{
  "id": 1028,
  "title": "A Supervised Learning Scheme for Evaluating Frequency Nadir and Fast Response Reserve in Ancillary Service Market",
  "abstract": "Power system operators evaluate the frequency security of the system by predicting the frequency nadir, which is assumed to indicate the impact of a sudden loss of a generating resource. Recently, frequency nadir prediction has become more challenging because renewables have penetrated and significantly changed the generation portfolio within the system. Conventionally, the frequency nadir is determined using a frequency response model where the features-load damping, system inertia, and effective governor response-are assumed to be known. However, these key features are not easily obtained in a power system that continuously changes during daily operation. This study proposes a supervised learning scheme that traces these key features. It also proposes a new feature-the power gap rate-that better reflects the influence of the load on the system frequency than that of the load damping. Feature importance recognition and the construction of a frequency nadir model (FNM) are realized using the proposed supervised learning scheme. The proposed FNM achieved 54% higher accuracy than the conventional method. Finally, the FNM is implemented in a planning process that quantifies the capacity of the fast responsive reserve (FRR). In two renewable penetration cases, the proposed FRR procurement successfully secured the frequency nadir above the security criterion.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0009eade1893858dcc6db830784cfd1b",
  "timestamp": "2025-05-15T00:50:40.832728"
}