{
  "id": 5780,
  "title": "The dance of dependence: a macro-perspective on financial instability and its complex influence on the Euro-American green markets",
  "abstract": "PurposeThis study adopts a new macro-perspective to explore the complex and dynamic links between financial instability and the Euro-American green equity market. Its primary focus and novelty is to shed light on the non-linear and asymmetric characteristics of dependence, causality, and contagion within various time and frequency domains. Specifically, the authors scrutinize how financial instability in the U.S. and EU interacts with their respective green stock markets, while also examining the cross-impact on each other's green equity markets. The analysis is carried out over short-, medium- and long-term horizons and under different market conditions, ranging from bearish and normal to bullish.Design/methodology/approachThis study breaks new ground by employing a model-free and non-parametric approach to examine the relationship between the instability of the global financial system and the green equity market performance in the U.S. and EU. This study's methodology offers new insights into the time- and frequency-varying relationship, using wavelet coherence supplemented with quantile causality and quantile-on-quantile regression analyses. This advanced approach unveils non-linear and asymmetric causal links and characterizes their signs, effectively distinguishing between bearish, normal, and bullish market conditions, as well as short-, medium- and long-term horizons.FindingsThis study's findings reveal that financial instability has a strong negative impact on the green stock market over the medium to long term, in bullish market conditions and in times of economic and extra-economic turbulence. This implies that green stocks cannot be an effective hedge against systemic financial risk during periods of turbulence and euphoria. Moreover, the authors demonstrate that U.S. financial instability not only affects the U.S. green equity market, but also has significant spillover effects on the EU market and vice versa, indicating the existence of a Euro-American contagion mechanism. Interestingly, this study's results also reveal a positive correlation between financial instability and green equity market performance under normal market conditions, suggesting a possible feedback loop effect.Originality/valueThis study represents pioneering work in exploring the non-linear and asymmetric connections between financial instability and the Euro-American stock markets. Notably, it discerns how these interactions vary over the short, medium, and long term and under different market conditions, including bearish, normal, and bullish states. Understanding these characteristics is instrumental in shaping effective policies to achieve the Sustainable Development Goals (SDGs), including access to clean, affordable energy (SDG 7), and to preserve the stability of the international financial system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0010d34b1a118e223ec9a118fb6cc049",
  "timestamp": "2025-05-15T02:51:30.021879"
}