{
  "id": 4588,
  "title": "THE EFFECT OF PROFITABILITY, CORPORATE GOVERNANCE MECHANISMS, AND FIRM SIZE ON DEBT POLICY",
  "abstract": "Good corporate governance practices can provide additional trust to external parties and investors, especially in corporate debt policy. This research aims to investigate the relationship between profitability, corporate social responsibility, corporate governance mechanisms, and firm size on corporate debt policy. The research method used is quantitative analysis using ordinary least squares and robust regression on data from companies listed on the Jakarta Islamic Index from 2017 to 2022. The results showed that profitability and an independent audit committee significantly negatively affect debt policy, while corporate social responsibility, independent commissioners, and firm size have a positive impact on debt policy. These findings provide important insights for companies in making smart debt policy decisions by business dynamics. The study also confirms the importance of agency theory in explaining how such elements help resolve conflicts of interest between management and shareholders, as well as enhance honesty, transparency, and better risk management in financial decision-making. By strengthening corporate governance and enhancing corporate social responsibility, companies can reduce the risk of conflicts of interest, increase integrity, and promote transparency in financial decision-making. This not only creates a more ethical working environment but also strengthens relationships with investors and society.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "001d10b92e88ff6ca99093da92aa7d18",
  "timestamp": "2025-05-15T02:38:56.352414"
}