{
  "id": 497,
  "title": "Bankruptcy Risk Prediction using Artificial Intelligence: An Empirical Study of the Slovak Chemical Industry",
  "abstract": "Research background: Bankruptcy prediction is important in business management, especially in the context of increasing competitiveness. Assessing the financial health of business entities using various models is an important area in not only scientific research, but also business practice. Comparing financial results and bankruptcy risk estimation is also important in economic practice. Purpose of the article: This study aims to apply an artificial neural network ( ANN) to predict the bankruptcy of non-financial corporations in the chemical industry of the Slovak Republic. We compared the results of artificial neural network with logistic regression. Methods: We used multi-layer perceptron artificial neural network (ANN-MLP) with feed-forwarded connections and back-propagation (BP) type of learning for prediction the bankruptcy of non-financial corporations in the chemical industry of Slovakia. We tested nine prediction models on a sample of 663 chemical companies in Slovakia from 2020 and 2021, while we used five financial indicators. The results were compared with logistic regression. Findings & Value added: An optimal neural network model was created for predicting risk bankruptcy in the chemical industry of the Slovak Republic. Our model can be applied in countries with undeveloped capital markets. We constructed an optimal network for the chemical industry using five financial indicators on the input layer in combination with one hidden layer (eight hidden nodes). All models achieved high accuracy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "002565e8a5e07d9aecec4c632072c30b",
  "timestamp": "2025-05-15T01:51:31.311694"
}