{
  "id": 1848,
  "title": "Analysis of the Physical and Financial Attributes of Medium- and Long-term Electricity Contracts: Pricing Mechanisms and Risk Mitigation Strategies",
  "abstract": "This paper aims to explore the physical and financial attributes of medium- and long-term electricity contracts and construct a pricing model that comprehensively considers factors such as supply-demand relationships, generation costs, and spot market prices. The study provides a detailed analysis of key elements in the electricity market, including supply-demand relationships, generation costs, spot market prices, and risk premiums. The pricing model is fitted and validated using the least squares method and the Radial Basis Function (RBF) neural network. Results indicate that the improved model outperforms the classic model in terms of fitting accuracy and explanatory power, significantly reducing root mean square error (RMSE) and mean absolute error (MAE), with a notable increase in the coefficient of determination (R-2). Additionally, price risk mitigation strategies based on Financial Transmission Rights (FTR) and differential settlement mechanisms, along with physical security assurance mechanisms, are proposed to ensure the physical safety and financial stability of the power system. This study not only offers new perspectives for theoretical research in the electricity market but also provides feasible solutions for practical operations, playing a crucial role in ensuring the physical security of the power system and enhancing market efficiency.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "002fc6eff9c7ae89349c00de8e08b4ef",
  "timestamp": "2025-05-15T02:08:03.986130"
}