{
  "id": 8953,
  "title": "Impact of different post-remission strategies on quality of life in patients with acute myeloid leukemia",
  "abstract": "Background The impact on quality of life of allogeneic stem cell transplantation or conventional chemotherapy in patients with acute myeloid leukemia remains unclear, mainly because of a lack of studies with long-term follow-up. The German AML-Intergroup, therefore, initiated a survey on quality of life of patients with a relapse-free survival of at least 5 years after first-line treatment. Design and Methods The EORTC Quality of Life Core Questionnaire (QLQ-C30), supplemented by information on self-assessed concomitant diseases, late treatment effects, and demographics was used.The questionnaire was returned by 419 of 818 patients (51.2%) identified by six study groups. The patients' median age at diagnosis was 42 years, and the median follow-up period was 8 years. One hundred and seventy patients were treated with stem cell transplantation (121 allogenic, 49 autologous) in first complete remission; the other 249 patients were treated with conventional chemotherapy. Results The ECOG activity index revealed normal activity in 45% vs. 60% of the patients in the allogeneic stem cell transplantation vs. conventional chemotherapy groups, respectively and disabled person status in 60% vs. 35%. All QLQ-C30 functions, except physical functioning and pain, were poorer in allogeneic stem cell transplantation patients. Problems in leisure-time activities, social life, and financial management, sexual limitations and adverse effects were significantly more frequent in patients after allogeneic stem cell transplantation than after conventional chemotherapy. Multivariate logistic regression models on global health status revealed concomitant disease, age >45 years, and allogeneic stem cell transplantation as significant risk factors. Conclusions These results indicate that, compared to conventional chemotherapy, allogeneic stem cell transplantation has a significantly worse long-term impact on quality of life. This needs to be considered when treatment options are discussed.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "002f9a11e3522a51ad9cdb6751993ade",
  "timestamp": "2025-05-15T03:23:56.139199"
}