{
  "id": 4049,
  "title": "Credit Risk Assessment of Small and Medium-Sized Enterprises under the Financial Model of Online Supply Chain",
  "abstract": "The rapid development of Internet technology meant that online supply chain finance has become an important source of small- and medium-sized enterprise (SME) finance. From a review of associated studies, this study constructed an online supply chain financial credit risk evaluation index system that had eleven level 2 indicators and 28 level 3 indicators for the four dimensions of financing enterprise qualification, core enterprise qualification, supply chain operations, and the macroenvironment. To assess the viability of this indicator system, data on 368 SMEs in four industries, clothing, home appliances, pharmaceutical, and construction, were selected as research samples. An online supply chain financial credit risk evaluation model for the different industries was then constructed using principal component analysis (PCA) and logistic regression methods. It was concluded that when evaluating online supply chain financial credit risk, it is necessary to focus on the solvency, profitability, and asset structure efficiencies of the financing enterprises. Due to the different production and operating characteristics of industries, significant variations in the degree and direction of the credit risk factors between industries were found; therefore, evaluating credit risks by industry significantly improved the accuracy of the model's credit risk predictions. For example, home appliance SMEs need to pay greater attention to their inventory turnover and construction industry SMEs should pay greater attention to their sales growth rate, return on common stockholders' equity, and GDP growth rate. Based on these results, some suggestions for commercial banks, supply chain core enterprises, and SMEs are given to improve supply chain financing. The conclusion of this study enriches the related research on credit risk assessment of SMEs and also provides decision support for improving SMEs to prevent credit risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "003427f3c184c2562b464c74151c6908",
  "timestamp": "2025-05-15T02:32:27.610817"
}