{
  "id": 8207,
  "title": "Nursing home costs and risk-adjusted outcome measures of quality",
  "abstract": "BACKGROUND. The inadequacy of quality of care in nursing homes has been and continues to be a focus of public concerns. Understanding the relationship between quality and costs can offer guidance to policies designed to encourage high quality. OBJECTIVES. TO investigate the relationship between costs and quality of care in nursing homes, and to test the hypothesis that higher quality may be associated with lower casts. RESEARCH DESIGN. Statistical regression techniques were used to estimate nursing home variable-cost functions that included three risk-adjusted outcome measures of quality. Quality measures were based on decline in functional status, worsening pressure ulcers, and mortality. The study hypothesis was tested by an F test for the exclusion of nonlinear quality variables in the cost functions. SUBJECTS. The study included 525 freestanding private and public nursing homes in New York State, or 84% of all nursing homes in the state during 1991. RESULTS. F tests rejected the hypotheses that the three quality measures could be excluded from the cost function and that the association between costs and quality was linear. An inverted U-shaped relationship between quality and costs suggests that there are quality regimens in which higher quality is associated with lower costs. CONCLUSIONS. Policies that encourage research to identify care protocols and management strategies leading to better outcomes and lower costs, as well as policies that encourage dissemination of such practices, may prevent decline in quality despite the continued financial constraints faced by nursing homes.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0042b3ba6b6df4e545255cfb14b533d1",
  "timestamp": "2025-05-15T03:16:17.456226"
}