{
  "id": 6931,
  "title": "The cross-impact between financial markets, Covid-19 pandemic, and economic sanctions: The case of Iran",
  "abstract": "The main financial markets in the Iranian Economy include the stock exchange, foreign exchange, oil, and gold markets. The sharp fluctuations in these markets, especially those caused by the severe sanctions imposed on Iran in May 2018, and the pandemic outbreak of Covid-19 have led to more confusion and uncertainty among investors. One of the effective approaches to examine such unstable conditions is to study the co-movement(s) between markets to identify the leading variable(s). Thus, in the present study, Wavelet Coherence Analysis was applied to examine the co-movements between markets in a time period from September 2014 to June 2020, as an intense period of uncertainty in Iran. In other words, in this study, the markets were investigated in different sub-periods. Also, the Segmented Regression was performed to estimate the impact of sanctions and the Covid-19 pandemic on the co-movements of financial markets in Iran. The results showed that the oil price had a low co-movement with the other three markets, i.e. stock exchange, exchange rate, and gold markets. Thus, the oil market can be a suitable alternative for risk aversion investors. Meanwhile, the oil market could also act as a source of finance for the government during the sanctions period. That possibly explains the recent decision by the Iranian government to use the oil market to finance its budget deficit. Between the exchange rate and gold price, the gold price was identified as the leading variable. While the exchange rate and gold price did not show a significant co-movement in stable conditions, they did show a significant co-movement in unstable conditions, as in times of sanctionsor during a global pandemic and thus influenced the investors portfolio risk. This result is important from a policy-making perspective. Based on this result, the policymakers can, especially during crises and unstable conditions, control the gold market and make it more stable by managing the foreign exchange market. (C) 2020 The Society for Policy Modeling. Published by Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00538f76ceb31669f7b308347e811537",
  "timestamp": "2025-05-15T03:03:13.441325"
}