{
  "id": 5970,
  "title": "Death in low-mortality diagnosis-related groups: frequency, and the impact of patient and hospital characteristics",
  "abstract": "Objective: To examine the frequency of deaths in low-mortality diagnosis-related groups (LM-DRGs) and the patient and hospital characteristics associated with them. Design, setting and patients: Retrospective cohort study of 2 400 089 discharge episodes for adults (>18 years) from 122 Victorian public hospitals from 1 July 2006 to 30 June 2008. Main outcome measures: Frequency of episodes of death in LM-DRGs (defined as DRGs with mortality <0.5% over the previous 3 years or <0.5% in any of the previous 3 years); associations between characteristics of patients and hospitals with deaths in LM-DRGs. Results: There were 1 008 816 LM-DRG episodes with 0-15 LM-DRG deaths per hospital in the 2006-07 financial year and 0-20 deaths per hospital in the 2007-08 financial year. Increased age, level of comorbidity, being male, admission from a residential aged care facility, interhospital transfer, emergency admission and lower hospital volume were associated with an increased risk of death in LM-DRG episodes in both years. Metropolitan location and teaching/major provider status were not associated with LM-DRG deaths (P > 0.10). More than 40% of LM-DRG deaths were among patients aged 83 years or over, who had a length of stay of less than 1 day and had a medical DRG classification. Standardised mortality ratios (SMRs) that adjusted for the patient and hospital characteristics identified nine outlier hospitals with high frequencies of deaths in LM-DRGs in the 2006-07 and six in the 2007-08 financial year compared with 59 hospitals flagged by the death-in-LM-DRG indicator. Conclusions: The use of the LM-DRG indicator requires further investigation to test its validity. LM-DRG deaths are infrequent, making it difficult to identify temporal changes and outlier hospitals. Patient characteristics unrelated to quality of care increase the likelihood of death among LM-DRG patients. The SMR analysis showed that failure to adjust for these characteristics may result in unfair and inaccurate identification of outlier hospitals. The increased risk of death associated with interhospital transfer patients and low-volume hospitals requires further investigation. MJA 2011; 195: 89-94",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00589fb38e5b04a4fe859733297dd4f4",
  "timestamp": "2025-05-15T02:53:33.359606"
}