{
  "id": 6225,
  "title": "Housing as a Social Determinant of Health in Singapore and Its Association with Readmission Risk and Increased Utilization of Hospital Services",
  "abstract": "Background: Residence in public rental housing is an area-level measure of socioeconomic status, but its impact as a social determinant of health in Singapore has not been studied. We therefore aimed to examine the association of public rental housing with readmission risk and increased utilization of hospital services in Singapore. Methods: We conducted a retrospective cohort study using retrospective 2014 data from Singapore General Hospital's electronic health records. Variables known to affect readmission risk and health-care utilization were identified a priori and include patient demographics, comorbidities, health-care utilization in the preceding 1 year and clinical variables from the index admission in 2014. Multivariate logistic regression was used to evaluate public rental housing as an independent risk factor for admission risk, emergency department (ED), and specialist outpatient clinic attendances. Results: A total of 14,457 unique patients were analyzed, and 2,163 patients (15.0%) were rental housing residents. Rental housing patients were significantly more likely to be male; required financial assistance; have chronic obstructive pulmonary disease; usage of anti-depressant and anti-psychotic medications; longer length of hospital stay during the index admission; and higher Charlson Comorbidity Index scores. After adjusting for demographics and clinical variables, staying in public rental housing remained an independent risk factor for readmission within 15 and 30 days, frequent hospital admissions and ED attendances in Singapore. Conclusion: Our study showed an association between public rental housing with readmission risk and increased utilization of hospital services in Singapore. A deeper understanding of the residents' social circumstances and health seeking behavior would be insightful.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "005c99ed14f1837ab7ef7cc0bce52cf8",
  "timestamp": "2025-05-15T02:56:10.854012"
}