{
  "id": 2103,
  "title": "Knowledge creates value: the role of financial literacy in entrepreneurial behavior",
  "abstract": "Under the backdrop of economic globalization and the digital economy, entrepreneurial behavior has emerged not only as a focal point of management research but also as an urgent topic within the domain of family finance. This paper scrutinizes the ramifications of financial literacy on household entrepreneurial behavior utilizing data from China's sample of the China Household Finance Survey spanning the years 2015 and 2017. Employing the ordered Probit model, we pursue our research objectives. Our findings suggest that financial literacy exerts immediate, persistent, and evolving positive effects on households' engagement in entrepreneurial activities and their proclivity toward entrepreneurship. Through the mitigation of endogeneity in the regression model, the outcomes of the two-stage regression corroborate the primary regression results. An examination of heterogeneity unveils noteworthy disparities between urban and rural areas, as well as gender discrepancies, in how financial literacy influences household entrepreneurial behavior. Furthermore, this study validates three potential pathways-namely income, social network, and risk attitude channels-demonstrating that financial literacy significantly augments household income, expands social networks, and enhances risk attitudes. Moreover, through supplementary analysis, we ascertain that financial education amplifies the impact of financial literacy on entrepreneurial behavior. Our study contributes to the enrichment of human capital theory and modern entrepreneurship theory. It advocates for robust efforts by governments and financial institutions to widely disseminate financial knowledge and foster family entrepreneurship, thereby fostering the robust and stable operation of both the global financial market and the job market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "005d33d96dfcd8f836301e20bb02fbae",
  "timestamp": "2025-05-15T02:10:59.106848"
}