{
  "id": 7591,
  "title": "Do Welfare Regimes Moderate Cumulative Dis/advantages Over the Life Course? Cross-National Evidence from Longitudinal SHARE Data",
  "abstract": "Objectives: This study aimed to examine the cumulative disadvantage of different forms of childhood misfortune and adult-life socioeconomic conditions (SEC) with regard to trajectories and levels of self-rated health in old age and whether these associations differed between welfare regimes (Scandinavian, Bismarckian, Southern European, and Eastern European). Method: The study included 24,004 respondents aged 50-96 from the longitudinal SHARE survey. Childhood misfortune included childhood SEC, adverse childhood experiences, and adverse childhood health experiences. Adult-life SEC consisted of education, main occupational position, and financial strain. We analyzed associations with poor self-rated health using confounder-adjusted mixed-effects logistic regression models for the complete sample and stratified by welfare regime. Results: Disadvantaged respondents in terms of childhood misfortune and adult-life SEC had a higher risk of poor self-rated health at age 50. However, differences narrowed with aging between adverse-childhood-health-experiences categories (driven by Southern and Eastern European welfare regimes), categories of education (driven by Bismarckian welfare regime), and main occupational position (driven by Scandinavian welfare regime). Discussion: Our research did not find evidence of cumulative disadvantage with aging in the studied life-course characteristics and age range. Instead, trajectories showed narrowing differences with differing patterns across welfare regimes.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "006eb0d51881a871742cbe2aebdf8369",
  "timestamp": "2025-05-15T03:10:05.607703"
}