{
  "id": 7115,
  "title": "What makes equity crowdfunding successful in Japan? Testing the signaling and lack of financial literacy hypotheses",
  "abstract": "PURPOSE: The first objective of this study is to identify the factors that contribute to the success of equity crowdfunding (ECF) campaigns in Japan. We examined what makes a campaign successful using data from 217 campaigns conducted on FUNDINNO, Japan's largest ECF platform, between February 2017 and May 2021. The second objective is to assess individual investors' financial literacy based on the ECF campaign's success or failure. This study is unique in that it focuses on funding method differences as well as the contents of the business plans disclosed in the ECF campaigns. In Japan, a common equity campaign and stock acquisition rights campaign are run on the same ECF platform, as if they were the same type of funding. Common stock and stock acquisition rights are treated differently by venture capitalists and other professional investors. By comparing the success or failure of the two Japanese projects, we can assess individual investors' financial literacy after taking into account the project signals. METHODOLOGY: The Signaling Hypothesis and the Lack of Financial Literacy Hypothesis were tested. Nine and four variables were set as proxy variables for the Signaling Hypothesis and the Lack of Financial Literacy Hypothesis, respectively. This study first divides the qualitative data into success/failure dichotomies for the proxy variables that comprise the hypotheses and then uses a chi-square test to examine the composition ratio of each. The quantitative data among the hypotheses' proxy variables are then tested for differences in means (t-test) and medians (Wilcoxon signed-rank test). Subsequently, we perform a probit analysis with the explained variable being success (1)/failure (0) and the explanatory variable being a proxy variable for the hypothesis. We begin with a probit analysis, and the Logit model is then introduced. Finally, a multiple regression analysis is run with the explained variables fundraising rate and number of investors and the hypothesized proxy variables as explanatory variables. FINDINGS: We found that the number of directors is an effective management ability indicator of ECF success. In terms of start-up fundamentals, investors appear to accept the signals intellectual property, product releases and tax incentives. Awards affected the size of the final funding round. In contrast, B2C companies negatively signaled to private investors. The proxy variable in final year sales was supported concerning the lack of a financial literacy hypothesis. Individual investors can be assumed to be financially literate if they perform due diligence. However, since expected rate of return (Internal Rate of Return, hereafter abbreviated as IRR) and common stock dummy are uncorrelated, we can conclude that they do not demonstrate financial literacy in valuation, nor whether or not the investment is profitable. Thus, individual investors' financial literacy in the Japanese ECF can be considered to be limited. IMPLICATIONS: We have demonstrated which signals investors in Japan's ECF campaigns respond to. These guidelines will be useful for future start-ups planning ECF campaigns. We were able to identify the lack of financial literacy among ECF individual investors. Therefore, for Japan's equity capital market to grow in the future, individual investors' financial literacy must be improved. ORIGINALITY AND VALUE: With very limited analysis in Asia, home to the world's second-and third largest stock markets, we have identified the factors behind the success of Japan's ECF. Identifying success factors in a country like Japan, where many individual investors are extremely risk averse, will provide new insights. By comparing the success or failure of the two types of Japanese ECF projects (common equity projects and stock acquisition rights), we could test the financial literacy of individual investors, taking into account the project signals.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0074411c2c43fa2bcb6daed91ab91e76",
  "timestamp": "2025-05-15T03:05:32.003898"
}