{
  "id": 8667,
  "title": "Predicting the unpredictable",
  "abstract": "The collective behavior of people in crowds, markets, and organizations has long been a mystery. Why, for instance, do employee bonuses sometimes lead to decreases in productivity? Why do some products generate tremendous buzz seemingly out of nowhere, while others languish despite multimillion-dollar marketing campaigns? How could a simple clerical error snowball into a catastrophic loss that bankrupts a financial institution? Traditional approaches like spreadsheet and regression analyses have failed to explain such emergent phenomena, says Eric Bonabeau, because they work from the top down, trying to apply global equations and frameworks to a particular situation. But the behavior of emergent phenomena, contends Bonabeau, is formed from the bottom up-starting with the local interactions of individuals who alter their actions in response to other participants. Together, the myriad interactions result in a group behavior that can easily elude any top-down analysis. But now, thanks to agent-based modeling, some companies are finding ways to analyze - and even predict - emergent phenomena. Macy's, for instance, has used the technology to investigate better ways to design its department stores. Hewlett-Packard has run agent-based simulations to anticipate how changes in its hiring strategy would affect its corporate culture. And Societe Generale has used the technology to determine the operational risk of its asset management group. This article discusses emergent phenomena in detail and explains why they have become more prevalent in recent years. In addition to providing real-world examples of companies that have improved their business practices through agent-based modeling, Bonabeau also examines the future of this technology and points to several fields that may be revolutionized by its use.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00a703c34d1b660f7d16b8ee328df931",
  "timestamp": "2025-05-15T03:21:24.612971"
}