{
  "id": 3805,
  "title": "Catastrophic Health Expenditures Associated With Open Reduction Internal Fixation of Distal Radius Fractures",
  "abstract": "Purpose Distal radius fracture is one of the most common upper-extremity traumatic injuries. These injuries result in time off work and potential financial consequences for patients. Therefore, we aimed to understand the risk of catastrophic health expenditures (CHEs) after open reduction and internal fixation of distal radius fractures and examine the association between patient characteristics and the risk of CHE.Methods We used data from patients undergoing open reduction and internal fixation of a distal radius fracture from a large, urban, level I trauma center (2018-2020). The risk of CHE was defined as out-of-pocket expenses of >40% of postsubsistence income. We used multivariable logistic regression to assess the impact of age, sex, race, and insurance status on the risk of CHE.Results In our cohort of 394 patients, 121 patients (30.7%) were at risk of CHE after their distal radius fracture. After controlling for patient characteristics and insurance status, patients aged 26-34 years were 5.7 times more likely to be at risk of CHE (odds ratio, 5.73; 95% CI, 1.81-18.13) than patients aged >65 years. Patients who were uninsured were six times more likely to be at risk of CHE than patients with employer-sponsored health insurance (odds ratio, 6.02; 95% CI, 1.94-18.66). Lastly, non-White patients were at a higher risk of CHE (odds ratio, 3.63; 95% CI, 1.70-7.79) than White patients.Conclusions Distal radius fractures are unexpected and place patients at risk of financial harm, with one in three patients at risk of CHEs. Policies aimed at minimizing cost-sharing after traumatic injury may help alleviate the financial consequences of health care delivery and reduce disparities. (J Hand Surg Am. 2023;48(10):977-983. Copyright (c) 2023 by the American Society for Surgery of the Hand. All rights reserved.)",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00a7bd7ab694b93714fd7f1affa3bbc2",
  "timestamp": "2025-05-15T02:29:59.231126"
}