{
  "id": 4054,
  "title": "Assessing the Risk of Natural Disaster-Induced Losses to Tunnel-Construction Projects Using Empirical Financial-Loss Data from South Korea",
  "abstract": "Tunnel construction, a common byproduct of rapid economic growth and transportation-system development, carries inherent risks to life and various kinds of property that operations and management professionals must take into account. Due to various and complicated geological conditions, tunnel construction projects can produce unexpected collapses, landslides, avalanches, and water-related hazards. Moreover, damage from such events can be intensified by other factors, including geological hazards caused by natural disasters, such as heavy rainfall and earthquakes, resulting in huge social, economic, and environmental losses. Therefore, the present research conducted multiple linear regression analyses on financial-loss data arising from tunnel construction in Korea to develop a novel tunnel-focused method of natural-hazard risk assessment. More specifically, the total insured value and actual value of damage to 277 tunnel-construction projects were utilized to identify significant natural-disaster indicators linked to unexpected construction-budget overruns and construction-scheduling delays. Damage ratios (i.e., actual losses over total insured project value) were used as objective, quantitative indices of the extent of damage that can be usefully applied irrespective of project size. Natural-hazard impact data-specifically wind speed, rainfall, and flood occurrences-were applied as the independent variables in the regression model. In the regression model, maximum wind speed was found to be correlated with tunnel projects' financial losses across all three of the natural-hazard indicators. The present research results can serve as important baseline references for natural disaster-related risk assessments of tunnel-construction projects, and thus serve the wider purpose of balanced and sustainable development.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00b03eba89e8138d4e268dd75d622e9a",
  "timestamp": "2025-05-15T02:32:27.630969"
}