{
  "id": 7574,
  "title": "Association of Net Worth and Ambulatory Blood Pressure in Early Middle-aged African American Women",
  "abstract": "IMPORTANCE Low socioeconomic status (SES) in the form of educational level and income has been linked to greater cardiovascular risk across cohorts; however, associations have been inconsistent for African American individuals. Net worth, a measure of overall assets, may be a more relevant metric, especially for African American women, because it captures longer-term financial stability and economic reserve. OBJECTIVE To examine whether net worth is associated with increased ambulatory blood pressure (ABP), a marker of cardiovascular disease (CVD) risk, independent of educational level and income, in young to middle-aged African American women. DESIGN, SETTING, AND PARTICIPANTS A cross-sectional, community-based study conducted in the southeastern US was performed using 48-hour ambulatory BP monitoring. Participants included 384 African American women aged 30 to 46 years without clinical CVD recruited between December 16, 2016, and March 21, 2019; data analysis was performed from September 2020 to December 2021. EXPOSURES Self-reported net worth (total financial assets minus debts), self-reported educational level, and self-reported income. MAIN OUTCOMES AND MEASURES Mean daytime and nighttime BP levels, assessed via 48-hour ABP monitoring and sustained hypertension (ABP daytime and clinic BP >= 130/80 mm Hg). RESULTS The 384 African American women in this study represented a range of SES backgrounds; mean (SD) age was 38.0 (4.3) years. Excluding 66 women who were not receiving antihypertensive medications, in linear regression models adjusted for age, marital status, educational level, family income, and family size, women reporting a negative net worth (debt) had higher levels of daytime (beta = 6.7; SE = 1.5; P < .001) and nighttime (beta = 6.4; SE = 1.4; P < .001) systolic BP, compared with women reporting a positive net worth. Similar associations were observed with sustained hypertension: women reporting a negative net worth had 150% higher odds (odds ratio, 2.5; 95% CI, 1.3-4.7) of sustained hypertension than those reporting a positive net worth. Associations remained significant after additional adjustments for smoking, body mass index, psychosocial stress due to debt, and depressive symptoms and were similar, although attenuated, when women receiving antihypertensive medications were included and treatment was controlled for in all analyses. CONCLUSIONS AND RELEVANCE In this cross-sectional study, having a negative net worth (ie, debt) was associated with elevated BP in African American women, independent of traditional indicators of SES. This finding suggests that limited assets or a lack of economic reserve may be associated with poor CVD outcomes in this at-risk group.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00bbb623f8f215e2d69a537e765ec5f6",
  "timestamp": "2025-05-15T03:10:05.528080"
}