{
  "id": 6779,
  "title": "Cash flow volatility and capital structure in MENA and Africa: the moderating role of fixed assets",
  "abstract": "This paper investigates the direct association between cash flow volatility and capital structure (i.e. debt ratio). This study further examines the moderating role of fixed assets on the association between cash flow volatility and capital structure in the Middle East and North Africa (MENA) and African markets. This study applies a two-step system generalized method of moment regression as the main estimation technique to minimize endogeneity concern. The data consist of non-financial listed firms in 20 MENA and African countries covering 2011 to 2020. The results reveal that cash flow volatility is significantly and positively related to capital structure of MENA and African firms. The results also reveal that fixed assets have a negative moderating impact on the relationship between cash flow volatility and the capital structures of MENA and African firms. The results are robust to different estimation techniques. The findings inform managers to consider cash flow stability as a major factor in corporate risk management and strategic decision making and consider fixed asset investment decisions and the quality of fixed assets as a significant factor in debt choice. Moreover, policymakers should formulate efficient capital structure policies that consider cash flow stability factors and encourage fixed asset investments. This study investigates the direct impact of cash flow volatility on capital structure (i.e., debt ratio) and examines the moderating impact of fixed assets on the link between cash flow volatility and capital structure of listed firms in 20 Middle East and North Africa (MENA) and African countries spanning 2011 to 2020 applying the panel two-step system generalized method of moment as the main estimation method. The findings reveal that cash flow volatility increase debt ratio in the firms' capital structure while the fixed assets negatively moderate the positive link between cash flow volatility and debt ratio in the firms' capital structure. The findings suggest that managers should consider cash flow stability and fixed assets quality as important factors in corporate risk management and debt choice. Besides, policymakers and investors should encourage capital structure and investment policies that consider cash flow stability and quality of fixed assets to mitigate risk of financial distress that can reduce investment value.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00beab569470760900c47bd92cc6696b",
  "timestamp": "2025-05-15T03:01:31.392825"
}