{
  "id": 7533,
  "title": "Triple pillars of sustainable finance: The role of green finance, CSR, and digitalization on bank performance in Bangladesh",
  "abstract": "This study examines the impact of sustainable finance factors on bank performance in Bangladesh. It utilizes annual data from 24 listed commercial banks in Bangladesh from 2016 to 2022. It focuses on three sustainable finance factors: green finance, corporate social responsibility (CSR), and digitalization. These factors ensure sustainable finance practices by prioritizing eco-friendly investments, responsible business operations, operational efficiency, and reduced resource consumption rather than focusing solely on short-term profit maximization. Return on assets (ROA) and return on equity (ROE) are used to measure the performance of commercial banks. This study incorporates default rate and bank size as control variables to consider inherent risk and operational scale, resulting in a more precise evaluation of the impact of digitization, CSR, and green financing on bank performance. Traditional and dynamic panel regression models, including feasible generalized least squares (FGLS) and random effects models, are applied to ensure robust findings. The findings indicate that green finance exhibits an insignificant impact on bank performance. However, corporate social responsibility (CSR) demonstrates a statistically significant positive effect on ROE through positive marketing, enhancing reputation, and building shareholder loyalty towards banks. Conversely, digitalization shows a statistically significant negative effect on performance, implying that initial implementation costs and challenges may outweigh the benefits. In addition, control variables, including default rate and bank size, exhibit a statistically significant negative relationship with performance measures. This suggests that higher default rates indicate increased credit risk and financial losses, while larger bank sizes may lead to inefficiencies due to agency costs and organizational complexities.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00c52dc5cac893a0e0ebafde62e052e8",
  "timestamp": "2025-05-15T03:09:36.890635"
}