{
  "id": 4173,
  "title": "Empirical Analysis of Factors Influencing the Behavioral Intention to Use Cryptocurrency Among Mongolian Customers: Extended UTAUT2 Model",
  "abstract": "This study aims to determine factors that influence Mongolian customers' intention to use cryptocurrency, which is a virtual currency created by fast-growing technology. For the theoretical framework, the extended Unified Theory of Acceptance and Use of Technology (UTAUT2) along with received risk and financial literacy was used. Data in this study were collected by conducting survey questionnaires from cryptocurrency users of cryptocurrency platforms in Mongolia. Analyzing the data which consists of 720 valid datasets was accomplished by using SmartPLS software. The results of partial least squares structural equation modeling (PLS-SEM) showed that behavioral intention to use cryptocurrency is significantly and positively influenced by performance expectancy, price value, perceived risk, hedonic motivation, and facilitating conditions. In contrast, financial literacy has a significant negative impact on the behavioral intention to use cryptocurrency. The other two variables, effort expectancy and social influence, have no impact on cryptocurrency use. The proposed model explains 59.3% of the total variance in intention to use cryptocurrency among Mongolian customers. The outcomes of our study hold noteworthy implications for policymakers, individual users, and stakeholders within the cryptocurrency domain, as well as researchers engaged in scholarly investigations within this field.JEL Classification: G4, G11.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00d45c3f4e631ad5f623638d8eb9d4d1",
  "timestamp": "2025-05-15T02:34:13.350878"
}