{
  "id": 849,
  "title": "Novel Data-Driven Resilient Portfolio Risk Measures Using Sign and Volatility Correlations",
  "abstract": "Portfolio risk management is an important success factor in an organization's ability to deliver more business value. Moreover, constructing a true resilient portfolio is impossible without the inclusion of higher-order moments such as skewness and kurtosis. Recently there has been a growing interest in using machine learning methods with empirical variance covariance matrix of returns to study Markowitz portfolio optimization. A major drawback is that the tangency portfolios constructed by using the existing portfolio risk measures such as portfolio standard deviation, value-at-risk (VaR), conditional value-at-risk (CVaR), maximum absolute deviation (MAD) are always affected by the larger skewness and kurtosis of the portfolio return. This paper develops a set of metrics that extend the traditional portfolio Sharpe ratio (PSR) to measures that include skewness and kurtosis. Using a random portfolio approach, the paper demonstrates how to use these new metrics and optimize portfolios. Inclusion of higher moments such as skewness and kurtosis in portfolio risk management acknowledges the risk of asymmetric and heavy-tailed returns and can help in constructing resilient portfolios. For portfolio optimization, simple yet effective novel data-driven resilient portfolio risk measures incorporating skewness and kurtosis are presented in this paper. The results show that the performance of maximum mean-risk portfolios using the proposed portfolio risk measures based on volatility correlation and sign correlation outperform the commonly used tangency portfolio using portfolio standard deviation.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00dbf26f6c7931d131e28f31248aeb48",
  "timestamp": "2025-05-15T00:49:03.095619"
}