{
  "id": 3127,
  "title": "Secure expansion of energy storage and transmission lines considering bundling option under renewable penetration",
  "abstract": "This paper presents a multi-stage expansion model for the co-planning of transmission lines, battery energy storage (ES), and wind power plants (WPP). High penetration of renewable energy sources (RES) is integrated into the proposed model concerning renewable portfolio standard (RPS) policy goals. The possibility of bundling existing transmission lines to uprate power flow capacity is considered. Renewable energy curtailment and load shedding are included in the model to assess the system operation more precisely. Battery ES devices are coplanned to defer transmission expansion and renewable management. To make the time complexity of the problem tractable and capture the uncertainties of load and RES in an hourly resolution, a chronological timeperiod clustering algorithm is used to extract the representative hours of each planning stage. Additionally, the flexible ramp reserve is utilized to handle the uncertainty of RES. An accelerated Benders dual decomposition (BDD) algorithm is developed to solve the proposed model mixed-integer linear programming (MILP) formulation. The N-1 security criterion is evaluated by considering a designed contingency screening (CS) algorithm to identify higher risk contingencies. The effectiveness of the proposed co-planning model is evaluated using IEEE RTS 24-bus and IEEE 118-bus test systems.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "00ec20e2ff1bd2af0ca7bbf578959c95",
  "timestamp": "2025-05-15T01:13:45.265229"
}