{
  "id": 8070,
  "title": "Understanding 'missed appointments' for pills and injectables: a mixed methods study in Senegal",
  "abstract": "Introduction High discontinuation rates of contraceptive methods have been documented in sub-Saharan Africa. However, little is known about gaps within individual episodes of method use, despite their implications for unintended pregnancies. The objective of this mixed methods study was to examine the prevalence of, and explore the factors contributing to, delays in repeat appointments for pills and injectables in Senegal. Methods First, we constructed a longitudinal data set of women's contraceptive consultations using routine records from 67 facilities in Senegal. Consultations for pills and injectables were classified as on time, delayed or with unknown delay status based on time since previous appointment. We described the prevalence of delayed appointments and used backward stepwise regression to build a mixed-effects model to investigate risk factors for delay. Second, we conducted workshops with family planning (FP) providers, and indepth interviews and focus group discussions with women of reproductive age, to explore factors contributing to delays. Results Almost one-third (30%) of appointments for pills and injectables were delayed, resulting in risk of pregnancy. Previous delay, pill use, lower educational level, higher parity, third and subsequent visits, and Islamic faith were independently predictive of delays (p<0.04 for all). Although women's 'forgetfulness' was initially mentioned as the main reason for delays by women and providers, examining the routines around appointment attendance revealed broader contextual barriers to timely refills-particularly widespread covert use, illiteracy, financial cost of FP services and limited availability of FP services. Conclusion Delays in obtaining repeat pills and injections are common among contraceptive users in Senegal, exposing women to unintended pregnancies. Strategies to reduce such delays should move beyond a narrow focus on individual women to consider contraceptive behaviour within the broader socioeconomic and health systems context. In particular, effective interventions addressing low acceptability of contraception and appointment reminder strategies in high illiteracy contexts are needed.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01066ada9c984ecb735ec5f81b83bba3",
  "timestamp": "2025-05-15T03:15:09.316585"
}