{
  "id": 9322,
  "title": "Comparative Trends and Downstream Outcomes of Coronary Computed Tomography Angiography and Cardiac Stress Testing in Emergency Department Patients With Chest Pain: An Administrative Claims Analysis",
  "abstract": "Objectives: Coronary computerized tomography angiography (CCTA) is a rapidly emerging technology for the evaluation of chest pain in the emergency department (ED). We assessed trends in CCTA use and compared downstream healthcare utilization between CCTA and cardiac stress testing modalities. Methods: Using administrative claims data (Optum Labs Data Warehouse) from over 100 million geographically diverse privately insured and Medicare Advantage enrollees across the United States, we identified 2,047,799 ED patients from January 2006 to December 2013 who presented with chest pain and had a CCTA or cardiac stress test within 72 hours. Cohorts were established based on CCTA or functional stress testing (myocardial perfusion scintigraphy [MPS], stress echocardiogram [SE], or treadmill exercise electrocardiogram [TMET]) performed within 72 hours of the ED visit. We tracked subsequent invasive cardiac procedures (invasive coronary angiography [ICA], percutaneous coronary intervention [PCI], and coronary artery bypass grafting [CABG]), repeat noninvasive testing, return ED visits, hospitalization, and the rate of acute myocardial infarction (AMI) within 30 days. We used propensity-score matching to adjust for coronary artery disease (CAD) risk factors, Charlson-Deyo comorbidity index, and baseline differences between patients selected for CCTA or cardiac stress testing. Logistic regression was used to measure adjusted associations between testing modality and outcomes. Results: During the study period, CCTA use increased from 0.8% to 4.5% of all cardiac testing within 72 hours, a change of 434% (p-value for trend < 0.001), while rates of other cardiac stress testing modalities decreased (-22% for TMET [p < 0.001]; -11% for SE [p = 0.11]; -6% for MPS [p = 0.04]. After matching, there was no difference in the 30-day rate of AMI between testing modalities. Compared to MPS, CCTA was associated with higher rates of PCI (odds ratio [OR] = 1.25, 95% confidence interval [CI] = 1.04 to 1.51), and CABG (OR = 1.47; 95% CI = 1.03 to 2.13). Compared to SE and treadmill stress testing, CCTA was associated with more invasive procedures, hospitalizations, return ED visits, and repeat noninvasive testing. Conclusions: CCTA use increased fourfold during the study period and was associated with higher rates of PCI, CABG, repeat noninvasive testing, hospitalization, and return ED visits. The authors have no relevant financial information or potential conflicts to disclose. (C) 2016 by the Society for Academic Emergency Medicine",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0108d77b0fd835c26fbe5ec604a0297d",
  "timestamp": "2025-05-15T03:27:53.317681"
}