{
  "id": 7527,
  "title": "Incidence and factors influencing sleep disorders in patients with chronic hepatitis B infection: A case-control study",
  "abstract": "Chronic hepatitis B (HBV) infection is a disease that imposes a considerable financial burden on patients and can lead to sleep disorders (SDs), resulting in a serious deterioration to patient quality of life. This study aimed to determine the prevalence of SDs in patients with HBV and the correlated sociodemographic and clinical characteristics. A total of 747 patients with chronic HBV infection were recruited. All patients completed the Pittsburgh Sleep Quality Index (PSQI), Patient Health Questionnaire-9 (PHQ-9), Generalized Anxiety Disorder-7 scale, Social Support Rating Scale, Short Form 36 Health Survey (SF-36), and Visual Analogue Scale (VAS). The total PSQI score of patients with each type of chronic HBV infection was significantly higher compared to healthy Chinese adults (p < .05). The incidence of SDs in HBV carriers and patients with mild HBV, moderate HBV, severe HBV, liver failure, compensated cirrhosis, and decompensated liver cirrhosis was 25%, 26%, 32%, 47%, 56%, 31%, and 49%, respectively. The incidence of SDs in all patients with chronic HBV infection was 30%. Binary logistic regression analysis revealed that the course of disease, aspartate aminotransferase levels, PHQ-9 scores, and VAS scores were independent risk factors for SDs, while the total SF-36 score was a protective factor for SDs (all p < .05). In conclusion, the prevalence of SDs was significantly higher in patients with chronic hepatitis B compared to healthy subjects. The independent risk factors for SDs included disease duration, aspartate aminotransferase levels, depression, and fatigue. Clinicians should pay more attention to SDs in patients with chronic HBV infection.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "012611e673997c997515b145f1ba0557",
  "timestamp": "2025-05-15T03:09:36.876238"
}