{
  "id": 3284,
  "title": "DETERMINANTS OF MUTUAL FUND FLOWS: EVIDENCE FROM EQUITY FUNDS FROM EU",
  "abstract": "Already for more than century investigation of allocation of international investment funds is a topic of considerable interest for both practitioners and academicians. To the former such investigation provides a useful aid for efficient diversification of their investment portfolios. To the latter identification of significance of impact of certain factors on international investment flows may provide a proof for violation of efficient market hypothesis, which, if found, will have far-reaching implications for the theory of finance. Despite being an innovative modern scheme for international investment allocation mutual funds still are puzzling from the viewpoint of factors, which determine the status of a particular fund or country fund industry to be or not to be attractive for international investment flows. Most of existing studies focus on effect which individual fund characteristics have on inducing of foreign and domestic capital to flow in or out of a particular mutual fund and there is an evident gap in knowledge about factors which determine the attractiveness of an individual economy and its mutual fund industry for international portfolio flows. In the light of the stated above the paper aims to study the determinants of inflows and outflows from equity funds from EU by means of panel regression framework. Application of such framework gives a twofold result: (1) it allows to model simple statistically significant relations between fund characteristics, country attributes and international portfolio flows in EU; and (2) by decomposing the sample into advanced and emerging economies, it allows to track differences across development stages and document important country and regional characteristics.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0127d8a5eba59ad369c22ef3a36b9fe0",
  "timestamp": "2025-05-15T01:15:26.191174"
}