{
  "id": 4520,
  "title": "Risk factors associated with current intimate partner violence at individual and relationship levels: a cross-sectional study among married rural migrant women in Shanghai, China",
  "abstract": "Objective To identify individual and relationship risk factors associated with current intimate partner violence (IPV) against married rural migrant women in Shanghai, China. Design Cross-sectional survey. Setting Two subdistricts of one administrative district, Shanghai, China. Participants A total of 958 married rural migrant women of reproductive age were selected using a communitybased two-stage cluster sampling method in April and May of 2010. Outcome measures Data were collected using a modified questionnaire based on an instrument from the WHO Multi-country Study on Women's Health and Domestic Violence against Women. Adjusted odds ratio (AOR) and 95% CI from a multivariable logistic regression model were estimated to identify individual and relationship risk factors associated with different types of violence in the past 12 months. Results Women's low financial autonomy was associated with all types of violence (AORs ranged from 1.98 to 7.89, p<0.05). Quarrelling with husband was a very strong risk factor (AORs >6, p<0.05) for both emotional violence and any violence. Experience of job change in the past year (AOR=4.03, 95% CI 1.57 to 10.35) and history of husband being abused (AOR=4.67, 95% CI 2.17 to 7.69) were strongly associated with physical or sexual violence. Conclusion Women's low financial autonomy and unstable employment status at an individual level, quarrelling with husband and history of husband beaten by family members at a relationship level were identified as the most robust risk factors for IPV among married rural migrant women. Efforts to prevent IPV among this population should be made to involve both women and their husbands, with a focus on improving financial autonomy and employment status of women, promoting problem-solving and interaction skills of the couples and changing their knowledge and attitudes towards gender norms and IPV.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "012dec946a6c5d627c242c7f620de259",
  "timestamp": "2025-05-15T02:38:20.289083"
}