{
  "id": 3810,
  "title": "A novel multi-objective stochastic risk co-optimization model of a zero-carbon multi-energy system (ZCMES) incorporating energy storage aging model and integrated demand response",
  "abstract": "To model a realistic and highly flexible zero-carbon multi-energy system (ZCMES), a novel modelling strategy for ZCMES incorporating energy storage aging influence and integrated demand response (IDR) is proposed. Firstly, an integrated clustering-scenario generation and reduction approach (IC-SGRA) is developed to quantify the datasets uncertainties while selecting a representative day for the model. Secondly, the model is formulated as a multi-objective optimization problem to evaluate the influence of decision-maker preference concerning investment cost and operation cost on the optimal planning, and then weighting sum method is adopted to solve the problem. Finally, a Markowitz portfolio risk theory approach is adopted to mitigate the risk associated with uncertainties during decision-making, then an illustrative case study is used to analyse the proposed model. The simulation results reveal that the energy storage is overdesigned when aging effects are not considered, and the proposed approach can reduce the investment cost and the operation cost by 10.86% and 80.66% respectively, while the overall expenditure is reduced by 23.09%. Moreover, it was observed that the optimal total economic cost is obtained when high preference is given to the operation expenditure by the decision-makers while an equal preference resulted in a 0.24% reduction in investment cost and a 0.49% increase in total expen-diture. Furthermore, the effect of BES lifetime and IDR load factors are also examined on ZCMES optimal planning. This study concluded that IDR is a promising strategy to encourage adopting zero-carbon policies flexibly and economically while choosing BES with high lifetime and tolerable capacity loss contribute to optimal planning. (c) 2021 Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01333c0e23f50a6b64ccaef65a3c1429",
  "timestamp": "2025-05-15T01:21:08.213842"
}