{
  "id": 3632,
  "title": "Risk factors for financial toxicity in patients with gynecologic cancer",
  "abstract": "BACKGROUND: The cost of cancer care is high and rising. Evidence of increased patient cost burden is prevalent in the medical literature and has been defined as financial toxicity, the financial hardship and financial concerns experienced by patients because of a disease and its related treatments. With targeted therapies and growing out-of-pocket costs, patient financial toxicity is a growing concern among patients with gynecologic cancer. OBJECTIVE: This study aimed to determine the prevalence of financial toxicity and identify its risk factors in patients with gynecologic cancer treated at a large cancer center using objective data. STUDY DESIGN: Using institutional databases, we identified patients with gynecologic cancer treated from January 2016 to December 2018. Patients with a preinvasive disease were excluded. Financial toxicity was defined according to institutionally derived metrics as the presence of >= 1 of the following: >= 2 bills sent to collections, application or granting of a payment plan, settlement, bankruptcy, financial assistance program enrollment, or a finance-related social work visit. Clinical characteristics were gathered using a 2-year look-back from the time of the first financial toxicity event or a randomly selected treatment date for those not experiencing toxicity. Risk factors were assessed using chi-squared tests. All significant variables on univariate analysis were included in the logistic regression model. RESULTS: Of the 4655 patients included in the analysis, 1155 (25%) experienced financial toxicity. In the univariate analysis, cervical cancer (35%), stage 3 or 4 disease (24% and 30%, respectively), younger age (35% for age <30 years), nonpartnered marital status (31%), Black (45%) or Hispanic (37%) race and ethnicity, self-pay (48%) or commercial insurance (30%), clinical trial participation (31%), more imaging studies (39% for >= 9), >= 1 emergency department visit (36%), longer inpatient stays (36% for >20 days), and more outpatient clinician visits (41% for >= 20 visits) were significantly associated with financial toxicity (P<.01). In multivariate analysis, younger age, nonpartnered marital status, Black and Hispanic race and ethnicity, commercial insurance, more imaging studies, and more outpatient physician visits were significantly associated with financial toxicity. CONCLUSION: Financial toxicity is an increasing problem for patients with gynecologic cancer. Our analysis, using objective measures of financial toxicity, has suggested that demographic factors and healthcare utilization metrics may be used to proactively identify at-risk patients for financial toxicity.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01350017c4edc6f1d32acfdb501481c5",
  "timestamp": "2025-05-15T02:28:29.311125"
}