{
  "id": 3317,
  "title": "Impact of emotional state and suicidal intentions on suicide attempts among Korean adolescents with household financial difficulties following the outbreak of COVID-19: A cross-sectional study",
  "abstract": "The recent prolonged coronavirus disease-2019 pandemic has brought an economic crisis to various households, leading to negative mental health such as depression, anxiety, traumatic distress, and suicide risk among adolescents. Adolescents with household financial difficulties due to the coronavirus disease-2019 pandemic show high suicidal tendencies and attempts such as suicidal ideation and plans, their suicidal ideation and plans increase the risk of suicide attempts in South Korea. The purpose of this study was to determine the effects of emotional state and suicidal tendencies on suicide attempts among adolescents with household financial difficulties in early pandemic. This was a secondary data analysis study using statistical data from the 16th (2020) Korea Youth Risk Behavior Web-based Survey. Among 54,948 who participated in the survey, 16,839 (30.6%) adolescents who had household financial difficulties were included in final analysis. Descriptive statistics, chi-squared test, and logistic regression analysis were conducted to analyze data. The strengthening the reporting of observational studies in epidemiology checklist was used for reporting this study. 16,839 adolescents (mean age 15.68 & PLUSMN; 1.76 years; 8709, 51.7% male) who experienced household financial difficulties in the prior year revealed 3 percent (508) had attempted suicide. Suicide attempts differed according to several characteristics and were significantly associated with sex, residence type, drinking experience, depressive mood, perceived happiness, suicidal ideation, and suicide planning. The findings indicate high-risk adolescents with household financial difficulties need a multi-dimensional safety network, suicide screening, and emotional interventions during the pandemic.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01504630290a76119f6c4691a8487283",
  "timestamp": "2025-05-15T02:25:13.620958"
}