{
  "id": 7730,
  "title": "Self-reported delays in care-seeking in West Africa during the first wave of the COVID-19 pandemic",
  "abstract": "Background The COVID-19 pandemic caused delays in care-seeking due to fears of infection and decreased healthcare access globally. These delays have been linked in some countries to COVID-19 perceptions, decreased income, and food insecurity, but little is known about patient-level factors for decreased care-seeking specifically at the beginning of COVID-19 in West Africa. Understanding these factors is important to identify those at highest risk and address healthcare-related barriers. Methods This study used self-reported data from telephone surveys in a population-based sample in Burkina Faso (n = 1352), Ghana (n = 1621), and Sierra Leone (n = 1301) in May-June 2020. Questions assessed delays in care-seeking, sociodemographic variables, COVID-19 beliefs, and food insecurity. Bivariate analyses using chi-square and multivariate analyses using logistic regression were used to explore associations between factors and delays in care-seeking by country. Independent variables were chosen based on prior research suggesting that financial insecurity, older age, female sex, rural location, and COVID-related concerns are associated with delays. Results Between March-June 2020, 9.9%, 10.6%, and 5.7% of participants in Burkina Faso, Ghana, and Sierra Leone, respectively, delayed care-seeking. Food insecurity was prevalent (21.8-46.1%) and in bivariate analyses was associated with delays in care-seeking in Burkina Faso and Ghana. Concern about risk of household contraction of COVID-19 was common (18.1-36.0%) and in Ghana and Sierra Leone was associated with delays in care-seeking in both bivariate and multivariate analyses. In bivariate analyses, females showed more delays in Burkina Faso, while age above 30 and urban location were associated with delays in Ghana. In multivariate analyses, food insecurity was associated with increased delayed care-seeking in Burkina Faso. Conclusions Multiple factors were associated with delays in care-seeking early in the COVID-19 pandemic, with food insecurity and concerns about infection showing significant associations in multiple countries. These findings highlight the need to invest in clinic accessibility, community education, and financial assistance to address barriers in healthcare. While many delays have subsided since the initial phase of the COVID-19 pandemic, understanding factors associated with early disruptions of care-seeking at the patient and household level will inform strategies for maintaining healthcare access during future pandemics in West Africa.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0158269f353e9470a4b18360ddfbe689",
  "timestamp": "2025-05-15T03:11:38.484841"
}