{
  "id": 7007,
  "title": "Discovering Adverse Drug Reactions from Twitter: A Sentiment Analysis Perspective",
  "abstract": "Pharmacovigilance is an area of the healthcare sector responsible for drug tests and monitoring. The entire life cycle of the drug release process follows strong rules and procedures that may require many years (10-15 years) and substantial financial resources (up to one billion dollars). As pharmaceutical companies aim to minimize the time and expenses required to release the new drug, they may underreport adverse drug reactions (ADRs). Some companies may fail to research or report all potential reactions to a medicinal product. ADRs can cause harmful or unpleasant reactions users and put lives at risk. This work aims to discover ADRs from digital social media. The main contribution of this work is the creation of a labeled database and an ontology to improve the pre-processing of tweets for classification. On Twitter there are many posts about studies and dissemination of research and messages of experts on subject that are not spontaneous opinions of drug users, but primary focus of this study is to investigate adverse reactions. This shows that social networks can help in the discovery of adverse events, but there is a need for robust pre-processing. Using Twitter as a source for potential drug reaction detection, a database of 30,000 tweets with mentions of four distinct drugs was investigated, which resulted in finding 5 0 adverse reactions. To improve the accuracy of a classification model for ADRs, a supervision of the task is essential. Starting from a database containing 1,000 posts, 50 opinions were identified as ADRs, which is a rate of 5%. This shows that Twitter is a reliable source for the extraction of ADRs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0165a1bc6509b79e736b484057d907c4",
  "timestamp": "2025-05-15T03:03:55.862340"
}