{
  "id": 7331,
  "title": "Mediastinal micro-vessels clipping during lymph node dissection may contribute to reduce postoperative pleural drainage",
  "abstract": "Background: Postoperative pleural drainage markedly influences the length of postoperative stay and financial costs of medical care. The aim of this study is to retrospectively investigate potentially predisposing factors related to pleural drainage after curative thoracic surgery and to explore the impact of mediastinal micro-vessels clipping on pleural drainage control after lymph node dissection. Methods: From February 2012 to November 2013, 322 consecutive cases of operable non-small cell lung cancers (NSCLC) undergoing lobectomy and mediastinal lymph node dissection with or without application of clipping were collected. Total and daily postoperative pleural drainage were recorded. Propensity score matching (1: 2) was applied to balance variables potentially impacting pleural drainage between group clip and group control. Analyses were performed to compare drainage volume, duration of chest tube and postoperative hospital stay between the two groups. Variables linked with pleural drainage in whole cohort were assessed using multivariable logistic regression analysis. Results: Propensity score matching resulted in 197 patients (matched cohort). Baseline patient characteristics were matched between two groups. Group clip showed less cumulative drainage volume (P=0.020), shorter duration of chest tube (P=0.031) and postoperative hospital stay (P=0.022) compared with group control. Risk factors significantly associated with high-output drainage in multivariable logistic regression analysis were being male, age >60 years, bilobectomy/sleeve lobectomy, pleural adhesion, the application of clip applier, duration of operation >= 220 minutes and chylothorax (P<0.05). Conclusions: This study suggests that mediastinal micro-vessels clipping during lymph node dissection may reduce postoperative pleural drainage and thus shorten hospital stay.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01785db4f247ffaf6f6a8517d1b1ba01",
  "timestamp": "2025-05-15T03:07:31.878770"
}