{
  "id": 1985,
  "title": "Integration of value and sustainability assessment in design space exploration by machine learning: an aerospace application",
  "abstract": "The use of decision-making models in the early stages of the development of complex products and technologies is a well-established practice in industry. Engineers rely on well-established statistical and mathematical models to explore the feasible design space and make early decisions on future design configurations. At the same time, researchers in both value-driven design and sustainable product development areas have stressed the need to expand the design space exploration by encompassing value and sustainability-related considerations. A portfolio of methods and tools for decision support regarding value and sustainability integration has been proposed in literature, but very few have seen an integration in engineering practices. This paper proposes an approach, developed and tested in collaboration with an aerospace subsystem manufacturer, featuring the integration of value-driven design and sustainable product development models in the established practices for design space exploration. The proposed approach uses early simulation results as input for value and sustainability models, automatically computing value and sustainability criteria as an integral part of the design space exploration. Machine learning is applied to deal with the different levels of granularity and maturity of information among early simulations, value models, and sustainability models, as well as for the creation of reliable surrogate models for multidimensional design analysis. The paper describes the logic and rationale of the proposed approach and its application to the case of a turbine rear structure for commercial aircraft engines. Finally, the paper discusses the challenges of the approach implementation and highlights relevant research directions across the value-driven design, sustainable product development, and machine learning research fields.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "017cd4968dbc45a54df6f48cf48f05f6",
  "timestamp": "2025-05-15T01:01:41.669912"
}