{
  "id": 4067,
  "title": "From Cardio Renal Syndrome to Chronic Cardiovascular and Kidney Disorder: A Conceptual Transition",
  "abstract": "The association between cardiac and kidney dysfunction has received exponentially increasing attention over the last two decades. A putatively unique syndrome, the cardio-renal syndrome, distinguishing five subtypes based on the chronology of cardiac and kidney events, has been widely adopted. This review discusses the methodological and practical problems inherent to the current classification of cardio renal syndrome. The term disorder is more appropriate than the term syndrome to describe concomitant cardiovascular and kidney dysfunction and/or damage. Indeed, the term disorder designates a disruption induced by disease states to the normal function of organs or organ systems. We apply Occam's razor to the chronology-based construct to arrive at a simple definition based on the coexistence of cardiovascular disease and chronic kidney disease (CKD), the chronic cardiovascular -kidney disorder (CCKD). This conceptual framework builds upon the fact that cardiovascular and CKD share common risk factors and pathophysiological mechanisms. Biological changes set in motion by kidney dysfunction accelerate cardiovascular disease progression and vice-versa. Depending on various combinations of risk factors and precipitating conditions, patients with CCKD may present initially with cardiovascular disease or with hallmarks of CKD. Treatment targeting cardiovascular or kidney dysfunction may improve the outcomes of both. The portfolio of interventions targeting the -kidney cardiovascular continuum is in an expanding phase. In the medium term, applying the new omics sciences may unravel new therapeutic targets and further improve the therapy of CCKD. Trials based on cardiovascular and kidney composite endpoints are an attractive and growing area. Targeting pathways common to cardiovascular and kidney diseases will help prevent the adverse health effects of CCKD.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0193a65b619d6a3974bdb5e2c7e21158",
  "timestamp": "2025-05-15T01:23:27.348377"
}