{
  "id": 8540,
  "title": "Determinants of health facility delivery among young mothers aged 15-24 years in Nigeria: a multilevel analysis of the 2018 Nigeria demographic and health survey",
  "abstract": "BackgroundYoung mothers aged 15 to 24 years are particularly at higher risk of adverse health outcomes during childbirth. Delivery in health facilities by skilled birth attendants can help reduce this risk and lower maternal and perinatal morbidity and mortality. This study assessed the determinants of health facility delivery among young Nigerian women.MethodsA nationally representative population data extracted from the 2018 Nigeria Demographic and Health Survey of 5,399 young women aged 15-24 years who had had their last birth in the five years before the survey was analysed. Data was described using frequencies and proportions. Bivariate and multivariate analyses were carried out using Chi-Square test and multilevel mixed effect binary logistic regression. All the analysis were carried out using STATA software, version 16.0 SE (Stata Corporation, TX, USA)..ResultsOf the total sampled women in the 2018 NDHS, 5,399 (12.91%) formed our study population of young women 15 -24 years who had their last birth in the preceding five years of the survey. Only 33.72% of the young mothers utilized health facility for delivery. Women educated beyond the secondary school level had 4.4 times higher odds of delivering at a health facility compared with women with no education (AOR 4.42 95%, CI 1.83 - 10.68). Having fewer children and attending more antenatal visits increased the odds of health facility delivery. With increasing household wealth index, women were more likely to deliver in a health facility. The odds of health facility delivery were higher among women whose partners had higher than secondary level of education. Women who lived in communities with higher levels of female education, skilled prenatal support, and higher levels of transportation support were more likely to deliver their babies in a health facility.ConclusionStrategies to promote institutional delivery among young mothers should include promoting girl child education, reducing financial barriers in access to healthcare, promoting antenatal care, and improving skilled birth attendants and transportation support in disadvantaged communities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01a8c0206db7820a11665349c2d8c6a6",
  "timestamp": "2025-05-15T03:19:52.132894"
}