{
  "id": 4204,
  "title": "Functional Mixed-type Clustering of Investors' Daily Returns During a Market Shock Change-point and Recovery",
  "abstract": "We analyze a dataset of daily portfolio market positions spanning July financial dealer. For each client, we know demographic information (age, gender, marital status, income, retirement status, investment knowledge), desired risk preferences, and their market positions for July 17th 2019 to February 19th 2021. The daily unrealized returns of those portfolios are analyzed using a functional principal component approach to discover underlying variations in observed client returns and if those differences in portfolios resulted in different outcomes before, during, and after the short-duration 2020 market crash. The distinguishing factors between portfolio returns are, in the order of importance, performances during the crash, before the crash, overall throughout, during the recovery, and mitigating losses at the sacrifice of recovery. We conduct mixed-type categorical analysis by mixing 15 functional principal components with categorical data using..-prototypes clustering. Clients are grouped into six categories: two small groups with strong performances corresponding to the volatility of their positions and four large groups, all with smaller volatilities and a range of overall performances. We find that clients tended to overshoot their risk appetites in clusters: high-risk appetites tended toward over-risked; low-risk tended toward under-risk. Overall, performance was connected to increased risk throughout the market crash-if the clients did not take as much risk, they did not experience as strong a recovery.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01ac7d0f590b48afbea5576b40cc49db",
  "timestamp": "2025-05-15T02:34:13.481259"
}