{
  "id": 3580,
  "title": "Analysis of Factors Influencing the Risk of Poverty for Elderly People in Europe",
  "abstract": "The paper addresses the problems related to financial stability and exposure to poverty risk of senior citizens in European countries. The aging population trend is now becoming a global challenge, which is being made worse by the inevitable retirement of the so-called baby boom generation over the coming decades. The development of aging population will cause a series of problems to the elderly, including increasing instability of financial situation of elderly households. The budgets of senior citizens may considerably shrink because of low disposable incomes and overburden expenditures (e.g. expenses on health care services). The purpose of the paper is to identify and evaluate the main factors affecting the financial situation of elderly households, especially in the context of their exposure to poverty risk. In the analysis the selected external variables, such as: GDP, inflation index, saving rate, unemployment rate and old-age dependency ratio were included, in order to indicate the impact of economic environment, demographic trends and the existing pension schemes on the elderly financial stability. Moreover, specific variables corresponding to income and expenses of seniors were also examined. With the use of multiple regression analysis an attempt of comparison and evaluation of the poverty risk of elderly households in the selected European countries in 2007-2017 was made. The obtained results may be useful for policymakers in the area of pension systems and they indicate the need for the further analysis of detailed reasons for similarities and differences in the seniors' financial stability across Europe.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01b1ae5e2bab7385371220bd25d60029",
  "timestamp": "2025-05-15T02:27:54.031524"
}