{
  "id": 4273,
  "title": "Risk Factors for Adults with Chronic Obstructive Pulmonary Disease in the United States, Utilizing State-Based Surveillance",
  "abstract": "Chronic Obstructive Pulmonary Disease (COPD) is a complex and heterogeneous condition. Exposure to tobacco smoke and air pollutants are key risk factors for COPD development; however, other risk factors include race/ethnicity, sex of adults, a history of asthma, occupational exposures, and chronic respiratory infections. Data for the current study were from the 2022 Behavioral Risk Factor Surveillance Survey. Chi-squares and multinomial logistic regression analyses, adjusted with the survey's sampling weight, were used to examine how critical health indicators impacted a COPD diagnosis. Participants (N = 311,175) were adults aged 45 years and older. Adjusted multinomial regression analyses showed adults who reported asthma, current and former smoking, poor physical health, depression, less physical activity, and fatigue were more likely to report COPD. Those with COPD were more likely to be male than female. Moreover, those with COPD reported higher rates of health insurance coverage, and yet had lower income and more financial difficulty affording a doctor for health services. In a follow up regression analysis, examining racial differences in COPD for participants, American Indian adults had a higher odds of reporting COPD than the other race groups. Because COPD remains a leading cause of death and disability in the U.S., and racial disparities persist in respiratory outcomes, continuing to identify risk factors for vulnerable groups could assist health program planners with development of successful health messaging.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01cc2fb07c497ad0d3a623f8ffadcc78",
  "timestamp": "2025-05-15T02:35:26.244480"
}