{
  "id": 8570,
  "title": "Do socially responsible audit firms provide higher audit quality? An investigation of corporate social responsibility activity in audit firms",
  "abstract": "Purpose - The paper aims to examine the corporate social responsibility (CSR) activity of audit firms. Design/methodology/approach - Using hand-collected data on all Chinese audit firms CSR activities from 2007 to 2020, this study constructs two measures to proxy for audit firms' CSR engagement: a dummy variable to indicate whether an auditor engages in CSR activities in year t and the frequency with which auditors conduct CSR activities in year t. The authors use ordinary least squares regression as a baseline methodology, along with the entropy balancing method and instrumental variable approach to alleviate potential endogeneity concerns. Findings - The baseline results show that socially responsible audit firms provide higher quality audit services than their counterparts. In particular, the authors find that clients audited by socially responsible audit firms are less likely to receive an aggressively clean opinion. Moreover, the findings suggest that CSR activities related to community and employees are more relevant in improving audit quality compared with those related to other dimensions of CSR. Further analyses show that capital markets and audit clients react positively to audit-firm CSR activity. Audit firms engaging in CSR increase their audit inputs in response to risky clients, as compared with their counterparts. Finally, cross-sectional analyses show that the positive relationship is more pronounced for non-Big 4 and non-industry experts and is attenuated by within-firm geographic dispersion. In terms of client characteristics, the positive effect of audit-firm CSR is stronger when their clients face the higher financial risk or have lower CSR awareness than others. Taken together, these findings are consistent with the ethical view of audit-firm CSR engagement. Practical implications - The study advances investors understanding of audit-firm CSR engagement and helps them evaluate the credibility of audited financial reports. Besides, the findings may also help guide the audit firms to conduct more CSR activities and help guide the audit clients to choose CSR audit firms. Originality/value - To the best of the authors knowledge, this study provides the first large-sample evidence by empirically examining the association between audit-firm CSR activity and audit service performance. Besides, this paper also explores audit-firm CSR activity from two competing perspectives, thereby providing a comprehensive understanding of this issue. Finally, this work responds to the call for more CSR research in emerging markets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01cf66811393ddca5fc1eeeb9ac5d59c",
  "timestamp": "2025-05-15T03:20:22.153146"
}