{
  "id": 9037,
  "title": "On resolving exchange rate exposure puzzle: evidence from Chinese stock market",
  "abstract": "Purpose It has been increasingly recognized that exchange rate changes affect the cash flow and the value of firms. Existing studies on exchange rate exposure do not have much success in finding significant exposure, and the failure to find this relationship empirically has been termed exposure puzzle. Motivated by the limited success in detecting significant exchange rate exposure in the extant literature, China's exchange rate regime reform in 2005, the increasing role of China's stock market played in the global financial market and its attractiveness in international portfolio diversification, the purpose of this paper is to resolve the so-called exposure puzzle and thus make a contribution to the literature by investigating whether the renminbi (RMB) exchange rate movements have any significant impact on China's stock market from the perspective of US investors who may want to diversify their portfolios with Chinese stocks. Design/methodology/approach Since previous studies which rely heavily on the standard Ordinary Least Squares (OLS) or seemingly unrelated regression (SUR) method of estimation with the assumption of constant variance of firm's or industry's returns do not have much success in detecting significant exchange rate exposure, in this study, we apply an asymmetric GARCH(1,1) with generalized error distribution (GED) model which takes conditional heteroscedasticity and leptokurtosis of asset returns into account in the estimation of first- and second-moment exchange rate exposure. Findings Using weekly data over the period August 10, 2005-January 1, 2020 on 40 Chinese sector stock returns, the authors find strong evidence of first-moment exchange rate exposure. In particular, 65% (26 out of 40) of sectors examined have significant first-moment exposures and 73.08% (19 out of 26) of these significant first-moment exposures are asymmetric. For the second-moment exchange rate exposures, they are less frequently detected with 20% (8 out of 40) significant cases. These results are robust to whether an unorthogonalized or orthogonalized bilateral US dollar (USD)/Chinese Yuan (CNY) exchange rate is used in the estimation. Research limitations/implications Because this study concerns only with whether exchange rate movements affect ex post returns as opposed to expected (ex ante) returns, and given the significant exposures with respect to different risk factors found in the study, it is interesting to see if any of these risk factors commands a risk premium. In other words, a natural extension of this study is to test whether any of these risk factors is priced in China's stock market. Practical implications The findings of the study have interesting implications for US investors who would like to diversify their portfolios with Chinese stocks and are concerned about whether the unexpected movements in CNY will affect their portfolio returns in addition to its local and world market risk exposures. Originality/value The study extends previous research on the first- and second-moment exchange rate exposure of Chinese stock returns by utilizing an asymmetric GARCH(1,1) with generalized error distribution (GED) model, which has not been fully exploited in the literature.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01d00286832c648df985fb78a89c4eff",
  "timestamp": "2025-05-15T03:24:54.907714"
}