{
  "id": 7065,
  "title": "Nutritional status and its associated factors among elderly people in Ilu Aba Bor Zone, Southwest Ethiopia: a community-based cross-sectional study",
  "abstract": "ObjectivesThis study aimed to assess the nutritional status and its associated factors among elderly people.DesignA community-based cross-sectional study.SettingThe study was conducted in urban and semiurban areas.ParticipantsThe study included 620 elderly community dwellers in Southwest Ethiopia from 3 October 2021 to 10 November 2021. Those who were seriously ill, could not get around or were on special diets were excluded from the study.Outcome measureThe Mini Nutritional Assessment was used to evaluate nutritional status and the STEPwise approach was used to collect data on backgrounds and lifestyle. SPSS V.22.0 was used for data analysis. Logistic regression was computed. The level of significance was set at 0.05.ResultsElderly people who were malnourished or at risk of malnutrition were found to make up 48.1% (44.1%) and 17.4% (14.5%) of the population, respectively. Those aged 80 years and older had a chance of being at risk of malnutrition (adjusted OR (AOR)=22.555; 95% CI: 7.963 to 63.881), while the odds of being malnourished were 11.5 times higher (AOR=11.755; 95% CI: 4.825 to 28.638). Informal education was a significant predictor of being at risk of malnutrition (AOR=6.102; 95% CI: 2.684 to 13.871). Urban dwellers were 8.9 times more likely to be malnourished. Inadequate financial resources make people 3.7 times more likely to be malnourished. A lower wealth index was a significant predictor of being at risk of malnutrition (AOR=4.156; 95% CI: 1.361 to 12.692). Single elderly people had a 3.4-fold higher risk of malnutrition. Elderly people with chronic pain, who were smokers and alcoholics, and who had depression were all at risk of nutritional problems.ConclusionThe risk of malnutrition and malnourishment was high. Age, urbanisation, finances, education, economics, being a woman, smoking and alcohol are associated factors. Interventional studies are warranted to minimise malnutrition challenges in the study population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01d21740af3d3af02731bbd207d2aae5",
  "timestamp": "2025-05-15T03:05:03.363882"
}