{
  "id": 9134,
  "title": "Situation-specific factors predicting nonadherence to methadone maintenance treatment: a cross-sectional study using the case-crossover design in Guangzhou, China",
  "abstract": "Methadone maintenance treatment (MMT) is a key risk reduction measure for controlling HIV transmission among drug users. Studies using traditional methods exist to distinguish between drop outs and nondrop outs. However, many nondrop outs use MMT discontinuously and no study has identified situation-specific factors predicting their showing or not showing up. This study used a case-crossover design comparing situation-specific factors appearing on the last episode of attendance versus those of the last episode of nonattendance. A total of 133 participants were recruited from two MMT clinics in Guangzhou, China. Participants were asked separately whether various situation-specific factors existed in the last episodes of nonattendance and attendance of MMT. Matched odds ratios (ORs) based on conditional logistic regression analysis were presented. The results showed that the participants attended the MMT clinics on average for 25 days in the last month. Situation-specific factors significantly predicting nonattendance included: (1) physical and mental health status: in illness (OR = 33.0, P < 0.001), in a bad mood (OR = 7.5, P < 0.001), and occurrence of an unhappy event (OR = 18.0, P < 0.001); (2) other engagement: work engagement (OR = 40.0, P < 0.001), trip to other places (OR = 83.0, P < 0.001), and social activities (OR = 10.0, P = 0.012); (3) interpersonal relationship: conflicts with family (OR = 19.0, P = 0.004); and (4) structural situational factors: financial difficulty (OR = 19.0, P = 0.004) and worrying about police arrest (OR = 12.0, P = 0.003). Other factors such as interaction with drug users and heroin use were marginally significant, while reduced methadone dosage was nonsignificant. Interventions to improve MMT adherence need to consider situation-specific factors. Ancillary psychosocial services should be integrated with current MMT; MMT should also provide more flexible services to the clients. Furthermore, efforts should be taken to build up interdisciplinary teams and to connect with MMT in order to provide holistic harm reduction, rehabilitation, and health care.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01d67cb63954de70799727c1ea6ded37",
  "timestamp": "2025-05-15T03:25:54.604062"
}