{
  "id": 4171,
  "title": "The volatility transmission of stock returns across Asia, Europe, and North America",
  "abstract": "Purpose -The purpose of this paper is to investigate the lead-lag relationships between three major stock markets (Tokyo, London, and New York) over the period 1997-2007, using the return-volatility variable. The study aims to use new data to test how one national stock market affects another national stock market, which is one focus of the market integration literature. Design/methodology/approach -The paper employs the traditional regression model because three stock markets (Tokyo, London, and New York) are in different time zones and trading takes place sequentially. Specifically, the intraday return is calculated from the daily open and close prices. Findings -This paper finds strong evidence that three stock markets are significantly interdependent: Tokyo leads London and New York; London leads New York and Tokyo; and New York leads Tokyo and London. In particular, the tie between London and New York is the strongest. Most of the author's results are consistent with those of previous studies. Practical implications -First, there may exist profitable investment strategies in one market by observing the performance of another market that was just closed. Second, regulators should pay close attention to not only the domestic market but also the foreign markets and be ready to deal with adverse situations accordingly. Third, achieving international diversification in portfolio management may become more challenging because of high correlations between markets. Originality/value -This paper extends the existing literature in market integration by using return volatility to test how one market affects another market. Our new evidence confirms that there are high degrees of linkages between Tokyo, London, and New York.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01e4deabc710876739d82e66b782748b",
  "timestamp": "2025-05-15T01:24:25.413163"
}