{
  "id": 6830,
  "title": "Impact of banking models on the relationship between corporate social performance and financial stability: a focus on value-based banking models",
  "abstract": "PurposeThe purpose of this paper is to clarify how the values, tenets and practices of value-based banking and traditional banking models differ and influence the relationship between financial stability (FS) and corporate social performance (CSP). By conducting this analysis, we aim to contribute to a deeper understanding of the sustainability performance of conventional, Islamic and social banks. This understanding will help us develop strategies for the banking industry that will advance social and environmental goals while also promoting FS.Design/methodology/approachThe investigation of the moderating effects of three different banking models Islamic banking, social banking and conventional banking on the link between CSP and FS are new areas of research for CSP studies. Additionally, it presents a brand-new independent variable called the CSP Index, which consists of six indicators that represent different aspects of financial intermediation and inclusion. Using data from a cross-national sample of 111 financial institutions in 33 countries, the study covers a 10-year observation period from 2014 to 2023. The system generalized method of moments (GMM) is the regression estimator that is being used.FindingsThe results indicate that the models of banking affect the link between FS and CSP. Specifically, the conventional banking (CB) model has an extremely negative effect on FS when it comes to CSP-related activities. This is because beyond a given level of financial inclusion and intermediation, the marginal advantages of economic development start to diminish, and any further expansion of financial intermediation would increase financial risk. The potential of value-based institutions, like Islamic and social banks, to strike a balance between social performance and FS, on the other hand, is demonstrated by their reduced negative effects.Research limitations/implicationsThe research has some limitations, despite its merits. Initially, the absence of a widely accepted sustainability reporting standard among international financial institutions had an impact on the volume and range of data used to create a more thorough and reliable CSP index for this research. The results may not have been applicable to a wider class of social banks due to the study's selection of GABV members as social banks. Additionally, the quantitative methodology of the study could have missed contextual and qualitative subtleties that could have an impact on the relationship between CSP, banking models and FS.Practical implicationsThe policy implications of these findings point to the necessity of regulatory frameworks that protect FS while fostering ethical banking practices. Regulators want to think about putting policies in place to guarantee that banks properly identify and handle any risks connected to their social performance initiatives. Policymakers could also consider providing incentives for banks to prioritize sustainable banking practices, which have a good impact on social development and FS.Originality/valueThis paper provides novel insights into the parallels and differences between various banking models and the main objectives of CSP and FS. The frequent problem of bias seen in the CSP indices of prior studies is addressed by the development of a fresh CSP index. The study offers and contributes novel insights that can help stakeholders in the banking sector, regulators and policymakers make decisions that will strengthen and maintain the business and enhance the financial institutions and their stability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "01ebb5e7c873ef1de3c87b3ff51b47f6",
  "timestamp": "2025-05-15T03:02:07.464439"
}