{
  "id": 3927,
  "title": "Elimination of FinTech Risks to Achieve Sustainable Quality Improvement",
  "abstract": "This paper aims to adopt the principles of sustainable risk management for both providers and users who demand to use Financial Technology (FinTech) with high security. Risk management is consider both compliance and sustainability. Moreover, FinTech is considered for financial industry and related with e-transaction or e-payment industries as well. There are certain standards (ISO31000:2018 and ISO27005:2018) and fundamentally applied in information technology; however, it renders insufficient for the newer technologies. In order to determine and assess the potential risks associated with FinTech. Our finding are business and technology risks which are related to FinTech. These two clusters are validated by qualitative and quantitative method. This study combines a known set of FinTech risks with data obtained through the consensus process. I-CVIs and K-mean clustering algorithm are the tools for data analysis on this paper. It has been found that the technologies themselves are at risks of 0.3 and the business risks are at 0.7. The study indicate that traditional technology risks have relevant. The difference in the levels of risks depends on the details of each FinTech type and the parts of the business which technologies are associated with. In addition, the new sets of risks based on the current situations can also be eliminated the risks to create sustainable business.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0200e625f2a8af61992f66d7d79d2493",
  "timestamp": "2025-05-15T02:31:28.357405"
}