{
  "id": 2990,
  "title": "Financial Management in Small Business: Case Studies",
  "abstract": "This study examines the financial management practices of small businesses in Ukraine, emphasizing their impact on revenue growth and financial stability. Using a mixed-methods approach, data were collected from 100 small business representatives through structured surveys and semi-structured interviews, supplemented by publicly available financial statistics. Regression analysis and Likert-scale modelling identified key drivers of financial performance, including cash flow stability, financial risk management, and adopting financial technologies. The study's originality lies in developing the Financial Management Optimization Framework, a structured decision-making model that enables small businesses to enhance financial planning, optimize resource allocation, and mitigate risks effectively. Unlike previous studies that focus broadly on financial management challenges, this research provides a data-driven, actionable approach tailored to the dynamic economic conditions of Ukraine. The framework integrates automated cash flow tracking, AI-driven financial analytics, and structured budgeting techniques such as zero-based budgeting (ZBB) and scenario-based financial planning to improve financial resilience. From a practical perspective, the findings highlight the transformative role of financial technology in overcoming structural financial barriers. Businesses implementing digital financial tools and structured financial planning demonstrate increased financial efficiency and reduced vulnerability to market fluctuations. However, limited access to affordable credit, outdated accounting practices, and insufficient financial literacy continue to hinder small business growth. The study recommends targeted policy interventions to address these issues, including government-backed financial education programs, technology adoption incentives, and improved access to risk management instruments. These insights offer valuable guidance for small business owners, financial institutions, and policymakers seeking to enhance financial management effectiveness in volatile economic environments. Future research should explore sector-specific financial challenges and the long-term impact of financial innovations on small business sustainability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "020eed6a0c608db8d35f1df339eac07f",
  "timestamp": "2025-05-15T02:21:19.270202"
}