{
  "id": 4440,
  "title": "Board of director attributes: effects on financial performance in SMEs",
  "abstract": "This paper analyses the relationship between board of director (BoD) attributes and financial performance in small and medium-sized enterprises (SMEs). Although SMEs are the backbone of world economies, most studies on this relationship focused on large companies and did not consider many typical or recommended processes and activities carried out by SME BoDs. We monitored a set of variables related to BoD attributes such as composition, characteristics, structure and processes for 184 Italian SMEs along with their financials over a 4-year period (2014-2017). We controlled for enterprise-specific characteristics such as annual sales growth, assets value, sales turnover, leverage, company size (employees), firm age, generational changes, director ownership and familiness. Using an ordinary least squares (OLS) regression model with time-period and industry-fixed effects on financial performance data, we found a significant correlation between certain BoD attributes and financial performance. In particular, in our model, BoD members' adequate competences and skills, presence of committees or individual delegates within the BoD, adequate and timely-furnished documentation before BoD meetings, monitoring of conflicts of interest of BoD members, BoD risk analysis and management, BoD member performance-based remuneration, and disclosure to stakeholders influenced the ROA ratio, used as a proxy for financial performance. Our findings support the importance of the BoD and its attributes in influencing the financial performance of SMEs. BoDs are proven unique resources for companies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "021361fe61eff86626a356315edecead",
  "timestamp": "2025-05-15T02:37:16.895228"
}