{
  "id": 8640,
  "title": "Challenges in achieving Sustainable Development Goal 2 in Ghana: An assessment of the impact of economic crisis on urban household food security",
  "abstract": "There is an ongoing economic crisis in Ghana which has the potential to strain household finances, alter dietary patterns, and push people into a state of food insecurity. While rural areas have traditionally been the focus of food security research and interventions in Sub-Saharan Africa, there is growing evidence of the challenges faced by urban residents which warrants investigation. This study aims to assess the current status of food security among urban households in Ghana, and examine the impact of the economic crisis on food dietary decisions and food security. This study surveyed 401 random sampling participants in two major urban areas, Accra and Takoradi. The structured questionnaire included the Food Insecurity Experience Scale (FIES), and additional questions on income allocation to food and dietary changes. The results show a significant prevalence of food insecurity among urban households in Ghana, with over half of the respondents experiencing moderate to severe food insecurity. The economic crisis has notably impacted food expenditures, with 81 % of participants reporting changes in their income allocation to food, and 75 % reducing the variety of foods they consume. A substantial portion of respondents now spends between 31 and 50 % of their total income on food which is an indication of the financial burden they face. Ordinal logistic regression identified household income as a critical factor influencing food security, with unemployed and lower-income individuals facing a significantly higher risk. These results emphasize the urgent need for both immediate food assistance, and long-term strategies to strengthen food systems and improve the economic situation to reduce vulnerability. Implementing the recommendations from these findings could contribute towards achieving Sustainable Development Goal 2 in Ghana.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "022b7bb26f1e2385719a8ddd3ca40e9d",
  "timestamp": "2025-05-15T03:20:55.969267"
}