{
  "id": 5389,
  "title": "The impact of social frailty on mortality in older patients with chronic heart failure: A prospective cohort study",
  "abstract": "Background: There is still insufficient longitudinal evidence regarding the risk of mortality in older patients with chronic heart failure (CHF) and social frailty (SF). Objectives: The purpose of study was to describe the incidence rate of non-SF, pre-SF, and SF in older patients with CHF and explore its impact on mortality. Methods: The observational study was conducted at a tertiary hospital in China. According on the Help, Participation, Loneliness, Financial, Talk scale (HALFT) scores, they were divided into three groups: non-SF (0 points), pre-SF(1-2points), and SF groups(>= 3points). Follow up for 6 months, observation indicator was mortality. Kaplan Meier survival analysis and the Log-rank test were used to compare the mortality of the three groups of patients. Apply the Cox proportional hazards regression model to analyze the related factors associated with mortality. Results: A total of 297 patients completed the baseline survey.The average age was 69.99 +/- 6.47, with 59.26 % men and 40.74 % women. In the 6-month follow-up, nine patients were lost to follow-up, and 35 patients died. The mortality rate of the SF group was higher than that of the non-SF group (chi(2)=14.805, P < 0.01). Using a multivariate Cox proportional hazards regression model, our results showed that SF, age, and marital status were risk factors for mortality. Conclusion: SF can increase the risk of mortality in older patients with CHF and is a risk factor for mortality. Healthcare providers should enhance patients' social adjustment to aid early prevention and intervention in the occurrence and development of SF to reduce the risk of mortality in older patients with CHF.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "022e02026341a4b2cf563d26115383fa",
  "timestamp": "2025-05-15T02:47:13.989363"
}