{
  "id": 2511,
  "title": "Correlates of limitations in activities of daily living and mobility among community-dwelling older Singaporeans",
  "abstract": "Most research on activity limitations has focused on the association between chronic health conditions and activity limitations and given little attention to their social and financial implications. In this paper, we study the correlates of limitations in the activities of daily living (ADL) and mobility among older Singaporeans (aged 55 or more years), based on the 'disability frameworks' or pathways proposed by Nagi, Verbrugge and the International Classification of Functioning, Disability and Health. Data from the 2005 National Survey of Senior Citizens in Singapore was used. The weighted prevalence of ADL and mobility limitations was calculated, overall and in subgroups. Logistic regression models were used to assess predictors of ADL and mobility limitations and variation in involvement with family, society, work, use of services and perceived financial adequacy, by ADL and mobility status was studied. We found the overall weighted prevalence of ADL and mobility limitation to be 5 and 8 per cent, respectively. Significant risk factors for ADL and mobility limitation were being older (aged 75 or more years), widowed, having diabetes, joint/bone problems, stroke, cancer and low income. Individuals with ADL and mobility limitations had lower involvement with family, society and work, and perceived financial adequacy, while use of services was higher. The findings underline the importance of improving elderly services for sustained integration of disabled elderly within the community.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "023e311774b6277b5cf8c38eabf4c73a",
  "timestamp": "2025-05-15T02:15:59.932634"
}