{
  "id": 2728,
  "title": "Understanding the interactions among revenue categories using elasticity measures-Evidence from a longitudinal sample of non-profit sport clubs in Germany",
  "abstract": "The revenue composition of for-profit and non-profit organisations is fundamentally different. Non-profit organisations have diversified revenues and must therefore manage an income portfolio. For the management of the income portfolio of a non-profit sport club it is not only important that sufficient revenues are available, but also where they come from as complex interactions exist among different revenue sources. These interactions are referred to as crowd-out effects (increases in one revenue source lead to decreases in another source) and crowd-in effects, respectively. The interactions among revenue categories of non-profit sport clubs were analysed using a longitudinal dataset from a nationwide sport club survey in Germany (n = 5026). Elasticity measures were calculated within a regression framework which provided information about the nature and significance of interactions. The results revealed a significant positive interaction between revenues from donations and sport supply (e.g., membership and service fees) pointing towards a crowd-in effect, i.e., increased revenues from donations have crowded in revenues from sport supply. Moreover, increased revenues from subsidies were found to crowd in revenues from donations and economic activities (e.g., sponsorship). Significant negative interactions were observed for revenues from economic activities and other supply suggesting that increased revenues from economic activities have crowded out revenues from other supply. The findings indicated an increased level of commercialisation supporting a modernisation of German clubs. Furthermore, the uncertainties have increased and therefore sport clubs have to consider the level of uncertainty of their revenue sources when they manage their income portfolio. (C) 2011 Sport Management Association of Australia and New Zealand. Published by Elsevier Ltd. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "025aaa93af22089ccda66e5fd227359e",
  "timestamp": "2025-05-15T01:09:43.391146"
}