{
  "id": 2992,
  "title": "Understanding the Relationship between Breast Reconstruction Subtype and Risk of Financial Toxicity: A Single-Institution Pilot Study",
  "abstract": "Background: The impact of breast reconstruction on financial toxicity remains poorly understood despite growing awareness. The authors sought to illustrate the relationship between breast reconstruction subtypes and the risk of financial toxicity. Methods: The authors conducted a single-institution cross-sectional survey of all female breast cancer patients undergoing any form of breast reconstruction between January of 2018 and June of 2019. Financial toxicity was measured by means of the validated Comprehensive Score for Financial Toxicity instrument. Demographics, clinical course, and coping strategies were abstracted from a purpose-built survey and electronic medical records. Multivariable linear regression was performed to identify associations with financial toxicity. Results: The authors' analytical sample was 350 patients. One hundred eightyfour (52.6 percent) underwent oncoplastic reconstruction, 126 (36 percent) underwent implant-based reconstruction, and 40 (11.4 percent) underwent autologous reconstruction. Oncoplastic reconstruction recipients were older, had a higher body mass index, and were more likely to have supplemental insurance and receive adjuvant hormonal therapy. No significant differences in the risk of financial toxicity were uncovered across breast reconstruction subtypes (p = 0.53). Protective factors against financial toxicity were use of supplemental insurance (p = 0.0003) and escalating annual household income greater than $40,000 (p < 0.0001). Receipt of radiation therapy was positively associated with worsening financial toxicity (-2.69; 95 CI percent, -5.22 to -0.15). Financial coping strategies were prevalent across breast reconstruction subtypes. Conclusions: Breast reconstruction subtype does not differentially impact the risk of financial toxicity. Increasing income and supplemental insurance were found to be protective, whereas receipt of radiation therapy was positively associated with financial toxicity. Prospective, multicenter studies are needed to identify the main drivers of out-of-pocket costs and financial toxicity in breast cancer care.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "025a45fcea211c8f90e44c3e46f9363d",
  "timestamp": "2025-05-15T02:21:19.272203"
}