{
  "id": 3843,
  "title": "IS THE MUCH DISCUSSED AGILITY OF CORPORATE REAL ESTATE VISIBLE IN PRACTICE? AN EMPIRICAL STUDY OF THE RELATIONSHIP BETWEEN BUSINESS METRICS AND SURPLUS PROPERTY",
  "abstract": "Very little work has been undertaken on the consequences of economic recession on Corporate Real Estate (CRE) and its realignment following strategy changes. Only those CRE portfolios with short term leases have a dynamic alignment capability allowing them to readily adjust to change. For those with longer leases this leads to the creation of a surplus property provision (SPP). This paper analyses the relationship between SPP and metrics for business and CRE through a period of significant change, by examining company annual reports using a distributed time lag auto-regression model. The results show an inverse relationship between SPP and profits but a positive relationship with both turnover and employment, suggesting that declining profits trigger the re-shaping of CRE. SPP is used to provide portfolio flexibility because of the lack of dynamic alignment capability. SPP increases as the commitment to short leases (<5 years) increases. The estimated time for SPP to revert to zero ranges from 3 to 9 years, but one category, financial services, is continuing to increase its liability. CRE agility has yet to be visible in the financial reports of companies, suggesting its impact remains limited, indicating the relationship between business parameters and CRE is more complicated than envisaged.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "025d4624d58de82d577ba5d13a57bee3",
  "timestamp": "2025-05-15T01:21:41.241055"
}