{
  "id": 361,
  "title": "Pricing and promotion strategies of an online shop based on customer segmentation and multiple objective decision making",
  "abstract": "The advent of the Internet and web technologies has enabled the prosperity of virtual stores, which greatly reduce customers' search costs and retailers' overhead. However, the furious competition between online shops makes it difficult for them to generate profits. This study attempts to establish pricing and promotion strategies for online shops to enhance their profitability. The pricing decision is based on the concept of customer relationship management, where a greater margin of price concession is given to customers who are more valuable to the shop. The process of our approach is: clustering customers into different classes based on their RFM data, computing and presenting the list prices of products to customers according to their classes, allowing customers to bargain over the price and offering conceded prices which are computed based on customer classes and a multi-objective decision making model, and finally providing promotion options to customers to reinforce their purchase inclination. The proposed approach is implemented at an online shop of a computer peripherals retailer. Transaction data before and after the implementation are collected and compared to assess the performance of the proposed approach. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02633a99310801798943d155a81174cf",
  "timestamp": "2025-05-15T01:31:13.159793"
}