{
  "id": 8551,
  "title": "Impact of the COVID-19 pandemic on health care and daily life of patients with rare diseases from the perspective of patient organizations - a qualitative interview study",
  "abstract": "BackgroundDuring the COVID-19 pandemic people affected by rare diseases (RD) or caregiver of affected children have faced additional challenges. The pandemic has affected physical and mental health, social life and has led to financial consequences. Our objectives were to identify the impact of COVID-19 (1) on health care and (2) on daily life and participation of patients with RDs or caregivers from the perspective of representatives of patient organizations. Moreover, we explored their perspective on experiences of pandemic stress and resources during the pandemic.ResultsWe conducted 18 semi-structured interviews with representatives of patient organizations (e.g. chairperson, members of the steering committee), who were asked about the experiences of their members. The interviews were transcribed verbatim and analyzed using the framework approach. We contextualized our findings on the basis of the International Classification of Functioning, Disability and Health (ICF) model and adapted it according to identified subthemes. Patients and caregivers were confronted with aspects of pandemic stress such as lack of information, access and information regarding vaccination and being a risk group for COVID-19 infection. Physical and mental functioning was reported to be negatively impacted. Lock downs and contact restrictions led, e.g., to increasing lack of nursing services or lack of necessary informal support. Participation e.g. in social life and work was reduced. Health care services including medical care and supportive care as well as additional therapies were disrupted and greater effort was necessary to organize care. According to participants, central resources were informal support networks, digitalization, patient organizations and individual characteristics.ConclusionsOur study highlights the consequences of the COVID-19 pandemic on the situation of people affected by RDs and caregivers. Contextualization of the results into the biopsychosocial model reinforces the impact of the pandemic on health care as well as daily life and participation. Major challenges and difficulties were experienced during lockdowns and contact restrictions. Depending on the risk of an infection with COVID-19, certain patient groups were still isolated and reduced social contacts or still followed strict hygienic measures (e.g., wearing medical masks). Future pandemic control measures, e.g. on lockdowns and closing facilities, should consider the challenges of people with RDs and caregivers of affected children.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0268176634ffafa04682677e65ecdb97",
  "timestamp": "2025-05-15T03:19:52.171710"
}