{
  "id": 8594,
  "title": "Survival in Patients with Uveal Melanoma Is Linked to Genetic Variation at HERC2 Single Nucleotide Polymorphism rs12913832",
  "abstract": "Purpose: Uveal melanoma (UM) is a rare disease, with the highest incidence in people with fair skin and light eyes. Eye color is largely genetically determined and is defined by a set of single nucleotide polymorphisms (SNPs). We set out to determine whether we could identify a SNP related to prognosis. Design: We sequenced DNA from peripheral blood mononuclear cells of 392 patients with UM and obtained the genotype of 6 common eye color-related SNPs. Clinical and histopathologic tumor characteristics, tumor chromosome status, and patient survival were compared among patients with different genotypes. Participants: Three hundred ninety-two patients who underwent enucleation for UM at the Leiden University Medical Center, Leiden, The Netherlands. Methods: We isolated DNA from peripheral blood leukocytes of 392 patients with UM and performed sequencing, using 6 eye color SNPs from the HIrisPlex-S assay (Erasmus MC, Walsh lab). The genotypes extracted from the sequencing data were uploaded onto the HIrisPlex webtool (https://hirisplex.erasmusmc.nl/) for eye color prediction. We tested the association of eye color SNPs with tumor characteristics and chromosome aberrations using Pearson's chi-square test and the Mann-Whitney U test and evaluated survival with Kaplan-Meier curves with the log-rank test and Cox regression. Main Outcome Measures: Uveal melanoma-related survival. Results: Of 392 patients with analyzable genotype data, 307 patients (78%) were assigned blue eyes, 74 patients (19%) were assigned brown eyes, and 11 patients (3%) could not be assigned to either blue or brown. Patients with a genetically blue eye color showed worse survival (P = 0.04). This was related to 1 genotype: patients with the G/G genotype of rs12913832 (HERC2), which codes for blue eye color showed a worse prognosis (P = 0.017) and more often had high-risk tumors (monosomy of chromosome 3; P = 0.04) than in patients with an A/G or A/A genotype. Conclusions: The G/G genotype of rs12913832 (HERC2), which is related to blue eye color, not only is a genetic factor related to the risk of UM develop, but also is linked to a worse prognosis because of an association with a higher risk of a high-risk UM developing (carrying monosomy of chromosome 3). Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2025;132:299-308 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "026d85133ae1b0c401edf68cedcb8d5c",
  "timestamp": "2025-05-15T03:20:22.290795"
}