{
  "id": 5664,
  "title": "Corporate governance and sharia board: enhancing disclosure compliance in Islamic banks of MENA region",
  "abstract": "PurposeThe purpose of this study is to investigate the impact of corporate governance mechanisms and sharia supervisory board (SSB) characteristics on financial disclosure compliance of Islamic banks (IB) with International Financial Reporting Standards (IFRS) and Accounting and Auditing Organization for Islamic Financial Institutions (AAOIFI) in Middle East and North Africa (MENA) region.Design/methodology/approachUsing a sample of 600 observations covering the listed Islamic banks in MENA region during the period 2010-2021, the study uses a quantitative approach using a regression panel data analysis to examine the relationship between SSB and corporate governance mechanisms with financial disclosure of IB. The empirical study used a dynamic panel model estimated with feasible generalized least squares to identify the main determinants of disclosure compliance with IFRS and AAOIFI standards.FindingsThis study revealed variations in compliance level with AAOIFI FAS1, FAS2, FAS3, FAS4, FAS9, and IAS1, IAS30, IAS32, and IFRS7 standards among Islamic banks. Financial disclosure was positively influenced by board independence (IND_BD), women directors (WOM), sharia board reputation (REP_SH) and financial year (FIN_Y). However, it was negatively related to audit committee (AUD_C), sharia board size (SIZ_BD) and country (CTRY). No significant impact was observed for CEO duality (CEO_D), cross-membership (CRSS_SH) and audit quality (AUD_Q). These findings highlight the complex relationship between governance attributes and compliance with AAOIFI and IFRS standards.Practical implicationsThe study's findings have important practical implications for various stakeholders and users of the financial information in the Islamic banking industry for their decision-making. Also, this study highlights the significance of enhancing the independence SSB to improve decision-making and the independence of the board to solve problems that deal with risk management. However, the diversity of characteristics and rule between countries mitigate negative effects on discloser level. Adopting the AAOIFI standards and incurring strong governance mechanisms may provide insights to investors to make informed decisions.Originality/valueBased on the agency, stewardship and stakeholder theories, this study expands on previous literature by examining the degree of compliance with both IFRS and AAOIFI financial standards, providing important insights into the evolution of disclosure practices over time. It highlights the main factors that influence the extent of disclosure, with a particular focus on corporate governance and SSB dimensions, using MENA region known by distinct characteristics and regulatory dynamics.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0270bbb2ad700877b7db97a9e26df818",
  "timestamp": "2025-05-15T02:50:21.140334"
}