{
  "id": 1443,
  "title": "Novel online portfolio selection algorithm using deep sequence features and reversal information",
  "abstract": "Computational finance combines machine learning with financial needs to provide more efficient solutions for investment analysis and automated trading. In previous studies, traditional online portfolio selection (OLPS) algorithms were found to be overly reliant on artificially designed, subjective financial features. To address this issue, we propose a new predictive price tracking algorithm based on deep sequence features and reversal information (DSF-RI-PPT) for OLPS, extending a hybrid stock prediction algorithm to a multiasset trading algorithm. We respectively employ the complete ensemble empirical mode decomposition with adaptive noise (CEEMDAN), principal component analysis (PCA) algorithms and long short-term memory (LSTM) network to perform decomposition, feature extraction and prediction on financial data. Further, we supplement the reversal information by modifying the predicted prices with a reversal indicator-rate of change (ROC). Finally, we introduce a fast error back-propagation algorithm to integrate the predictive information into the investment ratio using gradient projection. Through empirical comparison and statistic analysis of the DSF-RI-PPT algorithm, price-tracking algorithms with similar prediction models, and nine classic OLPS algorithms in nine portfolio data sets under three financial indexes, it can be found that the DSF-RI-PPT algorithm is profitable and generalizable.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "027f4d5e8f27631d7634c557539663db",
  "timestamp": "2025-05-15T00:56:08.248044"
}