{
  "id": 4291,
  "title": "Modelling the cost of place of birth: a pathway analysis",
  "abstract": "Background In New South Wales (NSW), Australia there are three settings available for women at low risk of complications to give birth: home, birth centre and hospital. Between 2000 and 2012, 93.6% of babies were planned to be born in hospital, 6.0% in a birth centre and 0.4% at home. Availability of alternative birth settings is limited and the cost of providing birth at home or in a birth centre from the perspective of the health system is unknown. Objectives The objective of this study was to model the cost of the trajectories of women who planned to give birth at home, in a birth centre or in a hospital from the public sector perspective. Methods This was a population-based study using linked datasets from NSW, Australia. Women included met the following selection criteria: 37-41 completed weeks of pregnancy, spontaneous onset of labour, and singleton pregnancy at low risk of complications. We used a decision tree framework to depict the trajectories of these women and Australian Refined-Diagnosis Related Groups (AR-DRGs) were applied to each trajectory to estimate the cost of birth. A scenario analysis was undertaken to model the cost for 30 000 women in one year. Findings 496 387 women were included in the dataset. Twelve potential outcome pathways were identified and each pathway was costed using AR-DRGs. An overall cost was also calculated by place of birth: $AUD4802 for homebirth, $AUD4979 for a birth centre birth and $AUD5463 for a hospital birth. Conclusion The findings from this study provides some clarity into the financial saving of offering more options to women seeking an alternative to giving birth in hospital. Given the relatively lower rates of complex intervention and neonatal outcomes associated with women at low risk of complications, we can assume the cost of providing them with homebirth and birth centre options could be cost-effective.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "028c6503a9ddbd2f8c83a01cd03999d2",
  "timestamp": "2025-05-15T02:35:26.291935"
}