{
  "id": 9437,
  "title": "Loneliness, office space arrangement and mental well-being of Gen Z PR professionals. Falling into the trap of an agile office?",
  "abstract": "PurposeThe purpose of the study was to assess how the well-being and loneliness of public relations and communication professionals are impacted by the post-pandemic characteristics of the work environment: flexible work schemes, non-territorial office arrangements and video communication technologies. It was hypothesised that the post-pandemic workplace landscape poses several new challenges to the practice of PR - an industry which invariably relies on working with other people and demands a good level of social resilience. Loneliness and well-being both depend on the experience of having good and efficient social relationships, but the pandemic has directly and indirectly led to their deterioration.Design/methodology/approachThe project employed a correlational design and used an online survey system to collect responses from Gen Z professionals employed in the public relations and communications industry in the UK and the US via the Prolific platform. Demographical and workplace-related characteristics were assessed to investigate links with loneliness (measured using a three-item scale adopted from Russell et al., 1980 in Hughes, 2004) and well-being (using a short Warwick-Edinburgh Mental Well-being Scale scale). Causal relationships between data were tested using regression analysis for continuous variables and analysis of covariance for categorical factors. Bootstrapping was used to test mediated relationships that explain loneliness, job satisfaction and the well-being of Gen Z PR professionals.FindingsSeveral types of flexible working schemes, defined as the ability to work from home on any number of weeks, showed an impact on loneliness and job satisfaction but not on well-being. However, all remaining aspects of the post-pandemic office did manifest as important predictors. In the sample, 30% of Gen Z PR professionals showed signs of mild to clinical levels of depression, and the best protection from this state was the presence of a significant other. Lower levels of loneliness were related to non-territorial office arrangements and job satisfaction. The use of hot desks and open-plan arrangements led to a significantly lower level of job satisfaction than a traditional, cellular office. Both excessive online meetings and face-to-face only interactions led to marginally lower levels of loneliness and job satisfaction.Research limitations/implicationsThe present research is limited in several aspects. Firstly, while the project evaluated loneliness, job satisfaction and mental well-being (with each of these elements including a component of the requirement for building effective relationships), the quality of relationships built by PR professionals was not measured. Secondly, the project focused only on post-pandemic aspects of the workplace and did not cover other important components of job satisfaction. Lastly, the measure of online meetings was declarative rather than behavioural, and greater control of the number of online meetings held would be required to show more reliable links between variables.Practical implicationsThis study calls for proposing recommendations for employers to develop organisational-level measures and programmes to counteract loneliness. While traditionally intimate relationships of employees were not a direct focus of HR programmes, employers should develop elements of organisational culture that would support employees in building effective intimate relationships. Separately from this, despite immediate financial benefits, employers should avoid using open-space and hot desk policies, as they contribute negatively to job satisfaction (and indirectly to well-being). The sample of UK and US professionals was chosen for analysis because in these countries employers have more capacity to introduce changes to tangible characteristics of the workplace and work culture, which may positively impact the well-being of their employees.Social implicationsIt is expected that both employers and employees will revisit their approach to post-pandemic financial and logistic challenges related to the workplace. A lower level of job satisfaction and well-being is linked to the lack of assigned office space, but the ability to work exclusively from home leads to loneliness. Employees - when offered this possibility - should work in offices they are provided. Employers must appreciate the negative link between open and hot-desking policies and job satisfaction and well-being of their employees.Originality/valueThis study is the first to examine the post-pandemic workplace and personal characteristics of public relations and communications professionals in the UK and US and show how they impact job satisfaction and well-being. The study shows that 30% of employed in the PR industry are at risk of depression or anxiety. The connecting factor between personal and work-related characteristics that explains this problem is loneliness.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "029515b6e522f006af42ada3040d8a7b",
  "timestamp": "2025-05-15T03:28:46.311210"
}