{
  "id": 6033,
  "title": "A Mixed Methods Population Health Approach to Explore Radon-Induced Lung Cancer Risk Perception in Canada",
  "abstract": "Background Radon is a predominant indoor air pollutant and second leading cause of lung cancer in radon-prone areas. Despite the gravity of the health risk, residents in Canada have inadequate perception and taken minimal protective actions. Better perception of a risk motivates people to take preventive measures. Scholarship about radon health risk perception is lacking in Canada. We applied a mixed methods population health approach to explore the determinants shaping perception and actions of a resident population in Canada. Methods We conducted mixed surveys (n = 557) and qualitative bilingual interviews (n = 35) with both homeowners and tenants of Ottawa-Gatineau areas. The study explored residents' risk perception and adaptations factors. Descriptive, correlational and regression analyses described and established associations between quantitative variables. Thematic, inductive analyses identified themes in the qualitative data. A mixed methods analysis triangulated both results to draw a holistic perception of the health risk. Results Residents' quantitative perceptions of radon health risk, smoking at home, synergistic risk perception, social influence and care for family were associated significantly with their intention to test for radon levels in their home, actual testing and mitigation. These results were explained further with the qualitative findings. Residents who had dual cognitive and emotional awareness of the risk were motivated enough to take preventive actions. Caring for family, knowing others who contracted lung cancer and financial capability were enablers, whereas lack of awareness and homeownership, cost of mitigation and stigma were obstacles to preventive actions. We also explored the dual subjective and objective aspects of risk perception that are influenced by micro- and macro-level determinants. Conclusions Inducing protective action to reduce risk requires comprehensive population-level interventions considering dual perceptions of the risk that can modify the risk determinants. Future research can explore the dual aspects of risk perception and unequal distribution of the risk factors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02a1e7357ece9994f2b16ce75cd717f8",
  "timestamp": "2025-05-15T02:54:03.403574"
}