{
  "id": 5202,
  "title": "Role of fintech in credit risk management: an analysis of Islamic banks in Indonesia, Malaysia, UAE and Pakistan",
  "abstract": "PurposeThe purpose of this study aims to examine the effect of fintech on pre- and post-financing credit risks faced by the Islamic banks. Design/methodology/approachThis research uses primary data for fintech awareness and adoption and secondary data of various financial and economic variables from 2009 to 2021. It uses baseline regression to identify moderation of fintech controlling gross domestic products, size, return on assets and leverage. The findings are confirmed using robustness against key variable bias. It also uses a dynamic panel two-stage generalized method of moments for endogeneity. FindingsThe study finds that the fintech awareness and adoption are not the same across all Islamic countries. The Asia Pacific region is far ahead of the other two regions where Indonesia is ahead in terms of fintech awareness and adoption, and Malaysia is ahead in terms of reaping its benefits in credit risk management. Fintech affects prefinancing credit risk significantly more than postfinancing credit risk. Also, the study finds that Islamic banks suffer from the problem of Adverse selection under Shariah compliance. Practical implicationsThis research invites regulators to introduce fintech in Islamic banks on war footing. Similar studies can be conducted on the role of other risks such as operational and market risks. Fintech will also help in improving the risk profile and stability of Islamic banks against systemic risks and financial crises. Originality/valueThis research has variety of originalities. First, it is the pioneering study that addresses the effect of fintech pre- and post-financing credit risks in Islamic banks. Second, it identifies Adverse selection under Shariah compliance for Islamic banks. Third, it helps identify how fintech can be useful in reducing credit risk that will help in reducing capital charge for regulatory capital.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02a4d2b93338450de1e8b3c90c738f56",
  "timestamp": "2025-05-15T02:45:17.127675"
}