{
  "id": 8071,
  "title": "Does politics matter? Partisan FDI in Central and Eastern Europe",
  "abstract": "Purpose - While many studies have investigated the impact of institutional factors (i.e. financial risk factors) in the host country on inward foreign direct investment (FDI), fewer studies have researched on the locational aspects of FDI in relation to the political economy. This paper aims to fill this gap by examining the effects of the political economy on inward FDI in Poland's regions and in other CEE (Central and Eastern Europe) countries. Design/methodology/approach - The paper develops a theoretical argument postulating that political economy affects locational determinants of FDI inflow. To test this hypothesis empirically, several analyses were performed at the national level (Poland, Bulgaria, Romania, Slovakia and the Czech Republic) and at the subnational level (Poland's provinces). First, the footloose nature of FDI inflows using the time series analysis was examined. Then a fixed-effect panel data regression model and a dynamic adjustment model to quantify the impact of political ideology and agglomeration effects were performed. Findings - After controlling for economic and institutional determinants of FDI, the findings indicate that, in transitional economies, ideology affects the locational choice of multinational corporations (MNCs). At the national level, the results show that political risk, liberalization and economic reforms are important drivers of FDI inflows. At the subnational level, the vote for a liberal party positively affects the distribution of FDI in the provinces. Another finding is that electoral cycles also affect FDI inflows at regional levels in Poland. Finally, this study provides some supporting evidence for the footloose nature of FDI in case of external shocks. Originality/value - This study contributes to the literature on the locational determinants of FDI by showing that ideology constitutes an important factor for locational choices by MNCs. The findings have important implications for public policy decision-makers who are seeking to improve the attractiveness of their country or region as an FDI destination.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02a9391aaf464ae8d1c8aab4f2c8bbbe",
  "timestamp": "2025-05-15T03:15:09.316960"
}