{
  "id": 8968,
  "title": "THE PRESENT GLOBAL FINANCIAL AND ECONOMIC CRISIS POSES AN ADDITIONAL RISK FACTOR FOR MENTAL HEALTH PROBLEMS ON THE EMPLOYEES",
  "abstract": "Background: The global financial and economic crisis starting in 2007 led to a deterioration of several socio-economic determinants of mental health. The aim of this cross-sectional study was to examine the impact of the present economic crisis on the depression and anxiety levels of the employed in the private and public sector in Slovenia. Subjects and methods: Altogether 1592 employees completed an internet based self-reported questionnaire. Data about perceived impact of the economic crisis, several socio-demographic, socioeconomic, and health parameters were collected. Depression symptoms were assessed by the Center for Epidemiological Studies-Depression Scale and anxiety symptoms by the Spielberger State-Inventory. Regression models were used 1) to explore the associations of the economic crisis with the level of depression and anxiety symptoms while controlling for some sociodemographic and work characteristic variables, and 2) to understand the relationship between some potentially important socioeconomic variables and the perception of the economic crisis. Results: Depressive and anxiety scores were significantly increased among 590 (46.6%) employees being affected by the economic crisis. The level of depressive symptoms was significantly associated with perceived impact by the crisis, recent sick leave, reported injuries sustained at work, benzodiazepine and analgesic use, the lack of emotional support, and trust in crisis telephone lines. The level of anxiety symptoms yielded the robust association with the level of depression symptoms, reported injuries sustained on the way to work and education. Conclusions: The economic crisis poses an additional risk factor for mental health problems which clinicians should internalize and become more aware of them. Symptoms of depression and anxiety can be masked in high-utilizers of medical care with physical complaints or psychoactive drug use.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02aa69e6ba8be720e05e27823b237b3b",
  "timestamp": "2025-05-15T03:24:26.261163"
}