{
  "id": 3098,
  "title": "Corporate governance quality index and Islamic bank risk-taking",
  "abstract": "This study used the board of directors, risk management committee (RMC), audit committee (AC) and Shari'a supervisory board (SSB) attributes and constructed a comprehensive corporate governance (CG) quality index and sub-indices to explore their influence on Islamic bank risk-taking. It used unbalanced panel data manually collected over 12 years (2010-2021) generated from the annual reports of a sample of 43 fully Shari'a-compliant Islamic banks operating in 15 different countries. Using the two-step system GMM estimator as a major regression, the findings indicate a significant positive relationship between the CG quality index and credit risk. Concerning sub-indices, board and AC quality sub-indices have a significant negative and positive association with credit risk. However, RMC and SSB quality sub-indices have an insignificant association with risk. The findings were substantially similar when we used portfolio risk as an alternative measure of risk-taking and FGLS and OLS robust regression as alternative regression models. Consequently, the study recommends the need for relevant regulators to review the CG codes related to the board and these committees, as well as credit and risk management policies, to rejuvenate the effectiveness of RMC, AC, SSB and the overall CG practices in enhancing Islamic bank stability.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02b7ac40c55bbae130b11e3218ac72d4",
  "timestamp": "2025-05-15T01:13:45.115421"
}