{
  "id": 6759,
  "title": "Contagion risk: cases of Islamic and emerging market banks",
  "abstract": "Purpose Globally influential Islamic banks from the Middle East and Southeast Asia carry voluminous correspondence banking with banks from China and India, leading to potential spillover effect of contagion among the banks from these regions. This study aims to investigate the Islamic banks systemic risk contagion with major banks from China and India. Design/methodology/approach Having the option pricing theory in the backdrop, the authors calculated three different distance to risk measurements (default, insolvency and capital). The authors have included top six listed globally influential Islamic banks, top seven Indian banks and top eight Chinese banks based on their net asset value. They then measured the banks' extreme shocks based on the extreme value theory by using the logistic regression model. These extreme shocks helped the authors to map the spillover among the selected banks from multiple regions. Findings The authors have found strong evidences of directional risk spillover among the banks in this sample. Islamic banks are receiving a significant risk spillover from the other sample banks but transmitting less toward the other banks from India and China. Hence, there is strong one-directional risk contagion toward the Islamic banks in the study sample. Practical implications This research would be particularly useful to the regulators and bankers from emerging and Islamic markets to understand the conniving nature of the crisis by effectively mapping the source, destination and implementation of the shock transmission mechanism of the potential financial contagion. Originality/value Even though the corresponding banking among the top Islamic banks from the Middle East and Southeast Asian countries, and banks from India and China, is on the rise, the assessment of risk among these banks has been limited. In particular, the authors extended on the extreme value theory to focus on the wider impact of spillover, including significant direction of contagion from non-Islamic banks to Islamic banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02b79699d94dc8cbc8a0c95d8b4b8246",
  "timestamp": "2025-05-15T03:01:03.710667"
}