{
  "id": 4868,
  "title": "Association of household net worth with healthcare costs after radical cystectomy using real-world data",
  "abstract": "Background Financial toxicity of bladder cancer care may influence how patients utilize healthcare resources, from emergency department (ED) encounters to office visits. We aim to examine whether greater household net worth (HHNW) confers differential access to healthcare resources after radical cystectomy (RC). Methods This population-based cohort study examined the association between HHNW and healthcare utilization costs in the 90 days post-RC in commercially insured patients with bladder cancer. Costs accrued from the index hospitalization to 90 days after including health plan costs (HPC) and out-of-pocket costs (OPC). Multivariable logistic regression models were generated by encounter (acute inpatient, ED, outpatient, and office visit). Results A total of 141,903 patients were identified with HHNW categories near evenly distributed. Acute inpatient encounters incurred the greatest HPC and OPC. Office visits conferred the lowest HPC while ED visits had the lowest OPC. Black patients harbored increased odds of an acute inpatient encounter (OR 1.22, 95% CI 1.16-1.29) and ED encounter (OR 1.20, 95% CI 1.14-1.27) while Asian (OR 0.76, 95% CI 0.69-0.85) and Hispanic (OR 0.74, 95% CI 0.69-0.78, p < 0.001) patients had lower odds of an outpatient encounter, compared to White counterpart. Increasing HHNW was associated with decreasing odds of acute inpatient or ED encounters and greater odds of office visits. Conclusions Lower HHNW conferred greater risk of costly inpatient encounters while greater HHNW had greater odds of less costly office visits, illustrating how financial flexibility fosters differences in healthcare utilization and lower costs. HHNW may serve as a proxy for financial flexibility and risk of financial hardship than income alone.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02c34003dad8dbe9391d78e2972820d8",
  "timestamp": "2025-05-15T02:42:04.806028"
}