{
  "id": 2207,
  "title": "Designing a post-disaster humanitarian supply chain using machine learning and multi-criteria decision-making techniques",
  "abstract": "PurposeEvery day, small and big incidents happen all over the world, and given the human, financial and spiritual damage they cause, proper planning should be sought to deal with them so they can be appropriately managed in times of crisis. This study aims to examine humanitarian supply chain models.Design/methodology/approachA new model is developed to pursue the necessary relations in an optimal way that will minimize human, financial and moral losses. In this developed model, in order to optimize the problem and minimize the amount of human and financial losses, the following subjects have been applied: magnitude of the areas in which an accident may occur as obtained by multiple attribute decision-making methods, the distances between relief centers, the number of available rescuers, the number of rescuers required and the risk level of each patient which is determined using previous data and machine learning (ML) algorithms.FindingsFor this purpose, a case study in the east of Tehran has been conducted. According to the results obtained from the algorithms, problem modeling and case study, the accuracy of the proposed model is evaluated very well.Originality/valueObtaining each injured person's priority using ML techniques and each area's importance or risk level, besides developing a bi-objective mathematical model and using multiple attribute decision-making methods, make this study unique among very few studies that concern ML in the humanitarian supply chain. Moreover, the findings validate the results and the model's functionality very well.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02c799f6e3686a9eff2cd8f49d106a67",
  "timestamp": "2025-05-15T02:12:17.467268"
}