{
  "id": 8648,
  "title": "Effect of integrated nutrition-sensitive and nutrition-specific intervention package on maternal malnutrition among pregnant women in Rwanda",
  "abstract": "Maternal undernutrition remains a major public health concern in Rwanda despite significant gains and progress. An integration of nutrition-specific and nutrition-sensitive interventions was implemented in five districts of Rwanda to improve maternal and child nutrition. The package included nutrition education and counselling, promotion of agricultural productivity, promotion of financial literacy/economic resilience and provision of Water, Hygiene and Sanitation services. However, there is limited evidence about the effect of such interventions in reducing maternal undernutrition. A postintervention quasi-experimental study was conducted among pregnant women to determine the effect of the integrated intervention on their nutritional status. It was carried out in two intervention districts, namely Kicukiro and Kayonza, and two control districts, namely Gasabo and Gisagara between November 2020 and June 2021. Five hundred and fifty-two women were recruited for the intervention arm, while 545 were recruited for the control arm. Maternal undernutrition was defined as either having low mid-upper arm circumference (<23 cm) during delivery or low body mass index (<18.5 kg/m(2)) in the first trimester or both. A multivariable logistic regression model was used to assess the effect of the integrated interventions. The prevalence of maternal undernutrition was significantly lower in the intervention group compared with the control group (4.7% vs. 18.2%; p < 0.001). After controlling the potential confounders, the risk of maternal undernutrition was 77.0% lower in the intervention group than in the control group [adjusted odds ratio= 0.23; 95% confidence interval = 0.15-0.36; p < 0.001]. Further studies are therefore recommended to establish causation and inform the potential scale-up of these interventions nationally in Rwanda.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02df42e27033c27db81f29c26631adcb",
  "timestamp": "2025-05-15T03:20:55.982916"
}