{
  "id": 8731,
  "title": "Investors' perception towards investor protection measures taken by the government of India and SEBI: an ordinal approach",
  "abstract": "PurposeThis study aims to determine experimentally factors affecting the satisfaction of retail stock investors with various investor protection regulatory measures implemented by the Government of India and Securities and Exchange Board of India (SEBI). Also, an effort has been made to gauge the level of satisfaction of retail equities investors with the laws and guidelines developed by the Indian Government and SEBI for their invested funds.Design/methodology/approachTo accomplish the study's goals, a well-structured questionnaire was created with the help of a literature review, and copies of it were filled by Punjabi retail equities investors with the aid of stockbrokers, i.e. intermediaries. Amritsar, Jalandhar, Ludhiana and Mohali-area intermediaries were chosen using a random selection procedure. Xerox copies of the questionnaire were given to the intermediaries, who were then asked to collect responses from their clients. Some intermediaries requested the researcher to sit in their offices to collect responses from their clients. Only 373 questionnaires out of 1,000 questionnaires that were provided had been received back. Only 328 copies were correctly filled by the equity investors. To conduct the analysis, 328 copies, which were fully completed, were used as data. The appropriate approaches, such as descriptives, factor analysis and ordinal regression analysis, were used to study the data.FindingsWith the aid of factor analysis, four factors have been identified that influence investors' satisfaction with various investor protection regulatory measures implemented by government and SEBI regulations, including regulations addressing primary and secondary market dealings, rules for investor awareness and protection, rules to prevent company malpractices and laws for corporate governance and investor protection. The impact of these four components on investor satisfaction has been investigated using ordinal regression analysis. The pseudo-R-square statistics for the ordinal regression model demonstrated the model's capacity for the explanation. The findings suggested that a significant amount of the overall satisfaction score about the various investor protection measures implemented by the government/SEBI has been explained by the regression model.Research limitations/implicationsA study could be conducted to analyse the perspective of various stakeholders towards the disclosures made and norms followed by corporate houses. The current study may be expanded to cover the entire nation because it is only at the state level currently. It might be conceivable to examine how investments made in the retail capital market affect investors in rural areas. The influence of reforms on the functioning of stock markets could potentially be examined through another study. It could be possible to undertake a study on female investors' knowledge about retail investment trends. The effect of digital stock trading could be examined in India. The effect of technological innovations on capital markets can be studied.Practical implicationsThis research would be extremely useful to regulators in developing policies to protect retail equities investors. Investors are required to be safeguarded and protected to deal freely in the securities market, so they should be given more freedom in terms of investor protection measures. Stock exchanges should have the potential to bring about technological advancements in trading to protect investors from any kind of financial loss. Since the government has the power to create rules and regulations to strengthen investor protection. So, this research will be extremely useful to the government.Social implicationsThis work has societal ramifications. Because when adequate rules and regulations are in place to safeguard investors, they will be able to invest freely. Companies will use capital wisely and profitably. Companies should undertake tasks towards corporate social responsibility out of profits because corporate houses are part and parcel of society only.Originality/valueMany investors may lack the necessary expertise to make sound financial judgments. They might not be aware of the entire risk-reward profile of various investment options. However, they must know various investor protection measures taken by the Government of India & Securities and Exchange Board of India (SEBI) to safeguard their interests. Investors must be well-informed on the precautions to take while dealing with market intermediaries, as well as in the stock market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02df08d4105fc755944f79e1d9681e11",
  "timestamp": "2025-05-15T03:21:56.608128"
}