{
  "id": 6533,
  "title": "Chronic diseases and catastrophic health expenditures in elderly Chinese households: a cohort study",
  "abstract": "Background: Catastrophic health expenditure (CHE) is a key indicator for studying the economic burden of diseases. Previous study mainly focused on exploring the relationship between severe diseases such as cancer and multimorbidity with CHE. However, there is a lack of research exploring the differential effects of single and multiple chronic diseases on CHE. This study aims to analyse the longitudinal association between different chronic disease conditions and CHE among elderly households in China, and investigate whether this association is influenced by other demographic and socioeconomic variables. Methods: A total of 6,483 older adults obtained from four waves (2013, 2015, 2018, 2020) of the China Health and Retirement Longitudinal Study (CHARLS) were analysed (elderly household without CHE at baseline were included). CHE was defined as out-of-pocket health expenditures exceeding 40% of household non-food expenditures. Mixed-effects logistic regression models were employed to explore the longitudinal relationship between different chronic diseases conditions and CHE, and stratification analyses were conducted to explore the potential moderation effect. Result: The analysis indicates that both single chronic diseases(P < 0.001) and multimorbidity(P < 0.001) significantly increase the risk of CHE in elderly households. A stratified analysis based on population and socio-economic variables showed similar results. Besides, when the threshold for CHE was set at 40% of household non-food expenditures, the risk increase for CHE was similar for both elderly individuals with single and multiple chronic diseases. However, when the threshold was lowered to 10%, 25% of total household expenditures or 25% of household non-food expenditures, elderly individuals with multiple chronic diseases had a higher risk of CHE compared to those with a single chronic disease or without chronic disease. The influencing factors of CHE included age, education level, marital status, hukou, and place of residence. In particular, basic medical insurance did not significantly reduce the risk of CHE. Conclusion: Both single and multiple chronic diseases significantly increase the risk of catastrophic health expenditure among elderly households in China, and the existing basic medical insurance coverage has not effectively alleviated this burden. The findings highlight the urgent need for improving social health insurance programs, as well as conducting differentiated financial protection strategies for elderly individuals with different chronic disease statuses to reduce the financial vulnerability of elderly households with chronic diseases.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02eab374ca04d0b1baaa142d898d3c69",
  "timestamp": "2025-05-15T02:59:07.513417"
}