{
  "id": 3806,
  "title": "Assessing Firm ESG Performance Through Corporate Survival: The Moderating Role of Firm Size",
  "abstract": "This study explores the relationship between Corporate Survival (CS), measured through both an accounting- based model (Altman Z-Score) and a market-based model (Merton Distance to Default), and ESG performance, measured through Refinitiv ESG ratings. Based on an IQR-normalized sample of data from non-financial companies listed on the STOXX 600 European index, the study conducted a fixed-effects regression analysis on data collected from 2015 to 2023, using both an overall sample and a regional classification methodology (Northern, Central, and Southern Europe). The initial findings indicated an overall negative and significant relationship between Z-Score and ESG performance, and a positive but non-significant relationship between the latter and Merton DD. However, incorporating the natural logarithm of total assets as a firm size measure within the fixed-effect regression analysis drastically changed these relationships, resulting in an overall positive and significant effect for both models, suggesting that higher CS levels involve superior ESG performance. Moreover, the moderating effect of firm size enabled a combined approach, as both CS measures were capable of being incorporated within the same regression model. However, even if this condition applies for all European regions, the Southern one showed some peculiarities that offsets the results obtained on both Northern and Central companies. Based on these findings, we conducted a Principal Component Analysis (PCA) to explore how this effect could serve as a valuable tool for better understanding ESG performance. This approach provided evidence that both accounting-based and market-based default risk prediction models can be used together for a better understanding of the relationship between ESG performance and CS if the moderating effect of firm size is controlled for.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02efb5c26ade4679cbf1410b9b86207d",
  "timestamp": "2025-05-15T02:29:59.232128"
}