{
  "id": 5166,
  "title": "Racial/Ethnic Differences in Mortality in Late Midlife: Have They Narrowed in Recent Years?",
  "abstract": "Objectives: To examine whether racial/ethnic differences in mortality rates have changed in recent years among adults in late midlife, and if so, how. Methods: We analyze Health and Retirement Study data on non-Hispanic Whites (Whites), non-hispanic Blacks (Blacks), and English- and Spanish-speaking Hispanics (Hispanic-English and Hispanic-Spanish), aged 50-64 from 2 periods: 1998-2004 (Period 1, n = 8,920) and 2004-2010 (Period 2, n = 7,224). Using survey-generalized linear regression techniques, we model death-by-end-of-period as a function of race/ethnicity and sequentially adjust for a series of period-specific baseline risk factors including demographics, health status, health insurance, health behaviors, and social networks. Regression decomposition techniques are used to assess the contribution of these factors to observed racial/ethnic differences in mortality rates. Results: The odds ratio for death (ORD) was not statistically different for Blacks (vs. Whites) in Period 1 but was 33% higher in Period 2 (OR = 1.33; 95% confidence interval [CI] = 1.05-1.69). The adjusted ORD among Hispanic-English (vs. Whites) was not statistically different in both periods. The adjusted ORD among Hispanic-Spanish (vs. Whites) was lower (ORD = 0.36; 95% CI = 0.22-0.59) in Period 1 but indistinguishable in Period 2. In Period 1, 50.1% of the disparity in mortality rates among Blacks was explained by baseline health status, 53.1% was explained by financial factors. In Period 2, 55.8% of the disparity in mortality rates was explained by health status, 40.0% by financial factors, and 16.2% by health insurance status. Discussion: Mortality rates among Blacks and Hispanic-Spanish have risen since the mid-1990s. Hispanic-Spanish may be losing their advantageous lower risk of mortality, long known as the Hispanic Paradox.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02f1b01b10a77d23c6879c9eaf10b7c1",
  "timestamp": "2025-05-15T02:45:17.001475"
}