{
  "id": 3306,
  "title": "Does family affect financial outcomes and psychological biases? Evidence from small investors in Bangladesh",
  "abstract": "Purpose - The purpose this paper is to investigate whether family affects financial outcomes and psychological biases in an under-researched context, Bangladeshi small investors. Design/methodology/approach - To achieve the stated research objective, the survey data were collected from 223 small investors from brokerage houses in Dhaka and estimated using regression analysis. Findings - The results indicate that learning from parents, discussion with parents about financial issues and father's education have the strongest impact on financial outcomes (i.e. financial wealth holding, portfolio value, investment strategy, technical indicator, past perceived and expected portfolio performance) and psychological biases (i.e. herding, risk tolerance and better-than-average). Furthermore, spouse's education, parental income, marital status and family size explain financial outcomes and psychological biases, but to a lesser extent. Practical implications - The implications have been discussed for small investors and the family's role in resulting positive financial outcomes and avoid biases. Originality/value - This is the first study to take into account a set of family background variables influencing various financial outcomes and psychological biases in the context of Bangladesh.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "02f83a9fee1ccb8b651076a668e39673",
  "timestamp": "2025-05-15T02:24:39.752034"
}