{
  "id": 5808,
  "title": "ANAYSIS OF IMPACTS OF A SIX FACTOR MODEL CASE ON EIB STOCK PRICE IN COMMERCIAL BANKING INDUSTRY IN VIETNAM -- AND ROLES OF IT SECURITY AND RISK MANAGEMENT",
  "abstract": "During Covid 19 we need to recognize role of risk management including IT security and financial risk management. Risk can reflex in Fluctuation of stock price in commercial banks in developing countries such as Vietnam, which will reflect the business health of bank system and the whole economy. Good business management requires us to consider the impacts of multi macro factors on stock price, and it contributes to promoting business plan and economic policies for economic growth and stabilizing macroeconomic factors. By data collection method through statistics, analysis, synthesis, comparison, quantitative analysis to generate qualitative comments and discussion; using econometric method to perform regression equation and evaluate quantitative results, the article analyzed and evaluated the impacts of six (6) macroeconomic factors on stock price of a joint stock commercial bank, Eximbank (EIB) in Vietnam in the period of 2014-2019, both positive and negative sides. The results of quantitative research, in a seven factor model, show that the increase in Risk free rate has a significant effect on increasing EIB stock price with the highest impact coefficient, the second is decreasing CPI and lending rate. This research finding and recommended policy also can be used as reference in policy for commercial bank system in many developing countries. We also recommend some plans to deal with risk management and IT security in this industry.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0300abd946f7371810eb1d50ac05b029",
  "timestamp": "2025-05-15T02:51:30.132289"
}