{
  "id": 1013,
  "title": "Harnessing probabilistic neural network with triple tree seed algorithm-based smart enterprise quantitative risk management framework",
  "abstract": "Enterprise risk management (ERM) frameworks convey vital principles that help create a consistent risk management culture, irrespective of employee turnover or industry standards. Enterprise Management System (EMS) are becoming a popular research area for assuring a company's long-term success. Statistical pattern recognition, federated learning, database administration, visualization technology, and social networking are all used in this field, which includes artificial intelligence (AI), data science, and statistics. Risk assessment in EMS is critical for enterprise decision-making to be effective. Recent advancements in AI, machine learning (ML), and deep learning (DL) concepts have enabled the development of effective risk assessment models for EMS. This special issue seeks groundbreaking research articles that showcase the application of applied probability and statistics to interdisciplinary studies. This study offers Improved Metaheuristics with a Deep Learning Enabled Risk Assessment Model (IMDLRA-SES) for Smart Enterprise Systems. Using feature selection (FS) and DL models, the provided IMDLRA-SES technique estimates business risks. Preprocessing is used in the IMDLRA-SES technique to change the original financial data into a usable format. In addition, an FS technique based on oppositional lion swarm optimization (OLSO) is utilized to find the best subset of features. In addition, the presence or absence of financial hazards in firms is classified using the triple tree seed algorithm (TTSA) with a probabilistic neural network (PNN) model. The TTSA is used as a hyperparameter optimizer to improve the efficiency of the PNN-based categorization. An extensive set of experimental evaluations is performed on German and Australian credit datasets to illustrate the IMDLRA-SES model's improved performance. The performance validation of the IMDLRA-SES model portrayed a superior accuracy value of 95.70% and 96.09% over existing techniques.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0303eb3379de0d533173290650511fc6",
  "timestamp": "2025-05-15T01:58:08.422688"
}