{
  "id": 6676,
  "title": "Are Family Firms Financially Healthier Than Non-Family Firm?",
  "abstract": "This study examines the whether or not family firms are financially healthier than non-family in terms of capital structure and leverage. It therefore takes into consideration the existence of any significant differences between the leverage and risk choices of family and non-family firms. Using a panel data set of 888 firms and 7104 firm-year observations of unlisted small and medium size firms over the period 2007-2014, we present that family owned businesses have lower financial structure than those of non-family owned businesses. This indicates that most family firms use less debt financing than non-family firms, and as such maintain a lower level of debt. Secondly, family firms demonstrate lower risk as illustrated by the Altman Z-score. The Altman Z-score scale illustrates a contrary relationship of significance with respect to family firms and their counterparts in terms of the operation aspect of the business's risk factors. Family firms managed their business operations with lower risk and are generally healthier financially than their counterpart firms. Lastly, findings from the robust tests for the hypotheses using a sample of bankrupt firms in Iberian Balance sheet Analysis System (SABI) reveal that the proportion of failure of family firms as opposed to their counterpart firms is relatively low. Analyzing the bankruptcy files of firms from 2002 to 2014 shows a considerably low ratio of family firms at the 5% significant level. This affirms that the low risk illustrated in the Altman Z-score regression is consistent to the lower ratio of family firms that were declared bankrupted over the study period, which makes Spain an important case in this study.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "031a6e27a52730b6df54df2bdb9222a1",
  "timestamp": "2025-05-15T03:00:35.357930"
}