{
  "id": 4268,
  "title": "Performance of commercial and residential real estate investments in Ibadan property market, Nigeria",
  "abstract": "Purpose This study examined the performance of commercial and residential real estate investments in the Ibadan property market to provide information for investment decisions. Design/methodology/approach The study used a mixed research design (qualitative and quantitative). Data were obtained employing in-depth interviews with randomly selected sixteen estate surveyors and valuers practising in the Ibadan property market. Data for the study were analysed using the phenomenological thematic content analysis. Similarly, data on rental and capital values were translated to income, capital and holding period returns. The Kwiatkowski-Phillips-Schmidt-Shin (KPSS) and Philip-Perron (PP) models were used for unit root analysis. Ordinary least square (OLS) regression model was used to test for inflation-hedging characteristics, and the Granger causality tests were carried out to analyse the causal relationship between the variables. Findings The study revealed that the Ibadan property market is still immature. For the return components, the study found that the Ibadan property market provided mean holding period returns of 10.82%, 14.31 and 8.29% for office, shop and residential property types, respectively. The study also revealed that the selected property types are perverse hedges against inflation. Similarly, the study showed a unidirectional causal relationship between inflation and returns on the selected property types. Practical implications Results of this study revealed the peculiar nature of the Ibadan property market; findings from the survey can be used as a guide for investment decisions by foreign and domestic investors. Shrewd investors can take advantage of the high returns provided by the real estate assets in the Ibadan property market (by investing in the property market) to obtain high returns and expand their investment portfolio. Originality/value This study is the first to examine, in an eclectic and comparative context, the performance of commercial and residential properties in the Ibadan property market from the perspective of its market maturity level, returns profile, as well as its inflation-hedging characteristics. Findings from the study will equip both individual and institutional investors with valuable information for investment decisions.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "031c1f6c4ffe1d91ac8850b7094d6a48",
  "timestamp": "2025-05-15T01:25:23.303715"
}