{
  "id": 6009,
  "title": "Shedding light on the impact of financial literacy for corporate social responsibility during the COVID-19 crisis: managerial and financial perspectives",
  "abstract": "Purpose The aim of this paper is to help management scholars and executives learn from the COVID-19 global crisis by analyzing if and how the level of financial literacy affected stakeholders' sensitivity to corporate social responsibility (CSR) issues during the pandemic, as well as identifying whether financial literacy is an important variable to account for in the postpandemic period. The authors test the relationship between objective (measurable) and subjective (self-assessed) financial literacy, as well as financial happiness (i.e. satisfaction with one's current financial situation) with CSR during the pandemic. High levels of financial literacy cause individuals to reward companies that implement CSR strategies and processes. Design/methodology/approach The authors designed an online survey and obtained data on objective and subjective financial literacy, financial happiness and COVID-19 infections, as well as on the demographic and socioeconomic characteristics of a representative sample of 1,334 Italian respondents. From a methodological point of view, the authors perform a factor analysis on the CSR-related questions to extract the principal components (PCs) that were used as dependent variables in the regression models to analyze the effects of explanatory variables (financial literacy, financial happiness and COVID-19 infections) and consider the control variables (demographic and socioeconomic characteristics). The authors follow a theoretical approach merging stakeholder theory with CSR. Findings Respondents with a high level of financial literacy and financial happiness are highly sensitive to all CSR components (ethical, philanthropic, economic and legal social responsibilities). Being infected by COVID-19 increased participants' sensitivity to ethical and philanthropic social responsibility (SR), but not to economic and legal SR. The more educated and employed respondents were, the more sensitive they were to CSR, especially compared to their less educated and unemployed counterparts. Research limitations/implications While the sample used is large and representative of the Italian population, Italy is an interesting and useful case to analyze, given that it was the first Western country to be severely hit by COVID-19; since the paper only refers to a specific country scenario, the results cannot be generalized to other countries. A cross-country comparison relating financial literacy and financial happiness to CSR during the COVID-19 pandemic period would be desirable. The research study has theoretical implications for management scholars since the authors show that, during the pandemic period, financial education and financial happiness are relevant in explaining stakeholders' greater sensitivity to CSR issues. The findings may thus help scholars to learn from the COVID-19 period, with the aim of further developing and enhancing stakeholders' theory. Practical implications The research also has practical implications, both for corporate executives and for policymakers, helping them to learn from the COVID-19 global crisis concerning the role of financial literacy and financial happiness on CSR sensitivity and, consequently, how they may consider these important variables in the postpandemic era. On the one hand, executives may improve stakeholders' segmentation and eventually modify CSR policies, considering the higher sensitivity of their stakeholders' due to a higher degree of financial literacy. On the other hand, the findings suggest that policymakers should have a stronger role in supporting employment and education in general and in promoting programs to improve financial literacy to increase stakeholders' sensitivity to CSR, thus further stimulating the inclusion of CSR factors in companies' strategies. Increasing stakeholders' sensitivity to CSR will, in turn, increase the propensity of companies to include SR in their strategies. Thus, increasing financial literacy will have tangible positive effects of increasing CSR. Given the greater role played by companies during the COVID-19 period with respect to societal risk, the findings seem particularly useful. Originality/value To the best of the authors' knowledge, this study represents the first that links financial literacy and financial happiness with CSR during the COVID-19 crisis. The large and representative dataset, as well as the use of specific variables related to financial literacy, financial happiness and COVID-19 infections in the CSR assessment model, makes our analysis original, robust and significant by contributing to the CSR literature and to the financial literacy literature from a methodological point of view, as well as by informing corporate executives and policymakers about the role of financial literacy with regard to CSR during the pandemic, which may help them in learning how to improve their decisions and actions in the postpandemic era.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "033dcfc44d6357e8757de8f02ad0d299",
  "timestamp": "2025-05-15T02:53:33.507691"
}