{
  "id": 3439,
  "title": "A NON-PARAMETRIC METHOD FOR INCURRED BUT NOT REPORTED CLAIM RESERVE ESTIMATION",
  "abstract": "The number and cost of claims that will arise from each policy of an insurance company's portfolio are unknown. In fact, there is a high degree of uncertainty on how much will ultimately be the cost of claims, not only during the period of inception but also after the contract termination, since there might be future, not yet reported, losses associated with past claims. Therefore, in practice, insurance companies have to protect themselves against the possibility of this ultimate cost by creating an additional reserve known as the incurred but not reported (IBNR) reserve. This work introduces new non-parametric models to IBNR estimation based on kernel methods; namely, support vector regression and Gaussian process regression. These are used to learn certain types of nonlinear structures present in claims data using the residuals produced by a benchmark IBNR estimation model, Mack's chain ladder. The proposed models are then compared to Mack's model using real data examples. Our results show that the three new proposed models are competitive when compared to Mack's benchmark model: they may produce the closest predictions of IBNR and also more accurate estimates, given that the variance for the reserve estimation, obtained through the bootstrap technique, is usually smaller than the one given by Mack's model.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "034964be026140de8f2f9155552ce789",
  "timestamp": "2025-05-15T01:16:55.630803"
}