{
  "id": 2774,
  "title": "Evaluating the impact of ESG on financial risk: the moderating effects of operational ability and profitability in Indonesian infrastructure firms",
  "abstract": "PurposeThis study aims to examine the impact of environmental, social, and governance (ESG) practices on financial risk, with operational ability and profitability as moderating variables, within the infrastructure sector in Indonesia.Design/methodology/approachThe sample consists of 14 infrastructure companies listed on the Indonesia Stock Exchange over the period of 2020-2022, resulting in a total of 42 firm-year observations. The study employs a random-effects model for panel data regression analysis to test the hypotheses. ESG serves as the independent variable, financial risk as the dependent variable, and operational ability (measured by total asset turnover) and profitability (measured by return on assets) as moderating variables.FindingsThe results reveal that ESG practices have a significant positive impact on financial risk. Furthermore, operational ability negatively moderates the relationship between ESG and financial risk, while profitability positively moderates this relationship. These findings suggest that although higher ESG scores may elevate financial risk due to associated costs and uncertainties, firms with greater operational efficiency and profitability are better equipped to mitigate and manage these risks more effectively.Research limitations/implicationsThis study focuses on infrastructure companies in Indonesia, which may limit the generalizability of the findings to other sectors or geographic regions. Future research could broaden the scope by incorporating diverse industries and cross-country contexts to enhance the robustness and applicability of the results.Practical implicationsThe findings offer valuable insights for policymakers and corporate managers. Policymakers can develop frameworks to encourage sustainable practices without imposing excessive financial burdens on companies. Managers can leverage operational efficiency and profitability to integrate ESG practices effectively, thereby balancing sustainability goals with financial performance.Originality/valueThis study contributes to the scarce literature on the moderating effects of operational ability and profitability on the relationship between ESG practices and financial risk, particularly in the context of the infrastructure sector in Indonesia.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "036962574b0da35649502a4b46000ee1",
  "timestamp": "2025-05-15T02:19:08.403708"
}