{
  "id": 3007,
  "title": "Development of a Nomogram for Predicting Financial Toxicity Risk Among Lung Cancer Patients: A Cross-Sectional Study",
  "abstract": "With the progress and development of medicine, the emergence of new treatment methods brings hope to patients with lung cancer. However, it is accompanied by high treatment costs. At present, the research on the financial toxicity of lung cancer by medical staff needs to be improved. The study was to describe and analyze the status and risk factors of financial toxicity in lung cancer patients. This was a cross-sectional study. The study recruited 218 lung cancer patients from the 2 hospitals in Qingdao and Tianjin. Lasso regression and random forest were combined to identify significant factors of financial toxicity. A nomogram was used to visualize the model. The discrimination, calibration, and clinical applicability of the nomogram were evaluated by the receiver operating characteristic curves, area under the curve, and decision curve analysis. Educational level, residence, family monthly income, out-of-pocket expenses, chemotherapy history, and radiotherapy history were found to be significant factors of financial toxicity. The area under the curve of the training set was 0.930, while that of the test set was 0.939. The risk prediction model of financial toxicity has high predictive discrimination, calibration, and clinical practicality, which is helpful for medical staff to screen for early financial toxicity risk in lung cancer patients. The financial toxicity of lung cancer patients is common and affected by many factors. Medical staff can formulate personalized intervention measures according to the patient's own situation and assessment results.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03734317a7018aec7dd94b092cfa9108",
  "timestamp": "2025-05-15T02:21:19.307851"
}