{
  "id": 7238,
  "title": "DETERMINANTS OF BANK PROFITABILITY IN VIETNAM: A FOCUS ON FINANCIAL AND COVID-19 CRISES",
  "abstract": "This research examines the determinants of banks' profit by employing the GLS, GMM and SEM regression method for 574 observations obtaining from 35 banks functioning in Vietnam between 2005 and 2022. Our evidence indicates that non-performing loans, deposit, loan, capital, operating cost, provisions, bank size, Covid-19 pandemic, inflation, economic growth, deposit rate, credit risk, exchange rate and ownership are key factors affecting bank profitability. Our findings show that the global crises are negatively associated with ROA and NIM while they are negatively related to ROE. The COVID-19 has a stronger effect than the financial crisis. Both crises play a moderating role in bank profitability. This research expands the existing literature by analyzing the impact of crises and the moderating effects, crisis comparison, and ownership effect which have not been done so far, to our best knowledge. This research also extends the literature by offering additional understandings about the determinants of bank profitability in emerging economies. Different from the previous studies, our dataset including foreign banks helps us analyze all banks. The investigation of factors affecting profitability also assists banks in regulating and supporting prudential supervisions carefully.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "037c05eb807af4840e17391756f4022c",
  "timestamp": "2025-05-15T03:06:35.392826"
}