{
  "id": 6345,
  "title": "Latent Class Analysis of Multiple Health Risk Behaviors among Australian University Students and Associations with Psychological Distress",
  "abstract": "University students have high rates of health risk behaviors and psychological distress. This study explores patterns of health behaviors among a sample of Australian university students, and determines whether patterns of health behaviors are associated with psychological distress and demographic characteristics. Cross-sectional data from the University of Newcastle Student Healthy Lifestyle Survey 2019 were analyzed. Fruit and vegetable intake, sugar-sweetened beverage intake, physical activity, sitting time, smoking, alcohol intake, drug use, sleep and psychological distress were assessed. Latent class analysis (LCA) was used to identify patterns of health risk behaviors, and latent class regression to explore associations between psychological distress and demographic characteristics with health behavior classes. Analysis included 1965 students (mean age 25.8 +/- 8.6 years, 70.7% female). Three patterns of health behaviors were identified: healthier (48.6%), moderate (40.2%) and unhealthy (11.2%) lifestyle classes. Students in the moderate and unhealthy lifestyle classes had higher odds of moderate (OR 1.43 and 2.37) and high/very high psychological distress risk (OR 2.71 and 11.69). Students in the unhealthy and moderate lifestyle classes had a higher odds of being male, younger, enrolled in transition to university and English language courses, Aboriginal or Torres Strait Islander descent and to report some financial difficulty. Study findings may be used to inform the design of mental health interventions for university students that target key health risk behaviors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0381a75c4262ea692fc56de4bcb6d128",
  "timestamp": "2025-05-15T02:57:07.724424"
}