{
  "id": 840,
  "title": "Can public opinions improve the effect of financial early warning ? -- an empirical study on the new energy industry",
  "abstract": "Public opinion will significantly affect investor decision -making and stock prices, which ultimately has an impact on the long-term development of the new energy industry. This paper mainly aims to delve in the impact of public opinion on the efficacy of financial risk early warning effect and try to establish an enhanced financial risk early warning model for the new energy list companies. To achieve this, we collect the financial data and public evaluation texts of 185 new energy listed companies, converting the text into emotional indicators which are combined with financial indicators to build a financial risk early warning model for new energy listed companies. The contributions of this paper are as follows: (1) The experiment validation demonstrates that the combination of 7 deep learning models and Bagging algorithm highly improves the accuracy of the sentiment analysis model, achieving an accuracy of 84.09%. (2) The accuracy of financial early warning models is generally enhanced after adding sentiment indicators, among which the accuracy of the BP neural network model reached 95.78%. (3) Through clustering analysis, the evaluation models can productively divide the warning intervals, thereby bolstering the interpretability and applicability of early warning results. Therefore, we suggest that when establishing the financial early warning system, it ' s necessary to take public opinions into consideration. Aside from improving the early warning effect, it also can be used as a separate indicator for daily monitoring.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03a35b36f1a8781595d2f6071f11dd8e",
  "timestamp": "2025-05-15T01:55:41.604138"
}