{
  "id": 7554,
  "title": "Effects of nursing home ownership type and resident payer source on hospitalization for suspected pneumonia",
  "abstract": "Background: Whether to hospitalize residents with suspected pneumonia is a complex decision determined both by clinical and financial considerations. The decision to hospitalize may be different in for-profit and not-for-profit facilities and for different payment sources. Objective: The objective of this study was to examine the role of proprietary status in the decision to hospitalize residents with suspected pneumonia, controlling for facility- and resident-level factors. Data and Methods: The analysis uses the 1996 Medical Expenditure Panel Survey Nursing Home Component, a nationally representative sample of 5899 nursing home residents in 815 facilities. During the year, 766 elderly residents in the sample were suspected of having pneumonia infections and 224 were hospitalized for them. Logistic regression is used to assess factors affecting the decision to hospitalize among the 766 with pneumonia infections. Main Outcome Measure: Hospitalization for suspected pneumonia. Results: Residents with suspected pneumonia in not-for-profit facilities are hospitalized at a rate half that of for-profit facilities. The difference is most pronounced for residents who are older and more cognitively impaired and those who are covered by Medicare or private funds. Medicaid residents are most likely overall to be hospitalized, with higher rates in not-for-profit than for-profit facilities. Conclusion: Risk of hospitalization for suspected pneumonia varies widely by ownership type and resident payer source, with lowest overall risk in not-for-profit facilities. Higher Medicaid hospitalization in not-for-profit facilities is consistent with heterogeneity in the not-for-profit sector, where Medicaid residents are sorted into the lower-quality facilities.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03ad0c1c6dedeab04a6eda684e71b5d5",
  "timestamp": "2025-05-15T03:09:36.975205"
}