{
  "id": 3133,
  "title": "Financial difficulties in childhood and adult depression in Europe",
  "abstract": "Background: Financial difficulties in childhood may be associated with immediate and long-term consequences for mental health. The aim of the current paper is to investigate the association between childhood financial difficulties and adult depression, and assess the relative contribution of financial difficulties in childhood to symptoms of adult depression across different age groups. Methods: Using three age cohorts (25-40, 41-59, 60-75) from 19 countries in the European Social Survey Round 7 (N=18 401), multi-level and country-wise OLS regression analyses were used to investigate the association between financial difficulties in childhood and adult depression, while adjusting for age, education, gender, highest education in family, level of family conflict, number of social meetings and marital status. Results: Financial difficulties in childhood was found to be influential predictors of depression scores for 25-40 year olds in 10 out of 19 countries in fully adjusted models. In older participants, depression scores were mostly influenced by frequency of social meetings and marital status. There was great variation in the pattern of influential risk factors across countries, and the predicted effect childhood financial difficulties had on adult depression scores. Conclusion: Childhood financial difficulties as predictors of depression appear to, by themselves, exert the strongest influence in younger adults. There was, however, large variation between countries in the magnitude of associated risk, and in the pattern of risk factors contributing to adult depression, which underscores the need to account for country-level factors when aiming to gain knowledge about mental health.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03b1d3eb3bd017d9a96f1ad18a9641b0",
  "timestamp": "2025-05-15T02:22:56.716652"
}