{
  "id": 1793,
  "title": "An Effective Investments System in the Optimal Portfolio Selection Intelligence (OPSI)",
  "abstract": "The optimal portfolio selection problem is investigated in fundamentals of higher order moments. The returns behavior frequently skewed and in excess kurtosis, along with investors' preferences set new grounds of discussion. Higher order moments, than the kurtosis, will offer further information on investors. A more complex problem arises, of higher flexibility, non-convexity, in unlimited scale fitted to portfolio optimization. The principal problem of Free Will is thus answered, with emphasis on investors. We discuss the OPSI model introducing three hybrid neuro-genetic models of numerous topologies and one regression. Firstly the Radial Basis Function Networks-RBF are in 40 hybrid forms and 10 RBF Neural Nets whilst the results are compared to 50 Time-Lag Recurrent Network-TLRN Hybrids topologies, 10 on the MultiLayer Perceptron-MLP Neural Nets, and the Bayesian Logistic Regression-BLR, to define the most competitive methods in asset allocation and corporate evaluation. New solutions are offered under specific hybrids whilst portfolio efficiency is either evolutionary or intelligent. Introducing the parameters of financial health, we propose the advanced expected utility function filtering noise. The problem of wealth maximisation is transformed to a preferential combination on gain and loss. The TLRN hybrid networks are a very efficient and reliable model on portfolio selection. The OPSI model offers a competitive approach in efficient portfolio selection, protecting the investor from systematic exposure. In the investors Free Will problem, the answer is that Logic is dynamic linearly but adjusting to the environment overrides new challenges of superior potentials than the linear series of events. It is consistent to the maximisation of utility and investors' welfare.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03b31e5769aaadd57d0c0c2a9071fb1b",
  "timestamp": "2025-05-15T00:59:53.128309"
}