{
  "id": 5606,
  "title": "Governance failure and its impact on financial distress",
  "abstract": "Purpose The purpose of this paper is to examine the effects of corporate governance failure, excess remuneration and entrenchment of managers, company variables and corporate governance variables on the company's financial distress risk (DETR) in the French context. Design/methodology/approach Using the regression analysis, this paper is based on 201 observations about 67 companies of SBF 120 from 2015 to 2017. Data are collected on the Thomson Reuters database and in the referenced documents, which are published on the internet. Findings The research findings reveal that firm's DETR is influenced negatively by excess remuneration and entrenchment of managers. In addition, there is a positive and significant relationship between DETR and company variables (performance and ownership structure) and corporate governance variables (power structure). However, a company's size and board of directors' independence do not affect firms' DETR. Practical implications The impact highlighted between remuneration and entrenchment of managers and the financial distress of the company is explained by the intention of managers to work for announcing good short-term performance indicators that are most favorable to them. Originality/value The shareholder/manager agency problem can be changed when business performance tends to decline. Certainly, the managerial latitude adopted by the managers is used as an external careerism strategy. Its positive impact on the reduction of the firm's financial distress can benefit shareholders who aim to sell their securities in the short term.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03b994ea246c994460523924f1b72c08",
  "timestamp": "2025-05-15T02:49:21.763469"
}