{
  "id": 1644,
  "title": "Mean-Var Investment Portfolio Optimization Under Capital Asset Pricing Model (CAPM) with Nerlove Transformation: An Empirical Study Using Time Series Approach",
  "abstract": "This paper discusses the problems of Mean-VaR investment portfolio optimization under the Capital Asset Pricing Model with Nerlove transformation by using a time series approach. It assumed that the market return follows the pattern of the time series, whereas stocks return analyzed following the pattern of capital asset pricing models with Nerlove transformation. So that the mean of the market return can be estimated by using the model of Autoregressive Moving Average (ARMA), while volatility can be estimated using a model of Generalized Autoregressive Conditional Heteroscedasticity (GARCH). As a risk-free asset here used the interest rate of Indonesia Bank (BI rate), together with the market return is used to estimate the CAPM regression equation for each stock analyzed. Based on the estimator of the CAPM regression equation is used to estimate the mean and variance of the return value of each stock. Estimator mean and the variance value of each stock, as well as the estimator value of the covariance between the stocks, will be used for investment portfolio optimization process. Investment portfolio optimization process is based on a model of Mean-VaR by risk tolerance factor. The goal is to determine the weight composition of the optimum of the investment portfolio. Based on the optimization process was obtained the composition weight of investment portfolio optimum. This composition weight can be taken into consideration in decision making for investors to invest in particular on the assets that were analyzed here.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03c9af1f326d2e5724888633ca11faf7",
  "timestamp": "2025-05-15T00:58:18.210334"
}