{
  "id": 7071,
  "title": "Estimates of multidimensional poverty and its determinants among older people in rural China: evidence from a multicenter cross-sectional survey",
  "abstract": "Background In 2020, China declared that the absolute poverty in the country had been eradicated, but older people in rural areas are deprived in multiple domains. Poverty is multidimensional and involves deprivations in health, social welfare, living standards, and income. This study focused on assessing the poverty status of rural older persons and providing a basis for decision-making at all levels of government in China. Methods A multicenter cross-sectional survey was conducted in four rural areas of China. Individuals aged 60 years and older were selected through stratified sampling. People with aphasia and severe cognitive impairment were excluded. An electronic questionnaire was used to collect older people's information, including basic demographics, major illnesses, disabilities, chronic diseases, functional disorders, and ability to perform activities of daily living. It also asked about the medical, financial, and social security assistance that respondents received, food and clothing standards, safe housing, clean energy, safe drinking water, and reliable electricity. Specific questions were asked regarding income sufficiency, financial support from children, and pension income. Multidimensional poverty measurements were used to compare regional disparities and indicators differences. Logistic regression was used to identify the risk factors influencing poverty. Results A total of 1272 older people were analyzed. Of them, 704 (55.35%) were women and 652 (51.26%) were aged between 60 and 69 years. The most frequently mentioned causes of poverty were illness, a lack of employment, inadequate technology, and poor transportation. We found that as multidimensional poverty indicators increased (from 6 to 10), the number of poor older people decreased (from 1218 to 437), as did the poverty incidence (from 95.75 to 34.36%) and multifaceted poverty index (from 53.41 to 25.06%). Xuanwei had the highest incidence of poverty (66.61%) and multidimensional poverty index (0.66) among the four provinces studied. Regarding the contribution of indicators, financial alleviation made the greatest contribution to multidimensional poverty among rural older adults (up to 70.51%). Age, marital status, education level, awareness of poverty alleviation policies, and region were significant predictors of multidimensional poverty among older rural residents(P < 0.05). Conclusions China's subsidy system and financial support must be enhanced. Particular attention should be given to the re-education of rural older individuals, basic vocational education should be strengthened in rural areas, and social participation should be encouraged.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03c9088e92108ff6380145234ecd7f07",
  "timestamp": "2025-05-15T03:05:03.374117"
}