{
  "id": 1436,
  "title": "APPLICATION OF ECONOMIC AND MATHEMATICAL MODELLING TO DETECT AND PREVENT FRAUD IN FINANCIAL STATEMENTS",
  "abstract": "This article addresses the significant challenges posed by financial statement fraud, which threatens both individual organizations and the global financial markets. It critically examines the inadequacies of traditional fraud detection methods in confronting increasingly sophisticated fraud schemes. The study focuses on the innovative use of Markov models to understand and predict the evolving nature of financial fraud risk. The research introduces an advanced technique for adjusting the temporal evolution of Markov model transition probabilities, incorporating external factors like economic trends and regulatory changes. This recalibration employs a conditional probability function, enabling the model to remain responsive to the vicissitudes of the financial milieu. This approach allows the model to adapt to the changing financial environment. Key findings demonstrate the model's ability to evolve, reflecting the dynamic nature of financial fraud risk. A salient feature of this model is its attainment of a steady-state distribution, allowing for the ascertainment of enduring risk levels associated with financial fraud. This attribute gains prominence in environments characterized by diverse fraud detection capabilities The model achieves a steady-state distribution, indicating long-term financial fraud risk levels across various scenarios. The paper concludes that Markov models are vital in modern financial risk management, with practical applications in areas such as credit scoring and insurance claims. It highlights the regulatory significance of these models in assessing the impact of financial regulations. Furthermore, the integration of data analytics and machine learning is explored, enhancing the models' capability against complex cyber fraud. The adaptability and predictive accuracy of these models are crucial in dynamic financial environments, necessitating continuous refinement and integration with emerging technologies and theories.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03cab9654ad06aaf70deebde68ade6db",
  "timestamp": "2025-05-15T02:03:00.682976"
}