{
  "id": 5949,
  "title": "Hamstrings injuries in football",
  "abstract": "Background: Hamstrings injuries are a major concern in football (soccer), affecting both recreational players and professional athletes. Although being a recognized issue within the football community, its incidence has been increasing over the last years and still poses a challenge to all practitioners involved.Study objectives and rationale: The goal of this narrative review is to outline hamstrings injuries epidemiology and mechanisms of injury, identify and discuss its risk factors, provide an approach to a proper early diagnosis, evaluate the efficacy of current treatment options and return to sports, and present the best strategies for hamstrings injury prevention. These guidelines will help the sports medicine staff team on how to better manage their players with or at risk of hamstrings injuries.Conclusion: Despite several breakthroughs in research of hamstrings injuries, there is still heterogeneity across studies and lack of consensus in regards to classification, diagnosis, treatment and prevention. Hamstrings in-juries compromise the athlete's performance with time loss due to injury, shortens their highest-level career longevity with higher risk of reinjury rates, and is a defying problem for clubs to balance financial losses due to having their players off the pitch. Further research is warranted to keep moving forward with evidence on treating and preventing hamstrings injuries to mitigate its high incidence and keep the players safe.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03da9daac1410267095f5a83592323da",
  "timestamp": "2025-05-15T02:53:03.142383"
}