{
  "id": 7692,
  "title": "Occupation and mental health in a national UK survey",
  "abstract": "To measure the prevalence of common mental disorder (CMD) by occupation in a representative sample of Great Britain and to identify occupations with increased and decreased risk of CMD. A cross-sectional interview-based survey was carried out including 5,497 working male and female respondents, 16-64 years from a stratified random survey of private households in Britain. Occupations were classified by the Standard Occupational Classification (SOC) into four groups: major, sub-major, minor and constituent unit groups. Common Mental Disorder was measured by the Revised Clinical Interview Schedule. Major SOC groups with higher prevalence of common mental disorder included clerical and secretarial, sales, and personal and protective services whereas craft and related, 'other' professional occupations and plant and machine operatives had lower prevalence compared to 13% overall prevalence in all adults. In sub-major SOC groups managers and administrators, teaching professionals, clerical and secretarial, 'other' sales and personal service occupations had higher prevalence whereas many professional and skilled occupations had lower prevalence. Specific SOC unit groups with higher prevalence included primary and secondary teachers, welfare community, youth workers, security staff, waiters, bar staff, nurse auxiliaries and care assistants. General managers in government and large organizations (OR = 2.79, 95% CI 1.41-5.54), managers in transport and storing (OR = 2.44, 95% CI 1.18-5.03), buyers and mobile sales persons (OR = 2.48, 95% CI 1.09-5.60), sales occupations (NES) (OR = 2.78, 95% CI 1.25-6.19) and clerks (NES) (OR = 2.71, 95% CI 1.59-4.61) had increased risk of common mental disorder relative to specialist managers adjusting for social and financial factors and physical ill-health. Occupations with higher risk of common mental disorder may be typified by high levels of job demands, especially emotional demands and lack of job security. The reasons why occupations have low rates of common mental disorder are varied and may include high levels of job discretion, good job training and clearly defined job tasks.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03e3a867329f6789cad92c2eca737041",
  "timestamp": "2025-05-15T03:11:04.577348"
}