{
  "id": 697,
  "title": "Impact of care management processes and integration of care on blood pressure control in diabetes",
  "abstract": "Background: Fragmentation within health care systems may negatively impact the quality of chronic disease patient care. We sought to evaluate the relationship between care management processes (CMP), integration of services, and blood pressure (BP) control among diabetic patients. Methods: Retrospective chart reviews were performed for a random sample of adult diabetic hypertensive patients (n = 2,162) from 28 physician organizations in the United States (US). A modified version of the Physician Practice Connection Readiness Survey (PPC-RS) was completed by the chief medical officer at each site. The PPC-RS measured health system organization, delivery system redesign, decision support, clinical information systems, and self-management support, and an integration scale measured structure, functions, and financial risk. Correlations between PPC and integration scores and BP outcomes were assessed using Spearman correlation coefficients. Results: Approximately 39.9% of diabetic patients had controlled BP. Mean total PPC score across sites was 55, with highest mean scores for health system organization (81), followed by design support (60), clinical information systems (57), self-management support (39), and delivery system redesign (39). Mean integration score was 46 (SD 27, range 4-93), and means of subscores were 64 for structure, 33 for financial risk, and 42 for function. Clinical information systems subscore was correlated with uncontrolled BP (r = -0.38, p < 0.05), while association with total PPC score was strong but not significant at p < 0.05 (r = -0.32). Total integration score and the structure subscore were significantly correlated with BP control (r = 0.38, p < 0.05, and r = 0.49, p < 0.01). Conclusions: This study suggests that CMP and service integration may be associated with better outcomes in diabetes, though results were mixed and limited by a small number of participating sites. Primary care implementation of integrated electronic medical records may have a beneficial effect on patient outcomes for diabetes and other chronic diseases.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03e63bc0ea3d1873c1f6b78b0b054d04",
  "timestamp": "2025-05-15T01:41:29.846992"
}