{
  "id": 7541,
  "title": "Predictors of receiving therapy among very low birth weight 2-year olds eligible for Part C early intervention in Wisconsin",
  "abstract": "Background: The Individuals with Disabilities Education Act (Part C) authorizes states to establish systems to provide early intervention services (e. g., therapy) for children at risk, with the incentive of federal financial support. This study examines family and neighborhood characteristics associated with currently utilizing physical, occupational, or speech therapy among very low birthweight (VLBW) 2-year-old children who meet Wisconsin eligibility requirements for early intervention services (EI) due to developmental delay. Methods: This cross-sectional analysis used data from the Newborn Lung Project, a regional cohort study of VLBW infants hospitalized in Wisconsin's newborn intensive care units during 2003-2004. We included the 176 children who were age two at follow-up, and met Wisconsin state eligibility requirements for EI based on developmental delay. Exact logistic regression was used to describe child and neighborhood socio-demographic correlates of parent-reported receipt of therapy. Results: Among VLBW children with developmental delay, currently utilizing therapy was higher among children with Medicaid (aOR = 5.3, 95% CI: 1.3, 28.3) and concomitant developmental disability (aOR = 5.2, 95% CI: 2.1, 13.3) and lower for those living in a socially more disadvantaged neighborhood (aOR = 0.48, 95% CI: 0.21, 0.98, per tertile). Conclusions: Among a sample of VLBW 2-year olds with developmental delays who are EI-eligible in WI, 4 out of 5 were currently receiving therapy, per parent report. Participation in Medicaid positively influences therapy utilization. Children with developmental difficulties who live in socially disadvantaged neighborhoods are at highest risk for not receiving therapy.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03e7f690e9ad4734efc2572cc3b5169e",
  "timestamp": "2025-05-15T03:09:36.920642"
}