{
  "id": 7137,
  "title": "Neighborhoods, Individuals, and Instrumental Crime in Russia and Ukraine: A Multilevel Test of Merton's Anomie Theory",
  "abstract": "ObjectivesEmpirically assess Baumer's (Theor Criminol 11(1):63-93, 2007) efforts to unify Merton's anomie/strain theory within a multilevel framework that anticipates instrumental crime among individuals who are both strongly committed to monetary success goals and weakly committed to the normative means for pursuing these goals, particularly if they possess certain other personal attributes or are embedded within anomic socio-cultural contexts.MethodsMultilevel overdispersed Poisson regression models are estimated using survey data from 1431 adult residents of 41 neighborhoods in Lviv, Ukraine, and Nizhni Novgorod, Russia.ResultsConsistent with expectations, financial dissatisfaction among individuals appears to exacerbate the effect of the goals-means interaction on instrumental crime. However, no evidence was observed of moderation involving perceived risk of punishment, commitment to non-monetary success goals, and blocked legitimate opportunities. Although neighborhood anomie exerted a statistically significant main effect on instrumental crime, theorized cross-level interactions involving strong cultural emphasis on monetary success goals, weak cultural emphasis on normative means, and limited consensus regarding the normative means by which to pursue monetary success goals did not materialize.ConclusionsFindings cast doubt on the cross-cultural generality of Baumer's multilevel conceptualization of Merton's strain/anomie theory. However, they confirm financial dissatisfaction as a key predictor of instrumental crime and moderator of unbalanced value commitments among individuals. They also suggest that future efforts to bridge the micro and macro strands of Merton's theory will need to incorporate alternate theoretical predictors (e.g., personal morality) and consider ways in which an anomic social order contributes to deviant behavior directly rather than merely indirectly through the proportion of the population experiencing a goals-means disjuncture.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03ee28c46ffb7f5ab6deb851a38940a8",
  "timestamp": "2025-05-15T03:05:32.055808"
}