{
  "id": 454,
  "title": "Data Intelligence in Public Transportation: Sustainable and Equitable Solutions to Urban Modals in Strategic Digital City Subproject",
  "abstract": "Transport infrastructure investments must be linked to the public transport demand strategically. User behavior and decision-making process bring several possible alternative transportation options due to a series of factors that define it. Municipalities must manage these factors to promote equal and sustainable transport solutions through urban infrastructure, public transport competitiveness, and attractiveness, and fossil fuels use and pricing policy. The research objective is to determine these factors to monitor and use them for citizens' benefit by means of analytical tools and methods to gain a superior knowledge of reality with a focus on improving investments and services in an agile and efficient manner. Methodologically, the number of passengers of main Curitiba's (Brazil) bus rapid transit (BRT) lines is operated in two linear regression models combined with the number of private vehicles, public transport fare, and fuel price for the period between January/2010 and December/2019. Research analysis indicates direct causal relationships between the studied factors and that the necessary data for decision-making is available in the government information systems. In conclusion, urban management and strategic digital city project can be more balanced and assertive in transport infrastructure investments and citizen services provision.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03fd1932d3db93170dd93bc58a95dd42",
  "timestamp": "2025-05-15T01:32:30.130222"
}