{
  "id": 8122,
  "title": "Comparison of two diagnostic protocols in the management of possible cardiac chest pain: One follow-up study in Iran",
  "abstract": "Background: Chest pain indicating acute coronary syndrome (ACS) accounts for approximately 5-10% of presents in the emergency departments (EDs). Rapid decision making is very important because longer hospital stay is associated with higher financial burden. The aim of this study was to compare current practice with a 2-hour accelerated diagnostic protocol (ADP) to manage chest pain in patients suspected to have ACS. Methods: This is a longitudinal follow-up study on 900 patients with negative troponin measured on entrance to the ED and initially low-risk for myocardial infarction according to the emergency department of chest pain assessment score (EDACS) at the Loghman Hakim Hospital, Tehran, Iran in 2018. Patients were divided in two groups (based on odd or even days at admission time) at a ratio of 2:1 (i) current protocol with a second troponin measuring after 6 hours and (ii) ADP with a second troponin measured after 2 hours. Major adverse cardiac events (MACE) associated factors assessed in two groups over 30-days. Results: Totally, the rate of return to EDs with the major adverse cardiac events was 4% (n=24) in the current protocol group and 1% (n = 1) in the ADP group within 30 days. The odds ratio for MACE in 30 days in the current protocol was 4.3 times more than ADP group (95% CI: 1.28-14.56, OR: 4.33, p:0.02). In multivariable logistic regression analysis, this estimation for the current protocol was 4.10 times more than comparison group (95% CI: 1.23-13.81, OR: 4.10, p:0.01). Conclusion: A 2-hour ADP in patients at low-risk for myocardial infarction by EDACS had fewer adverse follow-up events than the current protocol.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "03fea9321d6896bef35f79653276cf54",
  "timestamp": "2025-05-15T03:15:38.352539"
}