{
  "id": 7014,
  "title": "Low-Risk, Moderate-Risk, and Recreational Gambling Among Older Adults: Self-Complexity as a Buffer for Quality of Life",
  "abstract": "Gambling is a popular activity among older adults that has potential for growth as the population ages. Benefits have been identified for recreational gamblers (those experiencing no gambling-related problems), but there are many social, financial, and health harms affecting quality of life related to gambling across the spectrum of risk levels. Because of their greater numbers, low and moderate risk (LMR) older adult gamblers are responsible for higher levels of population harm. Therefore, this study examines outcomes experienced by older adults who participate in gambling at recreational and LMR levels to better understand protective factors that contribute to quality of life. Guided by activity theory and a modified self-complexity model, we explore how leisure complexity and employment buffer the relationship between gambler type and factors associated with well-being, namely social support (both perceived and received) and stress. A sub-sample of 3232 adults, age 55 years and older, who gambled in the past year was drawn from the 2013-2014 Canadian Community Health Survey. Data were analyzed using linear regression with moderation, focusing on the interactions of gambling risk level with leisure complexity and employment. Recreational gamblers reported greater role complexity and more diverse leisure lifestyles, both of which were associated with greater social support and reduced stress. Life stress was higher among older adults who worked for pay. Even so, having a job appeared to temper stress levels among LMR gamblers, suggesting the importance of maintaining a diversity of social roles and leisure activities, where possible, to enhance quality of life.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0418fd72551375fa137467c5ac8d2f24",
  "timestamp": "2025-05-15T03:04:22.949836"
}