{
  "id": 9305,
  "title": "Prevalence and correlates of food insecurity among US college students: a multi-institutional study",
  "abstract": "BackgroundCollege students may be vulnerable to food insecurity due to limited financial resources, decreased buying power of federal aid, and rising costs of tuition, housing, and food. This study assessed the prevalence of food insecurity and its sociodemographic, health, academic, and food pantry correlates among first-year college students in the United States.MethodsA cross-sectional study was conducted among first-year students (n=855) across eight U.S. universities. Food security status was assessed using the U.S. Department of Agriculture Adult Food Security Survey Module. Cohen's Perceived Stress Scale, Pittsburgh Sleep Quality Index, and Eating Attitudes Test-26 were used to assess perceived stress, sleep quality, and disordered eating behaviors, respectively. Participants self-reported their grade point average (GPA) and completed questions related to meal plan enrollment and utilization of on-campus food pantries.ResultsOf participating students, 19% were food-insecure, and an additional 25.3% were at risk of food insecurity. Students who identified as a racial minority, lived off-campus, received a Pell grant, reported a parental education of high school or less, and did not participate in a meal plan were more likely to be food-insecure. Multivariate logistic regression models adjusted for sociodemographic characteristics and meal plan enrollment indicated that food-insecure students had significantly higher odds of poor sleep quality (OR=2.32, 95% CI: 1.43-3.76), high stress (OR=4.65, 95% CI: 2.66-8.11), disordered eating behaviors (OR=2.49, 95% CI: 1.20-4.90), and a GPA<3.0 (OR=1.91, 95% CI: 1.19-3.07) compared to food-secure students. Finally, while half of the students (56.4%) with an on-campus pantry were aware of its existence, only 22.2% of food-insecure students endorsed utilizing the pantry for food acquisition.ConclusionsFood insecurity among first-year college students is highly prevalent and has implications for academic performance and health outcomes. Higher education institutions should screen for food insecurity and implement policy and programmatic initiatives to promote a healthier college experience. Campus food pantries may be useful as short-term relief; however, its limited use by students suggest the need for additional solutions with a rights-based approach to food insecurity.Trial RegistrationRetrospectively registered on ClinicalTrials.gov, NCT02941497.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04199e86c7502d33f355ff1e5a0c11db",
  "timestamp": "2025-05-15T03:27:25.104171"
}