{
  "id": 4015,
  "title": "Impact of upward and downward earnings management on stock returns",
  "abstract": "Purpose - The current study aims at examining the impact of upward and downward earnings management on the cross-sections of stock return. The study also examines the moderating role of cross-sectional effects on the association between earnings management and stock returns. Design/methodology/approach - The study employed univariate and bivariate-sorted portfolio-level analysis to investigate the issue. Fama-Macbeth cross-sectional regression is used to analyze the moderating role of different cross-sectional effects. The study used a sample of 3085 Bombay Stock Exchange (BSE) listed stocks spanning over 20 years from January 2000 to December 2019. Findings - The findings suggest that investors have different perceptions toward different forms of earnings management. In other words, results exhibit that investors perceive downward earnings management as an element of risk; hence, they discount the returns at a higher rate. On the contrary, results show that upward earnings management is positively perceived by the investors; hence, they hold the stocks even at a lower rate of return. This relation is found to be consistent even after controlling the impact of marker effect, size effect, value effect and momentum effect. Originality/value - This study is among pioneering studies that consider the direction of earnings management while examining its impact on the stock return. This study is also among the earlier attempts to examine the moderating role of four different cross-sectional effects by taking a uniform sample of stocks over the same period.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "042cd110049ebcd2d1e679cad30f7293",
  "timestamp": "2025-05-15T01:23:07.343316"
}