{
  "id": 4815,
  "title": "Statistical inference for a novel distribution using ranked set sampling with applications",
  "abstract": "Working on symmetrical or asymmetrical data is complicated since each requires a different probability density function. Many statistical distributions can be used for these data types, where choosing one should be satisfied with the correct data type. So, we apply the ranked set sampling technique, which is essential in gaining data when dealing with units in a population is expensive. However, their classification is simple according to the variable of interest. The Unit Generalized Rayleigh distribution has recently played a crucial role in analyzing symmetrical or asymmetrical complex data sets specifically in modeling claim and risk data used in actuarial and financial studies, and its density can take different symmetric and asymmetric possible shapes. It is proposed in various areas, such as reliability, survival, economics, actuarial science, and insurance. We applied the ranked set sampling design in this article for gaining the model parameter estimations of the unit generalized Rayleigh model. Different estimation procedures and risk measures are computed. Moreover, the performance of these measures is illustrated via numerical simulation experiments. Under different proposed estimators, we conduct the validation of the suggested ranked set sampling design via numerous Monte Carlo simulation experiments by computing average bias and mean squared errors. At the end, we illustrated two real applications of the financial area for demonstrating the potential and the supremacy of the proposed ranked set sampling estimators.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "042ee7ae36a1d4ee892ae2896e716bad",
  "timestamp": "2025-05-15T02:41:32.661038"
}