{
  "id": 1617,
  "title": "A dynamic, globally diversified, index neutral synthetic asset allocation strategy",
  "abstract": "An investor with the ability to assess the prospective return and risk structure of the global capital markets can construct portfolios that, over time, will not only outperform actively or passively managed domestic asset portfolios but will also outperform passively managed global portfolios. A Bayesian approach to dynamic seemingly unrelated regression (DSUR) is a robust and effective means to forecast the one-step ahead, conditional distribution of asset returns. This approach recognizes the time-varying nature of the global capital markets. The predictive moments are used to derive a single-factor return model once an index portfolio is specified. The index portfolio represents an investor's underlying portfolio. Given the factor model that assesses the relative attractiveness and risk of the assets in relation to the index, an index neutral portfolio is constructed as an overlay to enhance the returns of the index portfolio. This portfolio is mean-variance optimal, is notional neutral (i.e., the sum of the asset exposures is zero), and has returns that are designed to be uncorrelated with the returns of the index portfolio. The implementation of such an index neutral portfolio using derivative securities is simulated over the period January 1988 to December 1993.",
  "year": 1997,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04400ee3e7411edb007e795a67b17801",
  "timestamp": "2025-05-15T00:57:46.855589"
}