{
  "id": 2561,
  "title": "The Role of SMEs' Innovativeness and Competitiveness in Their Financial Risk Management Concerns",
  "abstract": "The majority of small and medium-sized enterprises (SMEs) worldwide are fragile and endangered in facing financial problems due to a lack of financial resources. To overcome these issues, their capabilities based on a Resource-based View (RBV), such as innovativeness and competitiveness, might enable them to reduce their major financial issues related to their financial risk management. In this regard, this paper aims to examine the impacts of SMEs' innovative and competitive attitudes on their financial risk management. Moreover, this paper examines whether those impacts differ depending on firm size. In line with those purposes, this paper analyzes 1221 Czech, Slovak, and Hungarian SMEs randomly selected from various databases. The researchers employ an online survey to collect the research data from the survey respondents, who are the executives of the analyzed SMEs. Concerning the data analysis, the researchers run Ordinal Logistic Regression Test. According to the results, while innovativeness negatively affects the financial risk management of SMEs, competitiveness does not. On the other hand, the results regarding firm size indicate that more competitive and less innovative microenterprises perform better in financial risk management compared to their less competitive and more innovative counterparts. However, competitiveness and innovativeness do not play determining roles in the financial risk management of small and medium-sized firms. The costs of R&D activities that firms face, the sectors that firms operate, and the educational status of the executives of SMEs might be strong arguments to explain the result of this paper.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04430cea39dc8c035a497478323b98cd",
  "timestamp": "2025-05-15T02:16:32.731344"
}