{
  "id": 6099,
  "title": "Factors associated with falls in patients with knee osteoarthritis: A cross-sectional study",
  "abstract": "Falls represent an important adverse effect associated with knee osteoarthritis and result in a significant financial burden on the healthcare system. Therefore, identification of fall predictors is essential to minimize fall incidence. However, few studies have investigated falls and fall predictors, particularly focused on the fear of falls and proprioception. In this study, we investigated significant fall predictors in patients with knee osteoarthritis in Malang, Indonesia. Our findings may serve as useful guidelines to develop geriatric fall prevention programs. This cross-sectional survey using purposive sampling was performed between April and July 2021 and included 372 participants. We recorded the following data: sociodemographic and medical history questionnaire responses, visual analog scale scores, Hopkins falls grading scale scores, Fall Efficacy Scale-International scores, proprioception test findings, knee injury and osteoarthritis outcome score (KOOS), range of motion (ROM), chair stand test and the timed up and go test performance. Data were analyzed using the chi-square and t tests, and multivariate logistic regression to determine significant fall predictors. Multivariate logistic regression analysis showed a lower risk of falls in patients with better proprioception and ROM than in the other groups (odds ratio 0.55 vs 0.96). The risk of falls was higher in patients with higher KOOS symptoms, fear of falls, diagnosis of low back pain and diabetes mellitus, and increased body mass index than in the other groups (odds ratio 1.41, 2.65, 1.27, 3.45, and 1.10, respectively. Our study shows that knee proprioception and ROM serve as protective factors against falls, whereas KOOS symptoms, fear of falls, low back pain, diabetes mellitus, and body mass index were associated with a high risk of falls, with diabetes mellitus and fear of falls being the most significant risk factors. These findings may be useful to policy makers to develop a fall prevention program that can be implemented in community health care centers across Indonesia to deliver individualized, person-centered care and improve fall prevention strategies through a systematic process comprising evaluation, intervention, and monitoring to minimize fall risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04472add67db3fd3ece7817dff6369c4",
  "timestamp": "2025-05-15T02:54:38.888935"
}