{
  "id": 6335,
  "title": "Public Perception About Pandemic Situation and Preparedness Towards a Probable Lockdown in an Affected Indian State Amidst the Second Wave of the Covid-19 Pandemic",
  "abstract": "Objective: The COVID-19 second wave badly affected India. This study assessed public preparedness and attitude towards a new lockdown in the state of West Bengal (WB) along with perception about the COVID pandemic situation. Methods: An anonymous questionnaire was administered to all willing adult attendees of a COVID vaccination centre in Kolkata, capital city of WB. Logistic regression was applied to find the relationship between attitude towards lockdown and other selected independent variables. Results: Of the 839 persons analyzed, 72.0% were non-health workers; and 55.4% thought that available vaccines reduce COVID-19 risk. Among them, 54.4% wanted stricter guidelines imposed. For preparedness, 42.6% and 28.8% said they would stock additional food and medicines respectively. On multiple logistic regression, being female, having elderly family members, perceiving the second wave as worse, and favouring stricter restrictions, all had odds of favourable attitude towards the new, proposed lockdown. Conclusions: A new lockdown was favoured by the majority. However, a well-planned and phased approach for this is needed in the light of many concerns about the previous lockdown. Mental health issues, financial security, medical help at hand, and ease of travel to workplaces are important issues that need to be addressed in case of future lockdown(s).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "044f816f304579cab7af490e36b33e92",
  "timestamp": "2025-05-15T02:57:07.691263"
}