{
  "id": 7640,
  "title": "Self-Perception of Aging and Satisfaction With Children's Support",
  "abstract": "Objectives: Those with self-beliefs in negative aging may desire a stronger support network to buffer against potential threats and may hence see their current network as less than adequate. This study investigated whether negative self-perception of aging is associated with increased dissatisfaction with children's support. Method: Six hundred and forty Chinese older adults with at least one child and a total of 2,108 adult children rated the degree of support received from each child individually and the degree to which it met their expectation. Additionally, the participants responded to measures of self-perception of aging (both positive and negative), neuroticism, instrumental activities of daily living, chronic illnesses, financial strain, and living status. The multilevel dataset was analyzed using mixed-effects regression. Results: Individuals who had a more negative self-perception of aging, who were younger, who lived alone, and who had fewer children provided lower support satisfaction ratings after support received from children was controlled for. Positive self-perception of aging was unrelated to support satisfaction. Neuroticism did not account for the relationship between negative self-perception of aging and support satisfaction. Discussion: A negative self-perception of aging may create vulnerability to intergenerational tension that puts older people at risk of adverse psychological and physical health outcomes.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0453fb4c633e1f5e95b3f89952e72bc3",
  "timestamp": "2025-05-15T03:10:33.043392"
}