{
  "id": 2447,
  "title": "Machine Learning-Based Phishing Website Detection: A Comparative Analysis and Web Application Development",
  "abstract": "Phishing, a cybercrime that uses sociotechnical and technical deception, targets identifiable information and financial credentials and poses a high risk according to the IBM Cost of a Data Breach Report 2022 which shows that on average precisely, the cost per transaction is $4.91 million, phishing attacks are on the rise, challenging the ability of traditional scanning systems to adapt to trends This study examines and it compares the effectiveness of three antiphishing methods: Autoencoder, Extreme Gradient Boost (XGBoost), and Random Forest (RF). Through feature selection and robust machine learning (ML) algorithms, including Random Forest achieving a remarkable 97.03% accuracy, the proposed solution integrates list-based methods with ML models for two-tier security. The wrapper method is employed to extract crucial features, facilitating precise phishing detection. Specific algorithms such as Random Forest and XGBoost are chosen for their proven effectiveness in handling complex data and class imbalances. However, potential limitations include the need for continuous adaptation to new phishing methods and exploring ensemble techniques for enhanced model robustness. Benchmarking against existing methods highlights the superiority of Random Forest in achieving balanced recall and precision. This study contributes to advancing phishing detection systems by leveraging machine learning and proposing strategies for improved performance and accuracy, which are then applied to a web application for countering phishing attacks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0462c578b46aa1229fb0e5883618f1b2",
  "timestamp": "2025-05-15T02:15:27.080170"
}