{
  "id": 5240,
  "title": "Funding liquidity risk: does banking market structure matter?",
  "abstract": "PurposeThe paper empirically investigates the link between banking market structure and funding liquidity risk.Design/methodology/approachWith a panel of Vietnamese commercial banks from 2007 to 2021, the system generalized method of moments (GMM) estimator is applied as the primary regression method, while the random-effect model and the corrected least square dummy variable (LSDVC) technique are also considered in robustness checks.FindingsCompetition may increase banks' funding liquidity risk. This finding holds for competition measures derived from the Boone index and concentration ratios but not in the case of the Lerner index as a proxy for market power. Further results indicate that the funding liquidity risk of banks that are larger and have better performance (less credit risk and higher return) tends to be less affected by competition. Besides, the overall impact of bank competition on funding liquidity risk is amplified by the financial crisis and the COVID-19 pandemic.Originality/valueThe study extends the empirical literature by exploring the relationship between bank competition and funding liquidity risk. Additionally, the paper also studies how the impact of bank competition on funding liquidity risk depends on the characteristics of the banking sector and the macroeconomic conditions of the economy, including the moderating effect of the COVID-19 pandemic.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04833464e159ca68418e5fc23d23ac12",
  "timestamp": "2025-05-15T02:45:47.416551"
}