{
  "id": 235,
  "title": "Consumer credit risk analysis through artificial intelligence: a comparative study between the classical approach of logistic regression and advanced machine learning techniques",
  "abstract": "This research article presents a comparative analysis between logistic regression as a traditional method, artificial neural networks (ANNs), and decision tree as machine learning techniques for predicting credit risk. It meticulously examines and evaluates these three methods, elucidating their contextual nuances and practical implications. The study utilizes consumer credit data comprising 9766 credit applications. The objective is to explore and evaluate the three models using various performance metrics, including accuracy, sensitivity, F1 score, and area under the ROC curve. Results demonstrate the superior performance of ANNs and decision trees over logistic regression across all metrics evaluated. This study provides compelling evidence endorsing ANNs and decision tree as more effective methods for credit risk prediction, thereby opening avenues for further exploration and application in this domain. However, a limitation of this study lies in its focus solely on three prediction methods, whereas considering additional approaches could have offered a more comprehensive perspective. This study provides valuable insights into the comparative performance of logistic regression, artificial neural networks (ANNs), and decision trees for credit risk prediction, based on a dataset from a Moroccan bank. The results clearly demonstrate the superiority of machine learning techniques, such as ANNs and decision trees, in terms of predictive accuracy and robustness, compared to traditional methods. By proving that these models outperform logistic regression across various performance metrics, this research contributes to improving credit risk assessment practices in the Moroccan financial sector. The implications of this study extend to risk management strategies, where the integration of advanced machine learning techniques can significantly enhance the reliability of forecasting tools.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0494f1c1f88512bc6e23fe6a83c94c01",
  "timestamp": "2025-05-15T01:48:30.735938"
}