{
  "id": 9043,
  "title": "Acceptability of HPV vaccines and associations with perceptions related to HPV and HPV vaccines among male baccalaureate students in Hong Kong",
  "abstract": "Objectives The highly infectious human papillomavirus (HPV) causes both genital warts and cervical cancer in women. In 2009, the prevalence of genital warts in Hong Kong was 203.7 per 100,000 person-years. Cervical cancer, more seriously, was the eight most common cancer among women and girls in Hong Kong, accounting for 2.3% of all new cancer cases in females in 2014. Cervical cancer is a significant global public health problem and HPV is a major risk factor leading to the development of cervical cancer. HPV is also the most common sexually transmitted disease among university students. This is the first study to examine the acceptability of HPV vaccines and associations with perceptions related to HPV and HPV vaccines among the male baccalaureate student population locally. Methods A self-administrative cross-sectional survey was used to assess whether male baccalaureate students from eight local Hong Kong universities intended to be immunized for HPV. The study also asked questions concerning how its subjects perceived HPV and HPV vaccines using the Health Belief Model. Data collection spanned from June to September 2015. A multiple stepwise regression model was used to examine associations between cognitive factors and subjects' intention to take up the HPV vaccine. Results A total of 1,004 (83.7%) students aged 18 and 26 participated in this study. 23.3% found vaccinating for HPV acceptable, a level correlating with a number of indicators. Subjects were more likely to find vaccinating acceptable if 1) they knew something about HPV vaccines; 2) they understood that men were susceptible to infection by HPV; 3) they realised they could benefit by HPV vaccination, and 4) they were aware of the arguments for and against HPV vaccination, as disseminated by either the media or peers. Conclusions HPV remains a significant public health concern in Hong Kong and China more broadly. This study's findings show a disconnect between the perceived and actual risk of being infected with the HPV vaccine among male baccalaureate students. This disconnect may be bridged by informing young men of the benefits of their being vaccinated against HPV, by removing the psychological and financial barriers that prevent them from taking up the vaccine and by improving how primary healthcare providers motivate them to get immunized.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04997959ae0978f1e8d78edd75583a81",
  "timestamp": "2025-05-15T03:24:54.931967"
}