{
  "id": 6368,
  "title": "Unexpected readmission after lung cancer surgery: A benign event?",
  "abstract": "Objective: The study objective was to study the incidence, predictors, and implications of unanticipated early postoperative readmission after lung resection for non-small cell lung cancer. Methods: Patients undergoing surgery for clinical stage I to III non-small cell lung cancer were abstracted from the National Cancer Database. Regression models were fitted to identify predictors of 30-day readmission and to study the association of unplanned readmission with 30-day and long-term survival. Results: Between 1998 and 2010, 129,893 patients underwent resection for stage I to III non-small cell lung cancer. Of these, 5624 (4.3%) were unexpectedly readmitted within 30 days. In a multivariate regression model, increasing age, male gender, preoperative radiation, and pneumonectomy (odds ratio, 1.77; 95% confidence interval, 1.56-2.00) were associated with unexpected readmissions. Longer index hospitalization and higher Charlson comorbidity score were also predictive of readmission. The 30-day mortality for readmitted patients was higher (3.9% vs 2.8%), as was the 90-day mortality (7.0% vs 3.3%, both P < .001). In a multivariate Cox proportional hazards model of long-term survival, increasing age, higher Charlson comorbidity score, and higher pathologic stage (hazard ratio, for stage III 1.81; 95% confidence interval, 1.42-2.29) were associated with greater risk of mortality. Unplanned readmission was independently associated with a higher risk of long-term mortality (hazard ratio, 1.40; 95% confidence interval, 1.34-1.47). The median survival for readmitted patients was significantly shorter (38.7 vs 58.5 months, P < .001). Conclusions: Unplanned readmissions are not rare after resection for non-small cell lung cancer. Such events are associated with a greater risk of short-and long-term mortality. With the renewed national focus on readmissions and potential financial disincentives, greater resource allocation is needed to identify patients at risk and develop measures to avoid the associated adverse outcomes.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04a3294ee9454f789e2f8c7d87c28abe",
  "timestamp": "2025-05-15T02:57:38.683688"
}