{
  "id": 3833,
  "title": "Screening, identification, and diagnosis of malnutrition in hospitalized patients with solid tumors: A retrospective cohort study",
  "abstract": "BackgroundMalnutrition is common in hospitalized patients with cancer and adversely affects clinical outcomes. We evaluated the prevalence of malnutrition risk, dietitian-identified malnutrition (DIMN), and physician-diagnosed malnutrition (PDMN) at admission.MethodsThis retrospective study included adults diagnosed with a stage I-IV solid tumor malignancy and admitted to Atrium Health Carolinas Medical Center from January 2016 to May 2019. Malnutrition risk was determined by a score >= 2 on the Malnutrition Screening Tool (MST) administered by a registered nurse during the intake process. Registered dietitian nutritionist (RDN) assessments were reviewed for DIMN and grade (mild, moderate, or severe). PDMN included malnutrition International Classification of Diseases, Tenth Revision codes in the discharge summary. Univariate models were estimated; multivariate logistic regression models identified associations between clinicodemographic factors and malnutrition prevalence with stepwise selection.ResultsA total of 5143 patients were included. Median age was 63 (range 18-102) years, 48% were female, 70% were White, and 24% were Black. Upper gastrointestinal (21%), thoracic (18%), and genitourinary (18%) cancers were most common. A total of 28% had stage IV disease. MST scores were available for 4085 (79%); 1005 of 4085 (25%) were at malnutrition risk. Eleven percent (n = 557) had malnutrition coded by a physician or documented by an RDN; 4% (n = 223) of these were identified by both clinicians, 4% (n = 197) by RDNs only, and 3% (n = 137) by physicians only.ConclusionMalnutrition appears to be underdiagnosed by both RDNs and physicians. Underdiagnosis of malnutrition may have significant clinical, operational, and financial implications in cancer care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04a8ae80565232976d618b18017025e4",
  "timestamp": "2025-05-15T02:30:28.701220"
}