{
  "id": 479,
  "title": "Non-fungible tokens (NFTs) in healthcare: a thematic analysis and research agenda",
  "abstract": "Introduction In the big data era, where corporations commodify health data, non-fungible tokens (NFTs) present a transformative avenue for patient empowerment and control. NFTs are unique digital assets on the blockchain, representing ownership of digital objects, including health data. By minting their data as NFTs, patients can track access, monetize its use, and build secure, private health information systems. However, research on NFTs in healthcare is in its infancy, warranting a comprehensive review. Methods This study conducted a systematic literature review and thematic analysis of NFTs in healthcare to identify use cases, design models, and key challenges. Five multidisciplinary research databases (Scopus, Web of Science, Google Scholar, IEEE Explore, Elsevier Science Direct) were searched. The approach involved four stages: paper collection, inclusion/exclusion criteria application, screening, full-text reading, and quality assessment. A classification and coding framework was employed. Thematic analysis followed six steps: data familiarization, initial code generation, theme searching, theme review, theme definition/naming, and report production. Results Analysis of 19 selected papers revealed three primary use cases: patient-centric data management, supply chain management for data provenance, and digital twin development. Notably, most solutions were prototypes or frameworks without real-world implementations. Four overarching themes emerged: data governance (ownership, tracking, privacy), data monetization (commercialization, incentivization, sharing), data protection, and data storage. The focus lies on user-controlled, private, and secure health data solutions. Additionally, data commodification is explored, with mechanisms proposed to incentivize data maintenance and sharing. NFTs are also suggested for tracking medical products in supply chains, ensuring data integrity and provenance. Ethereum and similar platforms dominate NFT minting, while compact NFT storage options are being explored for faster data access. Conclusion NFTs offer significant potential for secure, traceable, decentralized healthcare data exchange systems. However, challenges exist, including dependence on blockchain, interoperability issues, and associated costs. The review identified research gaps, such as developing dual ownership models and data pricing strategies. Building an open standard for interoperability and adoption is crucial. The scalability, security, and privacy of NFT-backed healthcare applications require further investigation. Thus, this study proposes a research agenda for adopting NFTs in healthcare, focusing on governance, storage models, and perceptions.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04bc22ffba9ac95af24551788c8be1e8",
  "timestamp": "2025-05-15T01:32:30.183758"
}