{
  "id": 5217,
  "title": "Six-year incidence of endophthalmitis after cataract surgery: Swedish national study",
  "abstract": "PURPOSE: To report the nationwide incidence and risk factors for endophthalmitis after cataract surgery in Sweden. SETTING: Swedish National Cataract Register containing reports on cataract operations from all Swedish ophthalmic surgical units. DESIGN: Prospective epidemiologic study. METHODS: Endophthalmitis case reports were collected from 2005 through 2010. Case and control parameters pertaining to patient characteristics and surgical technique were generated from the database. In addition, information from annual surveys regarding the topical prophylactic protocol was analyzed. RESULTS: The reports showed 135 endophthalmitis cases in 464 996 operations, equaling an incidence of 0.029%. Patient age over 85 years, perioperative communication with the vitreous and, above all, nonuse of intracameral cefuroxime showed a statistically significant association with endophthalmitis in the logistic regression. Short-term topical antibiotics given as add-on prophylaxis to the intracameral regimen before, after, or before and after the operation did not confer a clear-cut benefit. Groups with topical treatment were small, comprising 14% of the sample. CONCLUSIONS: The incidence of endophthalmitis after cataract surgery in Sweden is declining, which appears to be explained by a fall in the frequency of major risk factors. Operating earlier in the cataract course, avoiding capsule breakage, and giving intracameral antibiotics universally should further reduce the endophthalmitis rate. Financial Disclosure: No author has a financial or proprietary interest in any material or method mentioned.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04c184db60013fa75906035f86b90382",
  "timestamp": "2025-05-15T02:45:47.317808"
}