{
  "id": 7407,
  "title": "Risk Factors Associated with Childhood Strabismus The Multi-Ethnic Pediatric Eye Disease and Baltimore Pediatric Eye Disease Studies",
  "abstract": "Objective: To investigate risk factors associated with esotropia or exotropia in infants and young children. Design: Population-based cross-sectional prevalence study. Participants: Population-based samples of 9970 children 6 to 72 months of age from California and Maryland. Methods: Participants were preschool African-American, Hispanic, and non-Hispanic white children participating in the Multi-Ethnic Pediatric Eye Disease Study and the Baltimore Eye Disease Study. Data were obtained by parental interview and ocular examination. Odd ratios and 95% confidence intervals were calculated to evaluate the association of demographic, behavioral, and clinical risk factors with esotropia and exotropia. Main Outcome Measures: Odds ratios (ORs) for various risk factors associated with esotropia or exotropia diagnosis based on cover testing. Results: In multivariate logistic regression analysis, esotropia was associated independently with prematurity, maternal smoking during pregnancy, older preschool age (48-72 months), anisometropia, and hyperopia. There was a severity-dependent association of hyperopia with the prevalence of esotropia, with ORs increasing from 6.4 for 2.00 diopters (D) to less than 3.00 D of hyperopia, to 122.0 for 5.00 D or more of hyperopia. Exotropia was associated with prematurity, maternal smoking during pregnancy, family history of strabismus, female sex, astigmatism (OR, 2.5 for 1.50 to <2.50 D of astigmatism, and 5.9 for >= 2.5 D of astigmatism), and anisoastigmatism in the J0 component (OR, >= 2 for J0 anisoastigmatism of >= 0.25 D). Conclusions: Prematurity and maternal smoking during pregnancy are associated with a higher risk of having esotropia and exotropia. Refractive error is associated in a severity-dependent manner to the prevalence of esotropia and exotropia. Because refractive error is correctable, these risk associations should be considered when developing guidelines for the screening and management of refractive error in infants and young children. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011;118:2251-2261 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04c689baea810d2a7b21810bf7a15d6b",
  "timestamp": "2025-05-15T03:08:00.897923"
}