{
  "id": 7130,
  "title": "A data-driven use case planning and assessment approach for AI portfolio management",
  "abstract": "This paper presents a novel data-driven approach to identify and evaluate valuable and feasible AI use cases, following an Action Design Research methodology. The proposed approach comprises a three-step iterative AI use case planning method and an AI use case data model that establishes an AI use case library to gather ideas, document and compare solutions, assess feasibility, and plan implementation. Within this approach, we outline the process of use case planning, involving ideation, scoping, and assessment. The systematic collection and storage of specific use case data foster transparency and the creation of a knowledge base, facilitating data-driven decisions for AI use case portfolio management. This decision-making process is based on key dimensions such as value and feasibility, which are further broken down into sub-dimensions, including strategic value, financial value, data complexity, model complexity, required expertise, integration complexity, and risk classification. To validate the proposed approach, we apply it to real-world scenarios and conduct eight case studies to evaluate its effectiveness and practicality. Our approach enables different business stakeholders to collaborate effectively and create a standardized description and evaluation of AI use cases. This standardization not only ensures consistency and reuse across projects but also enhances the collective understanding and assessment of AI initiatives within and across organizations.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04ccda4820c2d1542de475d3c3382aa0",
  "timestamp": "2025-05-15T03:05:32.021693"
}