{
  "id": 3262,
  "title": "QUADRATIC CONVEX REFORMULATIONS FOR SEMICONTINUOUS QUADRATIC PROGRAMMING",
  "abstract": "We consider in this paper a class of semicontinuous quadratic programming problems, which arises in many real-world applications such as production planning, portfolio selection, and subset selection in regression. We build upon the idea of the quadratic convex reformulation approach, i.e., adding to the original objective function an additional convex term that is zero at all points of the feasible region. Exploiting the structure of semicontinuous variables, we derive the most general set of quadratic functions that can be added. We also incorporate the state-of-the-art perspective reformulation into our new framework. Within this framework, the set of optimal reformulations with the tightest continuous relaxation can be found by solving a semidefinite programming problem. We also explore the relationship among different reformulations within our framework and simplify the search for optimal ones in certain cases with the help of second-order cone programming. Among the proposed set of optimal reformulations, we can choose one with or without the perspective component. If the perspective component is present, the new reformulation can be solved by the perspective cut algorithm in the literature. If the perspective component is not present, the new reformulation is a standard mixed-integer quadratic programming (MIQP) problem and can be plugged into and solved by any MIQP solvers. Our preliminary numerical tests in both portfolio selection and subset selection problems have demonstrated the effectiveness of our new reformulations, and the comparison results indicate that the performance of the new reformulation without the perspective component, when solved in general MIQP solvers, is competitive to the perspective cut approach.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04ce359bf6933c416a0f095a1397800a",
  "timestamp": "2025-05-15T01:15:26.112628"
}