{
  "id": 1569,
  "title": "AI Predicted Product Portfolio for Profit Maximization",
  "abstract": "Enterprises analyze opportunities and threats in the external environment, measure internal strengths and weaknesses, and formulate strategic objectives to stay ahead of their opponents. Product portfolio management (PPM) is a dynamic process by which an enterprise chooses which products to develop, sell, maintain, and remove to achieve strategic objectives, maximize profit, and balance markets for different capabilities. Most product portfolios involve new products only and exclude existing products. This study proposes a product/market portfolio model that considers both old/new products and old/new markets to maximize overall PPM profit, determine which old products should stay in existing markets, which new markets should be considered, or which markets should be abandoned, and develop new products for old markets or to introduce new products to some new markets. This study uses machine learning and deep learning algorithms to establish prediction models to screen the planned products and markets with a high success rate. Mathematical programming is then used to determine which old products should be sold in which old and new markets and which new products should be launched in which new and old markets to maximize profit. A sensitivity analysis is used to determine the effect of changes in the resource and the risk threshold on profit and product/market selection.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04f1341e38d7587c75ae022e8e5ee69b",
  "timestamp": "2025-05-15T00:57:12.664754"
}