{
  "id": 6815,
  "title": "Modelling Interrelationships of the Factors Impeding Community Engagement in Risk-Sensitive Urban Planning: Evidence from Sri Lanka",
  "abstract": "During the last two decades, global disasters have impacted over 5.2 billion people, with economic losses exceeding USD 2.97 trillion. This underscores the critical need for inclusive risk-sensitive urban planning (RSUP) that integrates community insights. Community-based disaster risk reduction (CBDRR) has demonstrated a potential reduction of up to 40% in mortality rates during disasters and cost savings in disaster response and recovery. However, research has shown that only 20% felt they are involved in decisions related to neighborhood planning, despite communities' lived experience in surviving local hazards. This highlights a gap where practitioners dominate the development of mitigation and development plans, sidelining local perspectives. Using Sri Lanka as a case study, this study investigated the barriers to effective community participation in the decision-making of RSUP and thereby developed an interpretive logic model to establish an understanding of why they occur and how each barrier is interlinked. The data gathered from a sample of 44 experts and community representatives revealed 19 factors that impede community inclusion in the decision-making of RSUP in Sri Lanka. The Total Interpretive Structural Modelling (TISM) analysis adopted identified that the absence of legal provisions for inclusive development, political dynamics, and corruption are the most significant barriers. The Matrix Impact of Cross Multiplication Applied to Classification (MICMAC) further revealed that fewer financial provisions and the absence of an institutional framework for community engagement are the linking barriers to the other 17 barriers. This study not only extends the theoretical debate on barriers to community engagement for risk-responsive and equitable development but also helps urban planners, disaster management practitioners, and strategy policymakers focus on critical areas that need major reforms.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04f3c70302ce11a5cecc420c279a4d0f",
  "timestamp": "2025-05-15T03:02:07.415424"
}