{
  "id": 8268,
  "title": "Factors Related to Frailty Among Older Adults in Khuzestan, Iran",
  "abstract": "Objectives Frailty syndrome is one of the most important geriatric syndromes that imposes high psycho- logical and financial costs on the elderly, their families and health system. This study aims to determine the factors associated with frailty in older adults living in Khuzestan province of Iran Methods & Materials This is a cross-sectional study conducted in 2019 on 540 older adults in Khuzestan province who were selected by a multistage random sampling method. Data collection tools include a demographic form, Deficit accumulation Frailty Index, Wax's Social Support Scale and the Geriatric Depression Scale. Collected data were analyzed using Spearman correlation test, chi-square test and sequential logistic regression analysis. Results The Mean +/- SD age of participants was 72.61 +/- 8.72 years and 65.6% were women. Around 10.4% were frail and 25.6% were pre-frail. Frailty was higher among older women with higher age, lower education, without social support, with depression, living alone, single, with a history of taking high number of medications, and with a history of hospitalization (P<0.001). Frailty was lower in older men with lower age, a history of taking less than 5 medications, no depression, and high social support (P<0.005). Conclusion The consequences of frailty syndrome can be reduced by early identification of frail older adults and using appropriate interventions based on risk factors such as polypharmacy and low social support.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "04fbb9530885a1e1558625ce32bd40b1",
  "timestamp": "2025-05-15T03:17:21.433678"
}