{
  "id": 287,
  "title": "SABER: Stochastic-Aware Bootstrap Ensemble Ranking for portfolio management",
  "abstract": "Portfolio management (PM) is a central subject of finance that presents many unresolved challenges. Although solutions have been proposed since the 1950's, recent advances in machine learning are revolutionizing investments. Whereas supervised paradigms such as regression and classification are established in this direction, emerging research suggests that the learning -to -rank (LtR) paradigm can be more effective. Yet, these works are not many and overlook some important aspects. These aspects include the risk inherent in stocks, feature representation, portfolio cardinality and allocation. Addressing these gaps, this paper presents Stochastic -Aware Bootstrap Ensemble Ranking (SABER), an LtR method that directly minimizes the uncertainty and improves ranking performance. In addition, we propose Merged Bootstrap Selection for dynamic portfolio cardinality optimization. Trained on macroeconomic, fundamental and market indicators, the proposed methods outperform a state-of-the-art LtR approach, reaching annual returns and volatility of 83.48% and 29.89% across 6 years. The former also considers renowned weight allocation methods and achieves Sharpe and Sortino ratios of 2.79 and 5.28 respectively. Finally, the computational complexity of the proposed method is proven comparable to that of current methods.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0517b99f9038253303391cc6e0aca77a",
  "timestamp": "2025-05-15T00:41:04.918263"
}