{
  "id": 5694,
  "title": "Service use and health status of persons with severe mental illness in full-risk and no-risk Medicaid programs",
  "abstract": "Objective: The service use patterns and health status outcomes of Medicaid recipients with severe mental illness in a system that assigned full financial risk to managed care organizations through capitation and a system that paid for mental health care on a no-risk fee-for-service basis were compared. Methods: With use of a quasi-experimental design, initial interviews (time 1) and follow-up interviews six months later (time 2) were conducted among 92 clients in the full-risk group and 112 clients in the no-risk group. Regression models were used to compare self-reported service use and health status between the two groups. Results: Service use patterns differed between the two groups. When symptom severity at time I was controlled for, clients in the full-risk group were more likely to have received case management but less likely to report contact with a psychiatrist or to have received counseling than clients in the no-risk group. When health status at time 1 was controlled for, clients in the full-risk group reported poorer mental health at time 2 than clients in the no-risk group. When physical health status at time I was controlled for, clients in the full-risk group reported poorer physical health at time 2 than clients in the no-risk group. Conclusions; Capitation was associated with lower use of costly services. Clients with serious mental illness in the full-risk managed care system had poorer mental and physical health outcomes than those in the no-risk system.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05179c7fbad330c4f92b68abc20ca7fe",
  "timestamp": "2025-05-15T02:50:21.315637"
}