{
  "id": 5117,
  "title": "Capital structure and default risk of small and medium enterprises: evidence from Algeria",
  "abstract": "PurposeThis study examines the existence of a causal relationship between the capital structure at the creation of the small and medium-sized enterprise (SME) and its viability after 3 years.Design/methodology/approachThe empirical strategy consists of proceeding in two stages: first, the use of the Logit model to regress the studied variable reflecting the state of an SME of being in default or not, on the variables likely to significantly explain its default risk. Second, the authors investigate the existence of a relationship between the capital structure at the time of SME creation and viability. The obtained results are analyzed to confirm the initial hypothesis.FindingsThe results obtained indicate that the Logit model performs well in terms of discriminating and classifying SMEs. These findings are consistent with previous studies and support their conclusions regarding the model's strong classification capability. Furthermore, the model demonstrates a noteworthy classification rate of 90% for capital SMEs, specifically joint-stock companies (SpA). Out of the 10 observed SMEs, 8 nonfailing SMEs were still operational three years after the observation period, resulting in a survival rate of 80%.Practical implicationsThe results allow bankers to better understand the main determinants of SME default risk and demonstrate the existence of a causal relationship between the capital structure of an SME and its viability. This study is conducted in the construction, public works, and hydraulics sector (second largest sector in Algeria after the services sector). In future works, the authors try to extend the results of this study to other sectors of activity.Originality/valueThe richness of the established Logit model is to consider both financial and non-financial and qualitative variables. Although the qualitative variables are not statistically significant in the results obtained, the authors used the Legal form variable to demonstrate the existence of a causal relationship between the capital structure of an SME and its viability.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "051cb2d57062935c04f18df651c8a2b8",
  "timestamp": "2025-05-15T02:44:43.807524"
}