{
  "id": 3697,
  "title": "The impact of childhood sexual abuse and paternal rejection on economic marginalization in adulthood: A prospective population-based study of women in Sweden",
  "abstract": "Background: Childhood maltreatment has detrimental health consequences. Risk for economic marginalization in adulthood is less clear. Objective: To assess prospective associations between sexual abuse, paternal rejection and maternal rejection in childhood and indicators of economic marginalization. We also examined whether these associations were moderated by the adult women's own education and social support. Participants and setting: A population-based cohort of 643 Swedish women aged 20-25 were asked to retrospectively report on childhood maltreatment. Information on economic marginalization was obtained from register follow-up until 2017. Methods: Cox proportional hazard regression was used to assess the associations between childhood maltreatment and incident economic marginalization, and whether these associations were modified by the women's education and social support in adulthood. Regression models were adjusted for parental characteristics and the women's contentment with life at examination. Results: Sexual abuse increased the risk of financial welfare assistance and disability pension, but no association with long-term unemployment was observed. Paternal but not maternal rejection was associated with excess risk of long-term unemployment, financial welfare assistance, and disability pension. Social support in adulthood did not moderate the associations, but associations between paternal rejection and long-term unemployment were stronger among women with university education than among women with less education. Conclusions: This study found childhood sexual abuse and paternal rejection as risk factors for economic marginalization among adult women. Future studies should investigate the reasons for the differential impact of paternal and maternal rejection and the excess risk among highly educated women.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05251445db248cddddc449c52d9949c0",
  "timestamp": "2025-05-15T02:29:00.189608"
}