{
  "id": 1164,
  "title": "Role of perceived COVID-19 disruption, personality traits and risk perception in determining the investment behavior of retail investors: a hybrid regression-neural network approach",
  "abstract": "PurposeThis study aims to assess the impact of personality traits, risk perception and perceived coronavirus disease 2019 (COVID-19) disruption on the investment behavior of individual investors in the Indian stock market.Design/methodology/approachThis study adopts a survey approach. The sample comprises 315 active retail investors investing in the Indian stock exchange. Two-stage analysis technique regression and Artificial Neural Network (ANN) were used for data analysis. Study hypotheses were tested through regression and ANN was adopted to validate the regression results.FindingsTwo regression models were modeled to test the research hypotheses. Findings showed that risk perception and COVID-19 disruption have a significant positive and neuroticism has a significant negative impact on short-term investment decisions, while the role of conscientiousness in determining short-term investment decisions was not found significant. Results also showed a positive impact of neuroticism and conscientiousness and a negative impact of risk perception on long-term investment decisions. The role of COVID-19 disruption was found negative but insignificant in predicting long-term investment decisions.Practical implicationsThis study has practical implications for many parties like retail investors, financial advisors and policymakers. This study will assist the investors to realize that they do not always take rational financial decisions. This study will suggest the financial advisors to use the knowledge of behavioral finance in making the advisors' advisory and wealth management decisions. This study will also assist the policymakers to outline behaviorally well-informed policy decisions to protect the interests of investors.Originality/valueIndia is one of the fast-growing economies in the world. India has a vast population of active investors and determining investors' investment behavior adds novelty to this study as developed economies have remained the main focus of previous studies. The other novel feature of this study is that this study tries to assess the impact of COVID-19 disruption along with personality traits and risk perception on investment behavior. The other valuable factor of this study is the use of ANN to predict the relative importance of the exogenous variables.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0534aeaae7ac9155b9656258f9150f30",
  "timestamp": "2025-05-15T01:59:56.244807"
}