{
  "id": 3857,
  "title": "What makes the difference between a low-cost carrier airport and a low-cost carrier base?",
  "abstract": "The liberalization of the European air transport market has enabled airlines to expand their networks substantially throughout the continent. In particular, low-cost carriers (LCCs) did so by rapidly expanding their number of bases in countries all over Europe. This paper sheds light on the variables that are related to the base likelihood of Ryanair, easyJet and Wizz Air, using several logistic regression models on a rich dataset with 385 European airports. The analysis shows that population is positively related to base likelihood. This relation is substantially stronger for easyJet bases. In addition, Ryanair base likelihood is positively linked with the number of hotel beds near the airport. EasyJet bases do not show such a relationship. Ryanair and especially Wizz Air bases are located in less wealthy regions, while easyJet bases are located in slightly richer regions. In addition, an obvious positive relationship between base likelihood and the number of airport operating hours is shown. The level of labour costs is related negatively to base likelihood. Airport competition turns out not be related to base likelihood. Finally, Ryanair's bases are often only served by LCCs, while easyJet target airports that have a mixed airline portfolio. (C) 2016 Elsevier Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "054c2b483f8862fa1bda8d77c4a591bd",
  "timestamp": "2025-05-15T01:21:41.318583"
}