{
  "id": 5496,
  "title": "Firm-specific political risk: a systematic investigation of its antecedents and implications for vertical integration and diversification strategies",
  "abstract": "PurposeUncertainties caused by political risks can drastically affect global supply chains. However, the supply chain management literature has thus far developed rather limited knowledge on firms' perception of and reactions to increased political risks. This study has two main purposes: to explore the relationship between extant risk exposure and perceived firm-specific political risk and to understand the impact of firm-specific political risk on firms' vertical integration and diversification strategies.Design/methodology/approachThe authors developed a unique dataset for testing our hypotheses. Specifically, the authors sampled manufacturers (SIC20-39) listed in the United States from 2002 to 2019. The authors collected financial and diversification data from Compustat, vertical integration data from the Fresard-Hoberg-Phillips Vertical Relatedness Data Library and political risk data from the Economic Policy Uncertainty database. This data collection process yielded 1,287 firms (8,329 observations) with available data for analysis.FindingsA two-way fixed-effect regression analysis of panel data revealed that firms tend to be more sensitive to political risk when faced with income stream uncertainty or strategic risk. By contrast, exposure to stock returns uncertainty does not significantly influence firms' sensitivity toward political risk. Moreover, firm-specific political risk is positively associated with vertical integration and product diversification. However, firm-specific political risk does not result in higher levels of geographical diversification.Originality/valueThis study joins the literature that systematically explores the antecedents and implications of firm-specific political risk, thus broadening the scope of supply chain risk management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0552b89c49184492cf7312de5ec39f09",
  "timestamp": "2025-05-15T02:48:23.769403"
}