{
  "id": 3602,
  "title": "The impact of macroeconomic risk on asset prices in Ghana, 1997-2002",
  "abstract": "The dwindling nature of overseas development assistance in the early part of the 1990s called for the establishment of capital markets in some African countries, including Ghana, with the view to increasing foreign direct investments and achieving sustainable inflows, growth and development. One important factor which affects the determination of prices and the growth of capital markets is macroeconomic risk which is quite high in developing countries. Following works done on advanced stock markets, this study seeks to investigate the impact of six macroeconomic risk factors on asset pricing in the various industrial classification-financial, manufacturing, food and beverages, distribution and mining under the Ghana Stock Exchange (GSE) for the period January 1997 to December 2002. Using the arbitrage pricing methodology developed by Ross (1976) and Chen et al. (1986), the study revealed that investors in Ghana considered three main macroeconomic risk factors-short-term interest rate risk, inflation risk and the term structure of the country's interest rate in the determination of the various industrial asset prices during the period under consideration. Analysis of the risks and returns profile of the industries also shows that financial assets made the best gains on the market. Both general and specific policy recommendations aimed at improving the performance of the GSE are explored.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "055a614c093df8118336b8464f4c1b13",
  "timestamp": "2025-05-15T02:27:54.111416"
}