{
  "id": 4133,
  "title": "The role of disappointment aversion and expectation proclivity in describing financial risk aversion among financial decision-makers",
  "abstract": "Purpose Using data obtained from 525 individuals who were surveyed during early spring 2020, this study addressed three aims: (1) to ascertain the degree to which disappointment aversion and expectation proclivity are related; (2) to identify who is most likely to exhibit patterns of disappointment aversion; and (3) to determine to what extent the combination of disappointment aversion and expectation proclivity is associated with financial risk aversion. Design/methodology/approach Several analytic methods were used in this study. Descriptive statistics were calculated for each of the measures examined in this study. Correlation, analysis of variance (ANOVA) and regression techniques were used to estimate associations between and among the variables of interest in this study. Findings A negative relationship between disappointment aversion and expectation proclivity was noted, which is counter to conventional thinking. It is traditionally thought that those who establish high expectations will experience the greatest disappointment when choice outcomes fall below expectations. In this study, it was determined that when a financial decision-maker consistently establishes high outcome expectations and results fall below expectations, the financial decision-maker feels less disappointment. More precisely, those who consistently establish high expectations tend to be more disappointment tolerant than others. Research limitations/implications This paper provides evidence that categories of disappointment aversion and expectation proclivity are associated with financial risk aversion and certain demographic characteristics. Practical implications This paper adds support for assertions made in the International Journal of Bank Marketing (IJBM) that it is important for financial service professionals and bankers to manage customer expectations to reduce disappointment with products and services. This paper shows that combinations of disappointment aversion and expectation proclivity are related to the financial risk aversion of customers. Social implications Findings from this paper indicate that a commonly used heuristic that decision-makers should reduce expectations to avoid disappointment may not be accurate or particularly useful in the context of financial decision-making. Originality/value Findings from this study add to the existing body of literature by showing that aversion to disappointment and the establishment of expectations, while distinct concepts, are interrelated.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "055fc52a6120aabb99c454c12d8e0187",
  "timestamp": "2025-05-15T02:33:42.045072"
}