{
  "id": 9185,
  "title": "The status and influencing factors of fatigue in kidney transplant recipients based on the theory of unpleasant symptoms: A cross-sectional study in China",
  "abstract": "AimsThis study describes the incidence of fatigue in kidney transplant recipients and analyses the relationship between physiological factors, psychological factors, situational factors and fatigue in kidney transplant recipients.BackgroundFatigue, as a common symptom after kidney transplantation, is affected by many factors, but the influence of some factors on the fatigue of kidney transplant recipients is still controversial.DesignThis cross-sectional study was designed based on the theory of unpleasant symptoms.MethodsOur survey involved 307 participants attending the kidney transplant outpatient clinic of a tertiary Class A hospital (Changsha, Hunan, China). Data were collected between February and April 2021 using a structured questionnaire and electronic medical records. Data were analysed using IBM SPSS 25.0 (SPSS Inc.)ResultsIt was found that the incidence of fatigue in kidney transplant recipients was 53.1%. According to the binary logistic regression analysis, sleep quality, hypokalemia, anxiety, depression and education level were independent risk factors for fatigue in kidney transplant recipients.ConclusionThe incidence of fatigue in kidney transplant recipients was high and was influenced by physical, psychological and situational factors. Clinical nurses should assess fatigue levels in a timely and multidimensional manner in clinical practice and provide effective and scientific guidance about fatigue self-coping and symptom management for kidney transplant recipients. What is already known about this topic? Fatigue is a common symptom of kidney transplant recipients and can impair postoperative recovery, reemployment, quality of life, social activities and physical and mental states, causing the body to be in a state of chronic energy consumption. Owing to the imperceptible physical injury upon kidney transplant recipients, fatigue is often underappreciated or even disregarded.What this paper adds? It was found that the rate of fatigue in kidney transplant recipients was high. The risk factors for fatigue in kidney transplant recipients based on the theory of unpleasant symptoms were analysed in three ways: physiological, psychological and situational. The results showed that sleep quality, duration after transplantation, serum potassium level, anxiety, depression, education level, financial burden and social support were associated with fatigue in kidney transplant recipients.The implications of this paper: Clinical nurses should conduct timely and multidimensional fatigue evaluations of kidney transplant recipients and pay more attention to those with a high level of fatigue. The findings can provide a scientific basis for kidney transplant specialist nurses to conduct targeted interventions and facilitate fatigue management for kidney transplant recipients. They can also help to develop fatigue intervention models based on the displeasure symptom theory to improve fatigue in kidney transplant recipients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05610a77d151ba7839cdb87d62cf0ffc",
  "timestamp": "2025-05-15T03:26:25.974401"
}