{
  "id": 3763,
  "title": "Financial protection effects of private health insurance: experimental evidence from Chinese households with resident basic medical insurance",
  "abstract": "Background After achieving universal basic medical insurance coverage, Chinese government put the development of private health insurance (PHI) on its agenda to further strengthen financial risk protection. This paper aims to assess the level of financial protection that PHI provides for its insured households on the basis of resident basic medical insurance (RBMI). Methods We employed balanced panel data collected between 2015 and 2017 from the China Household Finance Survey (CHFS). Catastrophic health expenditure (CHE) and impoverishment due to health spending were applied to measure the financial protection effects. Random effects panel logistic regression model was performed to identify the factors associated with CHE and impoverishment among households covered by RBMI. In the robustness test, the method of propensity score matching (PSM) was employed to solve the problem of endogeneity. Results From 2015 to 2017, the CHE incidence increased from 12.96 to 14.68 % for all sampled households, while the impoverishment rate decreased slightly from 5.43 to 5.32 % for all sampled households. In 2015, the CHE incidence and impoverishment rate under RBMI + PHI were 4.53 and 0.72 %, respectively, which were lower than those under RBMI alone. A similar phenomenon was observed in 2017. Regression analysis also showed that the households with RBMI + PHI were significantly less likely to experience CHE (marginal effect: -0.054, 95 %CI: -0.075 to -0.034) and impoverishment (marginal effect: -0.049, 95 %CI: -0.069 to -0.028) compared to those with RBMI alone. The results were still robust after using PSM method to eliminate the effects of self-selection on the estimation results. Conclusions In the context of universal basic medical insurance coverage, the CHE incidence and impoverishment rate of Chinese households with RBMI were still considerably high in 2015 and 2017. PHI played a positive role in decreasing household financial risk on the basis of RBMI.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05663ab3b923217f33fc286641ed9a68",
  "timestamp": "2025-05-15T02:29:59.097657"
}