{
  "id": 6416,
  "title": "Body weight changes and associated predictors in a prospective cohort of young breast cancer survivors",
  "abstract": "Background Weight gain after a breast cancer diagnosis is common and is associated with inferior outcomes. Young survivors may be especially susceptible to weight changes given the impact of treatment on menopausal status. Methods The authors identified women who were diagnosed with stage 0 to III breast cancer at age 40 years or younger between 2006 and 2016 from a multicenter prospective cohort. Self-reported weight was collected at diagnosis and at 1 year and 3 years postdiagnosis. Tumor and treatment data were obtained from medical records and patient surveys. Multinomial logistic regression was used to identify the factors associated with weight gain (>= 5%) or weight loss (>= 5%) versus stable weight at 1 year and 3 years postdiagnosis. Results The cohort included 956 women with a median age of 37 years at diagnosis. Mean weight significantly increased over time from 66.54 +/- 14.85 kg at baseline to 67.33 +/- 15.53 and 67.77 +/- 14.65 kg at 1 year and 3 years, respectively (p <= .001 for both comparisons). The proportion of women experiencing >= 5% weight gain increased from 24.8% at 1 year to 33.9% at 3 years. At 1 year, less self-perceived financial comfort, Black race, and stage III disease were significantly associated with weight gain; at 3 years, only less self-perceived financial comfort remained significant. Baseline overweight or obesity was significantly associated with weight loss at both time points. Chemotherapy, endocrine therapy, and treatment-related menopause were not associated with weight change. Conclusions One third of young breast cancer survivors experienced clinically significant weight gain 3 years after diagnosis; however, treatment-related associations were not observed. Age-appropriate lifestyle interventions, including the reduction of financial barriers, are needed to prevent weight gain in this high-risk population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05736676837c6af9fd758429ed15ed09",
  "timestamp": "2025-05-15T02:58:05.578943"
}