{
  "id": 8186,
  "title": "Are electric vehicles riskier? A comparative study of driving behaviour and insurance claims for internal combustion engine, hybrid and electric vehicles",
  "abstract": "Electric vehicles (EVs) differ significantly from their internal combustion engine (ICE) counterparts, with reduced mechanical parts, Lithium-ion batteries and differences in pedal and transmission control. These differences in vehicle operation, coupled with the proliferation of EVs on our roads, warrant an in-depth investigation into the divergent risk profiles and driving behaviour of EVs, Hybrids (HYB) and ICEs. In this unique study, we analyze a novel telematics dataset of 14,642 vehicles in the Netherlands accompanied by accident claims data. We train a Logistic Regression model to predict the occurrence of driver at-fault claims, where an at-fault claim refers to First and Third Party damages where the driver was at fault. Our results reveal that EV drivers are more exposed to incurring at-fault claims than ICE drivers despite their lower average mileage. Additionally, we investigate the financial implications of these increased at-fault claims likelihoods and have found that EVs experience a 6.7% increase in significant first-party damage costs compared to ICE. When analyzing driver behaviour, we found that EVs and HYBs record fewer harsh acceleration, braking, cornering and speeding events than ICE. However, these reduced harsh events do not translate to reducing claims frequency for EVs. This research finds evidence of a higher frequency of accidents caused by Electric Vehicles. This burden should be considered explicitly by regulators, manufacturers, businesses and the general public when evaluating the cost of transitioning to alternative fuel vehicles.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "057425854e52d223dc5146166d14c956",
  "timestamp": "2025-05-15T03:16:17.392268"
}