{
  "id": 1485,
  "title": "An Improved Deep-Learning-Based Financial Market Forecasting Model in the Digital Economy",
  "abstract": "The high-complexity, high-reward, and high-risk characteristics of financial markets make them an important and interesting study area. Elliott's wave theory describes the changing models of financial markets categorically in terms of wave models and is an advanced feature representation of financial time series. Meanwhile, deep learning is a breakthrough technique for nonlinear intelligent models, which aims to discover advanced feature representations of data and thus obtain the intrinsic laws underlying the data. This study proposes an innovative combination of these two concepts to create a deep learning + Elliott wave principle (DL-EWP) model. This model achieves the prediction of future market movements by extracting and classifying Elliott wave models from financial time series. The model's effectiveness is empirically validated by running it on financial data from three major markets and comparing the results with those of the SAE, MLP, BP network, PCA-BP, and SVD-BP models. Interestingly, the DL-EWP model based on deep confidence networks outperforms other models in terms of stability, convergence speed, and accuracy and has a higher forecasting performance. Thus, the DL-EWP model can improve the accuracy of financial forecasting models that incorporate Elliott's wave theory.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0585f91df1d7d0dc2afbbe038af9d7ac",
  "timestamp": "2025-05-15T02:03:39.776438"
}