{
  "id": 8408,
  "title": "The association between use of opiates, cocaine, and amphetamines during pregnancy and maternal postpartum readmission in the United States: A retrospective analysis of the Nationwide Readmissions Database",
  "abstract": "Background: Substance use during pregnancy has increased in the United States, with adverse consequences for mother and baby. Similarly, postpartum readmission (PPR) imposes physical, emotional, and financial stressors causing disruption to family functioning and childcare. We used national data to estimate the extent to which women who used opiates, cocaine, and amphetamines during pregnancy are at increased risk of PPR. Methods: We analyzed 2010-2014 data from the Nationwide Readmissions Database (NRD). Our exposure, drug use during pregnancy, was identified using diagnosis codes indicative of opioid, cocaine or amphetamine use, abuse, or dependence. The outcome was all-cause PPR, maternal readmission within 42 days following discharge from the delivery hospitalization. Multivariable logistic regression was used to estimate odds ratios (OR) that represented associations between drug use and PPR. Results: Among 11 million delivery hospitalizations, nearly 1 % had documented use of opiates, cocaine and/or amphetamines. The crude PPR rate was nearly four times higher among users (54.6 per 1000) compared to nonusers (14.0 per 1000), and 1 in 10 women who had documented use of more than one drug category experienced postpartum readmission. Even after controlling for sociodemographic and clinical confounders, we observed a two-fold increased odds of PPR among users compared to non-users (OR = 1.95; 95 % CI: 1.82, 2.07). Conclusions: The national opioid epidemic should encourage a paradigm shift in health care public policy to facilitate the management of all substance use disorders as chronic medical conditions through evidence-based public health initiatives to prevent these disorders, treat them, and promote recovery.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "058b3426b564018ede6bab67be5c3459",
  "timestamp": "2025-05-15T03:18:19.699997"
}