{
  "id": 6616,
  "title": "The effect of older people's economic resources on care home entry under the United Kingdom's long-term care financing system",
  "abstract": "Objective. To determine how older people's economic resources affect their likelihood of care home entry in the United Kingdom. Methods. In 1988, income, home ownership, and health data were collected for 1,425 people aged 75+. Participants received up to five subsequent health assessments before the study endpoint (1999), in which care home entry was also recorded. Care home entry was identified from death certificates for those who died. Using proportional hazards regression, the effect of home ownership and income on the risk of care home entry was estimated, controlling for predisposing, enabling, and need factors. and health service utilization. Results. Age, living alone, activities of daily living restriction, cognitive impairment, poor/fair self-perceived health, and contact with services increased the risk of care home entry. Home ownership decreased it. Gender was not a significant predictor of care home entry once other factors were controlled for, and no significant effect was found for income. Discussion. UK public authorities can require older home owners to use the value of their homes to pay for institutional but not community-based care, thus producing a financial incentive to place home owners in institutional settings. However, we find that home ownership reduces the likelihood of care home entry, suggesting that other factors dominate the decision process.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05a0d2935eaeffecd58a50875fd6c916",
  "timestamp": "2025-05-15T03:00:04.924676"
}