{
  "id": 7016,
  "title": "Intraocular Tumor-Associated Lymphangiogenesis A Novel Prognostic Factor for Ciliary Body Melanomas with Extraocular Extension?",
  "abstract": "Purpose: To evaluate whether intraocular tumor-associated lymphangiogenesis contributes to prognosis of ciliary body melanomas with extraocular extension and to study its association with other tumor characteristics. Design: Nonrandomized, retrospective case series. Participants: Twenty consecutive patients enucleated for a malignant melanoma of the ciliary body with extraocular extension. Methods: Lymphatic vessels were identified using lymphatic vascular endothelial-specific hyaluronic acid receptor-1 (LYVE-1) and podoplanin as specific immunohistochemical markers for lymphatic vascular endothelium. Baseline tumor characteristics included intra-and extraocular tumor size, 2009 tumor, node, metastasis (TNM) classification, route of extraocular spread, tumor cell type, mitotic rate, Ki-67 proliferation-index, microvascular patterns and density, tumor-infiltrating lymphocytes and macrophages, and expression of human leukocyte antigen (HLA) class I and insulin-like growth factor-1 receptor. Kaplan-Meier and Cox regression analyses of melanoma-specific survival were performed. Main Outcome Measures: Prevalence of intraocular LYVE-1(+)/podoplanin(+) lymphatic vessels and association with intraocular tumor characteristics and metastasis-free survival. Results: Intraocular LYVE-1(+) and podoplanin(+) lymphatic vessels could be detected in 12 (60%) of 20 ciliary body melanomas with extraocular extension. Presence of intraocular LYVE-1(+)/podoplanin(+) lymphatic vessels was significantly associated with larger intra-(P = 0.002) and extraocular tumor size (P < 0.001), higher TNM categories (P = 0.004), epithelioid cellularity (P = 0.016), higher mitotic rate (P = 0.003), higher Ki-67 proliferation-index (P = 0.049), microvascular networks (P = 0.005), higher microvascular density (P = 0.003), more tumor-infiltrating macrophages (P = 0.002), higher expression of HLA class I (P = 0.046), and insulin-like growth factor-1 receptor (P = 0.033), but not significantly with route of extraocular spread (P = 0.803), and tumor-infiltrating lymphocytes (P = 0.069). Melanoma-specific mortality rates increased significantly with the presence of intraocular LYVE-1(+)/podoplanin(+) lymphatic vessels (P = 0.008). By multivariate Cox regression, tumor size (hazard ratio, 14.40; P = 0.002), and presence of intraocular lymphatic vessels (hazard ratio, 8.09; P = 0.04) were strong prognostic predictors of mortality. Conclusions: Intraocular peritumoral lymphangiogenesis seems to be associated with an increased mortality risk in patients with ciliary body melanomas and extraocular extension. This association may be primarily because of an association of intraocular lymphangiogenesis with greater tumor size and increased malignancy. Financial Disclosure(s): The authors have no commercial or proprietary interest in any of the materials discussed in this article. Ophthalmology 2010; 117: 334-342 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05a003f5ad21c39cd48f55b40d76a501",
  "timestamp": "2025-05-15T03:04:22.969061"
}