{
  "id": 6007,
  "title": "THE RELATIONSHIP BETWEEN BANKING RISKS UNDER THE CRISIS: EMPIRICAL ASSESSMENT POST-SOVIET COUNTRIES DATA",
  "abstract": "The study aims to substantiate the mutual influence of banking risks during the financial crisis by the empirical assessment of data from post-Soviet countries. Empirical substantiation of the mechanism of mutual banking risks within the crisis periods was based on a consecutive verification of the statistical significance of regression models. Firstly, the influence of foreign exchange risk on credit risk and liquidity risk is determined. Secondly, the causality between liquidity risk and credit risk is checked. Next, the impact of foreign exchange, credit and liquidity risks on interest rate risk is evaluated. As a result, the influence of the specified banking risks on solvency is determined, which is evaluated in this study by the indicator of equity capital adequacy. The results of the analysis have proved that in the post-Soviet economies (except the Baltic countries), foreign ex-change risk caused an increase in credit risk and did not have a statistically significant effect on liquidity risk. An in-crease in credit risk caused an increase in banking liquidity, which revealed the effect of replacing income assets with liquid ones during the crisis. The level of liquidity affects the interest rate risk (spread level); in Ukraine, the level of the spread is also negatively affected by credit risk. The level of solvency of banks is determined by their liquidity. In post-Soviet developing countries, the level of solvency is negatively affected by credit risk. The economic literature pays the main attention to the formalization of relationships between credit and interest risks, between credit risk and liquidity risk. In this aspect, we expanded the object of scientific research on banking risks, as we considered the empirical relationships between the main types of banking risks. The obtained empirical results can be useful for regulatory authorities when strategizing micro- and macro-prudential policy instruments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05a6f7e483f6d4c29264ddf75c592de8",
  "timestamp": "2025-05-15T02:53:33.501843"
}