{
  "id": 2779,
  "title": "Enhanced algorithmic modelling and architecture in deep reinforcement learning based on wireless communication Fintech technology",
  "abstract": "Financial technology or FinTech refers to use of information technologies to derive financial solutions. FinTech is now widely regarded as a hotly debated blend of financial services and information technology. A combination of AI and IoT approaches will significantly increase the extraction of valuable financial data as well as provide better services to customers. This research proposed a novel protocol in data transmission using fuzzy rule-based secure transmission with data optimization technique using deep reinforcement neural network by wireless communica-tion. This technique for data transmission will reduce the credit risk and enhances the data optimization by fuzzy rule-based protocol with DRNN. The logic utilized is fuzzy logic, which is a multi-valued logic with truth values for variables ranging from 0 to 1. When truth values range from entirely true to completely false, it is used. The end user's searching experience is improved by fuzzy logic-based semantic search, which finds and retrieves exact matching files for relevant search files provided by user. When exact matches aren't possible, method leverages semantic similarities to determine most relevant matches. A grading method is utilized to minimize number of false positives. For this, proposed technique was used, which may decide on a collection of suitable storage servers on which the data must be saved and resulting in a reduction in execution time while maintaining a higher level of security. The experimental results show the execution time of 54 %, network performance of 96 %, the overall complexity of 71 %, data optimization of 95 % and end-end delay of 67 %.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05b3f79eb787cc94bd6b3e684e2941fd",
  "timestamp": "2025-05-15T02:19:08.433317"
}