{
  "id": 3373,
  "title": "Financial Metrics and Environment, Social, Governance (ESG) Performance: A Cross Border Comparison of China and the UK Construction Industries",
  "abstract": "Environmental, social, and governance (ESG) performance has become a pivotal factor for multinational corporations, especially within resource-intensive sectors like construction. This study explores how financial indicators-specifically liquidity, profitability, and leverage ratios-influence ESG outcomes under differing institutional conditions in China and the United Kingdom. Employing a quantitative approach via ridge regression analysis on data from 96 construction firms, the research identifies key financial predictors of ESG performance and develops a predictive model to assess cross-regional applicability. The results demonstrate that liquidity and profitability are significant drivers of ESG outcomes, with their impact varying according to institutional frameworks-where regulatory compliance and government incentives dominate in China, and market-driven pressures prevail in the UK. Although the predictive model exhibits strong accuracy, it also underscores the contextual sensitivity of financial metrics in shaping ESG practices. The extent to which ESG serves as a stabilising force or an amplifier of financial risk depends on disclosure levels and the deeper integration of ESG principles into corporate strategy, risk management, and capital allocation. These findings contribute to sustainable finance and resource dependence theories, offering opportunities for policymakers to refine ESG disclosure frameworks, investors to pinpoint financially resilient ESG leaders, and construction firms to align their financial strategies with sustainable development goals.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05b4c6a2f2df201c807119ad08889894",
  "timestamp": "2025-05-15T02:25:40.094500"
}