{
  "id": 8338,
  "title": "Impacts of macroeconomic factors during COVID-19 pandemic on property loan impairments and overhang: case study of Malaysia",
  "abstract": "PurposeThe COVID-19 pandemic has profoundly impacted the global economy, disrupting supply chains, causing job losses and altering consumer demand. In Malaysia, the real estate sector has been notably affected, with increased property impairments and overhang due to unprecedented uncertainty. Understanding these effects is crucial for policymakers and investors to prevent real estate and banking crises. This study aims to analyse the relationships between macroeconomic factors during the pandemic on property impairments and overhang, providing insights for maintaining macroeconomic stability. The findings will inform strategies for mitigating economic shocks, identifying opportunities, and guiding real estate policies in Malaysia and potentially globally.Design/methodology/approachThis research article uses a time series ARDL regression analysis to examine pivotal macroeconomic factors including income, housing process, interest rates and unemployment on property loan impairments and property supply overhang in Malaysia. ARDL is effective to measure and analyse time series data, especially to understand the lagged impacts of macroeconomic factors. This can be seen by various economists in analysing macroeconomic factors affecting non-performing loans or the real estate finance using regression analyses both in Malaysia and other regions. The observations are gathered before, during and after the COVID-19 pandemic, spanning a five-year period with monthly frequency from 2018 to 2022.FindingsThe study emphasizes the critical importance of effectively managing unemployment and implementing policy interventions, such as moratoriums, to stabilize the economy and reduce the risk of loan impairments during crises like the COVID-19 pandemic. Additionally, this study highlights a significant inverse relationship between income per capita and loan impairments, underscoring the necessity for policies that promote economic growth and income equality. Initiatives targeting job creation, education and skills development can elevate income levels, thereby decreasing loan impairments. Lower lending interest rates during the pandemic also help mitigate the risk of loan impairments by facilitating borrowing, stimulating economic activity and enhancing financial well-being. Furthermore, the study suggests that while lower interest rates incentivize property developers and investors, understanding the intricate interaction between housing prices and supply is crucial for policymakers and stakeholders to effectively manage the housing market and ensure adequate housing supply, especially during crises.Research limitations/implicationsThis paper provides insight for policymakers, regulators, investors and property consultants into the dynamic effects of key macroeconomic factors amidst a global recession in how they impact the real estate market with regards specifically to all types of property loan impairments and property supply overhang. The observations are limited to the COVID-19 period, spanning five years with monthly data from 2018 to 2022. This understanding can facilitate the development of targeted strategic monetary policies and investment decisions in case of future recessions.Practical implicationsPolicymakers should prioritize initiatives such as moratoriums and job creation programs to mitigate economic downturns. Additionally, financial institutions need to adjust lending practices in response to lower interest rates, while stakeholders in the housing market must understand the complex dynamics between housing prices and supply to ensure a balanced market. Overall, addressing underlying economic factors and implementing targeted policies are essential for building resilience and promoting sustainable economic growth amidst challenging circumstances.Social implicationsInitiatives aimed at fostering income equality, creating employment opportunities and ensuring housing accessibility contribute to greater social cohesion and well-being. By promoting financial inclusion and building resilience to crises, societies can mitigate the adverse social impacts of economic challenges such as unemployment and housing affordability. Overall, addressing socioeconomic disparities and promoting inclusive growth are essential for fostering a more equitable and resilient society.Originality/valueThe originality and uniqueness of this study lie in its comprehensive analysis of the impact of COVID-19 on loan impairments and housing supply. While previous studies have focused on the pandemic's effects on specific segments of the real estate market or property prices, this study provides a broad overview of its impact on property loan impairments and housing supply overhang. Finally, this study highlights the social and practical implications. Overall, this study offers a distinctive analysis of COVID-19's impact on the real estate market and its implications for policymakers, real estate professionals and investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05b8576786dbee7829852d8fd0fd1530",
  "timestamp": "2025-05-15T03:17:49.146615"
}