{
  "id": 8677,
  "title": "Prevalence of gambling disorder and its correlates among homeless men in Osaka city, Japan",
  "abstract": "Internationally, the prevalence of gambling disorder has been reported to be higher among homeless people than the general population; however, little is known about the factors associated with gambling disorder in this population. The present study aimed to investigate the prevalence of gambling disorder and its associated factors among homeless men using shelters in Osaka City. A cross-sectional survey was conducted from 30 to 2018 to 4 January 2019, using the 2017 Japanese National Survey of Gambling (JNSG) questionnaire, supplemented with questions about homeless experiences, drinking, and smoking. Using the South Oaks Gambling Screen, the presence of gambling disorder was determined by a score >= 5 out of 20. Multivariate logistic regression was conducted to explore factors associated with lifetime gambling disorder. Lifetime and past-year prevalence of gambling disorder among 103 participants was 43.7% (95% confidence interval [CI]: 34.5-53.3) and 3.9% (95% CI: 1.5-9.6), respectively, which are higher than the 6.7% and 1.5% found among men in the 2017 JNSG. Reasons reported for currently gambling less were primarily financial. Factors associated with lifetime GD included more than 20 years since the first incidence of homelessness (adjusted odds ratio [AOR]: 4.97, 95% CI: 1.50-16.45) and more than five incidences of homelessness (AOR: 4.51, 95% CI: 1.06-19.26). When homeless individuals with gambling disorder try to rebuild and stabilize their lives, the presence or resurgence of gambling disorder may hinder the process and pose a risk of recurring homelessness. Comprehensive support services for homeless individuals with gambling disorder are required. (250 words)",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05ba4b36567aa380b0938100b151531a",
  "timestamp": "2025-05-15T03:21:24.647424"
}