{
  "id": 8139,
  "title": "Applicability of Technology Maturity Level Evaluation Methodologies within Small- and Medium-Sized Organizations: Prospects and Proposals",
  "abstract": "Most industrial companies (e.g., SMEs or start-ups) have very limited assets (time, human, and financial efforts, etc.) for the development of their R & D projects. To be competitive, these organizations must carefully evaluate the feasibility of their R & D projects and select the one that best suits their business priorities and their needs. Introducing new technologies can provide a significant competitive advantage, but it also involves risk. Moreover, in accessing public funding, the maturity level of a technology is one of the factors to be considered in terms of access to specific calls for proposals. In recent times, one of the most common measures to assess the maturity of a technology is based on the concept of technology readiness level (TRL), which allows the classification of the technology according to its maturity (research, development, or market readiness of the solution). But it has some drawbacks related to the SMEs' lack of specialized resources and the subjectivity of the current assessing methods. Determining the TRL of a given technology in an objective way, based on indicators, would be of great help for the formulation of R & D projects. This paper considers whether it is possible to use existing methodologies for the determination of the TRL from indicators in organizations with limited access to bibliographic resources. Based on the state-of-the-art, modifications of the methodologies will be proposed to make them applicable to organizations with fewer resources. The outcome of this study will form the basis of a novel approach to achieve a more appropriate methodology for these organizations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05d2e630d8231e6a265ac98047e21c60",
  "timestamp": "2025-05-15T03:15:38.401282"
}