{
  "id": 5331,
  "title": "A new risk measurement method for China's carbon market",
  "abstract": "Carbon markets were set up with the aim to achieve carbon reduction target and sustainable development. However, market risk has become one of the key factors influencing continuous development of carbon markets. Different from traditional financial asset price, carbon price has a heterogeneous characteristic in its tail distribution. The current value at risk (VaR) model with student t or generalized error distribution (GED) cannot describe the asymmetric tail distribution of carbon price. Therefore, this article propose to develop a combined model for China's carbon market risk measurement. First, extend generalized autoregressive conditional heteroscedasticity (GARCH) with standardized standard asymmetric exponential power distribution (SSAEPD) to reflect volatility clustering phenomenon and heterogeneous distribution character of China's carbon price. Then, genetic algorithm (GA) was innovatively used to solve GARCH-SSAEPD linear programming instead of interior-point algorithm. Finally, use VaR to measure the carbon market risk. The new model (GARCH-SSAEPD-GA-VaR) is implied to China's carbon market and compared with the traditional GARCH-VaR model, the empirical results show: (a) Compared with current VaR framework, the GARCH-SSAEPD-GA-VaR model we constructed can help describe the heterogeneous tail distribution of carbon price and help increase the precision of carbon market risk measurement. (b) SSAEPD can capture fat-tail, asymmetric effects of China's carbon price more entirely, which puts forward a new method to study the evolvement laws of carbon market risk. (c) GA is effective to achieve global optimum to some extent in parameter estimation. This study contribute to developing theory and methodology of describing particularity features of carbon price, increasing the accuracy of carbon market risk measurement and provide a new perspective for investigating the evolvement regularity of China's carbon market risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "05d89d74d47bb2f15afc3d52d3ecc8e1",
  "timestamp": "2025-05-15T02:46:44.892833"
}