{
  "id": 8694,
  "title": "COVID-19, clean energy stock market, interest rate, oil prices, volatility index, geopolitical risk nexus: evidence from quantile regression",
  "abstract": "PurposeThe outbreak and the spreading of the COVID-19 pandemic have impacted the global financial sector, including the alternative clean and renewable energy sector. This paper aims to assess the impact of the pandemic, COVID-19 on the stock market indices of the clean energy sector using quantile regression methods.Design/methodology/approachThis study utilized daily data sets on the four major categories of stocks: (1) Morgan Stanley Capital International Global Alternative Energy Index, (2) WilderHill Clean Energy Index, (3) Renewable Energy Industrial Index (RENIXX) and (4) the S&P 500 Global Clean Index. The study adopts a multifactor capital asset pricing model.FindingsClean and alternative energy stocks are powerful instruments for diversification. However, the impact of the volatility index induced by infectious disease is negative and significant across quantiles.Practical implicationsFor investors and policymakers, considering how the uncertainty caused by COVID-19 and the geopolitical index influences renewable energy markets is of great practical importance. For investors, it throws insights into portfolio diversification. For policy makers, it helps to devise strategies to reboot the economy along the lines of the deployment of renewables. This study sheds light on a global green-energy transition and has practical implications for renewable energy resilience in post-pandemic times.Originality/valueThis paper can be considered as a pioneer that explores the nexus between oil prices, interest rates, volatility index, and geopolitical risk upon the stock indices of clean and alternative sources of (renewable) energy in the COVID-19 pandemic situation. The results have important insights into the area of energy and policy decision-making. Additionally, the paper's novelty lies in using the explanatory variables associated with the Covid 19 pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "060257db432adb3bf6456323d45ebb09",
  "timestamp": "2025-05-15T03:21:24.698009"
}