{
  "id": 6074,
  "title": "THE IMPACT OF INSTITUTIONAL ENVIRONMENT ON RISK ASSESSMENT",
  "abstract": "The purpose of this research is to investigate the relationship between the institutional environment of the studied countries and the Coface Country Risk Assessment. To meet this object, we used quantitative methods in the form of descriptive and regression analysis. The result was an evaluation of the actual Coface Country Risk Assessment and its value prediction for chosen countries. The authors quantified the impact of the institutional environment using The Heritage Index of Economic Freedom subindexes on the risk assessment indicator of the major private insurance company Coface, which is not so often used in the scientific sphere and is regularly updated. The results suggest a positive correlation between the Coface Country Risk Assessment and Government Integrity, Fiscal Health, Financial Freedom and Property Rights. Although Tax Burden is a statistically significant factor, its parameter was detected with an unexpected sign. For this reason, authors abstracted from it. Subindexes Government Spending, Business Freedom, Monetary Freedom, Trade Freedom, and Investment Freedom were statistically insignificant. Control variable Public Debt as a share of gross domestic product was insignificant as well. Implications for Central European audience: The article applies the Coface Country Risk Assessment, which has so far been rarely used in the scientific literature. We present the current and predicted values of the Central European Countries, but also the countries interesting from their point of view due to trade and investment opportunities. Many countries, including those in Central Europe, show differences between actual and predicted values.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0625a4d7f229abb6fa6ed8f54b09b473",
  "timestamp": "2025-05-15T02:54:38.746544"
}