{
  "id": 2519,
  "title": "ESG stock markets and clean energy prices prediction: Insights from advanced machine learning",
  "abstract": "In the post-Paris agreement, the clean energy market has grown significantly due to its undeniable environmental sustainability. Therefore, this study aims to predict clean energy stock prices by analyzing ESG stock markets in ten countries using a batter of machine learning (ML) techniques and NGBoost. The analysis integrates Shapley Additive Explanations (SHAP) values to improve interpretability, offering insights into model performance. The dataset spans from January 1, 2014, to September 22, 2023, covering global crises such as the COVID-19 pandemic and the Russia-Ukraine conflict. Results indicate that NGBoost outperforms other models, with a significant correlation between clean energy stock prices and ESG market variables. Notably, ESG markets in India and the USA show strong predictive power for clean energy stocks, while those in Australia and South Africa contribute less. These findings underscore the potential of ML techniques in forecasting clean energy equity trends, providing insights for investors, policymakers, and venture capitalists. The study highlights the importance of considering the degree of market connectivity in portfolio construction, emphasizing a shift from traditional investments to sustainable ones like clean energy. This research adds value to clean energy market analysis by incorporating advanced ML methods and SHAP values, especially during periods of global disruption. These results are important for asset allocation and risk management, supporting investors in transitioning from ordinary to sustainable investments.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "062adfe8873059c268f5fbc5c4a02cef",
  "timestamp": "2025-05-15T01:07:35.738396"
}