{
  "id": 5802,
  "title": "Effect of supplementary private health insurance on out-of-pocket inpatient medical expenditure: evidence from Malaysia",
  "abstract": "The vital role of healthcare financing in achieving universal health coverage is indisputable. However, most countries, including Malaysia, face challenges in establishing an equitable and sustainable healthcare financing system due to escalating healthcare costs, an ageing population and a growing disease burden. With desirable pre-payment and risk pooling features, private health insurance (PHI) is considered an alternative financing option to reduce out-of-pocket (OOP) medical expenditure. However, ongoing theoretical and empirical debates persist regarding the adequacy of financial risk protection provided by PHI largely because it depends on its role, the benefit design and the regulations in place. Our study aimed to investigate the effect of supplementary PHI on OOP inpatient medical expenditure in Malaysia. Secondary data analysis was conducted using the Malaysian National Health and Morbidity Survey 2019 dataset. A total of 983 respondents with a history of inpatient hospitalization in the past 12 months were included in the study. Instrumental variable analysis using a two-stage residual inclusion was performed to address endogeneity bias, with wealth status and education level as the instrumental variables. Tobit regression model was used in the second stage considering the censored distribution of the outcome variable. Missing data were handled using multiple imputation. About one-fifth of the respondents had PHI. In this study, we found that having PHI significantly increased OOP inpatient medical expenditure in all three marginal effects. Additionally, age, residential location, ethnicity (citizenship), being covered by government guarantee letter, government funding and employer-sponsored health insurance were other significant factors associated with OOP inpatient medical expenditure. Our findings undermine a key justification to advocate PHI uptake among the population, with a need for the Malaysian government to reassess the role of PHI in healthcare financing and reconsider PHI subsidization policy. Regulations should also be strengthened to enhance the financial risk protection provided by PHI.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0630105da4bd4daaf8b70991def3e108",
  "timestamp": "2025-05-15T02:51:30.102496"
}