{
  "id": 1715,
  "title": "Research on Financial System Safety Performance under the Basis of Data Mining Environment",
  "abstract": "The daily business operation of financial industry makes the abundant data collected by information system piling and expanding, which results in the existed relations and regulations in date can't be identified in time that makes many valuable information hiding inside but being ignored or omitted. At the same time, if these magnanimity data cannot be effectively managed, the risk hiding in data can't be avoided in time and the high security of finance can't be reached. Therefore, this essay analyzes and researches the application in financial industry and existing problem based on data mining technology, whose objective is highlighting the advantage effect of it in data processing of financial industry and avoiding financial risk. Financial data are collected by many organizations like banks, stock exchange authorities, taxation authorities, big accounting and auditor offices specialized data bases, etc. and in some cases are publicly available. The application of data mining techniques on financial data can contribute to the solution of classification and prediction problems and facilitate the decision making process. Typical examples of financial classification problems are corporate bankruptcy, credit risk estimation, financial distress and corporate performance prediction.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0641e1a6293217d3ed442019c998b5fe",
  "timestamp": "2025-05-15T02:06:52.644796"
}