{
  "id": 8460,
  "title": "Parent-Adult Child Relationships and Repartnering After Gray Divorce",
  "abstract": "Objectives The rise in gray divorce has catalyzed repartnering in later life. However, the antecedents of older adult repartnering remain poorly understood, particularly the potential role of adult children. A form of ambiguous loss, marital disruption often leads to family boundary ambiguity, thereby weakening family ties. We investigated whether co-residence and proximity of, frequent contact with, and downward transfers to adult children were negatively associated with repartnering after gray divorce.Methods Data from the 1998 to 2018 Health and Retirement Study were used to estimate discrete-time event history models using logistic regression to predict repartnering after gray divorce among parents of adult children (N = 1,359).Results As expected, adult child co-residence as well as having a child who lived nearby and had frequent contact diminished the likelihood of repartnering. Parents whose children either did not live nearby or were nearby but did not have frequent contact were more likely to repartner than those with children nearby and in frequent contact or co-residing, signaling that both proximity and frequency of contact are related to repartnering. Additionally, the provision of financial support to adult children was associated with a lower risk of repartnering.Discussion Relationships with adult children shape parental repartnering behaviors. Echoing the concept of boundary ambiguity, our findings indicate that stronger family ties, as signaled by child co-residence or proximity and frequent contact as well as economic provision, tend to deter repartnering. These findings also indicate that absent strong family ties, older adults are more likely to form a new union.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "064300a91104e60fce11c7a720b5c914",
  "timestamp": "2025-05-15T03:18:51.761570"
}