{
  "id": 4023,
  "title": "The informativeness of the top holdings of Chinese equity mutual funds",
  "abstract": "PurposeThis study aims to determine whether the stock holdings of equity mutual funds are informative for predicting future stock performance in the Chinese market. It is a puzzle that actively managed mutual funds underperform passive benchmarks, whereas retail investors still delegate investment decisions to the fund managers. The present study sheds light on whether mutual fund managers possess security selection skills in their top ten holdings.Design/methodology/approachBy regression analysis and portfolio sorting, this study focuses on 830 Chinese A-share stocks in the industry research reports from the Guotai Junan Securities Company. It collects mutual fund's top ten holdings data from the Wind Financial Terminal between 2019Q1 and 2021Q1. As robustness checks, the result holds for the fixed-effect model, an additional measure of ranks in the top ten holdings, the predictability test based on the confusion matrix and two stage least square (2SLS) regression.FindingsThe authors find that the top ten holdings by equity mutual funds are informative for predicting stock performance and can provide valuable information for investors to support their decision-making.Practical implicationsThe findings of this study provide insightful guidance for retail investors in making investment decisions and support the hypothesis that active fund management adds value.Originality/valueFirstly, the authors find that the top ten holdings of Chinese mutual funds show significantly positive signals for future stock excess returns, indicating the selection skills of fund managers. Secondly, the above positive relationship exhibits a diminishing marginal effect with more funds holding this stock. Thirdly, the authors find that the predictability horizon of the number of overweighing funds is up to three quarters and then diminishes in the fourth quarter. Finally, investors have a 59% prediction accuracy for the whole stock sample and an 85% precision conditional on the predicted positive subsample to outperform the market. The authors also address the endogeneity and reverse causality issues.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0653862abed7f1e4c61fdea143175ac1",
  "timestamp": "2025-05-15T01:23:07.364045"
}