{
  "id": 4295,
  "title": "Association of financial status and the quality of life in Chinese women with recurrent ovarian cancer",
  "abstract": "Background: Very few studies have examined the association between financial status and the quality of life (QOL) of patients with specific cancers. Ovarian cancer survivors frequently suffer repeat recurrence and subsequent treatment and, as a result, a significant added financial burden. Financial burdens disproportionally affect patients of low income. This study examines the association between financial status, based upon family income and expenses, and QOL in Chinese women with recurrent ovarian cancer. Methods: We assessed baseline and follow-up (3-month) QOL of Chinese women with recurrent ovarian cancer using the European Organization for Research and Treatment of Cancer 30-Item Core Quality of Life Questionnaire (EORTC QLQ-C30), and the Quality of Life Ovarian Cancer 28 Questionnaire (QLQ-OV28). Financial status was stratified based upon self-reported disposable income. Linear or logistic regression models were applied to determine the relationship between QOL in each financial status category, and key demographic and clinical factors. Results: Among all 473 ovarian cancer patients, 123 of them met enrollment criteria were recruited to this study and completed baseline questionnaires; 95 of these patients completed the 3-month follow-up questionnaires. Our results showed that low financial status was significantly associated with worse QOL on all functioning domains and several symptom domains. QOL deteriorated during the follow-up. A significantly greater number of patients with low financial status experienced deteriorating QOL in several domains. Occupation and insurance type, two factors related to financial status, were significantly associated with QOL as well, but to a lesser extent. Education, recurrence interval, age and BMI were also significantly related to certain domains of QOL. Conclusions: Financial status is associated with QOL of Chinese women with recurrent ovarian cancer. These patients showed worsening QOL during active chemotherapy. Lower financial status is associated with a higher risk of deteriorating QOL in several domains.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "065f295e0a5176b959a62bc2c5688f14",
  "timestamp": "2025-05-15T02:35:26.306331"
}