{
  "id": 8239,
  "title": "The Impact of Household Economic Deterioration Caused by the COVID-19 Pandemic and Socioeconomic Status on Suicidal Behaviors in Adolescents: A Cross-sectional Study Using 2020 Korea Youth Risk Behavior Web-based Survey Data",
  "abstract": "Objectives: Economic hardship has a serious impact on adolescents' mental health. The financial impact of the coronavirus disease 2019 (COVID-19) pandemic was more severe for low-income families, and this also impacted adolescents. This study aimed to examine the associations of economic deterioration (ED) caused by the COVID-19 pandemic and low socioeconomic status (SES) with adolescents' suicidal behaviors.Methods: This study analyzed data from the 2020 Korea Youth Risk Behavior Web-based Survey, which included 54 948 middle and high school students. Odds ratios (ORs) of suicidal ideation, suicidal planning, and suicide attempts related to ED and SES were calculated using multivariable logistic regression. We calculated relative excess risks due to interaction to assess additive interactions. Results: The ORs for suicidal ideation, suicidal planning, and suicide attempts related to combined severe ED and low SES were 3.64 (95% confidence interval [CI], 3.13 to 4.23), 3.88 (95% CI, 3.09 to 4.88), and 4.27 (95% CI, 3.21 to 5.69), respectively.Conclusions: ED and low SES were significantly associated with suicidal behaviors in adolescents. Although no significant additive interaction was found, the ORs related to suicidal ideation, suicidal planning, and suicide attempts were highest among adolescents from low-income families with severe ED. Special attention is needed for this group, considering the increased impact of economic in- equality due to the COVID-19 pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0661abf485e68f981c34a643f9d1c0d2",
  "timestamp": "2025-05-15T03:16:48.972011"
}