{
  "id": 7292,
  "title": "Sarcopenia and coronary heart disease synergistically increase the risk of new onset depressive symptoms in older adults",
  "abstract": "Background Coronary heart disease (CHD), sarcopenia and depression are common disorders that markedly impair quality of life and impose a huge financial burden on society. They are also frequently comorbid, exacerbating condition and worsening prognosis. This study aimed to investigate the additive effects of CHD and sarcopenia on the risk of new onset depressive symptoms in older adults. Methods The prospective cohort study comprised 897 Chinese community-dwelling participants who were aged 60 years and older (386 men; mean age 66.9 +/- 5.9 years) without depressive symptoms at baseline, recruited from Chadian of Tianjin, China. Sarcopenia was defined according to the Asian Working Group for Sarcopenia (AWGS) criteria. CHD was identified via medical records or new diagnosed by at least two physicians. Depressive symptoms were assessed using the Geriatric Depression Scale (GDS) >= 11. Longitudinal data on new onset depressive symptoms were collected up to 12 months after baseline. Results We found that 103 (11.5%) of the 897 participants without depressive symptoms at baseline had developed depressive symptoms. Participants were classified into mutually exclusive groups based on sarcopenia status and CHD: normal, CHD alone, sarcopenia alone, and co-occurring groups. A logistic regression showed that the CHD alone [odd ratios (OR) = 1.78, 95% confidence interval (CI) = 1.05-3.02], sarcopenia alone (OR = 2.79, 95% CI = 1.26-6.22), and co-occurring (OR = 7.19, 95% CI = 2.75-18.81) had higher risk of depressive symptoms than the normal group after adjusting for the covariates. Conclusions CHD and sarcopenia synergistically increase the risk of new onset depressive symptoms in older adults. Thus, older adults may require early detection, and appropriate interventions should be implemented.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "066ca05ec3e87d34b385e72334b81de5",
  "timestamp": "2025-05-15T03:07:02.648187"
}