{
  "id": 6643,
  "title": "The exports-exchange rate volatility nexus in Pakistan: do financial constraints and financial development matter?",
  "abstract": "Purpose This paper first examines how changes in the real effective exchange rate and its volatility affect the exporting activities of firms. Next, it investigates whether exchange rate volatility (EXRV) affects the export behavior of financially constrained and unconstrained firms differently. Finally, it examines the role of financial development in mitigating the effects of EXRV and financial constraints on firms' exports. Design/methodology/approach The empirical analysis of the paper is based on a wide panel of Pakistani nonfinancial firms listed at the Pakistan Stock Exchange during the period 2001-2016. To mitigate the problem of endogeneity and to take into account the dynamic nature of the empirical model, the authors apply the robust two-step system-GMM estimator developed by Blundell and Bond (1998). To examine the role of credit constraints, firm-year observations are sorted as financially constrained and unconstrained based on the median value of three alternative measures: the liquidity ratio, the dividend payout ratio and the Whited and Wu (WW) index. Findings The results reveal that an increase in the real effective exchange rate has a positive and significant impact on firms' exports. However, the results show that the EXRV is significantly and negatively related to exporting decisions, suggesting firms considerably decrease their exports during periods of increased unpredictable variations in exchange rates. The findings also suggest that compared to financially constrained firms, the adverse effect of EXRV on exports is weaker for financially unconstrained firms. This finding implies that firm-level financial constraints unfavorably impact exports by making exporting more sensitive to the EXRV. Finally, the findings indicate that financial development not only positively affects firms' exports but also plays a vital role in declining the adverse effects of EXRV on firm-level exports. Specifically, the results show that financial development decreases the negative impact of EXRV on exports for both financially constrained and unconstrained firms. However, the moderating role of financial sector development is higher for financially unconstrained firms. Research limitations/implications Notwithstanding that the authors present robust and strong empirical evidence of the effects of EXRV on exporting and on the role of both firm-level financial constraints and financial sector development in formulating these effects, there are some limitations of the study. The authors use a single proxy for measuring financial sector development. However, one may construct an index for the financial sector developed using principal component analysis (PCA) by considering different measures of financial development. The authors use three different measures of financial constraints. Nonetheless, more sophisticated techniques such as switching regression can be used to endogenously determine whether firms are financially constrained. Moreover, an examination of the asymmetric effects of EXRV on exporting across different industries would also be worthwhile. Practical implications From a policy point of view, the results suggest that the development of the financial sector and the strategies to lessen credit constraints faced by firms will help in mitigating the adverse effects of the EXRV on the exporting behavior of firms in Pakistan. The findings also suggest that managers in financially constrained firms should apply appropriate hedging strategies to hedge exchange rate risks. Finally, the findings suggest that investors should take into consideration exchange rate dynamics and firms' financial constraints while investing in exporting firms' stocks. Social implications Since the findings suggest that financially constrained firms' exports are more exposed to EXRV, managers of such exporting firms are suggested to apply effective and suitable currency risk-minimizing hedging instruments for enhancing their exports. The government should also implement economic and financial policies in such a way that they should help in reducing volatilities of exchange rates and in turn, encouraging firms to export more. Definitely, any policy, at both government and firm level, favoring exporting and export-oriented growth will not only help in overcoming the problem of a persistent and wide trade deficit but also help society by providing more employment and investment opportunities. Originality/value Recently, Pakistan has experienced significant declines in foreign reserves, persistent political unrest and enlarged trade deficits. All these have increased the uncertainty about the exchange rate. Therefore, it is valuable to know the EXRV effects on firms' exporting activities. Second, Pakistani firms face more financial constraints, and thus, the influence of financial constraints in formulating the volatility effects on exporting would be worth exploring. Finally, no research has yet taken place to scrutinize the role of financial development in mitigating the adverse effects of EXRV and financial constraints on exporting activities. This paper provides firsthand empirical evidence on the role of financial constraints and financial sector development in formulating the EXRV impacts on firm-level exports in Pakistan.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "067045a15c20b97ae066859d6d2b0519",
  "timestamp": "2025-05-15T03:00:05.024113"
}