{
  "id": 8205,
  "title": "Firm Performance during COVID-19 Pandemic: Does Ownership Identity Matter? Evidence from Indonesia",
  "abstract": "This study aimed to examine the importance of shareholder identity in improving company performance during shock events such as the COVID-19 pandemic. The outbreak poses threats and opportunities for businesses in various countries including Indonesia. Subsequently, companies must adapt to address the consequences of the economic disruption and lockdown policies imposed by the local government. The study sample comprised companies listed on the Indonesia Stock Exchange (IDX) during the COVID-19 pandemic from 2020 to 2021. Fixed effects model regression was employed to examine the effect of family, government, and institutional ownership on company performance. The results showed that family and institutional ownership positively affected company performance during the pandemic. The mechanisms of direct supervision and control by family members could potentially increase the benefits of their businesses. Furthermore, high institutional ownership makes the role of investors substantial in reducing business risk and increasing company performance. Furthermore, the results revealed that government ownership negatively affected company performance. As owners, the government has different strategic objectives, where companies are more oriented toward better public services than financial gains. Therefore, it is essential to consider the impact of shareholder involvement on company performance, especially during a pandemic because they are treated differently. The research suggests that organizations are responding and adapting to the uncertainties in the business environment they face through a variety of mechanisms, including developing public and corporate governance strategies to prepare for and respond to future emergencies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06749eb4d8b941b55816ae34c15a8760",
  "timestamp": "2025-05-15T03:16:17.452101"
}