{
  "id": 3742,
  "title": "Corporate board vigilance and insolvency risk: a mediated moderation model of debt maturity and fixed collaterals",
  "abstract": "Studies indicate that a consistent rise in insolvency risk should be addressed at the strategic level. Vigilant boards can use leverage maturity structure as a tool to control insolvency risk. However, according to the information asymmetry theory, leverage acquisition is subject to the presence of fixed assets which can be used as collateral. The current study focuses on the relationship between board vigilance and insolvency risk, mediated by debt maturity and moderated by fixed collaterals in Pakistan based non-financial firms. A data set of 284 firms is constructed between the years 2013 and 2017. Hierarchical multiple regression analysis is used to test the proposed hypothesis using ordinary least squares (OIS) and panel corrected standard errors (PCSE) regression estimators. The results indicate that debt maturity mediates the relationship between board vigilance and insolvency risk. New information is generated about the fixed collaterals, and these negatively moderate the relationship between leverage maturity and emerging market z- score indicating inefficiency in the usage of fixed assets as collaterals. These results are robust to both regression techniques confirming that the non-productive fixed collaterals overshadow the positives of tangible assets in asset structure.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0685a5775f77d336e0e2f6e72a48fa43",
  "timestamp": "2025-05-15T02:29:28.050244"
}