{
  "id": 5957,
  "title": "Volatility clustering, risk-return relationship and asymmetric adjustment in the Finnish housing market",
  "abstract": "Purpose The purpose of this paper is to examine whether the house prices in Finland share financial characteristics with assets such as stocks. The studied regions are 15 main regions in Finland over the period of 1988:Q1-2018:Q4. These regions are divided geographically into 45 cities and sub-areas according to their postcode numbers. The studied type of dwellings is apartments (block of flats) divided into one-room, two rooms and more than three rooms apartment types. Design/methodology/approach Both Ljung-Box and Lagrange multiplier tests are used to test for clustering effects (autoregressive conditional heteroscedasticity effects). For cities and sub-areas with significant clustering effects, the generalized autoregressive conditional heteroscedasticity (GARCH)-in-mean model is used to determine the potential impact that the conditional variance may have on returns. Moreover, the exponential GARCH model is used to examine the possibility of asymmetric effects of shocks on house price volatility. For each apartment type, individual models are estimated; enabling different house price dynamics, and variation of signs and magnitude of different effects across cities and sub-areas. Findings Results reveal that clustering effects exist in over half of the cities and sub-areas in all studied types of apartments. Moreover, mixed results on the sign of the significant risk-return relationship are observed across cities and sub-areas in all three apartment types. Furthermore, the evidence of the asymmetric impact of shocks on housing volatility is noted in almost all the cities and sub-areas housing markets. These studied volatility properties are further found to differ across cities and sub-areas, and by apartment types. Research limitations/implications - The existence of these volatility patterns has essential implications, such as investment decision-making and portfolio management. The study outcomes will be used in a forecasting procedure of the volatility dynamics of the studied types of dwellings. The quality of the data limits the analysis and the results of the study. Originality/value To the best of the author's knowledge, this is the first study that evaluates the volatility of the Finnish housing market in general, and by using data on both municipal and geographical level, particularly.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0688f71d09bd865f563d580350e2a2ac",
  "timestamp": "2025-05-15T02:53:03.191201"
}