{
  "id": 1699,
  "title": "Counting chickens before the eggs hatch: Associating new product development portfolios with shareholder expectations in the pharmaceutical sector",
  "abstract": "Drug development is the lifeblood of pharmaceutical firms and a critical source of innovation in the healthcare industry. Pharmaceutical firms maintain their competitiveness by continuously developing and introducing new drugs, which requires an efficient new drug portfolio management process. However, the current literature does not elaborate on strategies pertaining to these new drug (product) portfolios (i.e., portfolios of drugs under development), nor does it provide the means with which to understand the future cash flow-generating potential of these portfolio strategies. To address this problem, we propose a set of generic descriptors of new drug portfolio strategies (i.e., portfolio breadth, portfolio depth, blockbuster strategy, and stages of the drug development process) and relate these descriptors to Tobin's q, a forward-looking measure of shareholder expectations. The results of a latent class regression analysis show that shareholder expectations of firms with broad new drug portfolios and potential blockbusters are positive. For most firms, shareholders focus on the final stage of the drug development process and deemphasize portfolio depth. In contrast, for a minority of mostly small firms, shareholders seem to value the earlier stages of the drug development process and stress portfolio depth. (C) 2008 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06ac0033fc3faccc29b5a5b0e7c05a8f",
  "timestamp": "2025-05-15T00:58:50.589540"
}