{
  "id": 4936,
  "title": "The importance of wage loss in the financial burden of illness: Longitudinal evidence from India",
  "abstract": "Background: A key aim of Universal Health Coverage (UHC) is to protect individuals and households against the financial risk of illness, and large-scale health insurance expansions are a central focus of the UHC agenda. Importantly, however, health insurance does not protect against a key dimension of financial risk associated with illness: forgone wage income. In this paper, we quantify the economic burden of illness in India attributable - separately - to wage loss and to medical care spending, as well as differences in them across the socio-economic distribution. Methods: We use data from two longitudinal Indian household surveys: (i) the Village Dynamics in South Asia (VDSA) survey (1300 households surveyed every month for 60 months between 2010 and 2015) and (ii) the Indian Human Development Survey (IHDS) (more than 40,000 households surveyed in 2005 and again in 2011). Our regression models include a series of fixed effects that account for time-invariant household-(or individual-) level and time-varying unobservables common across households. Findings: We find that, in the VDSA sample, wage loss accounts for more than 80% of the total economic burden of illness among the poorest households, but only about 20% of the economic burden of illness among the most affluent. Estimates from the IHDS sample confirm that this socio-economic gradient is present in the Indian population generally. Conclusions: Wage loss accounts for a substantial share of the total economic burden of illness in India - and disproportionately so among the poorest households. Our findings imply that if UHC is to achieve its objective of protecting households against the financial risk of illness - particularly poor households, the inclusion of wage loss insurance or another illness-related income replacement benefit is needed.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06c5be3b2325052c3cef946a989aa33e",
  "timestamp": "2025-05-15T02:42:36.170837"
}