{
  "id": 2613,
  "title": "Trends in Postacute Care Use and Outcomes After Hip and Knee Replacements in Dual-Eligible Medicare and Medicaid Beneficiaries, 2013-2016",
  "abstract": "Question What are the longitudinal trends in the use of postacute care after hip and knee replacement surgery, and in gaps among Medicare patients of different socioeconomic status, under current Medicare payment reforms? Findings This cohort study of 1.3 million Medicare patients who underwent joint replacement found reduced institutional postacute care use, reduced 30-day and 90-day readmission rates, and, among those discharged to a skilled nursing facility, roughly unchanged outcomes during the period from 2013 to 2016. However, Medicare and Medicaid dual-eligible patients had worse outcomes than Medicare-only patients over time. Meaning Future Medicare reforms should be revised to align financial incentives with improved outcomes and equality of postacute and skilled nursing facility care. Importance Several Medicare alternative payment models were implemented in recent years, but their implications for socioeconomic gaps in postacute care (PCA) are unknown. Objectives To determine the longitudinal trends in PCA use and outcomes after hip and knee replacements and in gaps among 3 groups: Medicare-only patients, dual-eligible patients with full Medicaid benefits, and dual-eligible patients with partial Medicaid benefits. Design, Setting, and Participants A cohort study was conducted of PCA use and outcomes among Medicare fee-for-service patients undergoing hip or knee replacement surgery from January 1, 2013, to December 31, 2016, in approximately 3000 hospitals, using Medicare claims, assessment, hospital, and skilled nursing facility (SNF) files. Statistical analysis was performed from October 1, 2018, to December 17, 2019. Main Outcomes and Measures Risk-adjusted differences among dual-eligible groups in institutional PCA use (SNF, inpatient rehabilitation, or long-term hospital care), readmission rate, and payment for readmissions; for patients discharged to a SNF, risk-adjusted differences in SNF quality measured by star ratings, proportion successfully discharged to the community, proportion transitioned to long-stay residence, and SNF length of stay and payments. Results The sample included 1 & x202f;302 & x202f;256 patients (837 & x202f;256 women [64.3%]; mean [SD] age, 75.4 [7.2] years) who underwent joint replacement. The proportion of patients discharged to institutional PCA and the 30-day and 90-day readmission rates decreased for all 3 groups during the period from 2013 to 2016. In 2013, institutional PCA use was 43.7% (95% CI, 43.5%-43.9%) for Medicare-only patients (n = 1 & x202f;182 & x202f;555), 70.1% (95% CI, 69.4%-70.8%; n = 60 & x202f;461) for dual-eligible patients with full benefits, and 70.3% (95% CI, 69.6%-71.0%; n = 59 & x202f;240) for dual-eligible patients with partial benefits; in 2016, the rates decreased to 32.5% (95% CI, 32.4%-32.7%) for Medicare-only patients, 62.3% (95% CI, 61.5%-63.0%) for dual-eligible patients with full benefits, and 61.5% (95% CI, 60.7%-62.3%) for dual-eligible patients with partial benefits. Among patients discharged to SNFs, outcomes remained flat over time. For example, the proportion of patients successfully discharged to the community remained at 80.5% (95% CI, 80.4%-80.7%) for Medicare-only patients, 59.8% (95% CI, 59.3%-60.3%) for dual-eligible patients with full benefits, and 50.0% (95% CI, 49.4%-50.5%) for dual-eligible patients with partial benefits. Multivariable analyses with adjustment for patient, hospital (or SNF), and geographical covariates suggested maintained or enlarged gaps in all outcomes. Conclusions and Relevance This study suggests that, during the period from 2013 to 2016, Medicare patients undergoing hip or knee replacement showed reduced institutional PCA use, reduced readmissions, and, among those discharged to SNFs, roughly unchanged outcomes. However, dual-eligible patients, especially those with partial Medicaid benefits, had persistently worse outcomes than Medicare-only patients. This cohort study examines the longitudinal trends in postacute care use and outcomes after hip and knee replacements and in gaps among 3 groups: Medicare-only patients, dual-eligible patients with full Medicaid benefits, and dual-eligible patients with partial Medicaid benefits.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06e0dfcbf2c32f2549830c230a24d464",
  "timestamp": "2025-05-15T02:17:32.050235"
}