{
  "id": 2795,
  "title": "The effects of promoter share pledging on stock price crash risk and financial performance: empirical evidence from India",
  "abstract": "PurposeDespite the widespread prevalence of share pledging by Indian promoters, this area remains out of the researchers' purview. This study aims to bridge this research gap by delineating the impact of promoter share pledging on future stock price crash risk and financial performance in India.Design/methodology/approachA sample of 257 companies listed on the Standard and Poor's Bombay Stock Exchange 500 (S&P BSE 500) Index has been analysed using panel (fixed-effects) data regression methodology over 2011-2020. Further, alternative proxies for crash risk and financial performance are adopted to ensure that the study's initial findings are robust. Finally, the instrumental variable with the two-stage least squares (IV-2SLS) method has also been employed to alleviate endogeneity concerns.FindingsThe results suggest a significantly positive relationship between promoter share pledging and future stock price crash risk in India. Conversely, this association is significantly negative for future financial performance. Moreover, the results hold, even after including alternative proxies of stock price crash risk and financial performance and addressing endogeneity concerns.Originality/valueOwing to the sizeable equity shareholdings of the promoters, share pledging has remained a lucrative source of finance in India. Despite the popularity, the findings of this study question the relevance of share pledging by Indian promoters considering its impact on aggravating future stock price crash risk and deteriorating future financial performance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06f3e3c9c860b734f285f13922116310",
  "timestamp": "2025-05-15T02:19:08.472717"
}