{
  "id": 2780,
  "title": "Technological innovation and renewable energy consumption: a middle path for trading off financial risk and carbon emissions",
  "abstract": "Global carbon dioxide emissions are on an upward trend, but there have been declines in carbon emissions during financial crises. The possible negative correlation between financial risks and carbon emissions will cause policy makers to face a dilemma when formulating carbon neutral policies. Therefore, it is crucial to find a middle path that can control financial risks while addressing carbon emission reduction, which can help achieve the dual goals of stable economic development and environmental protection. This empirical research studies the linear and non-linear relationships between financial risk and carbon emissions in Organization for Economic Cooperation and Development (OECD) countries, using a panel fixed effects model and a panel threshold regression model. The study further investigates the role of technological innovation and renewable energy consumption in the risk-emission relationship. Key results were as follows. First, the fixed effects model results verify that financial risk has a negative impact on carbon emissions. This relationship may be influenced by technological innovation and energy transition. Second, there is a significant single-threshold effect between financial risk and carbon emissions. When research and development (R&D) expenditures and renewable energy consumption exceed the threshold, there is a significant decrease in the contribution of financial stability to carbon emissions. Third, the slow growth of technological innovation in OECD countries compared to renewable energy consumption highlights that the potential of technological innovation for carbon reduction needs to be further explored. These empirical findings indicate that encouraging technological innovation and accelerating energy transitions would be productive new ways of thinking about the trade-off between controlling financial risk and carbon emission reduction.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "06f97702918ab3d068a989c8e01d26b3",
  "timestamp": "2025-05-15T02:19:08.436957"
}