{
  "id": 40,
  "title": "The Impact of Financial Enterprises' Excessive Financialization Risk Assessment for Risk Control based on Data Mining and Machine Learning",
  "abstract": "The purpose is to make full use of data mining and machine learning technology under big data to improve the ability of trade financial enterprises to cope with the risk of excessive financialization. In view of the above needs, based on previous studies, genetic algorithm (GA), neural network and principal component analysis (PCA) methods are used to collect and process the data, and build a risk assessment model of excessive financialization of financial enterprises. The performance of the model is analyzed through the data of specific cases. The results suggest that the data mining technology based on back propagation neural network (BPNN) can optimize the input variables and effectively extract the hidden information from the data. The specific examples show that most of the current enterprises do not have greater financial risk. However, most of the financial enterprise indexes show that the actual enterprise assets are gradually financialized. The total accuracy rate of financial risk assessment model based on deep belief network (DBN) is over 91%, and the accuracy of the model can reach 80% even if the sample size is small. Therefore, the financial risk assessment model proposed can effectively analyze the relevant financial data, and provide reference for the financial decision-making research of financial enterprises.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "070337cea59f1404d67855d25bafeeba",
  "timestamp": "2025-05-15T01:46:03.862239"
}