{
  "id": 396,
  "title": "Travel behavior and price preferences of bikesharing members and casual users: A Capital Bikeshare perspective",
  "abstract": "Even though casual users of bikeshare account for a large share of ridership and revenue at public bikeshare systems in North America, very little is known about the characteristics and preferences of casual users and how they compare to registered members. The primary objectives of the study include identifying the similarities and differences between members and casual users along demographics, usage and indicated preferences; and examining and modeling pricing preferences of bikeshare users. An intercept survey was conducted to obtain demographic information, bikeshare usage and various preferences of Capital Bikeshare users in the metro Washington DC area. The survey data was validated against the data from an existing member survey with large sample using goodness of fit tests. Survey participants reported that single trip fare (STF) and annual membership paid at once as their preferred pricing options and a combination of STF, 24-hour pass, and annual membership with monthly installments as their favorable pricing model. Logistic regression findings indicate that, when compared to casual users, registered members are more likely to be White, earn more and reside in the D.C. area. Casual users make fewer bikeshare trips and are less sensitive to the service (station density) compared to members. Gender, age and income distribution do not appear to influence casual fare product choice. Results from this study are useful in policy-making, planning and operations for bikeshare systems.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0703490b820c09a11e5538bceb0a8bfd",
  "timestamp": "2025-05-15T01:31:13.219448"
}