{
  "id": 7166,
  "title": "Family context and child mental health problems in the Family Health Program",
  "abstract": "OBJECTIVE: To assess the association between variables in the family context and the risk for emotional/behavioral problems in children enrolled in a Family Health Program. METHODS: A cross-sectional design study was conducted with 100 children aged 6 to 12 years old and their families, especially their biological mothers (82%). All subjects were enrolled in center of the Family Health Program in the city of Ribeir (a) over tildeo Preto, Southern Brazil, in 2001. Emotional/behavioral problems of the child, in levels considered as at risk for the development of disorders, were identified by means of the Strengths and Difficulties Questionnaire. Regarding conditions in the family context, the following variables were evaluated: socioeconomic level, adverse events, maternal stress, maternal depressive symptoms, organization, and structure of family environment. Data analysis was performed through univariate and multivariate logistic regression. RESULTS: Maternal stress was associated with general mental health problems in the child (OR= 2.2), while a daily routine with an organized timetable and greater range of activities to fill up their free time were associated with the absence of these problems (1/OR 1.3 and 1.9, respectively). Maternal stress was also a risk factor for anxiety/depression symptoms (OR= 1.6). Regarding hyperactivity, financial instability was a risk factor (OR= 2.1), and all indicators of environmental stability were protective variables (1/OR between 1.2 and 1.6). CONCLUSIONS: Information about family context indicators associated with mental health problems in schoolchildren may subsidize actions of the Family Health Program teams for the child and his/her family; the results indicate a possible employment of the Strengths and Difficulties Questionnaire by the teams, in order to identify early problems in child mental health.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0707ecb2167ce4ef9bc0d458f64f679f",
  "timestamp": "2025-05-15T03:06:01.092896"
}