{
  "id": 8836,
  "title": "Experiences and characteristics of women seeking and completing at-home medical termination of pregnancy through online telemedicine in Ireland and Northern Ireland: a population-based analysis",
  "abstract": "ObjectiveTo examine the characteristics and experiences of women in Ireland and Northern Ireland seeking at-home medical termination of pregnancy (TOP) using online telemedicine. DesignPopulation-based study. SettingIreland and Northern Ireland. PopulationBetween 1 January 2010 and 31 December 2015, 5650 women requested at-home medical TOP through online telemedicine initiative Women on Web. MethodsWe examined the demographics and circumstances of women requesting medical TOP and examined the experiences of the 1023 women who completed TOP between January 2010 and December 2012. We conducted a content analysis of women's evaluations and used logistic regression to examine factors associated with lack of emotional support during and after TOP Main outcome measuresSatisfaction with TOP; feelings before and after TOP; emotional support during TOP. ResultsWomen requesting TOP were diverse with respect to age, pregnancy circumstances and reasons for seeking TOP. Among those completing TOP, 97% felt they made the right choice and 98% would recommend it to others in a similar situation. Women commonly reported serious mental stress caused by their pregnancies and their inability to afford travel abroad to access TOP. The feelings women most commonly reported after completing TOP were relieved' (70%) and satisfied' (36%). Women with financial hardship had twice the risk of lacking emotional support (odds ratio = 2.0, P < 0.001). ConclusionsThe vast majority of women who completed at-home medical TOP through Women on Web had a positive experience. These demonstrated benefits to health and wellbeing contribute new evidence to the debate surrounding abortion laws in Ireland and Northern Ireland. Tweetable abstractIrish and Northern Irish women completing at-home medical TOP report benefits for health, wellbeing and autonomy. Tweetable abstract Irish and Northern Irish women completing at-home medical TOP report benefits for health, wellbeing and autonomy.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "070ccaebf24de7d165fda1116dfef002",
  "timestamp": "2025-05-15T03:22:57.906867"
}