{
  "id": 4485,
  "title": "Stock Price Prediction Methods based on FCM and DNN Algorithms",
  "abstract": "With the rapid economic development and the continuous expansion of investment scale, the stock market has produced increasing amounts of transaction data and market public opinion information, making it further difficult for investors to distinguish effective investment information. With the continuous enrichment of artificial intelligence achievements, the status and influence of artificial intelligence researchers in academia and society have been greatly improved. Expert system, as an important part of artificial intelligence, has made breakthrough progress at this stage. Expert system is based on a large amount of professional knowledge and experience for a specific field. Computers of this system can be used to simulate the decision-making process of experts to provide a decision-making basis for solving some complex problems. This research mainly discusses stock price prediction methods on the basis of artificial intelligence (AI) algorithms. Fuzzy clustering is a data mining tool that has been developed in recent years and is widely used. Using this method to process super large-scale databases with various data attributes has the characteristics of high efficiency and small amount of information loss. Theoretically speaking, the use of fuzzy clustering technology and related index method can effectively reduce the massive financial fundamentals of listed companies. By analyzing the influencing factors of stock value investment, we specifically select from the financial statements of listed companies the five aspects that can reflect their profitability, development ability, shareholder profitability, solvency, and operating ability. The full text runs through a variety of AI methods that is the characteristic of the research method used in this article, which pays special attention to verifying the theoretical method model. Doing so ensures its effectiveness in practical applications. In stock value portfolio research, a portfolio optimization model, which integrates the dual objectives of portfolio risk and returns into the risk-adjusted return of capital single objective constraints and solves the portfolio, is established. The accuracy and recall of the FCM model are relatively stable, with accuracies of 0.884 and 0.001, respectively. This research can help improve the number and quality of listed companies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0714541e347e4dd737fb85fdf3cb3df5",
  "timestamp": "2025-05-15T02:37:47.515812"
}