{
  "id": 5700,
  "title": "Weight Categories among Male Adolescents Linked to Risky Behaviors: High or Low BMI, Which Is Worse?",
  "abstract": "The literature about the relationship between extreme BMI and at-risk behaviors is quite inconsistent, and few articles focus on the underweight male population. This study aimed to analyze BMI level and its association with risky behavior, such as psychoactive substances use, gaming, and gambling, in a representative sample of the male adolescent population. Psychosocial variables were considered to better describe the possible at-risk profiles. This study used data from the 2018 ESPAD (R) Italia cross-sectional study, a survey using a self-administered anonymous questionnaire. For the purpose of the paper, males only were included in the analysis, with a total sample of 6938 students aged 15-19 years. Multinomial logistic regression showed that being overweight is positively associated with the gambler profile, the perception of a low financial family situation, and dissatisfaction with health conditions. Furthermore, being underweight was positively associated with gaming. Both extremes of BMI were associated with a frequent alcohol consumption and a sedentary lifestyle. This study provides important information regarding both extremes of BMI conditions, underling the presence of at-risk behavior and self-related perceptions with shared factors between underweight and overweight.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07203157086025838cfa065d4359b1cd",
  "timestamp": "2025-05-15T02:50:21.329034"
}