{
  "id": 9202,
  "title": "Associations of Insurance Churn and Catastrophic Health Expenditures With Implementation of the Affordable Care Act Among Nonelderly Patients With Cancer in the United States",
  "abstract": "IMPORTANCE Health insurance coverage is dynamic in the United States, potentially changing from month to month. The Patient Protection and Affordable Care Act (ACA) aimed to stabilize markets and reduce financial burden, particularly among those with preexisting conditions. OBJECTIVE To describe the risks of insurance churn (ie, gain, loss, or change in coverage) and catastrophic health expenditures among nonelderly patients with cancer in the United States, assessing for changes associated with ACA implementation. DESIGN, SETTING, AND PARTICIPANTS This retrospective, cross-sectional study uses data from the Medical Expenditure Panel Survey, a representative sample of the US population from 2005 to 2018. Respondents included were younger than 65 years, identified by health care use associated with a cancer diagnosis code in the given year. Statistical analysis was conducted from July 30, 2020, to January 5, 2021. EXPOSURES The Patient Protection and Affordable Care Act. MAIN OUTCOMES AND MEASURES Survey weights were applied to generate estimates for the US population. Annual risks of insurance churn (ie, any uninsurance or insurance change or loss) and catastrophic health expenditures (spending >10% income) were calculated, comparing subgroups with the adjustedWald test. Weighted multivariable linear regression was used to assess for changes associated with ACA implementation. RESULTS From 6069 respondents, we estimated a weighted mean of 4.78 million nonelderly patients (95% CI, 4.55-5.01 million; female patients: weighted mean, 63.9%[95% CI, 62.2%-65.7%]; mean age, 50.3 years [95% CI, 49.7-50.8 years]) with cancer annually in the United States. Patients with cancer experienced lower annual risks of insurance loss (5.3%[95% CI, 4.5%-6.1%] vs 7.6% [95% CI, 7.4%-7.8%]) and any uninsurance (14.6%[95% CI, 13.3%-16.0%] vs 24.1%[95% CI, 23.5%24.7%]) but increased risk of catastrophic health expenditures (expenses alone: 12.4%[95% CI, 11.2%-13.6%] vs 6.3%[95% CI, 6.2%-6.5%]; including premiums: 26.6%[95% CI, 25.0%-28.1%] vs 16.5%[95% CI, 16.1%-16.8%]; P < .001) relative to the population without cancer. Patients with cancer from low-income families and with full-year private coverage were at particularly high risk of catastrophic health expenditures (including premiums: 81.7%[95% CI, 74.6%-88.9%]). After adjustment, low income was the factor most strongly associated with both insurance churn and catastrophic spending, associated with annual risk increases of 6.5%(95% CI, 4.2%-8.8%) for insurance loss, 17.3%(95% CI, 13.4%-21.2%) for any uninsurance, and 37.4%(95% CI, 33.3%-41.6%) for catastrophic expenditures excluding premiums (P < .001). In adjusted models relative to 2005-2009, full ACA implementation (2014-2018) was associated with a decreased annual risk of any uninsurance (-4.2%; 95% CI, -7.4% to -1.0%; P = .01) and catastrophic spending by expenses alone (-3.0%; 95% CI, -5.3% to -0.8%; P = .008) but not including premiums (0.4%; 95% CI, -2.8% to 4.5%; P = .82). CONCLUSIONS AND RELEVANCE In this cross-sectional study, US patients with cancer faced significant annual risks of insurance churn and catastrophic health spending. Despite some improvements with ACA implementation, large burdens remained, and further reform is needed to protect this population from excessive hardship.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07209b9b32b94c0cb0201c8870c8b7e4",
  "timestamp": "2025-05-15T03:26:26.035538"
}