{
  "id": 5519,
  "title": "The effect of industry sector and profit-loss sharing financing on credit risk of Islamic banks in Indonesia considering COVID-19 pandemic",
  "abstract": "Purpose The COVID-19 pandemic has affected economic activity both globally and nationally, which also has an impact to banking sector and Islamic banking is no exception. This study aims to see how the impact of Islamic bank financing in seven sectors affected by the COVID-19 to the credit risk of Indonesian Islamic banks. In addition, this study also tries to see whether the proportion of mudharabah-musharaka or profit-loss sharing (PLS) financing also affects credit risk in Indonesian Islamic banks. Design/methodology/approach This study uses fixed effect panel data regression over the period 2011-2020. Findings The results of this study show that wholesale and retail trade financing will increase credit risk in Indonesian Islamic banks as a policy implication. In terms of the proportion of PLS financing, it shows that a larger share of PLS financing will reduce credit risk in Islamic banks. Originality/value This paper demonstrates that despite the industry's perception of PLS as riskier than murabaha-based instruments. According to the research, PLS financing will lower credit risk in Islamic banks. This study found that PLS contributes to overall economic stability by shifting the function of Islamic banks from a simple lending body to an active market catalyst/manager/consultant to market players seeking financial aid.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "072347f7bfa4d971f13ab883e65385a4",
  "timestamp": "2025-05-15T02:48:51.279393"
}