{
  "id": 8086,
  "title": "Kinetic-pharmacodynamic model to predict post-rituximab B-cell repletion as a predictor of relapse in pediatric idiopathic nephrotic syndrome",
  "abstract": "Purpose: Rituximab has proven efficacy in children with idiopathic nephrotic syndrome (INS). However, vast majority of children inevitably experience relapse with B-cell repletion, necessitating repeat course of rituximab, which may increase the risk of adverse effects. The timing of additional dosing and optional dosing regimen of rituximab in pediatric patients with INS have yet to be determined. This study aimed to identify factors that influence disease relapse and B-cell repletion to provide tailored treatment. Methods: LASSO and random survival forest were performed on 143 children to screen covariates which were then included in Cox regression model to determine the biomarkers of relapse and establish a nomogram. A kinetic-pharmacodynamic (K-PD) model was developed in 59 children to characterize the time course of CD19+ B-cell after rituximab treatment. Monte Carlo simulation was conducted to explore a mini-dose regimen with larger intervals. Results: Nomogram contained 7 predictors of relapse including neutrophil-to-lymphocyte ratio, duration of B-cell depletion, duration of disease, urine immunoglobulin G to creatinine ratio, urine transferrin, duration of maintenance immunosuppressant and hemoglobin. As a direct PD indicator, each 1-month increase of duration of B-cell depletion decreased risk of relapse by 21.4% (HR = 0.786; 95% CI: 0.635-0.972; p = 0.026). The K-PD model predicted t1/2 (CV%) of rituximab and CD19+ B-cell to be 11.6 days (17%) and 173.3 days (22%), respectively. Immunoglobulin A is an important covariate of ED50. Simulation of a mini-dose regimen with larger intervals (three 150 mg every 2 monthly) indicted longer B-cell depletion time (>7 months) compared to standard regimen. Conclusion: The nomogram indicated optimal infusion timing before relapse and the K-PD model provided tailored rituximab regimens for children with INS to reduce safety risks and financial burden.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07325e4f922a620a241ea26b91d05a22",
  "timestamp": "2025-05-15T03:15:09.342699"
}