{
  "id": 54,
  "title": "Dynamic customer demand management: A reinforcement learning model based on real-time pricing and incentives",
  "abstract": "The demand response model proposed in this work offers a game-changing solution to the challenges posed by the unpredictability of renewable energy sources. By combining both pricing and incentives, this model significantly improves the accuracy of demand response strategies, leading to more effective modulation of customer demand. The real-time and time-of-use pricing options presented to customers incentivize them to actively increase or decrease their energy consumption, thereby contributing to the stability of the energy grid. This work also sheds light on the crucial role that characteristic parameters such as the internal or external coincidence factor play in the classification of customers using the k-means algorithm. The reinforcement learning method used in the model not only optimizes prices and incentives, but also ensures that both customers and energy distribution companies benefit equally. A sensitivity analysis of customer elasticity highlights the dynamic interplay between clustering and reinforcement learning algorithms and customer behavior, demonstrating the power and effectiveness of this model. With its innovative approach and cutting-edge techniques, this work sets a new model for demand response and makes a compelling case for the inclusion of prices and incentives in future models. (C) 2023 Elsevier Ltd. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "073d29a9bc804636a422ab7e9d778c7d",
  "timestamp": "2025-05-15T01:28:03.812768"
}