{
  "id": 56,
  "title": "APPLICATION OF BP NEURAL NETWORK MODEL IN SUPPLY CHAIN FINANCIAL RISK CONTROL",
  "abstract": ". The diversification of the market development model has rapidly promoted financial innovation, and the improvement of the supply chain has also given rise to the supply chain financial form. However, the risk problem also arises. In order to effectively control supply chain financial risk and improve the ability of supply chain enterprises to resist financial crises, the application of the BP neural network model in supply chain financial risk control is studied. The BP neural network model is designed to categorize the dynamic risk types of supply chain finance according to the dynamic development characteristics of supply chain finance in the past, with the corresponding weight distribution allocated to each category. The BP neural network model is employed to extract the financial risk characteristics of the supply chain, and a dynamic measurement of supply chain finance is conducted based on the risk characteristics. This paper constructs a supply chain financial risk management model based on the BP neural network model and controls the supply chain financial risk. The experimental results demonstrate that after employing various control methods, the risk exhibits a declining trend, effectively mitigating the financial risk of the supply chain with high efficacy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "073d3afd80219244eead3ee8a62b6701",
  "timestamp": "2025-05-15T01:46:03.908348"
}