{
  "id": 8051,
  "title": "Economic cost of primary prevention of cardiovascular diseases in Tanzania",
  "abstract": "Tanzania is facing a double burden of disease, with non-communicable diseases being an increasingly important contributor. Evidence-based preventive measures are important to limit the growing financial burden. This article aims to estimate the cost of providing medical primary prevention interventions for cardiovascular disease (CVD) among at-risk patients, reflecting actual resource use and if the World Health Organization (WHO)'s CVD medical preventive guidelines are implemented in Tanzania. In addition, we estimate and explore the cost to patients of receiving these services. Cost data were collected in four health facilities located in both urban and rural settings. Providers' costs were identified and measured using ingredients approach to costing and resource valuation followed the opportunity cost method. Unit costs were estimated using activity-based and step-down costing methodologies. The patient costs were obtained through a structured questionnaire. The unit cost of providing CVD medical primary prevention services ranged from US$30-41 to US$52-71 per patient per year at the health centre and hospital levels, respectively. Employing the WHO's absolute risk approach guidelines will substantially increase these costs. The annual patient cost of receiving these services as currently practised was estimated to be US$118 and US$127 for urban and rural patients, respectively. Providers' costs were estimated from two main viewpoints: 'what is', that is the current practice, and 'what if', reflecting a WHO guidelines scenario. The higher cost of implementing the WHO guidelines suggests the need for further evaluation of whether these added costs are reasonable relative to the added benefits. We also found considerably higher patient costs, implying that distributive and equity implications of access to care require more consideration. Facility location surfaced as the main explanatory variable for both direct and indirect patient costs in the regression analysis; further research on the influence of other provider characteristics on these costs is important.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07555a6ac0327f64b410a68c49b2ccf3",
  "timestamp": "2025-05-15T03:14:37.399409"
}