{
  "id": 7387,
  "title": "COVID-Related Stressors and Psychological Distress Among Chicago Residents: the Moderating Role of Race",
  "abstract": "Background Racial and ethnic minorities have been disproportionately affected by the COVID-19 pandemic and have experienced greater financial loss, housing instability, and food insecurity due to COVID-related restrictions. As a result, Black and Hispanic communities may be at greater risk of experiencing psychological distress (PD). Methods Using data collected between October 2020 and January 2021from 906 Black (39%), White (50%), and Hispanic (11%) adults, we assessed racial/ethnic differences in the effect of three COVID-related stressors-employment stress, housing instability, and food insecurity-on PD using ordinary least square regression. Results Black adults reported lower PD levels compared to White adults (beta = - 0.23, P < 0.001), but Hispanic adults did not differ significantly from White adults. COVID-related housing instability (beta = 0.46, P < 0.001), food insecurity (beta = 0.27, P < 0.001), and employment stress (beta = 0.29, P < 0.001) were associated with higher PD. Employment stress was the only stressor to differentially affect PD by race/ethnicity. Among those that reported employment stress, Black adults had lower levels of distress compared to Whites (beta = - 0.54, P < 0.001) and Hispanics (beta = - 0.04, P = 0.85). Conclusion Despite relatively high exposure to COVID-related stressors, Black respondents had lower levels of PD compared to Whites and Hispanics which may reflect differences in race-specific coping mechanisms. Future research is needed to elucidate the nuances of these relationships and identify policies and interventions that prevent and minimize the impact of employment, food, and housing-related stressors and support coping mechanisms that promote mental health among minority populations, such as policies that support easier access to mental health and financial and housing assistance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0759ec1f33cd554d7b0a836ca19b840b",
  "timestamp": "2025-05-15T03:08:00.801686"
}