{
  "id": 4273,
  "title": "NATURE AND CAUSES OF THE UNCERTAINTIES FOR THE INNOVATION BUSINESS",
  "abstract": "Development of innovative entrepreneurship is always fraught with considerable difficulties. It is especially difficult to make decisions about the development of activities in the face of uncertainty. The study of scientific materials showed that in the innovative business there are about 70 types of uncertainties. The task was - of their systematization and classification of conditions, existence, nature appearance to develop management guidelines. For data processing was carried the large-scale expert study based on a survey of entrepreneurs (over 6,700 units), which have in their product portfolio of innovative projects. Was assembled a vast array of information and found exactly which uncertainty can arise before, at the moment, and at the end all over innovation activities. Also highlighted in the environment (external, internal, conjugate) and factors of uncertainty (market, information, labor, technical, technological, organizational, financial, etc.). The next unit was to determine exactly which uncertainties accompany the organization depending on its size (small, medium, large, very large) and the establishment of the degree of controllability. It was put forward the idea of the existence of certain properties of the system uncertainties, i.e. they cannot occur spontaneously, there are chaotic and remove ourselves to a certain time. With using tools SPSS was found that an uncertainties generated by the causal conditions exist, as long as these conditions will not delete. Moreover, uncertainties in innovative entrepreneurship can be grouped into network with their signs, certain way. Such a provision to test the theory of the existence of uncertainties Autopoiesis' properties - namely, the set of uncertainties faced by the entrepreneur to innovate may be the pattern, i.e. many private conditions most of these uncertainties; but a manifestation of the strength and character of uncertainties are an organization a concrete implementation of the pattern. Finally, the Work presents - which kinds of uncertainties can be at innovative entrepreneur in those or other conditions of the organizational Environment. There are some recommendations that may help to avoid uncertainty or minimize their negative impact on the effectiveness of innovation. Research study financed from Russian Foundation for Basic Research (RFBR) in the year 2014-2015 as research project No. 14-06-00051 The implementation of innovative projects and processes under conditions of uncertainty.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07596799354157a571c6b57d6d7188e9",
  "timestamp": "2025-05-15T01:25:23.317122"
}