{
  "id": 5642,
  "title": "Tax Risk and Cost of Debt: The Role of Tax Avoidance-Evidence from the Iraqi Stock Market",
  "abstract": "Taxes represent a significant expense for many companies, prompting a strong incentive to minimize tax liabilities through strategies known as tax avoidance. This research explores the impact of tax avoidance and tax risk disclosure on the cost of debt among companies listed on the Iraqi Stock Exchange. This study analyzes data from 33 firms from 2016 to 2021, employing multivariate linear regression and the generalized least squares (GLS) model to test the hypotheses. The findings indicate that tax avoidance significantly and positively affects the cost of debt, suggesting that firms engaging in tax avoidance may experience greater borrowing costs. Additionally, tax risk disclosure is shown to directly and significantly influence the cost of debt. Importantly, this study reveals that tax risk disclosure negatively moderates the relationship between accrual tax avoidance and the cost of debt, indicating that higher tax risk disclosure can reduce uncertainties associated with tax avoidance, reducing borrowing costs. These results imply that tax avoidance and its influence on corporate debt levels can affect the overall risk profile of a country's financial system. Understanding this relationship is crucial for governance measures aimed at managing tax risks effectively. Given the limited research in this area, this study contributes to the literature by examining how tax risk and tax avoidance relate to the cost of debt in an emerging market context.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "075fa9ac2df1280fae02360f972ebeaf",
  "timestamp": "2025-05-15T02:49:50.336385"
}