{
  "id": 145,
  "title": "Approximation of single-barrier options partial differential equations using feed-forward neural network",
  "abstract": "Artificial neural networks are generally employed in the numerical solution of differential equation problems. In this article, we propose an approach that deals with the combination of the feed-forward neural network method and the optimization technique in solving the partial differential equation arising from the valuation of barrier options. The methodology entails transforming the extended Black-Scholes partial differential equations (PDE), which defines a barrier option, into a constrained optimization problem, and then proposing a trial solution that reduces the differential equation problem to an unconstrained one. This trial function consists of the adjustable and non-adjustable neural network parameters. We design it to be differentiable, analytic, and satisfy the initial and boundary conditions of the corresponding option pricing PDE. We compare the corresponding option values to the Monte-Carlo simulated values, Crank-Nicolson finite-difference values and the exact Black-Scholes prices. Numerical results presented in this research show that neural networks can sufficiently solve PDE-related problems with sufficient precision and accuracy. Furthermore, they can be applied in the fast and accurate valuation of financial derivatives without closed analytic forms.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07691c43383ae26a01b66a9ef30a952f",
  "timestamp": "2025-05-15T01:28:35.407577"
}