{
  "id": 9179,
  "title": "Continuation ratio model for the performance behavior of wastewater collection networks",
  "abstract": "Canada's aged wastewater infrastructure is failing. New financial and environmental regulatory requirements demand municipalities to estimate operating and capital expenditures for running the systems into the future, and to develop plans for financial sustainability while protecting public health and the environment. Presently, wastewater pipelines' deterioration is not well understood and realistic deterioration models need to be developed. This paper presents a new ordinal regression model for the deterioration of wastewater pipelines based on continuation ratio logits. The model is presented using the generalized linear model formulation, and takes into account the ordinal nature of the dependent variable and the interaction effects between explanatory variables. The model provides estimates of conditional probabilities for a pipeline to advance beyond a particular internal condition grade - to worse condition - depending on pipe material and age. The model development and validation procedure is demonstrated using high quality condition assessment data for reinforced concrete (RC) and vitrified clay (VC) pipes from the City of Niagara Falls wastewater collection system. The new model is found to represent the RC and VC pipes' degradation behavior for in-service pipes up to 110 years of age at the City of Niagara Falls wastewater collection system. RC pipes' deterioration is found to be age dependent while VC pipes' deterioration is not age dependent. The VC pipe finding is contrary to other deterioration model studies that indicate that the type of pipe material is not significant and that the deterioration of VC pipes is age dependent. The analysis shows, for example, that the predicted conditional probability for RC pipes to advance beyond internal condition grade 3 is estimated to be 60% at 40 years of age and it increases to 90% at 80 years. Similarly, there is a 60% chance of advancing beyond grade 4 to collapsed/collapse imminent condition at 80 years of age for RC pipes. VC pipes are found to have an indefinite service life if installed without structural damage. However. VC pipes exhibited relatively higher conditional probabilities than RC pipes for advancing to worse internal condition grades for pipes up to 65 years of age. Poor installation practices that resulted in pipe defects, such as open/displaced joints and defective connections are deemed to be the factors that resulted in VC pipe deterioration. The findings from the continuation ratio model can be used for risk-based policy development for maintenance management of wastewater collection systems. The proposed model can help in devising appropriate intervention plans and optimum network maintenance management strategies based on pipelines' age, material type, and internal condition grades. These predictions are critical if realistic wastewater networks' future maintenance and operation budgets are to be developed over the life of asset and to meet new regulatory reporting requirements. Further research is required to validate the proposed model in other networks and to determine if the method can be used to model the deterioration of pipe materials other than RC and VC. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "076f6ea2cca6337923c0bc61348da199",
  "timestamp": "2025-05-15T03:26:25.953320"
}