{
  "id": 2983,
  "title": "MODEL FOR OPTIMAL PROJECT PORTFOLIO FOR THE CONSTRUCTION OF RAILWAY INFRASTRUCTURE ON CORRIDORS V AND X",
  "abstract": "The construction of railway infrastructure should be dealt with as a national strategic development programme, which due to technical, geographical, logistical, and other requirements is carried out through a number of projects and represents a complex multiple project operation for investors, contractors, and other influential players. The national strategic development programme for the construction of railway infrastructure is connected through programmes in the neighbouring countries and EU member states to Trans-European networks (TEN) that strategically regulate the construction within the community. In the Republic of Slovenia, the construction of railway infrastructure within TEN programmes is carried out on the pan-European traffic Corridors V and X within individual projects for the construction of sections and a number of supporting projects. The technical requirements, deadlines, and other TEN requirements as well as national strategic requirements and financial possibilities of the state represent the basic criteria that should be taken into consideration in setting up a strategic project plan, with optimal project classification achieved through the implementation project portfolio. The current paper has utilised the method of multiple-criteria decision analysis to prepare the portfolio, taking into account the macroeconomic and infrastructure! criteria. Consequently, the results represent the basis for the preparation of an optimal financial plan with regard to financing possibilities of the Republic of Slovenia and the European Union. The paper also summarises the research results regarding the formation of the project implementation process of the TEN-T network construction in the Republic of Slovenia.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "077514a244c185cbfcc918a501cf425e",
  "timestamp": "2025-05-15T01:12:09.251256"
}