{
  "id": 7598,
  "title": "Are Racial Groups Associated with Recurrence of Adult Protective Services?",
  "abstract": "Little is known about the recurrence differences among diverse race/ethnic groups in the Adult Protective Services (APS). This mixed methods triangulation design study used data from both administrative databases and interview/focus groups with APS social workers to explore whether race/ethnic groups are associated with different recurrence in APS. The recurrence rate of APS was 21.4% in the sample of 4,426 clients in a county of California. Results from the multiple logistic regression showed that Asian Americans and Pacific Islanders were less likely to have one or more APS reports and investigations within the 12-month follow-up after the case closure of the initial APS investigation when compared with Hispanic Americans. No statistically significant results were found among other racial/ethnic groups. Some co-variates were also found to be associated with the recurrence including marital status, risk level, financial abuse, and self-neglect. Qualitative results provided some support to the main findings from the quantitative analysis results. Both quantitative and qualitative analytical approaches intimated that racial/ethnic differences might not be a prominent factor leading to different APS recurrence. The limitations of this article indicate that there is a need for additional studies to further examine the influence of race/ethnicity on APS recurrence.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "077537d6f8e2da25fe44e40fb8cbad51",
  "timestamp": "2025-05-15T03:10:05.636231"
}