{
  "id": 5157,
  "title": "Short-term stock market reaction to the announcement of green bond issue: evidence from Nordic countries",
  "abstract": "Green bond issues and markets are growing rapidly worldwide every year. Green bonds are used for financing environmentally friendly projects. Their issue is an important event in a company, with a huge impact not only on the protection of the environment but also on the management practice and financial performance of the company. This event is a signal to a stock market that is interpreted by shareholders differently: positively for eco-friendly investors and negatively for traditional investors, as it increases additional capital expenditures and financial risk. This paper aims to assess the short-term stock market reaction to the announcement of green bond issues in Nordic public companies and to determine whether the characteristics of green bond issues and issuers are significant determinants of stock cumulative abnormal return (CAR). The total sample was composed of 197 green bonds issued during 2017-2024. Sweden had the highest number of green bond issues (60.9%). Denmark and Finland had a very similar share, with 20.3% and 18.8%, respectively. The stock market reaction was assessed by applying an event study methodology. CAR dependence on the characteristics of green bond issues and issuers was determined using a heteroskedasticity-corrected regression model. The findings revealed a negative stock market reaction to the announcement of green bond issues. Such reaction may not only be due to increased capital expenditures and financial risk but also to the shift of investments from stocks to green bonds, as the majority of green bonds were issued during the COVID-19 pandemic and the Russian-Ukrainian war. We highlight that CAR is more sensitive to the characteristics of green bond issuers than those of issues.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0778b5c96e3a33633aa4068fc8ed3492",
  "timestamp": "2025-05-15T02:44:44.000958"
}