{
  "id": 8650,
  "title": "Comparison of factors influencing liquidity of European Islamic and conventional banks",
  "abstract": "Research background: The innovation in Shari.ah-compliant banking products has resulted in the rapidly increasing size of assets in Islamic banks worldwide. The assets of such banks have been growing twice as fast as those of conventional banks. Islamic banks do not depend on con ventional interest, speculation, or complex derivatives stemming from banking operations. Instead, their actions in respect of profit/risk sharing, and the clarity of the contract are consistent with Islamic Shari. ah principles, which seek to promote a more equal society. Purpose of the article: This research aims to identify and compare factors influencing the liquidity of Islamic and conventional banks in Europe. Candidate factors are sought amongst profitability,credit quality, credit expansion and capital adequacy indicators. Methodology: First, relevant financial ratios for 249 observations on Islamic banks and 2,306 observations on conventional banks are selected and compared for the period 2013-2017. Second,liquidity is explained separately for each type of banks by panel data regression to identify its determinants in a comparative context. Findings & value added: The results indicate that the impact of the net interest margin on the liquidity ratio of Islamic banks is insignificant, which is obviously due to the prohibition of the use of interest (riba). To the contrary, in conventional banking a higher net interest margin results in a reduction in liquidity. Capital adequacy has a positive influence upon liquidity in both types of banks, but in Islamic banking, the influence is 5.4 times greater. The findings strongly suggest that the liquidity of Islamic and conventional banks is affected by different factors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "077a37dee46ce6d9e4d74a9a80aa1c50",
  "timestamp": "2025-05-15T03:20:55.984937"
}