{
  "id": 8350,
  "title": "Adoptability of digital payments for community health workers in peri-urban Uganda: A case study of Wakiso district",
  "abstract": "Background Whereas digital payments have been identified as a solution to health payment challenges, evidence on their adoptability among Community Health Workers (CHWs) is limited. Understanding their adoptability is crucial for sustainability. This study assessed the adoptability of digital payments for CHWs in Wakiso district, Uganda.Methods A convergent parallel mixed-methods study was conducted between November and December 2022, in Wakiso district, Uganda. We surveyed a random sample of 150 CHWs using a structured questionnaire and conducted key informant interviews among three purposively selected Digital payment coordinators. The study utilized the Technology Acceptance Model (TAM) framework to assess the adoptability of digital payments among CHWs. Factor analysis was performed to extract composite variables from the original constituting variables. Using the median, the outcome was converted to a binary variable and logistic regression was conducted to assess the association between the TAM constructs and adoptability of digital payments by CHWs. Quantitative data was analyzed using STATA 14, while qualitative data was transcribed verbatim and analyzed using ATLAS.ti 22.Results Nearly all participants (98.0%; n = 49) had previously received payments through mobile money, a digital payment method. (52%; n = 78) of CHWs said they intend to use digital payment modalities. Perceived risk of digital payments was associated with 83% lower odds of adoptability of digital payment modalities (OR = 0.17;95%CI:0.052, 0.54), while perceived trust had nearly three times higher odds of adoptability of digital payment modalities (OR = 2.82;95%CI:1.41, 5.67). Qualitative interviews showed that most CHWs reported positive experiences with digital health payments, including effectiveness and completeness of payments except for delays associated with mobile money payments across payment providers. Mobile money was reported to be easy to use, in addition to fostering financial responsibility compared to cash.Conclusion CHWs in Wakiso district intend to use digital payment modalities, particularly mobile money/e-cash. Perceived risk of the payment method and trust are key determinants of adoptability. Synergized efforts by both payment providers to manage payment delays and mitigate risks associated with digital payments could attenuate perceived risk and build trust in digital payment modalities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "077c495f55114acf44b2e5e1cc1ccf9c",
  "timestamp": "2025-05-15T03:17:49.189019"
}