{
  "id": 4640,
  "title": "The Double Role of Financial Covenants in Bond Issues in Brazil",
  "abstract": "Purpose - This study aims to identify the relationship between the use of financial covenants and the cost of borrowing via bonds issued by firms in Brazil. Design/methodology/approach - The sample comprised 269 bond series issued by 106 publicly-listed companies from 2010 to 2016. Covenants were sampled manually from the indentures and prospectuses of these issues. A distinction was made between covenants that must be fulfilled by the firm issuing the debt and those that create obligations for another firm that has a secondary liability to the issuer's creditors. A linear regression model was constructed to test the relationships between these covenants and the spreads paid on the bonds. Findings - The results indicate that covenants that must be observed by the issuer are used as a complementary mechanism to the risk premium charged by creditors. In turn, covenants that bind guarantors constitute a mechanism to substitute the risk premium, reducing the spread. These findings show that financial covenants play a double role in bond issues in Brazil and that the role varies depending on the firm that is responsible for complying with the covenant.- Originality/value - This paper contributes to the literature by showing that the effect of financial covenants on the cost of debt varies as a function of which firm must fulfill the covenant. It therefore demonstrates that it is essential to control for the responsibility to fulfill covenants when measuring their effect on the cost of debt.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "078a4cc4f9c07ed1a81814ca49515fe0",
  "timestamp": "2025-05-15T02:39:26.991812"
}