{
  "id": 8880,
  "title": "Potential profile analysis of financial toxicity and its related factors among lung cancer patients",
  "abstract": "BackgroundFinancial Toxicity (FT) is prevalent among lung cancer patients. Identifying high-risk groups and implementing comprehensive, targeted interventions can alleviate FT and improve patients' quality of life. Hence, the objective of this study was to analyze the status and potential profiles of FT in lung cancer patients and explore the related factors of FT levels in different categories of lung cancer patients.MethodsA cross-sectional design was used in this study. A total of 421 patients with lung cancer hospitalized in the oncology department of a Grade A general hospital and a provincial oncology hospital in Shandong Province from October to December 2023 were selected by convenience sampling. General data questionnaires, FT scale for reported outcomes of cancer patients, Chinese version of the Quality of Life Scale for lung cancer patients, Social Support Rating Scale and simplified version of the Mental Resilience Scale were used. Potential profile analysis of FT levels in lung cancer patients was performed, and multiple logistic regression was used to analyze the related factors of FT levels in different categories.ResultsAmong 421 lung cancer patients, the median FT (FT) score was 16 (IQR: 9-24). Latent profile analysis identified four distinct FT patterns: mild (19.5%), moderate resource-deficient (7.8%), moderate balanced (35.6%), and severe (37.1%). Multivariate analysis revealed significant associations between FT severity and hospitalization frequency, lifestyle modifications, employment status, insurance coverage, education level, social support, emotional distress, family resilience, problem-solving capacity, and social resource utilization.ConclusionFT demonstrates high prevalence and substantial heterogeneity in lung cancer patients, with over 70% experiencing moderate-to-severe levels. Clinical interventions should prioritize early screening and stratified management through psychological support, financial navigation programs, cost-containment strategies, and enhanced health literacy to alleviate economic burdens and optimize treatment outcomes.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07905a2a10ffa7fef539c2bcaaa56b57",
  "timestamp": "2025-05-15T03:23:27.789753"
}