{
  "id": 6299,
  "title": "Impacts of socio-psychological factors on smallholder farmers' risk attitudes: empirical evidence and implications",
  "abstract": "In the literature, there are limited studies on how socio-psychological factors affect farmers' attitudes towards risks. Therefore, this paper looks into this issue in Ethiopia for better understanding of how socio-psychological issues influence farmers' risk attitudes. The study uses data from a cross-sectional survey and a generalised ordered logistic regression is used to analyse the data. The findings show that farmers perceive natural hazards, input and output price volatility, technological risks, financial shocks and human security as the main sources of risks for agricultural production and livelihoods. Farmers' risk attitudes were assessed dividing them into three categories from more to less risk averse. Education, relational capital, attitudes, group membership, technical training and household sise were found to be the factors influencing farmers' risk attitudes. Farmers who can read and write, who have strong social capital and who have received training are less risk averse. Finally, this study confirms the importance of positive attitudes, strong social capital (group membership and relational capital) and satisfactory competence to motivate farmers to take risks related to technological innovations and others in the agricultural production. Therefore, attention should be given to specific initiatives to enhance their awareness, build their adaptive capacity to shocks and hazards, provide timely and up-to-date information, and improve their skills and knowledge. These issues would help to avert the risk aversion of smallholder farmers, who are usually thought to be risk-averse in low-income economies and to stimulate them to adopt sustainable agriculture and technological innovations, which are expected to improve agricultural production and enhance the tolerance of local systems for risks and shocks.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07918db1f77b651b89344255bfed04cb",
  "timestamp": "2025-05-15T02:56:37.510637"
}