{
  "id": 6940,
  "title": "Evaluation of a complex intervention to improve primary care prescribing: a phase IV segmented regression interrupted time series analysis",
  "abstract": "Background It is uncertain whether improvements in primary care high-risk prescribing seen in research trials can be realised in the real-world setting. Aim To evaluate the impact of a 1-year system-wide phase IV prescribing safety improvement initiative, which included education, feedback, support to identify patients to review, and small financial incentives. Design and setting An interrupted time series analysis of targeted high-risk prescribing in all 56 general practices in NHS Forth Valley, Scotland, was performed. In 2013-2014, this focused on high-risk nonsteroidal anti-inflammatory drugs (NSAIDs) in older people and NSAIDs with oral anticoagulants; in 2014-2015, it focused on antipsychotics in older people. Method The primary analysis used segmented regression analysis to estimate impact at the end of the intervention, and 12 months later. The secondary analysis used difference-in-difference methods to compare Forth Valley changes with those in NHS Greater Glasgow and Clyde (GGC). Results In the primary analysis, downward trends for all three NSAID measures that were existent before the intervention statistically significantly steepened following implementation of the intervention. At the end of the intervention period, 1221 fewer patients than expected were prescribed a high-risk NSAID. In contrast, antipsychotic prescribing in older people increased slowly over time, with no intervention-associated change. In the secondary analysis, reductions at the end of the intervention period in all three NSAID measures were statistically significantly greater in NHS Forth Valley than in NHS GGC, but only significantly greater for two of these measures 12 months after the intervention finished. Conclusion There were substantial and sustained reductions in the high-risk prescribing of NSAIDs, although with some waning of effect 12 months after the intervention ceased. The same intervention had no effect on antipsychotic prescribing in older people.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "079f1430099d6846bf936de3a9347056",
  "timestamp": "2025-05-15T03:03:13.488639"
}