{
  "id": 7182,
  "title": "Do socio-cultural factors influence college students' self-rated health status and health-promoting lifestyles? A cross-sectional multicenter study in Dalian, China",
  "abstract": "Background: An unhealthy lifestyle of college students is an important public health concern, but few studies have been undertaken to examine the role of socio-cultural differences. Methods: For this cross-sectional comparative study, data on college students' health-promoting lifestyles (HPL), as measured using the Health-Promoting Lifestyle Profile (HPLP-II) scale, and self-rated health status (SRH) as measured by Sub-Optimal Health Measurement Scale (SHMS V1.0) were collected from 829 college students. Results: The sample of 829 college students included 504 (60.8%) Chinese and 325 (39.2%) international students. Chinese students had higher scores in overall health-promoting lifestyle (HPL) (P < 0.001, eta squared = 0.113) and in all the six subclasses than their international counterparts. In relation to health status evaluation, the two groups varied in physiological health (P < 0.001, eta squared = 0.095) and social health (P = 0.020, eta squared = 0.007) but there was no significant difference in psychological health subscale (P = 0.156, eta squared = 0.002). HPL was predicted by financial status among the Chinese group and by student's major, age and level of education in the international group. Body mass index (BMI) and financial status emerged as predictors of the three subscales of SHMS V1.0 in the Chinese group and also of physiological and psychological subscales in the international group. Gender was associated with psychological health in both groups. Smoking status was a predictor of psychological health in both groups and also of social health in the international group. The level of education emerged as a predictor of social health in the international group. Regression analyses revealed a significant association between health status and healthy lifestyle (P < 0.001). In reference to participants with excellent lifestyle, participants with moderate lifestyle were at a 4.5 times higher risk of developing suboptimal health status (SHS) (OR: 4.5,95% CI: 2.2-9.99) and those with a 'general' lifestyle were at a 3.2 times higher risk SHS (OR: 3.2, 95% CI: 1.5-7.18). Good and moderate HPLP-II levels of nutrition are associated with low risk of suboptimal health status (OR: 0,41 and 0,25, respectively). Participants in good and moderate HPLP-II levels of interpersonal relations are associated with higher risk of suboptimal health (OR: 2,7 and 3,01 respectively) than those in excellent levels of HPLP-II. Conclusion: Collectively, these findings provide a convincing body of evidence to support the role of socio-cultural factors as key determinants of the HPL and SRH of college students.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07b86c3c381556844b37e2915d872f3d",
  "timestamp": "2025-05-15T03:06:01.212505"
}