{
  "id": 4265,
  "title": "Intracranial haemorrhage in thrombocytopenic haematology patients-a nested case-control study: the InCiTe study protocol",
  "abstract": "Introduction Intracranial haemorrhage (ICH) is one of the most serious side-effects of severe thrombocytopenia in haematology patients. ICH is rare, but can have devastating consequences (death or major morbidity). It is unknown why some patients with severe thrombocytopenia bleed and others do not. Study aims Primary aim was to identify risk factors for ICH in patients with haematological malignancies. Secondary aims were to identify short-term outcomes for these patients at 30days (major morbidity and mortality) and produce a more accurate estimate of ICH incidence in this population. This information is key to identifying means to improve treatment and quality of care. Methods/analysis This is a UK-wide case-control study of ICH nested within a 4-year prospective surveillance study set up specifically for the case-control study. Each case will be matched to one control. Cases will be adult haematology patients (16years) who have had any type or severity of ICH who are receiving, about to receive or have just received myeloablative chemotherapy (defined as chemotherapy expected to cause a significant thrombocytopenia <50x10(9)/L for >5days) or a haemopoietic stem cell transplant. Only patients being treated with curative intent will be included. Controls will be patients who fulfil the same inclusion criteria as cases (apart from ICH) and were treated at the same hospital immediately before the index case. Cases and controls will be matched to type of treatment (myeloablative chemotherapy or haemopoietic stem cell transplant). Hospitals across the UK will participate in a monthly email reporting strategy (started June 2011), as to whether a case of ICH occurred during the preceding calendar month. Case and control forms will be sent to any hospital reporting an eligible case. Conditional logistic regression will be used to calculate ORs. Denominator data for incidence estimates will use national registry data. Study Registration ISRCTN05026912 (prospective registration). NIHR Portfolio (UKCRN ID 10712).",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07cdd2263db31b17c1d17f7920baebe2",
  "timestamp": "2025-05-15T01:25:23.293068"
}