{
  "id": 3179,
  "title": "Improving returns on stock investment through neural network selection",
  "abstract": "The Artificial Neural Network (ANN) is a technique that is heavily researched and used in applications for engineering and scientific fields for various purposes ranging from control systems to artificial intelligence. Its generalization powers have not only received admiration from the engineering and scientific fields, but in recent years, the finance researchers and practitioners are taking an interest in the application of ANN. Bankruptcy prediction, debt-risk assessment and security market applications are the three areas that are heavily researched in the finance arena. The results, this far, have been encouraging as ANN displays better generalization power as compared to conventional statistical tools or benchmark. With such intensive research and proven ability of the ANN in the area of security market application and the growing importance of the role of equity securities in Singapore, it has motivated the conceptual development of this project in using the ANN in stock selection. With its proven generalization ability, the ANN is able to infer from historical patterns the characteristics of performing stocks. The performance of stocks is reflective of their profitability and the quality of management of the underlying company. Such information is reflected in financial and technical variables. As such, the ANN is used as a tool to uncover the intricate relationships between the performance of stocks and the related financial and technical variables. Historical data such as financial variables (inputs) and performance of the stock (output) are used in this ANN application. Experimental results obtained this far have been very encouraging. (C) 1999 Elsevier Science Ltd. All rights reserved.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07e07ab269de507d38519e7543cc2134",
  "timestamp": "2025-05-15T02:23:33.513402"
}