{
  "id": 857,
  "title": "Unraveling the Nexus between Sustainable Development, Bank Profitability, and Loan Loss Provisions in Vietnam: A Bayesian Vector Autoregression Perspective",
  "abstract": "Financial institutions play a crucial role in financing projects and initiatives that promote sustainable develop- ment (SD). However, banks are under increasing pressure to align with the United Nations' SD goals by divesting from high CO2-emitting industries and reallocating capital toward environmentally responsible investments. While this transition supports long-term sustainability, it can lead to short-term profitability challenges, as SD projects often involve higher risks, regulatory uncertainties, and lower immediate returns compared to traditional business activities. As a result, banks may need to adjust their loan loss provisions (LLP) to account for potential credit risks associated with these investments. This study investigates the impact of supporting SD goals on bank profitability (BP) and LLP in Vietnam from 2008 to 2019. To achieve this, we employ a Bayesian Vector Autoregression (BVAR) model, which is particularly useful in analyzing dynamic relationships, addressing heterogeneous variables, and managing small sample sizes. Our findings indicate that investing in SD projects initially reduces bank profitability due to increased costs and uncertainties, prompting banks to raise LLP. However, in the long run, such investments contribute to financial stability, enhance risk management, and strengthen the bank's overall reputation. By inte- grating SD principles into their investment strategies, banks can not only mitigate environmental and social risks but also create long-term value for stakeholders, reinforcing their credibility in an evolving global financial land- scape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07ea42269222ab9916b1bd16aa70f68c",
  "timestamp": "2025-05-15T01:43:20.705078"
}