{
  "id": 1486,
  "title": "Forward Fall Detection Using Inertial Data and Machine Learning",
  "abstract": "Fall risk assessment is becoming an important concern, with the realization that falls, and more importantly fainting occurrences, in most cases require immediate medical attention and can pose huge health risks, as well as financial and social burdens. The development of an accurate inertial sensor-based fall risk assessment tool combined with machine learning algorithms could significantly advance healthcare. This research aims to investigate the development of a machine learning approach for falling and fainting detection, using wearable sensors with an emphasis on forward falls. In the current paper we address the problem of the lack of inertial time-series data to differentiate the forward fall event from normal activities, which are difficult to obtain from real subjects. To solve this problem, we proposed a forward dynamics method to generate necessary training data using the OpenSim software, version 4.5. To develop a model as close to the real world as possible, anthropometric data taken from the literature was used. The raw X and Y axes acceleration data was generated using OpenSim software, and ML fall prediction methods were trained. The machine learning (ML) accuracy was validated by testing with data acquired from six unique volunteers, considering the forward fall type.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07f0e031d5d4ea4ca3b31f3436640f7b",
  "timestamp": "2025-05-15T02:03:39.779426"
}