{
  "id": 4201,
  "title": "Do working capital management practices influence investment and financing patterns of firms?",
  "abstract": "Purpose The present study aims to investigate the impact of working capital management (WCM) practices on the investment and financing patterns of listed nonfinancial companies in Pakistan for a span of 10 years. Design/methodology/approach The study is based on secondary financial data of 354 listed nonfinancial Pakistani firms during the period of 2005-2014. The two-step generalized method of moment (GMM) regression estimation technique is employed to ensure the robustness of results. Findings Empirical testing reveals that: excessive funds tied up in working capital have a negative impact on the investment portfolio of sample firms. Besides, a negative relationship between change in fixed assets and excess net working capital posits that, eventually, firms use idle resources tied up in short-lived assets to boost their investment activities. Furthermore, larger working capital levels were associated with higher leverage ratio which indicates that firms with inefficient WCM policies have to rely heavily on long-term debt to meet their short-term financing requirements. Additional results indicate that firms that take more time to sell inventory and convert receivables to cash, make more use of debt. Results of cash management models illustrate that cash-rich firms have lower leverage levels which signal the strong financial health and internal revenue generation capability of such firms. Originality/value There is a dearth of empirical studies that examine the implications of WCM decisions on a firm's capital structure. Besides, these studies are only confined to how a WCM policy influences the long-term investment activities of a firm. The research contributes to the extant literature by empirically revealing a link between the WCM practices and the firm's long-range investment and financing patterns. Hence, financial managers shall account for the impact of their short-term financial management decisions on the capital structure of the firm.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07f4825122227f444ce895a5bf3359c2",
  "timestamp": "2025-05-15T01:24:51.424309"
}