{
  "id": 7427,
  "title": "Risk of PTSD Due to the COVID-19 Pandemic Among Patients in Opioid Substitution Treatment",
  "abstract": "Background: The impact of the COVID-19 pandemic on the mental health of patients suffering from addictive disorders is of major concern. This study aimed to explore the presence and potential increase in post-traumatic stress disorder (PTSD) symptoms, depression, and anxiety since the beginning of the pandemic for patients in opioid substitution therapy (OST). Methods: This cross-sectional survey study evaluated a clinical sample of patients in OST (N = 123). Symptoms of post-traumatic stress disorder (PTSD) due to the COVID-19 pandemic were assessed by an adapted version of the impact of event scale (IES-R), resulting in two subgroups of low and high risk for PTSD. The depression, anxiety, and stress scale (DASS-21) was applied to collect data on the respective symptoms, and changes since the onset of the pandemic were reported on separate scales. Sociodemographic and COVID-19 related factors, as well as data on craving, consumption patterns, concomitant use, and the drug market were further assessed. Results: A binary logistic regression analysis confirmed the impact of self-perceived higher burden by psychological and economic factors on the elevated risk for PTSD due to the pandemic. The high-risk PTSD group also showed higher levels of depression, anxiety and stress, as well as a more pronounced deterioration in these symptoms since the pandemic. While reported levels of craving did not differ between the two groups, the high-risk PTSD group indicated a significantly higher increase in craving since the crisis, when compared to the low-risk group. Discussion: Our findings demonstrate elevated levels of clinical symptoms among patients in OST, with more than a quarter of patients found at risk for PTSD due to the COVID-19 pandemic. Furthermore, about 30-50% of our patients reported concerning levels of depression, anxiety, or stress. Special attention should be drawn to these findings, and potential deterioration of the situation should be addressed by health care facilities. Particularly, psychological, and financial burden due to the crisis were identified as factors increasing the risk for PTSD. These factors can easily be evaluated during routine anamneses, and might be a valuable source of information, when special attention is needed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "07fcd93bd08d29faab191b1323f56865",
  "timestamp": "2025-05-15T03:08:37.783823"
}