{
  "id": 25,
  "title": "TREND-HEURISTIC REINFORCEMENT LEARNING FRAMEWORK FOR NEWS-ORIENTED STOCK PORTFOLIO MANAGEMENT",
  "abstract": "Recent studies have shown that reinforcement learning (RL) methods have brought significant performance gains for stock portfolio management (PM) because they effectively utilize historical price information and directly generate portfolio weights. We found, however, that there is still great room for improvement in how to fully consider the impact of financial news and stock trends on PM while avoiding model instability caused by feature disparity and fragile convergence due to RL itself. Addressing this allows us to develop more profitable and robust PM strategies. To this end, we propose TrendTrader, a novel RL framework for news-oriented stock portfolio management with trend heuristics. Specifically, TrendTrader utilizes a large language model (LLM) to obtain sentiment scores of stock news and generates heterogeneous contexts based on global sentiment embedding, which enhances model stability in processing multimodal features. Further, TrendTrader incorporates trend heuristics into both the network architecture and the reward function, while combining supervised learning and reinforcement learning in the form of incremental training to facilitate policy network convergence. Extensive experiments in the U.S. market and the China market verify the state-of-the-art performance of TrendTrader.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0817089d292f4dd11ebad04b6ef68ba7",
  "timestamp": "2025-05-15T00:38:16.285109"
}