{
  "id": 6774,
  "title": "Not all hip arthroplasties are created equal INCREASED COMPLICATIONS AND RE-ADMISSIONS AFTER TOTAL HIP ARTHROPLASTY FOR FEMORAL NECK FRACTURES COMPARED WITH OSTEOARTHRITIS",
  "abstract": "Aims Total hip arthroplasty (THA) is gaining popularity as a treatment for displaced femoral neck fractures (FNFs), especially in physiologically younger patients. While THA for osteoarthritis (OA) has demonstrated low complication rates and increased quality of life, results of THA for acute FNF are not as clear. Currently, a THA performed for FNF is included in an institutional arthroplasty bundle without adequate risk adjustment, potentially placing centres participating in fracture care at financial disadvantage. The purpose of this study is to report on perioperative complication rates after THA for FNF compared with elective THA performed for OA of the hip. Patients and Methods The American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) database between 2008 and 2016 was queried. Patients were identified using the THA Current Procedural Terminology (CPT) code and divided into groups by diagnosis: OA in one and FNF in another. Univariate statistics were performed. Continuous variables were compared between groups using Student's t-test, and the chi-squared test was used to compare categorical variables. Multivariate and propensity-matched logistic regression analyses were performed to control for risk factors of interest. Results Analyses included 139 635 patients undergoing THA. OA was the indication in 135 013 cases and FNF in 4622 cases. After propensity matching, mortality within 30 days (1.8% vs 0.3%; p < 0.001) and major morbidity (24.2% vs 19%; p < 0.001) were significantly higher among FNF patients. Re-operation (3.7% vs 2.7%; p = 0.014) and re-admission (7.3% vs 5.5%; p = 0.002) were significantly higher among FNF patients. Hip fracture patients had significantly longer operative time and length of stay (LOS), and were significantly less likely to be discharged to their home. Multivariate analyses gave similar results. Conclusion This large database study showed a higher risk of postoperative complications including mortality, major morbidity, re-operation, re-admission, prolonged operative time, increased LOS, and decreased likelihood of discharge home in patients undergoing THA for FNF compared with OA. While THA is a good option for FNF patients, there are increased costs and financial risks to centres with a joint arthroplasty bundle programme participating in fracture care.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "081ed07507f18836e822ed40a8356a03",
  "timestamp": "2025-05-15T03:01:31.367812"
}