{
  "id": 2443,
  "title": "Developing a smart stock trading system equipped with a novel risk control mechanism for investors with different risk appetites",
  "abstract": "Due to the increasing complexity of financial markets and the importance of prompt decision-making in these markets, the use of smart trading systems by investors and capital market participants has become vital. With regard to the turbulent and risky nature of financial markets, comprehensive smart systems should be able to manage the risks. In addition, since investors have different levels of risk-taking, it is essential to consider their risk appetite in the risk management system. In this regard, the present study proposes a framework for smart stock trading that uses a new approach to risk management. The proposed system selects blue-chip stocks through a fundamental analysis. Then, trading signals are predicted with technical indicators and a deep neural network model for the selected stocks. By equally weighting the shares, a portfolio is formed, and a new index called risk control index is used to manage the portfolio risk. After the calculation of that risk, the index systematically tries to maintain the risk to a certain extent by using leveraged trading and depositing cash. Using this approach, the amount of investment in stocks is revised on a daily basis, and, for investors with different risk appetites, different approaches to risk management are offered. The performance of the proposed system is evaluated based on the data obtained from Tehran Stock Exchange. The results show that the proposed system can produce different portfolios for investors with different risk appetites. As the investors' risk appetite is increased in the proposed portfolios, the average annual return is increased too. The portfolios have proved to outperform the market in terms of such metrics as maximum drawdown as well as Sharpe and Sortino ratios.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0820811ce9d3f63dc7d0af8835db2ffc",
  "timestamp": "2025-05-15T02:15:27.057228"
}