{
  "id": 5648,
  "title": "Self-Reported Menstrual Alterations During the COVID-19 Syndemic in Spain: A Cross-Sectional Study",
  "abstract": "Introduction: Available evidence suggests that there might be an association between the stressors experienced during the COVID19 syndemic and changes in menstrual patterns. The aim of this study was to assess self-reported menstrual alterations during the COVID-19 syndemic among women and people who menstruate aged 18-55 in Spain. Materials and Methods: A cross-sectional online survey-based study was conducted (March-July 2021). Descriptive statistics were calculated and multivariate logistic regression models were constructed. This study was conducted as part of the Equity and Menstrual Health in Spain research project. Results: Among participants (N=17,455), 39.4% reported menstrual alterations since the start of the syndemic. Participants self reporting long COVID-19 presented higher odds of menstrual alterations (aOR: 1.34, 95% CI, 1.15-1.57). In participants with no history of COVID-19, the risk for self-reported menstrual alterations was significantly higher based on employment situation, among participants experiencing financial issues (eg, financial issues always/many times <12 months: aOR: 1.68, 95% CI, 1.48-1.90), poorer self-perceived health (eg, poor: aOR: 2.00, 95% CI, 1.31-3.07), and those diagnosed with polycystic ovary syndrome (aOR: 1.13, 95% CI, 1.02-1.26). Among participants with a self-reported COVID-19 diagnosis, factors that significantly increased the odds for menstrual alterations were experiencing financial strains (eg, financial issues always/many times <12 months: aOR: 1.53, 95% CI, 1.09-2.14), poorer self-perceived health (eg, poor: aOR: 3.09, 95% CI, 1.01-9.52). Overall, factors that decreased the odds of reporting menstrual alterations included age >25, being a carer, not having a gynecological condition and using hormonal contraception. Discussion and conclusions: Findings suggest an impact of the COVID-19 syndemic on menstrual patterns. Social inequities in reporting menstrual alterations were identified. While the risk of reporting menstrual alterations was higher among participants with long COVID-19, evidence is not conclusive. Further research on menstrual health in the context of COVID-19 is needed, also to inform policy and practice.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08310c1e351e953a89a9992296c1f2f6",
  "timestamp": "2025-05-15T02:49:50.362013"
}