{
  "id": 9002,
  "title": "How were situations of preventive and curative care expenditure for AIDS and medical burden of patients? Research based on System of Health Accounts 2011",
  "abstract": "Background The problem of AIDS response has not only involved public health, but also had a great impact on the family burden.The objective of this study was to estimate the preventive and curative care expenditure(PCE)for AIDS of Hunan Province in 2017 based on System of Health Accounts 2011(SHA2011)by quantity,financing scheme,health provider,health function,and to analyses the factors affecting patients' medical burden. Methods Through stratified multi-stage sampling method, 1336 institutions were surveyed to obtain AIDS prevention and control data, and the official data collected from Health Statistical Yearbook, Health Financial Annual Reports and Government Input Monitoring System were used to estimate the AIDS PCE based on SHA2011. Univariate analyses and ordered logistic regression were used to evaluate the factors affecting the medical burden of AIDS patients. Results The AIDS PCE of Hunan Province in 2017 was 266.67 million, mainly flowed to hospitals and disease prevention and control institutions. The proportions of curative care expenditure(CCE) and prevention expenditure were 51.39 and 48.61% respectively. Prevention expenditure were mainly used for traditional prevention methods. All prevention expenditure and 88.52% of CCE were borne by public financing scheme. Family health expenditure accounted for 11.12% of CCE, but there were still some people with heavy burden of treatment. Non insurance, co-infection and length of stay are risk factors to the total hospitalization expenses(Totalexp)and the out-of-pocket payments(OOPs)(all p < 0.05,OR > 1). Taking the age group under 30 as the reference, the partial regression coefficient of the age group over 60 was statistically significant (OR(Totalexp) = 1.809, OR(OOPs) = 0.30). Conclusion The financing structure of the PCE for AIDS in Hunan Province was relatively stable and the flow of institutions was reasonable. The functional flow of expenditure embodied the principle of prevention first. China should incorporate oral PrEP into the national guidelines as soon as possible to improve the allocation efficiency of AIDS prevention resources. Meantime, several measures should be taken to reduce the medical burden of AIDS patients, including expanding the scope of government assistance, adjusting insurance compensation measures, increasing the rate of patients participating in insurance,encouraging commercial insurance to join the AIDS insurance system,and controlling length of stay in hospital.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08356c3ea99b650d8bbe75dcdefa23ac",
  "timestamp": "2025-05-15T03:24:26.403594"
}