{
  "id": 4691,
  "title": "Clustering of non-medical risk factors and the association with duration of social care in pregnant women in highly vulnerable circumstances",
  "abstract": "Pregnancy can be considered a window of opportunity to help pregnant women optimize the circumstances they live in. Within the Mothers of Rotterdam study, pregnant women in highly vulnerable circumstances received standard social care or targeted social care to improve their circumstances. Women in this study had many combinations of non-medical risk factors contributing to their vulnerable circumstances. Here, the aim is to study the association between different combinations of non-medical risk factors and duration of care. Existing non-medical risk factors, assessed with a vulnerability checklist, were clustered using Latent Class Analysis (LCA). Linear regression was used to examine the relationship with duration of social care. The model was adjusted for maternal age, deprived neighbourhood, and type of social care. Four vulnerability classes were identified among 840 women and were labelled complex (9%), educational (24%), social network (12%), and financial vulnerability (55%). In the unadjusted model, all three classes showed a significant longer duration of social care compared to the financial vulnerability class. After adjustment, only the longer duration of care of the social network vulnerability class remained statistically significant. The four identified vulnerability classes illustrate that even within a group of women in highly vulnerable circumstances, subgroups of vulnerability exist. The vulnerability classes were identifiable through different combinations of non-medical risk factors and are all, associated with different durations of social care. These findings help to understand, and plan for, the requirements of social care for women in highly vulnerable circumstances.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08389b06f6081e1b54a569969582a382",
  "timestamp": "2025-05-15T02:39:57.570622"
}