{
  "id": 6743,
  "title": "Comparing the prevalence and the risk profile for antenatal depressive symptoms across cultures",
  "abstract": "Background and aims: Although several studies have analyzed the risk factors of antenatal and post-partum depression, evidence on the prevalence and the risk profile for antenatal depressive symptoms (ADS) between native-born and different groups of non-native born women living in the same country is scant. The aim of this article is to compare the prevalence and the risk profile for ADS across geographical areas in women recruited from two large hospitals of North-western Italy. Method: The presence of ADS was defined as an Edinburgh Post-natal Depression Scale (EPDS) score 12 or a Beck Depression Inventory, Short Form (BDI-SF) score 9 or the presence of suicidal ideation/behavior. Crude and adjusted odds ratios (ORs) of ADS were calculated using logistic regression models. Results: The prevalence of ADS was 12.4% among Italian women and ranged from 11.4% in other European to 44.7% in North-African women. Crude ORs of ADS were OR=3.3 (95% confidence interval (CI), 1.2-8.8) for Asian, 3.3 (95% CI, 1.9-5.6) for South-American and 5.7 (95% CI, 3.4-9.6) for North-African women. Marital problems, at-risk pregnancy, past psychiatric history, pharmacological treatment, psychological treatment, financial problems, change in residence and number of children were significantly associated with ADS in multivariate analyses, regardless of women's origin. After adjusting for these variables, the OR of ADS remained significant for South-American and North-African women. Conclusion: Our results demonstrate that the risk of ADS varies across geographical areas of origin and is highest among North-African women. The risk factors identified should be assessed in routine obstetric care to inform decisions about interventions to prevent post-partum depression and its consequences on the mothers and the newborns.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0861f9adff99d12d8e6be41859a9fee4",
  "timestamp": "2025-05-15T03:01:03.625699"
}