{
  "id": 4007,
  "title": "Frequency spillovers between green bonds, global factors and stock market before and during COVID-19 crisis",
  "abstract": "This paper examines frequency dynamic spillovers in return and volatility and the hedging ability of Green Bonds, gold, silver, oil, the US dollar index, and volatility index against downside US stock prices before and during the COVID-19 pandemic outbreak and for the short and long run. To do so, we use the Diebold and Yilmaz (2014), the TVP-VAR model, and the frequency spillover index by Barunik and Krehlik (2018). We show that the short-term volatility spillovers dominate their long-term counterparts. Green Bond is net transmitters of spillovers in the system at the short term and net receivers at the long term. S&P500 and silver (USDX and oil) are net transmitters (receivers) of short-and long-term spillovers. Gold and VIX are net receivers of short-term spillovers and net transmitters of long-term spillovers. COVID-19 crisis has more effects on the short-term spillover, which reaches its highest level early 2020. COVID-19 and time horizons lead the direction and the magnitude of spillovers. The Quantile-on-Quantile regression analysis shows significant nonlinear relationships between markets under study. More interestingly, we show that green bonds and gold are safe haven assets for US equity investors during COVID-19. On the other hand, a mixed portfolio offers higher diversification benefits. Finally, hedging effectiveness is dependent on COVID-19 and time horizon. (c) 2022 Economic Society of Australia, Queensland. Published by Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0873a1025cbb2545d1cd65489e83f925",
  "timestamp": "2025-05-15T01:23:07.304488"
}