{
  "id": 7717,
  "title": "Risk Factors Associated With Postmastectomy Breast Cancer Lymphedema A Multicenter Retrospective Analysis",
  "abstract": "Background Lymphedema is an edematous condition that afflicts the postmastectomy breast cancer population, with diminished quality of life with substantial financial costs. The factors predictive of postmastectomy lymphedema development in breast cancer patients are unknown. The objective was to evaluate the trends over time in lymphedema development and the risk factors predictive of lymphedema-related events within 2 years of mastectomy. Methods Using the New York Statewide Planning and Research Cooperative System multicenter deidentified database from 2010 to 2016, a total of 65,543 breast cancer postmastectomy female patients (mean age, 59 +/- 20 years) were identified across 177 facilities. The breast cancer patients were followed for any 2-year postmastectomy lymphedema-related events. A multivariable model identified predictors of 2-year lymphedema using eligible variables involving demographics, comorbidities, and complications. Elixhauser score was defined as a comorbidity index based on International Classification of Diseases codes used in hospital settings. Results Overall, 5.2% (n = 3409) of the breast cancer postmastectomy patients experienced a lymphedema-related event within 2 years of initial surgery. Over time, 2-year postmastectomy lymphedema rates have more than doubled from 4.62% in 2010 to 9.75% in 2016 (P < 0.001). Two-year postmastectomy lymphedema rates varied significantly by mastectomy procedure type: 5.69% of the mastectomy-only procedures, 5.96% of the mastectomies with lymph node biopsies, and 7.83% of the mastectomies with lymph node dissections (P < 0.0001). Full mastectomies had a greater 2-year lymphedema rate of 7.31% when compared with partial mastectomies with 2.79% (P < 0.0001). The top predictive risk factors for a lymphedema-related event included higher Elixhauser score, prolonged hospitalization for mastectomy, more recent mastectomy procedure, obesity, younger age, non-Asian race, Medicaid insurance, and hypertension (all P's < 0.01). Conclusions Although more recent postmastectomy lymphedema rates may not be as high as historical estimates, the 2-year postmastectomy lymphedema rates have more than doubled from 2010 to 2016 requiring further elucidation as well as continued focus on treatment. Furthermore, risk factors were identified that predispose postmastectomy breast cancer patients to developing lymphedema. Given these findings, perioperative screening seems warranted to proactively identify, educate, and monitor postmastectomy patients at greatest risk of future lymphedema development.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0876cc55419909414b82c0ad617023b8",
  "timestamp": "2025-05-15T03:11:38.429845"
}