{
  "id": 8105,
  "title": "The exploration of life experience of married people with genital warts: A qualitative study",
  "abstract": "Context: Human papillomavirus is one of the most important and common sexually transmitted viruses. Aims: The aim of this study was to explore the lived experiences of patients with genital warts. Setting and Design: The present study was conducted by descriptive phenomenological method of Colaizzi's approach in 2020. Sampling was performed from Iranian people referring to the gynecologist's clinics in Iran. Materials and Methods: This study was carried out with 23 participants with genital warts who were chosen by purposive sampling based on the data saturation. The semistructured interview was used Guba and Lincoln proposed criteria were used for the rigor and strength of the study. Statistical Analysis Used: Data analysis was performed by the Colaizi method. OneNote software was used for the data analysis. Result: Patients with the age group of 15-45 years were included. Classification of codes leads to the extraction of 8 sub-themes and four main themes, including numerous fears (fear of rejection and fear of the outcomes of the disease), lack of awareness and misconceptions regarding disease (denial of the main way of getting genital warts, resorting to unconventional therapies), seeking support (the need for financial support and also medical support), and bitter experiences of the disease (physical and psychological problems and disruption of emotional and sexual relationship). Conclusion: Due to the various physical and psychological adverse effects of genital warts, it should be emphasized on increasing public awareness about the prevention, treatment, and predicting the risk of the disease in the community.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08761a14310f615ed8ec9bc525f7d153",
  "timestamp": "2025-05-15T03:15:09.437345"
}