{
  "id": 6669,
  "title": "Assessing change in quality of life using the Oral Health Impact Profile",
  "abstract": "Traditionally, longitudinal studies of oral health have measured only disease progression and ignored improvements in health. Objectives: This study examines methodological issues that arise in longitudinal assessment of change in oral health-related quality of life (OHRQOL). Methods: Baseline and 2-year follow-up data were used from an observational longitudinal study of 498 people aged 60 years or more living in South Australia. Oral health-related quality of life was measured using the Oral Health Impact Profile (OHIP). Three hypothesized risk predictors (tooth loss, problem-based dental visits and financial hardship) were selected to examine the effects of four methods of measuring change: categorical measures of improvement, deterioration and net change, and a quantitative measure of net change in OHIP scores. Results: Some 31.7% of people experienced some improvement and 32.7% experienced some deterioration in OHRQOL. All three high-risk groups had approximately twice the rate of deterioration in OHRQOL compared with their corresponding low-risk groups. Surprisingly, high-risk groups also had higher rates of improvement. When measured categorically, these effects did not cancel one another, indicating that improvement and deterioration in OHRQOL can be experienced simultaneously. However, quantitative analyses cause improvements and deteriorations to cancel, and analysis of mean OHIP scores created a spurious impression that change in OHRQOL did not differ between dental visit groups. Furthermore, changes in mean OHIP scores were masked by regression to the mean. Conclusions: Oral health-related quality of life measures capture both improvement and deterioration in health status, creating new complexities for conceptualizing and analyzing change in longitudinal studies.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0882d68bbc5dd6d59494b16b0fdb148c",
  "timestamp": "2025-05-15T03:00:35.324953"
}