{
  "id": 822,
  "title": "RETRACTED: Predicting the Linkbetween Stock PricesandIndices withMachine Learning in R Programming Language (Retracted Article)",
  "abstract": "This paper provides an in-depth analysis machine study of the relationship between stock prices and indices through machine learning algorithms. Stock prices are difficult to predict by a single financial formula because there are too many factors that can affect stock prices. With the development of computer science, the author now uses many computer science techniques to make more accurate predictions of stock prices. In this project, the author uses machine learning in R Studio to predict the prices of 35 stocks traded on the New York Stock Exchange and to study the interaction between the prices of four indices in different countries. Further, it is proposed to find the link between stocks and indices in different countries and then use the predictions to optimize the portfolio of these stocks. To complete this project, the author used Linear Regression, LASSO, Regression Trees, Bagging, Random Forest, and Boosted Trees to perform the analysis. The experimental results show that the MRDL deep multiple regression model proposed in this paper predicts the closing price trend of stocks with a mean square error interval [0.0043, 0.0821]. Additionally, 80% of the proposed DMISV, KDJSV, MACDV, and DKB stock buying and selling strategies have a return greater than 10%. The experimental results validate the effectiveness of the proposed buying and selling strategies and stock price trend prediction methods in this paper. Compared with other algorithms, the accuracy of the algorithm in this study is increased by 15%, and the efficiency of prediction is increased by 25%.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0882ff95421859f22bb1c5a85f36eb7f",
  "timestamp": "2025-05-15T00:48:22.451565"
}