{
  "id": 7127,
  "title": "Menstrual characteristics and associations with sociodemographic factors and self-rated health in Spain: a cross-sectional study",
  "abstract": "BackgroundEvidence on how menstrual characteristics may differ based on socioeconomic factors and self-rated health is significantly scarce. The main aim of this study was to investigate the associations between menstrual characteristics, sociodemographic factors and self-rated health among women and people who menstruate (PWM) aged 18-55 in Spain.MethodsThis cross-sectional study includes data from an online survey collected in March-July 2021 across Spain. Descriptive statistical analyses and multivariate logistic regression models were performed.ResultsThe analyses included a total of 19,358 women and PWM. Mean age at menarche was 12.4 (SD = 1.5). While 20.3% of our participants experienced a menstrual abundance over 80 ml, 64.1% reported having menstrual blood clots; 6.4% menstruated for longer than 7 days. 17.0% had menstrual cycles that were shorter than 21 days or longer than 35 days. Reports of moderate (46.3%) and high (22.7%) intensity menstrual pain were common. 68.2% of our participants experienced premenstrual symptoms in all or most cycles. The odds for lighter menstrual flow, shorter bleeding days and menstrual cycles were higher as age increased, and amongst participants with less educational attainment. Caregivers presented higher odds for abundant menstrual flow and longer menstruations. Reporting financial constraints and a poorer self-rated health were risk factors for abundant menstrual flow, menstrual blood clots, shorter/longer menstruations and menstrual cycles, premenstrual symptoms, moderate and intense menstrual pain.ConclusionsThis study suggests that age, educational attainment, caregiving, experiencing financial hardship and a poorer self-rated health may shape or mediate menstrual characteristics. It thus highlights the need to investigate and address social inequities of health in menstrual research.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0883f979a061c48e5d4d2ff2cb5888ac",
  "timestamp": "2025-05-15T03:05:32.018191"
}