{
  "id": 6095,
  "title": "Risk transmission mechanism between energy markets: A VAR for VaR approach",
  "abstract": "The Global Financial Crisis (GFC) of 2007-2009 that originated in the US has revealed the need for measuring and monitoring the transmission of extreme downside market risk. This paper investigates the risk transmission mechanism between the oil and natural gas markets. We apply the recently introduced test statistics based on cross-quantilogram function and the multivariate quantile regression model (VAR for VaR) to the US oil and natural gas prices, which are independently formed. Our results show two asymmetric patterns. First, the shocks in the oil market substantially increase the Value at Risk (VaR) in the natural gas market, but the reverse impact does not exist. Second, we highlight the significant asymmetric response of gains and losses transmission in energy markets, cautioning about the underlying weakness of adopting volatility to measure risk in the energy market. Moreover, an extreme market risk is more easily transmitted across markets than moderate risks. Our results are in general robust in application to other regional energy markets, such as Europe and Asia, but the heterogeneities in responses are underpinned by the different role of natural gas in regions. The findings in this paper have important implications for academic researchers, policy makers in gas-dependent economies, and business practitioners in light of projected increases in the use of natural gas worldwide as well as the development of independent gas-on-gas competitive (hub) prices in Asia and Europe. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "088abebe8d166fa9e1b291c815b1973c",
  "timestamp": "2025-05-15T02:54:38.868428"
}