{
  "id": 1782,
  "title": "Association Between Life Event Stressors and Low Birth Weight in African American and White Populations: Findings from the 2007 and 2010 Los Angeles Mommy and Baby (LAMB) Surveys",
  "abstract": "We examined the association between life events stressors during pregnancy and low birth weight (LBW) among African Americans and Whites, while systematically controlling for potential confounders including individual characteristics and city-level variations and clustering. We analyzed data from 4970 women with singleton births who participated in the 2007 and 2010 Los Angeles Mommy and Baby Surveys. Multilevel logistic regression was used to assess the association between emotional, financial, spousal and traumatic stressors and LBW among African Americans and Whites. Potential confounders included were: the city-level Economic Hardship Index, maternal demographics, pre-pregnancy conditions, insurance, behavioral risk factors and social support. African Americans were significantly more likely to experience any domain of stressors during their pregnancy, compared to Whites (p < 0.001). Only the association between financial stressors and LBW was significantly different between African Americans and Whites (p for interaction = 0.015). Experience of financial stressors during pregnancy was significantly associated with LBW among African Americans (adjusted odds ratio = 1.49; 95 % confidence interval = 1.01-2.22) but not Whites. Differential impact of financial stressors during pregnancy may contribute to racial disparities in LBW between African Americans and Whites. We showed that financial life event stressors, but not other domains of stressors, were more likely to impact LBW among African Americans than Whites. Initiatives aimed at mitigating the negative impacts of financial stress during pregnancy may contribute to reducing disparities in birth outcomes between African Americans and Whites.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "088deb78c14eb5b64aca94c0d5021b7a",
  "timestamp": "2025-05-15T02:07:25.705810"
}