{
  "id": 2573,
  "title": "Study on financial risk towards individual investor as strategy to improve urban community empowerment",
  "abstract": "Investor will be always influenced by its risk tolerance when investing, each investor has own risk tolerance that differ to another, although this still being questioned until now. This research aimed to know the influence of demography factor in distinguish and classify Financial Risk Tolerance (FRT) and Financial Risk Taking Behavior (FRB) to individual investor. Methodology in this research is data that used as primary data which distributed by offline and online. The sample in this research is 642 respondents in Jakarta. Logistic regression is analyze method that used in this research. The research found that there is influence of gender, marital, status, education and income level to Financial Risk Tolerance (FRT) and Financial Risk Taking Behavior (FRB). For FRT significantly 0.000 for gender and marital status; 0.010 for education and 0.001 for income level. Whereas for FRB significantly 0.000 for gender; 0.003 for marital status and 0.010 for education level. The research contribution is crucial for financial advisor to notice the characteristic investor based on demography factor such as gender, marital, status, education level and income level. Therefore, this research able to give optional decision for appropriate investment to clients as ones of strategy to improve urban community empowerment.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0898eaa318c608a096488f491aecbdb5",
  "timestamp": "2025-05-15T02:17:01.614714"
}