{
  "id": 7683,
  "title": "The Mobile Health Multiple Lifestyle Behavior Interventions Across the Lifespan (MoBILE) Research Program: Protocol for Development, Evaluation, and Implementation",
  "abstract": "Background: Clustering of multiple lifestyle risk behaviors has been associated with a greater risk of noncommunicable diseases and mortality than one lifestyle risk behavior or no lifestyle risk behaviors. The National Board of Health and Welfare in Sweden reported in 2018 that it is important to provide additional support to individuals with multiple lifestyle risk behaviors, as risks from these behaviors are multiplicative rather than additive. However, the same report emphasized that there is a lack of knowledge regarding interventions that support changes to unhealthy lifestyle behaviors. Objective: The MoBILE (Mobile health Multiple lifestyle Behavior Interventions across the LifEspan) research program has brought together two Swedish research groups supported by international collaborators. Through this collaboration, we aim to design and evaluate a number of novel and tailored mobile health (mHealth) multiple lifestyle behavior interventions across the life span of different health care populations. In addition, the MoBILE research program will extend ongoing research to include mHealth interventions for migrant pregnant women and children. Methods: Each project within the MoBILE program will focus on a specific group: pregnant women, preschool children, high school and university students, and adults in primary and clinical care. All the projects will follow the same 4 phases: requirements, development, evaluation, and implementation. During the requirements phase, implementers and end users will aid the design of content and functionality of the interventions. In the development phase, findings from the first phase will be synthesized with expert domain knowledge and theoretical constructs to create interventions tailored to the target groups. The third phase, evaluation, will comprise randomized controlled trials conducted to estimate the effects of the interventions on multiple lifestyle risk behaviors (eg, alcohol, nutrition, physical activity, and smoking). The final phase will investigate how the interventions, if found effective, can be disseminated into different health care contexts. Results: The research program commenced in 2019, and the first results will be available in 2020. Projects involving pregnant women, preschool children, and high school and university students will be completed in the first 3 years, with the remaining projects being planned for the program's final 3 years. Conclusions: The development of evidence-based digital tools is complex, as they should be guided by theoretical frameworks, and requires large interdisciplinary teams with competence in technology, behavioral science, and lifestyle-specific areas. Individual researchers or smaller research groups developing their own tools is not the way forward, as it means reinventing the wheel over and over again. The MoBILE research program therefore aims to join forces and learn from the past 10 years of mHealth research to maximize scientific outcomes, as well as the use of financial resources to expand the growing body of evidence for mHealth lifestyle behavior interventions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08a4e2d07af38c1de703aa3b3ae3c78f",
  "timestamp": "2025-05-15T03:11:04.533225"
}