{
  "id": 6858,
  "title": "Global and regional trends in the incidence and prevalence of uterine fibroids and attributable risk factors at the national level from 2010 to 2019: A worldwide database study",
  "abstract": "Background:Uterine fibroids (UFs), the most common tumors in women worldwide, may reduce quality of life and daily activities and even lead to adverse fertility and general health events in patients, causing significant societal health and financial burdens. The objective of this study was to evaluate the global burden through epidemiological trends and examine the potential risk factors for UFs at the national level.Methods:Data on the incidence, prevalence, disability-adjusted life years (DALYs), age-standardized incidence rates (ASIRs), age-standardized prevalence rates (ASPRs), and age-standardized DALY rates for UFs were collected, and the associations with the Human Development Index (HDI) and fertility were evaluated. The age trends in the average annual percent change (AAPC) of the incidence and prevalence rates of UFs were evaluated by joinpoint regression analysis. The associations between lifestyle, metabolic, and socioeconomic factors and the ASIRs of UFs were examined using multivariable linear regression analysis.Results:The worldwide incidence and prevalence of UFs have been increasing in the past decade, with AAPCs of 0.27% in the incidence rate and 0.078% in the prevalence rate. During 2010-2019, significant increasing trends in UF ASIR were observed in 52 of 88 countries. The age-specific incidence and prevalence of UFs in most age groups showed increasing trends except for 45-54-year-old women which showed no significant trend. Ecological analysis demonstrated no relationship between the incidence of UFs and the HDI but an inverse association with fertility. The incidence of UFs was positively correlated with alcohol intake, hypertension, overweight, and obesity and negatively correlated with smoking.Conclusion:With the increasing incidence and prevalence worldwide, effective targeted prevention and control of relevant risk factors at the national level should be encouraged to reduce the disease burden of UFs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08aff8ed22f515ac7d75b4385c30fa6a",
  "timestamp": "2025-05-15T03:02:07.583948"
}