{
  "id": 7892,
  "title": "Skilled Nursing Facility Characteristics Associated With Financially Motivated Therapy and Relation to Quality",
  "abstract": "Objectives: In October 2019, the Centers for Medicare & Medicaid Services (CMS) implemented a new payment model for skilled nursing facilities (SNFs) that eliminated financial incentives to provide highintensity therapy. Yet high-intensity therapy in SNFs has been linked to better quality outcomes, potentially putting patients at risk if clinically indicated therapy is reduced under the new payment model. A metric to help differentiate between financially motivated vs clinically indicated therapy in SNFs is thresholding: the percentage of patients receiving therapy within 10 minutes of reimbursement thresholds. This study examined which SNF characteristics are associated with thresholding and how thresholding relates to quality outcomes. Design: Secondary analysis of 2016 CMS administrative data. Setting and Participants: 14,162 SNFs. Methods: SNF Public Use Files, Nursing Home Compare, and Provider of Services files were linked. We used linear regression models to (1) identify SNF characteristics associated with thresholding and (2) determine associations between thresholding and quality outcomes, controlling for SNF and patient characteristics. Results: Thresholding was 6.4 percentage points [95% confidence interval (CI) 5.4, 7.4] higher in SNFs with all contractor therapy staff vs all in-house staff. Compared with nonprofit SNFs, thresholding was 2.5 (95% CI 0.1, 2.9) and 1.6 (95% CI 0.4, 2.9) percentage points higher in governmental and for-profit SNFs, respectively. For each additional therapist per 1000 patient-days, SNFs had 2.9 (95% CI -03.4, -2.4) percentage points lower thresholding. Higher thresholding was significantly associated with worse quality outcomes, including lower rates of functional improvement and community discharge and higher rates of 30-day admissions, but magnitudes were small. Conclusions and Implications: SNFs with higher thresholding behavior may respond to changes in financial incentives under the new payment model by reducing clinically indicated therapy and should be monitored to ensure access to necessary therapy is maintained. Although thresholding behavior may indicate cost-intensive therapy practice, it may not have clinically significant implications for patients. (C) 2020 AMDA - The Society for Post-Acute and Long-Term Care Medicine.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08b34e767cdb673ab14a77335e628a5a",
  "timestamp": "2025-05-15T03:13:04.936017"
}