{
  "id": 5963,
  "title": "HIV Prioritization and Risk Perception Among an Online Sample of Men Who Have Sex With Men in the United States",
  "abstract": "Men who have sex with men (MSM) may prioritize interpersonal and structural factors, such as LGBTQ-related inequalities, housing instability, financial insecurity, and relationship seeking, over HIV prevention. The aim of this study was to assess how MSM prioritize HIV relative to other factors and the association between HIV prioritization, HIV testing and sexual risk behavior, and perceived risk. Data were collected from a national online survey of MSM in the United States assessing HIV knowledge and prioritization. Participants ranked HIV prevention relative to LGBTQ-related concerns and life issues (e.g., housing, job, relationship). Adjusted regression models were conducted to assess the association of HIV prioritization with HIV testing and condomless anal sex (CAS) and to evaluate associations between perceived risk and HIV risk behavior. Among 516 participants, HIV prevention was ranked significantly higher among MSM reporting recent CAS (p = .04) and HIV testing within the past (p = .02); HIV prevention was prioritized higher relative to life issues among MSM reporting last HIV test more than 1 year ago (p = .02). Perceived HIV risk was significantly associated with higher HIV prioritization relative to LGBTQ concerns (p = .001) and life issues (p = .001). Higher HIV perceived risk was associated with lower odds of any CAS (p < .001) and higher odds of having an HIV test in the past year (p < .001). In this online study, HIV prioritization was identified as differentially associated with HIV testing, sexual risk behavior, and perceived HIV risk. HIV prevention programs should integrate strategies to address social and structural inequalities based on priority needs of MSM.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08d808361f9e92c1f3e25edf3d7ce1f5",
  "timestamp": "2025-05-15T02:53:33.331251"
}