{
  "id": 2156,
  "title": "Comparison of Systemic Risk in the Banking Sector and Selected Sectors of Real Economy",
  "abstract": "Banks and other financial companies are less sensitive to the whole market changes than the cyclical construction sector, while they are as sensitive to the market as the non-cyclical food sector. This market sensitivity captures the direct exposure to macro-economic shocks as well as the indirect exposure that arises from contagion as well as feedback effects with the real economy (Munn, Bijlsma 2011). This paper compares systemic risk in the banking sector, the construction sector, the real estate sector, and the food sector. To measure systemic risk we use econometric measures of connectedness based on principal-components analysis (PCA) and delta Conditional Value at Risk (proposed by Adrian and Brunnermeier, 2011). The CoVaR measure is estimated by employing quantile regressions on weekly rates of return data. In PCA, the rate of increase in principal components can be used as an indicator of contagion effect in sector (Billio et al. 2012, Zheng et al. 2012). It has been established that the systemic risk is higher in the banking sector in relation to the other selected sectors. It can also be observed that there is a delay in reaction in the real estate sector on growing interconnectedness in the banking sector and a parallel increase in the banking and the food sector. The increase of interconnectedness in the construction sector has different background. Empirical research will be conducted for the Polish market.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08e0e9379048c5c092228225e3b16658",
  "timestamp": "2025-05-15T02:11:40.636617"
}