{
  "id": 1284,
  "title": "Abnormal trading around common factor pricing models",
  "abstract": "Purpose The purpose of this paper is to investigate the impact of factor-based trading strategies on pricing and volume. Design/methodology/approach The authors employ a regression discontinuity approach to identify abnormalities in volume or pricing around expected portfolio changes. In addition, the authors characterize more granular effects on pricing and volume as a result of portfolio re-classification through Fama and Macbeth (1973) regressions. Findings The authors find that firms which are predicted to transfer among the factor portfolios of Fama and French (1993) exhibit strong and statistically significant short-term variation in stock price and volume. Short-term returns around the cutoff values comprising SMB and HML tend to be temporarily high if the firm is predicted to move into a long component of a factor-mimicking portfolio, and temporarily low if moving into a short component. Similar results are apparent when examining movement in and out of the 25 size and book-to-market sorted test asset portfolios. Practical implications The use of portfolio strategies formulated on the basis of sorting procedures, while once upon a time a niche market in the portfolio management industry, is now ubiquitous. The results of this study raise interesting methodological questions about the pricing implications arising from these common methodologies. Originality/value This study makes a number of contributions. First, it contributes to the idea that the publication or dissemination of trading strategies or - more generally - common portfolio sorting methods, leads to effects on pricing and volume through commonly motivated trading pressure. In other words, recipe-like discoveries of advantageous trading strategies lead to a synthetic creation of demand. Second, by noting that a lot of factor-focused trading activity begins around July and August of each year, the study relates to existing literature which documents seasonal variation in stock returns and volume. The findings raise questions about what guides institutional investors' portfolio allocation decisions and whether these are optimal in aggregate.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08ebe72ba605f198a11172cb33f2549f",
  "timestamp": "2025-05-15T00:53:42.207239"
}