{
  "id": 8943,
  "title": "Lost to follow-up: reasons and characteristics of patients undergoing corneal transplantation at Tenwek Hospital in Kenya, East Africa",
  "abstract": "Introduction: corneal transplantation is a surgical procedure requiring consistent long-term follow-up to maximize the chance of graft survival. The purpose of this study was to explore patient characteristics and reasons for being lost to follow-up (LTFU). Methods: a retrospective review of clinical records from January 2012 to October 2014 was conducted of patients who received corneal transplantation at Tenwek Hospital. At the time of chart review, all patients who provided a mobile phone number were contacted to answer a phone questionnaire. Logistic regression was used to assess the association of each patient characteristic, separately, with the outcome of LTFU. Results: of the 118 patients that met inclusion criteria, 40 (33.9%) were considered LTFU by failing to follow up at Tenwek Hospital to at least one year postoperatively. The odds of LTFU for patients age 60 and older were 3.78 times that of those who were 18-59 (95% CI: 1.21-11.80]; p-value=0.02). The odds of LTFU for patients with a preoperative diagnosis of pseudophakic bullous keratopathy were 3.83 times that of those with a preoperative diagnosis of keratoconus (95% CI: [1.13-12.94]; p-value=0.03). Education level, employment status, distance from the hospital, and possession of a mobile contact number appeared marginally associated with follow-up status, though not statistically significant at the 0.05 significance level. Financial barriers were the most commonly cited reason for LTFU (42.4%, n=14). Conclusion: certain reasons and patient characteristics may be associated with follow-up adherence. Identifying these factors may help providers identify patients who are at a higher risk of LTFU and influence providers in medical decision-making and system-based interventions when offering corneal transplantation.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08ef5333a2ffc9d2b23d389e26750215",
  "timestamp": "2025-05-15T03:23:56.107131"
}