{
  "id": 2492,
  "title": "Enabling Large Scale Deep Learning on Smart Device by Exploiting Edge-Cloud Computational Paradigm",
  "abstract": "A deep neural network (DNN) has the ability to rival humans in performing wide variety of tasks. The exceptional ability of DNN comes with high computational, memory, and power cost. In order to enable DNN on edge devices and any real-time environments like self-driving car, many techniques have been developed. Most of the techniques use a single network and sacrifice huge amount of accuracy to reduce the cost. In our paper, we propose a hierarchical network to enable computation on edge devices with the help of a cloud to reduce the accuracy loss. The networks have to be able to detect uncertainty in their prediction which is not usually calibrated. This paper uses modern portfolio theory to calibrate uncertainty on the model prediction. The idea is to optimize the return of a horse race problem based on the doubling rate of gambling where a gambler needs to find the proportion between making a prediction and abstain when the network is not confident. For the high abstain score, the data will be forwarded to a deeper model for better prediction. We demonstrated that the proposed framework outperforms knowledge distillation and pruning algorithms. The superiority of our result enables a high-quality result on intelligence IoT applications.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08f7808de5f7c676e5bf93a508de060d",
  "timestamp": "2025-05-15T01:07:35.658938"
}