{
  "id": 4530,
  "title": "An extended robust optimisation approach for sustainable and resilient supply chain network design: A case of perishable products",
  "abstract": "Disruptions and uncertainties pose considerable challenges in supply chain (SC) operations, requiring robust, strategic approaches. This study addresses financial resource allocation between supply chain network (SCN) design and external market investments, explicitly considering budget allocation and sales representative selection for perishable products. We propose a novel axis-shift robust (AxShR) method combined with an enhanced p-robust optimisation framework to manage multiple complex uncertainties. The model introduces a new resilience strategy allowing retailers to transfer products within the SCN, and apply artificial intelligence (AI) via a neural network to predict disruptions by evaluating risk indicators such as supplier location risk, raw material availability, transportation infrastructure reliability, energy supply stability, and labour availability. Multi-cut Benders decomposition enhances computational efficiency, while goal programming accommodates multiple conflicting objectives (profitability, environmental sustainability, and job creation), with decision-makers assigning weights reflecting managerial and policy priorities. Comparisons with classical approaches (including two-stage stochastic programming and the Bertsimas-Sim robust method) demonstrate significantly improved performance, as sensitivity analyses indicate that neglecting resilience increases expected and worst-case costs by 10.21 % and 16.54 %, respectively. Higher disruption levels demand more extensive, combined resilience strategies rather than reliance on a single measure. Additionally, optimal pricing decisions balance profitability with demand fulfilment, guiding policymakers to reallocate resources between SCN design and external investments when gross profit margins shift. The proposed robust approach outperforms classical methods in managing uncertainty, and employing multi-cut Benders decomposition yields faster computational performance than commercial solvers and traditional methods, strengthening both the model's applicability and overall operational resilience.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "08f98b9c12228acc60d75e5fffe6cf4d",
  "timestamp": "2025-05-15T02:38:20.329049"
}