{
  "id": 8327,
  "title": "The European Union (EU) green taxonomy: codifying sustainability to provide certainty to the markets",
  "abstract": "This study aims at making the potential implications of the 'Green' Taxonomy implementation emerge. The EU (European Union) regulatory framework on sustainability-related issues and the regulatory action in the area of non-financial or ESG (environmental, social and governance) reporting have highlighted the need for more academic contributions. There could, indeed, be a risk of oversimplification of an issue that cannot be solved without considering its practical implications on the stakeholders affected. Hence, failing to think these through might result in tragic consequences from a societal standpoint, despite being outstanding from an environmental one. This critical analysis, thus, investigates a few crucial points pertaining to the EU 'Green' Taxonomy-as the latest classification system for environmentally sustainable economic activities proposed by the EU-with the aim of providing academics and policymakers with a balanced report between theory and practice. By means of archival data, content analysis and bibliometric techniques, and implementing the steps of the systematic literature network analysis (SLNA) protocol which were deemed pertinent for the purposes of our study, we conducted a documentary review regarding the EU Taxonomy. Based on this critical analysis, we were able to outline (a) the rationale of Regulation (EU) 2020/852, (b) its structure, (c) its ability to improve corporate environmental performance and (d) the role played by specific nuclear and gas energy activities for a climate-neutral future. Every economic choice implies a cultural choice, and economics-unlike natural sciences-is essentially based on decisions, which can be influenced. The study, thus, concludes with proposals for future research and potential improvements of EU frameworks in order to support an efficient achievement of the Green Deal objectives and the 2030 Agenda.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0930e9c82ebb754750036b2c468bb9b5",
  "timestamp": "2025-05-15T03:17:49.101018"
}