{
  "id": 1977,
  "title": "Advanced Option Pricing and Hedging with Q-Learning: Performance Evaluation of the QLBS Algorithm",
  "abstract": "This article provides an overview of the recent advances in reinforcement learning (RL) for pricing and hedging financial instruments, focusing on the Q-Learning Black-Scholes (QLBS) approach. This RL approach bridges the traditional Black-Scholes-Merton (BSM) model with artificial intelligence algorithms, enabling option pricing and hedging in a completely model-free and data-driven way. The study evaluates the QLBS algorithm's performance across different state variables and scenarios for a European put option, showing that the model accurately estimates option prices under varying volatility levels, hedging frequencies, risk-free rates, and when dividends are included. Additionally, the QLBS method shows robust performance in pricing and hedging options across different moneyness levels, with more pronounced deviations from the BSM model for deep in-the-money options under higher risk aversion. The empirical analysis also incorporates proportional transaction costs using at-the-money S&P 500 call options, revealing varied implications for profitability and risk mitigation, influenced by the choice of state variables. The article sheds light on the QLBS model's explainability by providing detailed technical notes and a numerical example, and additionally, the results reveal its high practical relevance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09361f2d3001d27b8bdbe81e4d50f828",
  "timestamp": "2025-05-15T02:09:48.312469"
}