{
  "id": 3604,
  "title": "Data Mining to Assess Organizational Transparency across Technology Processes: An Approach from IT Governance and Knowledge Management",
  "abstract": "Information quality and organizational transparency are relevant issues for corporate governance and sustainability of companies, as they contribute to reducing information asymmetry, decreasing risks, and improving the conduct of decision-makers, ensuring an ethical standard of organizational control. This work uses the COBIT framework of IT governance, knowledge management, and machine learning techniques to evaluate organizational transparency considering the maturity levels of technology processes applied in 285 companies of southern Brazil. Data mining techniques have been methodologically applied to analyze the 37 processes in four different domains: Planning and organization, acquisition and implementation, delivery and support, and monitoring. Four learning techniques for knowledge discovery have been used to build a computational model that allowed us to evaluate the organizational transparency level. The results evidence the importance of IT performance monitoring and assessment, and internal control processes in enabling organizations to improve their levels of transparency. These processes depend directly on the establishment of IT strategic plans and quality management, as well as IT risk and project management, therefore an improvement in the maturity of these processes implies an increase in the levels of organizational transparency and their reputational, financial, and accountability impact.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0937de9e472754ae8b6754650a265c38",
  "timestamp": "2025-05-15T02:27:54.118041"
}