{
  "id": 8649,
  "title": "Gentrification and binge drinking in California neighborhoods: It matters how long you've lived there",
  "abstract": "Background: Neighborhood context plays a role in binge drinking, a behavior with major health and economic costs. Gentrification, the influx of capital and residents of higher socioeconomic status into historically-disinvested neighborhoods, is a growing trend with the potential to place urban communities under social and financial pressure. Hypothesizing that these pressures and other community changes resulting from gentrification could be tied to excessive alcohol consumption, we examined the relationship between gentrification and binge drinking in California neighborhoods. Methods: California census tracts were categorized as non-gentrifiable, stable (gentrifiable), or gentrifying from 2006 to 2015. Outcomes and covariates were obtained from the California Health Interview Survey using combined 2013-2015 data (n = 60,196). Survey-weighted logistic regression tested for associations between gentrification and any binge drinking in the prior 12 months. Additional models tested interactions between gentrification and other variables of interest, including housing tenure, federal poverty level, race/ethnicity, sex, and duration of neighborhood residence. Results: A third of respondents reported past-year binge drinking. Controlling for demographic covariates, gentrification was not associated with binge drinking in the population overall (AOR = 1.13, 95% CI = 0.95-1.34), but was associated with binge drinking among those living in the neighborhood < 5 years (AOR = 1.49, 95% CI 1.15-1.93). No association was seen among those living in their neighborhood 5 years. Conclusions: For those newer to their neighborhood, gentrification is associated with binge drinking. Further understanding the relationship between gentrification and high-risk alcohol use is important for policy and public health interventions mitigating the impact of this process.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09425352970a14f0bb4943bd8b64051d",
  "timestamp": "2025-05-15T03:20:55.983833"
}