{
  "id": 4634,
  "title": "Adverse selection, loan access and default behavior in the Chilean consumer debt market",
  "abstract": "Why do households use different types of loans? Which factors cause borrowers to default? Using a comprehensive survey dataset from Chile, I estimate a partial information model of consumer debt access, lender choice, loan amount and default. The model consists of a first-stage multinomial logit that explains the choice across the five loan types, plus the options of no access to debt due to credit constraints and a no wish for consumer debt. In the second and third stages, the model assumes a log-linear regression of the debt amount and a logit regression of the default behavior, accounting for the loan type selection probability. Identification is obtained using factors measured at different time periods for the default and the loan type choices. I find that households choose different lenders based on income, education and labor risks. Higher income and education decrease the probability of credit constraints, while increasing bank lending and debt amounts. Unemployment risk and household size increase the chances of all the loan types; however, unemployment decreases the debt amount. Age and wage volatility reduce the probability of all loans. Default decreases with income, education and age, whereas it increases with indebtedness, unemployment, household size, health shocks, and paying previous loans. Counterfactual exercises demonstrate that pension reform, higher requirements for borrowers' capacities, and financial literacy programs could substantially reduce default risk. Financial literacy could greatly reduce arrears, households with credit constraints, the number of debtors and the aggregate debt amounts, especially for non-bank lending.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0945e7b73468132ffa35beb0629051ff",
  "timestamp": "2025-05-15T02:39:26.979812"
}