{
  "id": 7932,
  "title": "Unlocking the path to creditworthiness: the nexus of national governance and credit ratings in emerging markets",
  "abstract": "This study investigates the relationship between National Governance (NG) and Credit Ratings in emerging countries and examines how the institutional context impacts a company's creditworthiness. We utilized empirical tests and Ordered Probit regression models to analyze a sample of 2126 observations from BRICS-listed firms from 2010 to 2018. The study aims to explore the dynamics between NG and Credit Ratings. Our results confirm the positive influence of National Governance on corporate ratings within the BRICS countries, which aligns with previous international evidence. Additionally, the research reveals the moderating role of NG concerning the determinants of Credit Ratings. By demonstrating the positive relationship between institutional quality and corporate credit rating, this study contributes to the existing literature and provides valuable insights for Credit Rating Agencies (CRAs) in assessing corporate ratings within the BRICS countries. This study offers practical insights for investors, banks, financial professionals, researchers, and CRAs, enhancing their understanding of credit risk in emerging countries and facilitating well-informed decision-making. By examining the impact of National Governance on Credit Ratings, this study supports the proposition that enhanced NG strengthens Corporate Governance, leading to improved credit ratings. Examining this relationship within the emerging economies of BRICS represents a novel contribution, as it is crucial for evaluating investment returns and ensuring resource redemption guarantees, given these nations' growth potential.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0957bb0246017c44b519747f6747d80f",
  "timestamp": "2025-05-15T03:13:30.665488"
}