{
  "id": 5918,
  "title": "Does ESG Compliance Manipulate the Different Channels of Cash Holding?",
  "abstract": "This study focuses on examining the impact of ESG (Environmental, Social, and Governance) compliance on firm cash holdings and explores the various channels through which ESG compliance affects these holdings. The analysis is conducted using data from the United States. The results of our investigation reveal that firms operating in regions with high ESG compliance exhibit significantly lower levels of cash holdings compared to firms operating in regions with low ESG compliance. This finding suggests that ESG compliance has a negative effect on cash holdings. Furthermore, our study delves into the mechanisms through which ESG compliance influences cash holdings. We find that financial constraints and financial reporting quality serve as channels through which ESG compliance reduces cash holdings. In contrast, ESG compliance increases cash holdings through the channels of idiosyncratic and systematic risk. Additionally, our research highlights that the impact of ESG compliance on cash holdings is more pronounced in firms operating in regions with lower ESG compliance. This finding implies that firms in regions with weaker ESG compliance are more sensitive to the effects of ESG practices on their cash management decisions. To address potential endogeneity concerns and enhance the robustness of our findings, we employ the 2SLS (Two-Stage Least Squares) and GMM (Generalized Method of Moments) cluster regression analysis techniques. Overall, the findings of this study suggest that ESG compliance plays a crucial role in determining the optimal level of cash holdings for firms. By understanding the impact of ESG compliance on cash management, firms can make informed decisions regarding their financial strategies and align them with their sustainability goals.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "095bb295782be11d55d417ea59de1748",
  "timestamp": "2025-05-15T02:53:02.995496"
}