{
  "id": 7156,
  "title": "The burden of metastatic disease of the femur on the Medicare system",
  "abstract": "Background: In the United States, over 1,650,000 new cases of cancer are being diagnosed yearly with almost 50 % of them being the top five bone-seeking cancers. Since cancer risk increases with age, this suggests that orthopedic oncology services may be a strain on the Medicare system. The femur is the most common site of long bone metastases. Prophylactic fixation techniques prevent pathologic fractures, reduce morbidities, and enhance the quality of life of patients with femoral metastases. This study aims to assess the rate of metastatic disease to the skeleton and evaluate the use and financial burden of femoral prophylactic fixation techniques on the Medicare system. Questions/purposes: (1) In the Medicare population, has the number of skeletal metastases increased? (2) In the Medicare population, has the use of prophylactic fixation techniques increased? (3) How has the financial burden of prophylactic fixation changed over the study period? Methods: The Medicare database was searched between 2005 and 2014 with the assistance of PearlDiver Technologies Inc. and the RBRVS DataManager Online from the American Medical Association. Searches were completed by using International Classification of Disease-9 (ICD-9) and current procedural terminology (CPT) codes for secondary malignant neoplasms and prophylactic fixation techniques. Facility charges, Medicare reimbursement and length of hospital stay were extracted from the Medicare database. Simple linear regression was performed to test the significance of yearly changes and the coefficient of determination was used to assess the strength of the correlation. Results: (1) In the Medicare population, has the number of skeletal metastases increased? While the number of Medicare patients with skeletal metastases has increased from 132,452 in 2005 to 155,819 in 2012 (p = 0.01, r(2) = 0.72), the prevalence of skeletal metastases in this population remained constant at 30.66 cases per 10,000 Medicare patients in 2012 (p = 0.56, r(2) = 0.06). (2) In the Medicare population, has the use of prophylactic fixation techniques increased? The number of prophylactic fixation techniques has not increased from 2005 to 2014 (p = 0.68, r(2) = 0.02); however, the rate of prophylactic fixation among those diagnosed with skeletal metastases has significantly decreased from 94.6 per 10,000 in 2005 to 82.72 per 10,000 in 2012 (p = 0.006, r(2) = 0.74). (3) How has the financial burden of prophylactic fixation changed over the study period? Both total and average hospital charges increased after adjusting for inflation in the total Medicare population; however, only the average Medicare reimbursement changed to reflect this. The total amount Medicare spent on prophylactic fixation techniques in 2012 was $20,245,957 after adjusting to 2014. Despite the increase in hospital charges and average Medicare reimbursement, the average length of hospital stay in the total Medicare population showed a significant decreased trend-down from 7.51 days in 2005 to 5.86 days in 2012 (p = 0.02, r(2) = 0.81). Conclusions: Although the prevalence of metastatic disease to the skeleton remained stable between 2005 and 2012 in the Medicare population, prophylactic femoral fixation techniques declined in elderly adults between 2005 and 2014. This most likely signifies an increase in other treatment modalities that can prevent pathologic fractures such as prophylactic hemiarthroplasty, bisphosphonates, and/or radiation therapy.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09672aa4155c4c75216a4e749b5f4310",
  "timestamp": "2025-05-15T03:05:32.115360"
}