{
  "id": 4848,
  "title": "Over-indebtedness - a Harbinger of Financial Exclusion",
  "abstract": "The article explores the link between financial exclusion and the problems of social exclusion and the at -risk of poverty and highlights relevance in the context of social policy. The study seeks to analyze the problem of over -indebtedness as a threat to financial exclusion. The purpose of the study is implemented by disclosing the concept and causes of financial exclusion, analyzing over -indebtedness measurement and management. The tendency to over -indebtedness is determined by a whole palette of factors: social, demographic, economic, psychological, behavioral. It examines which groups of society are most likely to face financial difficulties in fulfilling their financial obligations and other household payments and to be over -indebted. Assessing gross debts of households and the scope of over -indebtedness, links with the socio-economic environment and available demographic data of debtors in Lithuanian municipalities are established. Over -indebtedness figures are analyzed using a secondary analysis of the Centre of Registers (database of open bailiffs' files, 1995-2023), the Official Statistics Portal, and the Employment Service for 2022. The data are analyzed using descriptive statistics, also Pearson correlation and linear regression were performed. The result of the study shows alarming increase in the amount of over -indebtedness in Lithuania. Over -indebtedness arrears are unevenly distributed among the population of different ages. The situation is not homogeneous between large and small municipalities. Results show that in large municipalities there is strong positive link between debts per person, poverty rate and amount of average salary. The problem of financial exclusion, and especially over -indebtedness, requires further extended research and increased attention in the political agenda.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "097f9dcb26a7b788a6502d5b847789df",
  "timestamp": "2025-05-15T02:41:32.799921"
}