{
  "id": 4928,
  "title": "Understanding the interplay between covariance forecasting factor models and risk-based portfolio allocations in currency carry trades",
  "abstract": "With the exception of naive methods for portfolio selection, such as the equal weighted approaches, all other methods of portfolio allocation are more or less sensitive to the quality of the inputs considered in constructing the models and risk measures utilized in the allocation framework. The extensively used factor model proposed initially by Sharpe in 1963 has provided a robust backdrop for development of relevant, micro, macro, and context-specific or asset specific explanatory variables to be incorporated in a statistical manner as inputs to forecasting models that can then be used to obtain risk measures upon which portfolio allocations are based. However, like all statistical models, a set of statistical assumptions accompany this factor model regression framework, one of which has recently been highlighted as seemingly nonvalidated in financial data. This is, of course, the assumption such factor models make on homoskedasticity or weak-sense covariance stationarity of the returns processes being modeled. Such factor models, therefore, have typically failed to cope with an important and ubiquitous feature of financial assets data, which often demonstrates heteroskedasticity of the returns variances and covariances. We propose a novel generalized multifactor forecasting structure utilizing a covariance regression model, which allows us to incorporate the required heteroskedasticity effects while also admitting potential dependence in the idiosyncratic error terms. We argue that such a modeling approach allows for more explicit relationships to be interpreted between the driving factors and the conditional responses of the portfolio returns. We then compare the forecasting performances of our model with the multifactor model and the time series dynamic conditional correlation model through a currency portfolio application.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "098a6177cb7cee981bc5f4e18f63cfb9",
  "timestamp": "2025-05-15T02:42:36.132331"
}