{
  "id": 2850,
  "title": "The Analysis of Credit Risks in Agricultural Supply Chain Finance Assessment Model Based on Genetic Algorithm and Backpropagation Neural Network",
  "abstract": "The risk assessment methods of agricultural supply chain finance (SCF) are explored to reduce agricultural SCF's credit risks. First, the genetic algorithm (GA) is utilized to adjust and determine the initial weights and thresholds of the backpropagation neural network (BPNN), which assesses the credit risks. Second, for the problem that many factors affect the credit risks and the difficulty in selecting the characteristics, the principle of assessment indicator selection is proposed; the characteristics of these indicators are selected by principal component analysis (PCA). Finally, the case analysis method is utilized to verify the proposed risk assessment method, and an optimal credit risk assessment method is established. The results show that GA-BPNN can accelerate the convergence speed of the BPNN and improve the disadvantage in easily falling into the local minimum of BPNN. The PCA method simplifies the complexity of assessment indicator selection, and the representative indicators in agricultural SCF credit risk assessment are successfully selected. Through verification, it is found that the GA-BPNN algorithm performs well in credit risk prediction of agricultural SCF, and its prediction accuracy and prediction speed are improved. Therefore, the used GA-BPNN has performed well in the credit risk prediction of agricultural SCF, which applies to financial credit risk assessment to reduce the credit risks in agricultural SCF.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "098c3ecfab213101a4f6f0d9aee9ef76",
  "timestamp": "2025-05-15T02:19:46.720632"
}