{
  "id": 3546,
  "title": "INNOVATIVE TOOLS FOR INVESTMENT MANAGEMENT IN THE DIGITAL ECONOMY: A GUIDE FOR POST-SOCIALIST COUNTRIES",
  "abstract": "This paper summarizes the arguments and counterarguments within the scientific discussion on the issue of establishing the main factors that determine the parameters and dynamics of investment activity in the country based on sources of investment financing. The main purpose of the research is to study the formed in post-socialist countries features of investment management and to develop proposals for the introduction of innovative approaches to investment management considering the experience of developed countries and current trends in digitalization of the economy. Investigation of the topic of investment management in post-socialist countries in terms of resources of investment financing is carried out in the paper in the following logical sequence. First, the literature review and theoretical analysis of the issue allowed identifying the main sources of investment financing such as own funds of enterprises, household savings, banking sector loans, capital market financing, budget funds, foreign direct and portfolio investment, funds of international organizations. The second stage of the study held a comparative analysis of the role of each of the factors on the parameters and dynamics of investment activity in post-socialist countries. Methodological tools of the research methods are correlation and regression analysis. The statistical base of the study is the World Bank data on gross capital formation, gross savings, foreign direct and portfolio investment, long-term commercial bank loans, taxes on income, profit and capital gains. The third component of the research is the study of the experience of developed countries in the use of innovative investment financing tools, analysis of the dynamics of digital capital management tools such as WealthTech. Based on the study findings, the authors proposed recommendations for improving the efficiency of investment management in post-socialist countries and options for adapting digital tools to attract investment and manage them.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "098d137083639d4b8157c495e5e3da46",
  "timestamp": "2025-05-15T01:18:20.517955"
}