{
  "id": 7332,
  "title": "Digital risks for humans: Subjective perception and possibilities of regulatory impact on online experiment data",
  "abstract": "The problem of combining the high speed of technological changes in the digital environment and the inertia of cognitive systems gives rise to many negative effects for humans (user manipulation, growth of cybercrime, re-sistance to digitalization, etc.), which poses the problem of personal security, its boundaries and control delegation. Many subjects of the digital economy (state, IT companies, commercial banks, etc.) are beginning to offer various digital protection systems, which, however, do not take into account existing social practices and strategies for human adaptation to cyber threats, and therefore are still ineffective. Building comprehensive digital security systems requires an understanding of the characteristics of people's perception of the digital risks and a willingness to entrust the man-agement of personal security to external entities. The focus of our research is on the subjective perception of the risks of digitalization and regulatory impacts. The aim was to study the assessment characteristics of digital risks by unqual-ified experts and the willingness to entrust risk management to various social actors in connection with the personal characteristics of the respondents. The empirical study was conducted using the following methods: online experiment on cases describing digital risks; questionnaires to assess the subjective perception of risks, possible technologies for their control, digital competencies, socio-demographic characteristics of respondents; the Intolerance-Tolerance to Un-certainty test (S. Budner, adaptation by T.V. Kornilova, M.A. Chumakova). The following methods were used for data analysis and processing: one-way analysis of variance, Kruskal-Wallis test, correlation analysis, Fisher's multifunction test, cluster analysis, multiple regression analysis. The study revealed the specificity of the respondents' assessments of risk indicators describing the likelihood of occurrence and the degree of damage associated with the type of risk event, indicators of tolerance/intolerance of uncertainty (TIU), and level of digital competency. The respondents are ready to delegate primary risk management to experts or carry out this process independently. Regression models re-vealed significant dependencies between the choice of risk management agents and predictors - total damage index, TIU indicators. The analysis of the experimental study made it possible to obtain multifaceted results regarding the specifics of assessments by unqualified experts of situations of digital collective risks in connection with their personal characteristics, as well as assessments of personal security controls. The results obtained, taking into account the ex-pansion of factors of digital and technological risks in modern society, can be useful for developers of new human-oriented digital technologies, specialists in the field of digital and financial security, other regulatory impact subjects.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09b7b69ec742069708427c6b478c6df1",
  "timestamp": "2025-05-15T03:07:31.880755"
}