{
  "id": 7606,
  "title": "Natural resources volatility, political risk and economic performance: Evidence from quantile-on-quantile regression",
  "abstract": "The growing concerns regarding natural resources volatility (TNR) and CO2 emissions in relation to economic performance attract the attention of scholars and policy-makers. In this regard, the current study investigated both TNR and CO2 along with the political risk index (PRI) in the case of China. The study used a novel approach, Quantile-on-Quantile regression methods, to capture the influence of each variable at different quantiles covering the period from 1988 to 2020. The examined results revealed that TNR, PRI, and CO2 emissions are positively but weakly associated with economic performance in China. The nexus is found weaker regarding the magnitude at lower quantiles while stronger at upper quantiles. Moreover, the frequency domain causality suggests that TNR significantly causes economic performance in the medium and the long run. At the same time, PRI is found to significantly cause economic performance in the long run only. In contrast, CO2 emissions are found to significantly cause economic performance in the short-run, medium-run, and long-run. Based on the empirical findings, the current study recommends policies to minimize volatility in natural resources, strengthen political and financial sectors, improve institutional quality, and efficient use of fossil fuels to promote economic performance while reducing environmental hazards.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09b977544ee0c94ac72fadb1460f49ee",
  "timestamp": "2025-05-15T03:10:05.667507"
}