{
  "id": 3242,
  "title": "Does audit quality moderate the relationship between financial statements readability and stock price crash risk?",
  "abstract": "PurposeThis study aims to examine the correlation between the readability of financial statements and the likelihood of future stock price crashes in nonfinancial companies listed on the Egyptian Stock Exchange. It further explores the possible moderating effect of audit quality on this relationship.Design/methodology/approachThe study uses ordinary least squares regression, generalized least squares estimation and two-stage least squares methodology to examine and validate the research hypotheses. The sample comprises 107 nonfinancial companies registered on the Egyptian Stock Exchange from 2016 to 2019.FindingsThe results reveal a significant negative association between the readability of financial statements and stock price crash risk. This suggests that companies with more complex financial statements tend to experience higher future crash risks. Additionally, the study identifies audit quality as a significant moderating factor. Higher audit quality, often indicated by engagements with Big-4 audit firms, strengthens the influence of financial statements readability on stock price crash risk. This implies that while high audit quality enhances investor confidence and market stability, it also accentuates the negative consequences of complex financial statements.Practical implicationsThe findings of this paper have significant implications for regulators and standard-setting bodies in Egypt. They should consider refining and revising existing standards to emphasize the importance of enhancing the readability of financial reports. Additionally, auditing firms should actively engage in efforts to ensure clearer and more transparent financial reporting. These actions are vital for boosting investor confidence, strengthening Egypt's capital market and mitigating potential risks associated with information opacity and complexity.Originality/valueThis study represents a pioneering endeavor within the Arab and Egyptian financial environments. To the best of the author's knowledge, it is the first examination of the association between the readability of financial statements and stock price crash risk in these contexts. Furthermore, it explores factors such as audit quality that may influence this connection.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09bd351ae1321a530c9cb6eb53338ba0",
  "timestamp": "2025-05-15T02:24:05.201173"
}