{
  "id": 436,
  "title": "Intact cell mass spectrometry coupled with machine learning reveals minute changes induced by single gene silencing",
  "abstract": "Intact (whole) cell MALDI TOF mass spectrometry is a commonly used tool in clinical microbiology for several decades. Recently it was introduced to analysis of eukaryotic cells, including cancer and stem cells. Besides targeted metabolomic and proteomic applications, the intact cell MALDI TOF mass spectrometry provides a sufficient sensitivity and specificity to discriminate cell types, isogenous cell lines or even the metabolic states. This makes the intact cell MALDI TOF mass spectrometry a promising tool for quality control in advanced cell cultures with a potential to reveal batch -to -batch variation, aberrant clones, or unwanted shifts in cell phenotype. However, cellular alterations induced by change in expression of a single gene has not been addressed by intact cell mass spectrometry yet. In this work we used a well -characterized human ovarian cancer cell line SKOV3 with silenced expression of a tumor suppressor candidate 3 gene (TUSC3). TUSC3 is involved in co -translational N-glycosylation of proteins with well-known global impact on cell phenotype. Altogether, this experimental design represents a highly suitable model for optimization of intact cell mass spectrometry and analysis of spectral data. Here we investigated five machine learning algorithms (k -nearest neighbors, decision tree, random forest, partial least squares discrimination, and artificial neural network) and optimized their performance either in pure populations or in two -component mixtures composed of cells with normal or silenced expression of TUSC3. All five algorithms reached accuracy over 90 % and were able to reveal even subtle changes in mass spectra corresponding to alterations of TUSC3 expression. In summary, we demonstrate that spectral fingerprints generated by intact cell MALDI-TOF mass spectrometry coupled to a machine learning classifier can reveal minute changes induced by alteration of a single gene, and therefore contribute to the portfolio of quality control applications in routine cell and tissue cultures.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09c03c2f21d304874e86894776537448",
  "timestamp": "2025-05-15T00:43:10.610344"
}