{
  "id": 1655,
  "title": "An Optimized BP Neural Network Model and Its Application in the Credit Evaluation of Venture Loans",
  "abstract": "With the rapid development of entrepreneurship loans in China, the construction of a credit evaluation system of risk loans has become an important financial safeguard measure. This paper mainly studies the following three aspects. Firstly, in view of the subjective factors in the approval process of venture loans, based on the credit evaluation system of commercial banks and the data characteristics of venture loans, a credit evaluation system based on venture loans is constructed. Secondly, the randomized uniform design method is used to improve the population initialization method to realize the uniform distribution of the individual population. Finally, aiming at the problem of low efficiency of venture loan audit, this paper proposes an optimized BP neural network to evaluate the venture loan. Especially, through data processing, a credit index system is constructed, and then the optimized BP neural network model is determined in parameters. The model contains 15 input nodes, 1 hidden layer, and 2 output layers. Finally, the simulation shows that the optimized BP neural network model has obvious advantages in the loan evaluation. This paper includes the development status of credit evaluation of venture loans is empirically studied by using an optimized BP neural network model of nonexpected output.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09c7fd4b8621f1a21a84f56734089966",
  "timestamp": "2025-05-15T02:05:42.625791"
}