{
  "id": 2497,
  "title": "STATISTICAL METHODS OF THE BANKRUPTCY PREDICTION IN THE LOGISTICS SECTOR IN POLAND AND SLOVAKIA",
  "abstract": "The fundamental subject matter of this publication is the analysis of the issue of bankruptcy in the context of appearance of possible threat signals. The presented research aims at proving validation values of described models in predicting possible bankruptcy signals and evaluating the financial condition of the TSL sector (transport, spedition, logistics) entities from Poland and Slovakia. In order to predict the risk of company bankruptcy from the logistics sector, the following statistical models of bankruptcy classification were used: classic linear discriminant analysis and logistic regression. What is more, the predictions based on the so-called classification trees and the method of nearest neighbours was applied. The empirical verification of correct classification by given groups of methods of statistical bankruptcy analysis from the perspective of their efficiency showed that these methods could be characterized with a high quality of bankruptcy prediction. The presented concepts allow evaluating quite easily the threat of bankruptcy for a given group of entities. One vital advantage of the presented results is the fact of dividing research sample into the so-called learning group, for which parameters of the analysed models were estimated, and the test sample researching effectiveness of proper classifications, for which all the predictions were set for a period of both one and two years before the bankruptcy.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09ce5458df089820029576ed7f39ed65",
  "timestamp": "2025-05-15T02:15:59.888981"
}