{
  "id": 3856,
  "title": "Share of Attention: Exploring the Allocation of User Attention to Consumer Applications",
  "abstract": "Despite clear, finite limits on the availability of human attention, limited effort has been directed toward understanding how user attention is allocated in contexts such as digital application environments where consumers frequently confront an abundance of competing alternatives. This is surprising given the growing significance of application platforms, ecosystems, and other application environments that offer seemingly endless choice. In these types of environments the value delivered to users and the success of application developers is often highly dependent on the attention that users allocate to an application after they have adopted it. There is, therefore, considerable value in efforts to better understand what drives the post-adoption allocation of consumer attention toward specific applications. As such, we draw on attention theory to propose a model of attention allocation and then test this model on a dataset that includes over 2,200 hedonic desktop applications and more than 300 users. Analysis using fractional regression indicates that user attention is most likely to be allocated to applications that have been used both recently and persistently as well as by applications that are popular and current. Finally, our results highlight the negative impact that a large application portfolio has on the allocation of user attention to individual applications.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09d7be78ea0cac28ccbf560f62b757fd",
  "timestamp": "2025-05-15T01:21:41.313581"
}