{
  "id": 8789,
  "title": "Dietary Profile and Nutritional Status of the Roma Population Living in Segregated Colonies in Northeast Hungary",
  "abstract": "Nutrition studies among Roma are scarce and to date no quantified dietary data are available. This report provides, for the first time, quantified dietary data and comprehensive anthropometric information for the Hungarian Roma (HR) population, with Hungarian general (HG) adults as reference. Data were obtained from a complex comparative health survey, involving 387 and 410 subjects of HR and HG populations, respectively. Using corporal measurements, body composition indicators were constructed, while daily nutrient intakes were evaluated in comparison with internationally accepted guidelines on nutrient requirements and recommended intakes. Associations between Roma ethnicity and nutrient intakes, as well as odds of achieving dietary recommendations were explored using regression models, adjusted for relevant covariates (i.e., age, gender, education, marital status and perceived financial status). Results showed occasional differences for selected nutrient intakes between the groups, with HR's intake being less favorable. Total fat intake, predominantly animal-sourced, exceeded recommendations among HR (36.1 g, 95% confidence interval (CI): 35.2-37.0) and was not dissimilar to HG group (37.1 g, 95% CI: 36.3-38.0). Sodium intake among HR was significantly lower (5094.4 mg, 95% CI: 4866.0-5322.8) compared to HG (5644.0 mg, 95% CI: 5351.9-5936.0), but significantly greater than recommended intake in both groups. HR had greater estimated body fatness (25.6-35.1%) and higher average body mass index (BMI, 27.7 kg/m(2), 95% CI: 26.9-28.4), compared to HG. In addition, HR had lower odds of achieving dietary recommendations (odds ratio (OR) = 0.81, 95% CI: 0.67-0.97,p< 0.05). Findings warrant further research, while highlighting the importance of establishing and integrating Roma nutrition into national surveillance and monitoring systems for key dietary risk factors.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09dd7357cff489e84d42ab432c869491",
  "timestamp": "2025-05-15T03:22:26.059434"
}