{
  "id": 8366,
  "title": "Public awareness and knowledge of sepsis: a cross-sectional survey of adults in Canada",
  "abstract": "Background Sepsis is a life-threatening complication of the body's response to infection. The financial, medical, and psychological costs of sepsis to individuals and to the healthcare system are high. Most sepsis cases originate in the community, making public awareness of sepsis essential to early diagnosis and treatment. There has been no comprehensive examination of adult's sepsis knowledge in Canada. Methods We administered an online structured survey to English- or French-literate adults in Canada. The questionnaire comprised 28 questions in three domains: awareness, knowledge, and information access. Sampling was stratified by age, sex, and geography and weighted to 2016 census data. We used descriptive statistics to summarize responses; demographic differences were tested using the Rao-Scott correction for weighted chi-squared tests and associations using multiple variable regression. Results Sixty-one percent of 3200 adults sampled had heard of sepsis. Awareness differed by respondent's residential region, sex, education, and ethnic group (p < 0.001, all). The odds of having heard of sepsis were higher for females, older adults, respondents with some or completed college/university education, and respondents who self-identified as Black, White, or of mixed ethnicity (p < 0.01, all). Respondent's knowledge of sepsis definitions, symptoms, risk factors, and prevention measures was generally low (53.0%, 31.5%, 16.5%, and 36.3%, respectively). Only 25% of respondents recognized vaccination as a preventive strategy. The strongest predictors of sepsis knowledge were previous exposure to sepsis, healthcare employment, female sex, and a college/university education (p < 0.001, all). Respondents most frequently reported hearing about sepsis through television (27.7%) and preferred to learn about sepsis from healthcare providers (53.1%). Conclusions Sepsis can quickly cause life-altering physical and psychological effects and 39% of adults sampled in Canada have not heard of it. Critically, a minority (32%) knew about signs, risk factors, and strategies to lower risk. Education initiatives should focus messaging on infection prevention, employ broad media strategies, and use primary healthcare providers to disseminate evidence-based information. Future work could explore whether efforts to raise public awareness of sepsis might be bolstered or hindered by current discourse around COVID-19, particularly those centered on vaccination.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09e6371bb50058c3afb050ffabf324b7",
  "timestamp": "2025-05-15T03:18:19.503645"
}