{
  "id": 9339,
  "title": "Exploring factors that influence HRQoL for people living with Parkinson's in one region of Ireland: A cross-sectional study",
  "abstract": "Background: The diversity of symptoms associated with Parkinson's and their impact on functioning have led to an increased interest in exploring factors that impact Health-Related Quality of Life (HRQoL). Although the experience of Parkinson's is unique, some symptoms have a greater impact than others, e.g. depression. Moreover, as the risk of Parkinson's increases with age, the financial and public health impact of this condition is likely to increase, particularly within the context of a globally ageing population. In Ireland, research is ongoing in the pursuit of causes and effective treatments for Parkinson's; however, its impact on everyday living, functioning, and HRQoL is largely under-examined. This study aims to describe factors that influence HRQoL for people with Parkinson's (PwP) in one region of Ireland.Methods: A cross-sectional postal survey was conducted among people living with Parkinson's (n = 208) in one area of Ireland. This survey included socio-demographic questions, Nonmotor Symptoms Questionnaire for Parkinson's disease (NMSQuest), the Geriatric Depression Scale (GDS-15), and the Parkinson's disease Questionnaire (PDQ39). Statistical analysis was conducted using SPSS, IBM version 25 (SPSS Inc., Chicago, II, USA).Results: Participants reflected a predominantly older population who were married, and lived in their own homes (91%). Participants diagnosed the longest reported poorer HRQoL regarding mobility, activities of daily living, emotional well-being, social support, cognition, communication domains and overall HRQoL. Lower HRQoL correlated with higher depression scores p < 0.001 and participants in the lower HRQoL cohort experienced 2.25 times more non-motor symptoms (NMSs) than participants with higher HRQoL. Hierarchical multiple linear regression analysis predicted Geriatric Depression Scale (GDS15) score, NMS burden, and years since diagnosis to negatively impact HRQoL. Principal component analysis (PCA) also indicated that for the population in this study, components measuring 1) independence/dependence 2) stigma 3) emotional well-being, and 4) pain were central to explaining core aspects of participants' HRQoL.Conclusions: Findings highlighted the negative impact of longer disease duration, NMS burden, depression, mobility impairments, and perceived dependence on HRQoL for PwP. The positive influence of perceived independence, social engagement along with close supportive relationships were also identified as key components determining HRQoL. Findings emphasised the importance of long-term healthcare commitment to sustaining social and community supports and therapeutic, rehabilitative initiatives to augment HRQoL for PwP.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09e852a4de46c37cf57fa93d1aed752d",
  "timestamp": "2025-05-15T03:27:53.366970"
}