{
  "id": 2612,
  "title": "The Risk Measurement of Horticultural Price: A Comparison Based on Financial Access in West Java, Indonesia",
  "abstract": "Access to finance has been an important issue in minimizing the risk in agricultural prices. Farmers in Indonesia can access finance from different ,financial sources, including from banks, micro finance institutions (MFIs), farmers' associations, traders, agricultural input kiosks, family, and friends. This research was aimed to investigate the difference of price risk between farmers who had access to finance from different, financial providers and those who did not, and to analyze the price risk and its relation to some socioeconomic variables. A survey was conducted to collect data from selected horticultural farmers, i.e. potato and banana farmers at the center of potato and banana production in West Java. The price risk was analyzed using 25th percentile and coefficient of variation. Moreover, the data were analyzed using independent t-test to see the difference of the risk between the groups of farmers, and censored regression model to see the relation between price risk and some socioeconomic variables. The results show that farmers who had access to financial sources from MFIs, farmers' associations, traders and from other financial sources had a lower price risk of banana compared to the farmers who did not have access to finance from those financial providers. The results also show that farmers having access to finance from traders had lower risk in terms of the price distribution. The findings suggest the need to enhance financial access from MFIs, farmers 'associations, and traders since those finance providers seem to have potency to minimize the farmers' risk on price.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09ef098ddb0c0f75301b303d2c354ae7",
  "timestamp": "2025-05-15T02:17:01.812767"
}