{
  "id": 20,
  "title": "Loan Repayment Prediction Using Logistic Regression Ensemble Learning With Machine Learning Algorithms",
  "abstract": "Lending activities are an important part of the credit activities of financial institutions and banks. This is an area that brings great potential for development as well as a sustainable source of profit for financial institutions and banks. However, lending to customers also brings high risks. Therefore, predicting the ability to repay on time and understanding the factors affecting the repayment ability of customers is extremely important and necessary, to help financial institutions and banks enhance their ability to pay debts. customers' ability to identify and pay debts on time, contributing to minimizing bad debts and enhancing credit risk management. In this study, Machine Learning models will be used: Proposing a method to combine Logistic Regression with Random Forest, Logistic Regression with K-Nearest Neighbor, Logistic Regression with Support Vector Machine, Logistic Regression with Artificial Neural Network, Logistic Regression with Long short-term memory and finally Logistic Regression with Decision Tree to predict customers' ability to repay on time and compare and evaluate the performance of Machine Learning models. As a result, the Logistic Regression with the Random Forest model ensemble is found as the optimal predictive model and it is expected that Fico Score and annual income significantly influence the forecast.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09f0914de84ec0805fb79716e0110be2",
  "timestamp": "2025-05-15T01:46:03.766544"
}