{
  "id": 8288,
  "title": "Magnitude and Determinants of Dropout from Community-Based Health Insurance Among Households in Manna District, Jimma Zone, Southwest Ethiopia",
  "abstract": "Background: Community-based health insurance (CBHI) is a prepayment method of financial contributions for healthcare which aims to risk pooling, avoidance of catastrophic and impoverishing health expenditure. However, a high dropout from the scheme remains the biggest challenge to effective and sustainable progress towards universal financial protection in low- and middle-income countries. While large literature had examined initial enrollment and factors associated with it, only a few studies dealt with dropout. So the study aimed to assess the magnitude and determinants of dropout from community-based health insurance among households in Manna district, Jimma zone, Oromia Regional State, Ethiopia. Methods: A community-based cross-sectional study design was employed to collect data from 634 household heads from March 1 to 30, 2020. A multistage sampling technique was carried out and interviewer-administered questionnaires were used to collect data. Descriptive statistics and multivariable logistic regression analyses were performed, and variables with a P-value<0.05 were considered as having a statistically significant association with the dropout from the CBHI. Results: Magnitude of dropout from CBHI was 31.9% with 95% confidence interval (CI) =28.2-35.8% and relatively older age [adjusted odds ratio (AOR) (95% CI)=0.26 (0.10-0.78)1, educational level [AOR (95% CI)=0.16 (0.06-0.41)], family size [AOR (95% CI) =0.36 (0.19-0.66)1, poor perceived quality of service [AOR (95% CI)=5.7 (2.8-11.8)], trust in health facility [AOR (95% CI)=0.43 (0.3-0.61)], trust in the scheme [AOR (95% CI)=0.61 (0.45-0.84)1, providers' attitude [AOR (95% CI)=10 (4.0-25.4)1, and benefit package [AOR (95% CI)=4.9 (2.4-9.9)] were statistically significant determinants associated with dropout. Conclusion: Dropout from CBHI in this study area was high. Household heads' age, educational level, family size, perceived quality of service, providers' attitude, a benefits package, trust in the contracted health facility, and the scheme were the significant predictors of dropout. We strongly recommend that greater efforts should be made toward the providers' attitude, promised benefit package, and quality of services.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09f3954855b4067f10c4bf7759f6a1de",
  "timestamp": "2025-05-15T03:17:21.542328"
}