{
  "id": 6359,
  "title": "Modifiable risk factors for hospitalization among people with psychosis: evidence from the National Study of Low Prevalence (Psychotic) Disorders",
  "abstract": "Objective: Relatively little has been published on dynamic, that is, modifiable, as opposed to static risk factors for hospitalization in the research literature on risk factors for hospitalization in serious mental illness. The aim of this study was to develop a model to determine modifiable predictors of hospitalization using data from the Australian National Study of Low Prevalence ( Psychotic) Disorders. Method: The Study of Low Prevalence Disorders used a two-phase design to estimate the prevalence of psychoses and identify characteristics of people with psychotic illness. This paper compares people hospitalized at the time of census and those using outpatient services. Logistic regression was used to examine the relative impact of dynamic characteristics including service utilization, symptom profile and risky behaviours on a base model for risk of hospitalization. Results: In the base model, course of disorder and age but not type of psychosis were significantly associated with hospitalization. Among symptoms, delusions ( but not hallucinations) and negative symptoms significantly increased the odds of hospitalization. Service utilization, especially case management, reduced the odds significantly and substantially. Results for risky behaviours ( e. g. substance abuse, offending) were ambiguous. Conclusions: The results highlight the impact of dynamic factors, particularly case management, over and above static factors in reducing the risk of hospitalization in psychosis, and point to a potential for targeted interventions to avert some of the burden, both emotional and financial, associated with the hospitalization of people with psychotic disorders. These findings have important clinical and policy implications.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "09f66e2e090aa40b5f13f0c68e247993",
  "timestamp": "2025-05-15T02:57:07.799915"
}