{
  "id": 41,
  "title": "Predicting systemic financial risk with interpretable machine learning",
  "abstract": "Predicting systemic financial risk is essential for understanding the financial system's stability and early warning of financial crises. In this research, we use the financial stress index to measure systemic financial risk. We construct the stress index for five financial submarkets and composite stress index, employ the Markov regime switching model to identify the systemic financial risk stress state. On this basis, we use interpretable machine learning models to forecast systemic financial risk, analyze and compare the results of the intrinsic interpretable machine learning models and the post-hoc explainable methods. The results indicate that systemic financial risk can be effectively predicted using both the submarket stress index and the feature variables, with the submarket stress index as the independent variable providing relatively higher accuracy. There is a linearly positive relationship between the stress index of each submarket and systemic financial risk, with financial stress in the stock and money markets having the greatest impact on systemic financial risk. For each feature variable, stock-bond correlation coefficient, stock valuation risk, the maximum cumulative loss of the SSE Composite Index (SSE CMAX), and loan-deposit ratio have strong predictive power. Our research can provide reference for government to construct prediction model and indicator monitoring platform of systemic financial crisis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a0641f0476ba57afd65f4901aa7c6ff",
  "timestamp": "2025-05-15T01:46:03.862739"
}