{
  "id": 3736,
  "title": "A quantile regression approach to evaluate the relative impact of global and local factors on the MENA stock markets",
  "abstract": "Purpose This paper investigates the relative importance of local macroeconomic and global factors in the explanation of twelve MENA (Middle East and North Africa) stock market returns across the different quantiles in order to determine their degree of international financial integration. Design/methodology/approach The authors use both ordinary least squares and quantile regressions from January 2007 to January 2018. Quantile regression permits to know how the effects of explanatory variables vary across the different states of the market. Findings The results of this paper indicate that the impact of local macroeconomic and global factors differs across the quantiles and markets. Generally, there are wide ranges in degree of international integration and most of MENA stock markets appear to be weakly integrated. This reveals that the portfolio diversification within the stock markets in this region is still beneficial. Originality/value This paper is original for two reasons. First, it emphasizes, over a fairly long period, the impact of a large number of macroeconomic and global variables on the MENA stock market returns. Second, it examines if the relative effects of these factors on MENA stock returns vary or not across the market states and MENA countries.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a076b41dff78bc59d6fb129702698fc",
  "timestamp": "2025-05-15T01:20:03.643388"
}