{
  "id": 7763,
  "title": "Knowledge of COVID-19 and Its Relationship with Preventive Behaviors and Vaccination among Adults in Northern Thailand's Community",
  "abstract": "(1) Background: the 2019 coronavirus disease outbreak (COVID-19) has posed a major threat to public health and had a significant impact on all areas of people's lives. Vaccines against COVID-19 have been developed to control the disease, and an array of personal hygiene measures has been introduced. As a result, information that will support and promote vaccination among populations as well as other health measures against COVID-19 are urgently needed. The goal of this research was to look into the knowledge about COVID-19 and how it relates to preventive behaviors and vaccination among people living in rural areas of northern Thailand. (2) Methods: a cross-sectional study was performed in four upper northern provinces of Thailand. A total of 1524 participants were recruited using the probability sampling technique. Questionnaires were distributed to collect data on general health information, as well as knowledge and preventive behaviors regarding COVID-19. (3) Results: more than half (55.9%) of the participants were female and had not received the COVID-19 vaccine (67.2%). Their mean age was 44.13 years. The majority had moderate COVID-19 knowledge and engaged in preventive behaviors (65.5% and 42.0%, respectively). A linear regression model showed that the COVID-19 knowledge score was related to the COVID-19 preventive behaviors score, with a standardized coefficient of 0.510, after adjusting for age, underlying disease, and body mass index (B = 2.64; 95%CI = 2.42, 2.87). Binary logistic regression revealed that after controlling for age, education, occupation, financial status, and current disease (AOR = 1.87; 95%CI = 1.64-2.13), the score of COVID-19 knowledge was significantly associated with having the COVID-19 vaccine. (4) Discussion: knowledge of COVID-19 is very important for people in rural regions to engage in COVID-19 prevention behaviors and vaccination. Relevant government agencies and health network partners should support proactive education campaigns emphasizing the risk of contracting the disease and its severity in order to promote vaccination against COVID-19 among unvaccinated groups. These campaigns can highlight COVID-19's positive benefit-risk balance in the short and long term and ensure public safety measures against COVID-19.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a09b14310cc1d2408c26cdc850a61c4",
  "timestamp": "2025-05-15T03:12:11.468873"
}