{
  "id": 2991,
  "title": "Actuarial Evaluation of the Financial Backing Risk on Chinese Public Pension",
  "abstract": "The Comprehensive Scheme on Reducing Social Insurance Contribution Rates (RSICR scheme) issued in 2019 had an important impact on the financial backing risk of the Chinese Public Pension for Enterprise Employees. We developed actuarial models for contribution revenues, benefit expenditures, and the balance of the public pension to analyze the impact of the RSICR scheme on the financial status of the Chinese Public Pension and the financial backing risk early warning after its implementation. This was done according to the State Council Documents and considering the interruption of participants' contributions and the contribution salary being lower than the statistical salary. We found that (1) the RSICR scheme will worsen financial status in earlier years; however, it effectively slows down the trend of financial deterioration in most years of the forecasted period. (2) After implementing the RSICR scheme, four early warning indicators were selected and calculated. Since 2022, the financial backing risk of the Chinese Public Pension has increased rapidly, and four warning levels-blue, yellow, orange, and red-and their corresponding warning-year intervals were obtained. (3) According to sensitivity analyses, the key reverse early warning indicators' influencing factors ranged from strong to weak: retirement age, firm contribution rate, and total fertility rate. In the same direction, from strong to weak, are the benefit growth rate, the bookkeeping interest rate, and the transitional coefficient. Finally, we propose policy suggestions to alleviate the financial backing risk.JEL Classification: G22, G23, H83, P34. Purpose. The Comprehensive Scheme on Reducing Social Insurance Contribution Rates (abbreviated as RSICR scheme) stipulated that contribution rate of firms in Chinese public pension can be reduced to 16% and the average salary calculation standard is correspondingly adjusted. This paper aims to explore the impact of the RSICR scheme on the finance of the public pension, and to early warn the financial backing risk of the public pension after the implementation of the scheme. Methodology. We develop actuarial models for contribution revenues, benefit expenditures and balance of Chinese public pension. The parameters involved in the actuarial models are estimated, and the impact of the RSICR scheme on Chinese public pension finance is numerically simulated by using MATLAB software, as well as the financial backing risk of Chinese public pension under the implementation of the scheme. Conclusions. By comparing the impacts of three scenarios on the financial status of the public pension, we find the RSICR scheme will worsen the financial status in early several years, nevertheless, effectively slow down the trend of financial deterioration in most years of the forecast period. After the implementation of the RSICR scheme, we calculate the benefit payment gap and its proportion in national financial revenues and find that financial backing risk rises rapidly since 2022. Implications. This paper provide a useful reference for improving the sustainable operation ability of Chinese public pension system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a1a4c1542daae438e3ed8789d8af0f4",
  "timestamp": "2025-05-15T02:21:19.271207"
}