{
  "id": 7437,
  "title": "A Longitudinal Analysis of Risk Factors Associated with Central Retinal Vein Occlusion",
  "abstract": "Purpose: To identify risk factors associated with central retinal vein occlusion (CRVO) among a diverse group of patients throughout the United States. Design: Longitudinal cohort study. Participants: All beneficiaries aged >= 55 years who were continuously enrolled in a managed care network for at least 2 years and who had >2 visits to an eye care provider from 2001 to 2009. Methods: Insurance billing codes were used to identify individuals with a newly diagnosed CRVO. Multivariable Cox regression was performed to determine the factors associated with CRVO development. Main Outcome Measures: Adjusted hazard ratios (HRs) with 95% confidence intervals (CIs) of being diagnosed with CRVO. Results: Of the 494 165 enrollees who met the study inclusion criteria, 1302 (0.26%) were diagnosed with CRVO over 5.4 (+/- 1.8) years. After adjustment for known confounders, blacks had a 58% increased risk of CRVO compared with whites (HR, 1.58; 95% CI, 1.25-1.99), and women had a 25% decreased risk of CRVO compared with men (HR, 0.75; 95% CI, 0.66-0.85). A diagnosis of stroke increased the hazard of CRVO by 44% (HR, 1.44; 95% CI, 1.23-1.68), and hypercoagulable state was associated with a 145% increased CRVO risk (HR, 2.45; 95% CI, 1.40-4.28). Individuals with end-organ damage from hypertension (HTN) or diabetes mellitus (DM) had a 92% (HR, 1.92; 95% CI, 1.52-2.42) and 53% (HR, 1.53; 95% CI, 1.28-1.84) increased risk of CRVO, respectively, relative to those without these conditions. Conclusions: This study confirms that HTN and vascular diseases are important risk factors for CRVO. We also identify black race as being associated with CRVO, which was not well appreciated previously. Furthermore, we show that compared with patients without DM, individuals with end-organ damage from DM have a heightened risk of CRVO, whereas those with uncomplicated DM are not at increased risk of CRVO. This finding may provide a potential explanation for the conflicting reports in the literature on the association between CRVO and DM. Information from analyses such as this can be used to create a risk calculator to identify possible individuals at greatest risk for CRVO. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2013;120:362-370 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a266c6688e94ed2aa9584fce3ee7642",
  "timestamp": "2025-05-15T03:08:37.851863"
}