{
  "id": 5690,
  "title": "Promotive and risk factors as concurrent predictors of educational outcomes in supported transitional living: Extended care and maintenance in Ontario, Canada",
  "abstract": "We tested selected promotive and risk factors as concurrent predictors of educational attainment, educational aspirations, and participation in education, training, or employment among young people enrolled in extended care and maintenance (ECM) in Ontario, Canada. ECM is a legislatively established transitional living program that provides financial, instrumental, and emotional support to former youths in care in the province who have had their individualized plans for education, training, or work accepted by their local Children's Aid Societies. The 406 participants in the research were 18-20 years of age and included 230 females (56.7%) and 176 males (43.3%). The data were collected by the youths' child welfare workers in interviews conducted by means of the second Canadian adaptation of the Assessment and Action Record from Looking After Children (AAR-C2-2006; Flynn, Vincent, & Legault, 2009). Cross-sectional hierarchical regression and sequential logistic regression analyses showed that the youth's total number of developmental assets was the most consistent promotive factor, predicting more favorable levels of all three educational outcomes. Cognitive impairments and soft-drug use were the most consistent risk factors, each predicting lower levels of two of the three outcomes. The practice and policy implications of the findings, as well as the limitations of the research, were discussed. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a3694b2a85bb0e6bf5c78dc6a090b23",
  "timestamp": "2025-05-15T02:50:21.278765"
}