{
  "id": 4194,
  "title": "Which ownership structure will sustain sustainability? An empirical examination of ESG disclosure",
  "abstract": "Sustainability has become the need of the hour around the world; to keep up with this requirement, companies are turning more vocal about sustainability practices followed by their organizations. This paper intends to explore the impact of major ownership structures on reporting relating to the environmental, social, and governance activities of a firm. The study explores the impact of government ownership, family ownership, and institutional ownership on ESG disclosure of US, Indian, and China firms by employing pooled and industry fixed effect regression models. A total of 6776 firm-year observations were used to analyze the annual data pertaining to the three countries from the period 2015-2021. The study finds a strong impact of ownership structure on ESG disclosure and its components of companies in all three countries in the industry fixed effects model. State-owned enterprises in China are found to be reserved in reporting their combined ESG-related activities. In contrast, the institutional ownership style of US firms consistently promotes reporting of all three aspects of non-financial information relating to a firm. Family-owned firms in India are found to have a mixed impact on the overall ESG disclosure. Overall, the study highlights the importance of ownership structure in determining the reporting of non-financial activities of firms. The study findings assist multinational portfolio managers in understanding the implication of differentiated ownership structures on ESG disclosure. The outcome is also relevant for international investors looking for transparency and convergence to worldwide standards. This study will also provide significant inputs to regulators and policymakers to enhance the disclosure norms in countries having differential institutional settings. The study adds to the existing literature on ESG by incorporating major ownership structures prevalent in the sample countries.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a4971bc4813abaac39dda4cc3aade49",
  "timestamp": "2025-05-15T01:24:51.397566"
}