{
  "id": 7684,
  "title": "Low-risk investment strategy: sector bets or stock bets?",
  "abstract": "Purpose The portfolio of low-risk stocks outperforms the portfolio of high-risk stocks and market portfolios on a risk-adjusted basis. This phenomenon is called the low-risk effect. There are several economic and behavioral explanations for the existence and persistence of such an effect. However, it is still unclear whether specific sector orientation drives the low-risk effect. The study seeks to answer the following important questions in Indian equity markets: (a) Whether sector bets or stock bets mainly drive the low-risk effect? (b) Is it a mere proxy for the well-known value effect? (c) Does the low-risk effect prevail in long-only portfolios? Design/methodology/approach The study is based on all the listed stocks on the National Stock Exchange (NSE) of India from December 1994 to September 2018. It classifies them into 11 Global Industry Classification Standard (GICS) sectors to construct stock-level and sector-level BAB (Betting Against Beta) and long-only low-risk portfolios. It follows the study of Asness et al. (2014) to construct various BAB portfolios. It applies Fama-French (FF) three-factor and Fama-French-Carhart (FFC) four-factor asset pricing models in addition to Capital Asset Pricing Model (CAPM) to examine the strength of BAB, sector-level BAB, stock-level BAB and long-only low-beta portfolios. Findings Both sector- and stock-level bets contribute to the return of the low-risk investing strategy, but the stock-level effect is dominant. Only betting on safe sectors or industries will not earn economically significant alpha. The low-risk effect is unique and not a value effect in disguise. Both long-short and long-only portfolios within sectors and industry groups deliver positive excess returns. Consumer staples, financial, materials and healthcare sectors mainly contribute to the returns of the low-risk effect in India. This study offers empirical evidence against the Samuelson (1998) micro-efficient market given the strong performance of the stock-level low-risk effect. Practical implications The superior performance of the low-risk investment strategies at both stock and sector levels offers investors an opportunity to strategically invest in stocks from the right sectors and earn high risk-adjusted returns with lower drawdowns over an entire market cycle. Besides, it paves the way for stock exchanges and index manufacturers to launch sector-specific low-volatility indices for relevant sectors. Passive funds can launch index funds and exchange-traded funds by tracking these indices. Active fund managers can espouse sector-specific low-risk investment strategies based on the results of this and similar other studies. Originality/value The study is the first of its kind. It offers insights into the portfolio characteristics and performance of the long-short and the long-only variant of low-risk portfolios within sectors and industry groups. It decomposes the low-risk effect into sector-level and stock-level effects.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a518ade4a3a49cdccb7629e8fa538bd",
  "timestamp": "2025-05-15T03:11:04.542184"
}