{
  "id": 7055,
  "title": "Cost and Effectiveness of Long-Term Care Following Integrated Discharge Planning: A Prospective Cohort Study",
  "abstract": "Little is known about the effects of seamless hospital discharge planning on long-term care (LTC) costs and effectiveness. This study evaluates the cost and effectiveness of the recently implemented policy from hospital to LTC between patients discharged under seamless transition and standard transition. A total of 49 elderly patients in the standard transition cohort and 119 in the seamless transition cohort were recruited from November 2016 to February 2018. Data collected from medical records included the Multimorbidity Frailty Index, Activities of Daily Living Scale, and Malnutrition Universal Screening Tool during hospitalization. Multiple linear regression and Cox regression models were used to explore risk factors for medical resource utilization and medical outcomes. After adjustment for effective predictors, the seamless cohort had lower direct medical costs, a shorter length of stay, a higher survival rate, and a lower unplanned readmission rate compared to the standard cohort. However, only mean total direct medical costs during hospitalization and 6 months after discharge were significantly (p < 0.001) lower in the seamless cohort (USD 6192) compared to the standard cohort (USD 8361). Additionally, the annual per-patient economic burden in the seamless cohort approximated USD 2.9-3.3 billion. Analysis of the economic burden of disability in the elderly population in Taiwan indicates that seamless transition planning can save approximately USD 3 billion in annual healthcare costs. Implementing this policy would achieve continuous improvement in LTC quality and reduce the financial burden of healthcare on the Taiwanese government.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a582e14b7fd855600167a0de4d8fd2c",
  "timestamp": "2025-05-15T03:04:23.047985"
}