{
  "id": 5410,
  "title": "From risk to responsibility: examining the financial resilience of banks",
  "abstract": "PurposeAssessing the performance and stability of financial institutions is crucial for investors, regulators and stakeholders. The primary purpose of this study was to examine the economic resilience and sustainability performance of banks operating in T & uuml;rkiye through their capital adequacy, asset quality, management quality, earnings, liquidity, and sensitivity to market risk (CAMELS) and environmental, social and governance (ESG) scores. The research examined whether there was a significant relationship between the CAMELS and ESG scores of the banks in the sample and how they affected each other.Design/methodology/approachThis study analyzed the relationship between the CAMELS and ESG scores of five public and private banks operating in T & uuml;rkiye. The study used statistical techniques such as correlation, regression and descriptive statistics to analyze the relationship between the CAMELS and the ESG score clusters. The data in the research cover the period 2008-2022 and were obtained from open sources disclosed to the public by the banks.FindingsThe study found a statistically significant relationship between the financial institutions' CAMELS and ESG scores. Banks with higher CAMELS scores had a better ESG performance; however, this relationship was not linear. Regression analysis allowed for the identification of factors that had a significant impact on ESG scores within the CAMELS framework. No effect was detected on earnings (E), one of the CAMELS elements in the economic, environmental, and governance elements section of the banks' ESG scores. Management quality (M) positively affected only governance (G). Additionally, it was determined that the banks' environmental performance (ENV) positively affected their CAMELS score.Practical implicationsThe positive relationship between the CAMELS and ESG dimensions shows that financial sustainability is essential. The findings are expected to enrich the understanding of financial institutions' resilience in the context of T & uuml;rkiye, which constitutes the research sample. In addition, the inferences that can be made from this Turkish sample are essential for informing investment decisions, regulatory frameworks and broader stakeholder engagement in similar markets.Social implicationsAlthough a significant and positive relationship was established between ESG and CAMELS scores, a substantial and positive relationship only sometimes emerged when the sub-elements of the variables in question were examined. Investing in environmental initiatives helps companies build sustainable business models for the long term, paving the way for future profits and improved capital adequacy and liquidity. However, new regulations and practices related to environmental activities may introduce additional costs, necessitating changes to existing business processes.Originality/valueThis study provides important information regarding the interaction in financial institutions between financial stability assessed by CAMELS scores and sustainability performance measured by ESG scores. The findings show that institutions with robust economic fundamentals demonstrate better ESG performance. This indicates that there is a positive relationship between financial stability and responsible business practices. This information will help investors, regulators and stakeholders to make informed decisions about financial institutions, decisions that focus on sustainability. The results also suggest that it is necessary to use dynamic models and analytical tools to address the link between CAMELS and ESG.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a596214c013d6c9bd0315364dab2e4d",
  "timestamp": "2025-05-15T02:47:14.124412"
}