{
  "id": 5528,
  "title": "Bank liquidity creation and solvency risk with moderating role of loan concentration: a comparative study of Islamic and conventional banks in Pakistan and Malaysia",
  "abstract": "The robust growth demonstrated by the Islamic Banking Industry over the last decade invites serious attention towards less attended areas of Islamic Banking Liquidity Creation, credit concentration, and risk-related financial stability. This study addresses the relationship between liquidity creation and solvency risk during the period of 2004-2021 in the presence of the moderating role of bank credit concentration while comparing Islamic and conventional banks in Pakistan and Malaysia. This study reveals that the relationship of bank liquidity creation is negative and significant with solvency risk across Islamic and conventional banks in Pakistan and Malaysia. This negative relationship has been positively and significantly moderated (reversed) by credit concentration. The result is robust to different regression estimation methods (fixed effect, random effect, GLS) and alternative measures of liquidity creation (Cat fat, Cat nonfat). Further, our study also observes that this relationship holds true while making a comparative analysis of Islamic and conventional banks in Pakistan and Malaysia. Islamic Banks in Pakistan faced more solvency risk while creating liquidity (both on and off-balance sheet) in the presence of moderation of credit concentration than Malaysian Islamic banks and Pakistani conventional banks, thereby showing an immediate need to establish a solvency risk management framework and a diversified loan portfolio strategy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a6ba959a653de623fbcdf9fab0a0d0b",
  "timestamp": "2025-05-15T02:48:51.303548"
}