{
  "id": 3343,
  "title": "Clinical trials involving positron emission tomography and prostate cancer: an analysis of the ClinicalTrials. gov database",
  "abstract": "Background: The goal of this study is to evaluate the status and future perspectives of clinical trials on positron emission tomography in prostate cancer for diagnostic or therapeutic as well as for surveillance purposes. Methods: The www. ClinicalTrials. gov database was searched on the 20th of January 2017 for all trials containing terms describing prostate cancer (prostate, prostatic, malignant, malignancy, cancer, tumor) and positron emission tomography. In total 167 trials were identified. Trials that included diseases other than PCa were excluded (n = 27; 16%). Furthermore, we excluded trials (n = 4, 2%) withdrawn prior to first patient enrollment. The remaining trials (n = 137, 82%) were selected for further manual classification analysis. Results: One hundred thirty-seven trials were detected and analyzed. Majority of trials were in active recruitment status (n = 46, 34%) followed by trials that had been completed-(n = 34, 25%) and trials with closed recruitment but active follow-up (n = 23, 17%). Phase 1 and 2 comprised 46% of the complete trial portfolio. Locally confined disease was of major interest (n = 46, 34%), followed by metastatic disease-not otherwise specified (n = 43, 13%). Evaluation of PET was the primary goal of the trial in 114 (83%) cases. Most of the trials evaluated only one agent (n = 122, 89%). Choline and PSMA represented two major groups (total 50%) and they were equally distributed across trial portfolio with 25% (n = 34) each. PSMA trials showed the highest average annual growth rate of 56%. The trials were conducted in 17 countries. Conclusion: The scientific community is showing a strong and ever-growing interest in the field and we expect that in the coming years, more phase III trials will be initiated ultimately delivering the required Level 1 evidence.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a819e70076a9e27210408fc85092537",
  "timestamp": "2025-05-15T01:16:22.065101"
}