{
  "id": 3240,
  "title": "Examining stylized facts and trends of FTSE/JSE TOP40: a parametric and Non-Parametric approach",
  "abstract": "It is critical in risk and portfolio management to identify groups or classes of financial returns. Portfolio diversification is one of the first decisions made during the portfolio construction phase, and it entails allocating assets among various asset class groups to maximize the risk/reward trade-off. Therefore, this research provides a detailed examination of empirical analysis concerning the characterization of financial markets. In this study, we use parametric and non-parametric approaches to look at stylized facts and patterns of the FTSE/JSE Top40, which comprises the top 40 holdings companies in the South African financial market. To the best of our knowledge, this is the first time a model of this type has been used to create a map that characterizes this index. Our findings indicated that the majority of the properties of the data were valid including among others, clustering volatility, monthly seasonal effects and significant autocorrelation (or serial correlation) on logarithmic returns. Moreover, we found that intra-week trend effects exist, whereas the weekend effect has practically vanished in the FTSE/JSE Top40. With regard to the transition probabilities of the MS(2)-GJR-GARCH (1,1) model, the FTSE/JSE Top40 index had a 98.8% chance of exhibiting long memory, while the volatility had a 99.6% chance of exhibiting long memory.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a9eccbb50f6d5cc9aab879458af3c69",
  "timestamp": "2025-05-15T02:24:05.174929"
}