{
  "id": 8120,
  "title": "Cloud-based agricultural solution: A case study of near real-time regional agricultural crop growth information in South Africa",
  "abstract": "Recent advances in cloud-based technology has led to the rapid increase of geospatial web-based applications. The combination of GIS and cloud-based solutions is revolutionizing product development in the geospatial industry and is facilitating accessibility to a wider range of users, planners and decision makers. Accessible through an internet browser, web applications are an effective and convenient method to disseminate information in multiple formats, and they provide an interface offering interactive access to geospatial data, real-time integration and data processing, and application specific analysis tools. An example of such a web application is GeoTerraImage's monthly crop monitoring tool called GeoFarmer. This tool uses climatic data and satellite imagery processed through a complex rule-based algorithms to determine monthly climatic averages and anomalies, and most importantly the field specific crop status (i.e. is the field fallow, or is the crop emerging, or if the field has been harvested). Monthly field verification has formed a part of calibrating the growth classification outputs to further improve the accuracy of its monthly agricultural reporting. The goal of this application is to provide timely data to decision makers to assist them in field-level and regional crop growth monitoring, crop production and management, financial risk assessment and insurance, and food security applications. This web application has the unique advantage of being highly transportable to other regions, since it has been designed so it can easily be adapted to other seasonal growth response patterns, and up-scaled to regional or national coverages for operational use.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0a9fa772b989cf128d07688be70e4eb9",
  "timestamp": "2025-05-15T03:15:38.348543"
}