{
  "id": 5399,
  "title": "Economic Independence in Survivors of Cancer Diagnosed at a Young Age: A Norwegian National Cohort Study",
  "abstract": "BACKGROUND: The impact of cancer on socioeconomic outcomes is attracting attention as the number of survivors of cancer in young age continues to rise. This study examines economic independence in a national cohort of survivors of cancer at a young age in Norway. METHODS: Through the linkage of several national registries, the study cohort comprised 1,212,013 individuals born in Norway during 1965 through 1985, of which 5440 had received a cancer diagnosis before age 25 years. Follow-up was through 2007, and the main outcomes were receipt of governmental financial assistance, employment, income, and occupation. Analytic methods included Cox proportional hazard regression, log-binomial regression, and quantile regression models. RESULTS: Individuals in the cancer survivor group had an increased probability of receiving governmental financial assistance (men: hazard ratio [HR], 1.4; 95% confidence interval [CI], 1.3-1.5; women: HR, 1.5; 95% CI, 1.3-1.6) and of not being employed (men: HR, 1.4; 95% CI, 1.2-1.7; women: HR, 1.4; 95% CI, 1.2-1.6) compared with those in the noncancer group. Income discrepancies were particularly pronounced for survivors of central nervous system tumors. There was no difference in representation in higher skilled occupations. CONCLUSIONS: Survivors of cancer at a young age in Norway had an increased risk of being economically dependent and unemployed. This was evident in several tumor groups and was most pronounced in female survivors. There were only small differences in income or representation in higher skilled occupations for most employed survivors compared with the noncancer group. The current results are important for understanding the impact of a cancer diagnosis at a young age on subsequent job market outcomes. (C) 2016 The Authors. Cancer published by Wiley Periodicals, Inc. on behalf of American Cancer Society.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0aa00d24de724ea5d95fafea7c4e2b22",
  "timestamp": "2025-05-15T02:47:14.041375"
}