{
  "id": 9347,
  "title": "Out-of-network bills among privately insured patients undergoing hysterectomy",
  "abstract": "BACKGROUND: In recent years, the issue of out-of-network billing for privately insured patients has been highlighted as a source of unexpected out-of-pocket charges for patients, even in the setting of an in-network primary surgeon. The Congress recently passed the No Surprises Act to curtail these practices. However, the new law contains exceptions, and its regulatory system has yet to be established. As one of the most frequently performed major surgical procedures, hysterectomy represents a significant exposure to out-of-network bills among nonelderly females in the United States. OBJECTIVE: To describe the extent and nature of out-of-network bills at the time of hysterectomy among privately insured patients in the context of the recently passed No Surprises Act. STUDY DESIGN: We performed a retrospective cohort study of women aged 18 to 64 years who underwent simple hysterectomy from 2008 to 2018 with an in-network primary surgeon in the IBM Watson Marketscan claims database, which includes data from over 350 different payers. We identified out-of-network claims for facility or professional services and analyzed the frequency, size, and source of the payments. We used multivariable logistic regression to assess for patient, procedure, and facility characteristics associated with the risk of out-of-network claims. RESULTS: We identified 585,223 hysterectomy cases meeting all the inclusion criteria, and they were evenly split between inpatient (49.6%) and outpatient (50.4%) procedures. Overall, 8.8% of cases included at least 1 out-of-network claim, with median out-of-network expenditures of $553 for inpatient procedures and $438 for outpatient procedures. Compared with professional out-of-network claims, facility out-of-network claims were less common (2.3% vs 7.4%) but far greater in the amount billed (median $8,307 vs $400 inpatient, $3,281 vs $407 outpatient). Among the professional claims, those from midlevel surgical assistants were most frequently out-of-network when present (13.8% inpatient; 20.0% outpatient), whereas out-of-network claims from anesthesia were most common overall and largest (median $890 inpatient, $1,021 outpatient) when present. In a multivariable model, older age, increasing comorbidity, and complications during the stay were associated with higher odds of any out-of-network claim. In contrast, the risk of facility out-of-network claims was more strongly associated with the facility region and the surgical approach, with the highest odds for cases in the North Central region and those using robotic approach. CONCLUSION: Out-of-network bills for privately insured patients at the time of hysterectomy occurred in 8.8% of cases. Approximately one-quarter of these included out-of-network facility claims tended to have higher payments than out-of-network professional claims and may not be prevented by the No Surprises Act. Gynecologic surgeons should be aware of the potential out-of-network charges for ancillary services at the time of surgery, particularly the network status of the facility, to provide maximal transparency and financial protection to our patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0aa3f7cba7ed6086bdd4d25d3471acf4",
  "timestamp": "2025-05-15T03:27:53.386019"
}