{
  "id": 4966,
  "title": "Cross-sectional prevalence survey of intimate partner violence perpetration and victimization in Canadian military personnel",
  "abstract": "Background: Intimate partner violence (IPV) is prevalent and is associated with a broad range of adverse consequences. In military organizations, IPV may have special implications, such as the potential of service-related mental disorders to trigger IPV. However, the Canadian Armed Forces (CAF) have limited data to guide their prevention and control efforts. Methods: Self-reported IPV perpetration, victimization, and their correlates were assessed on a cross-sectional survey of a stratified random sample of currently-serving Canadian Regular Forces personnel (N = 2157). The four primary outcomes were perpetration or victimization of any physical and/ or sexual or emotional and/ or financial IPV over the lifespan of the current relationship. Results: Among the 81% of the population in a current relationship, perpetration of any physical and/ or sexual IPV was reported in 9%; victimization was reported in 15%. Any emotional and/ or financial abuse was reported by 19% (perpetration) and 22% (victimization). Less physically injurious forms of abuse predominated. Logistic regression modelling showed that relationship dissatisfaction was independently associated with all four outcomes (OR range = 2.3 to 3.7). Probable depression was associated with all outcomes except physical and/ or sexual IPV victimization (OR range = 2.5 - 2.7). PTSD symptoms were only associated with physical and/ or sexual IPV perpetration (OR = 3.2, CI = 1.4 to 7.9). High-risk drinking was associated with emotional and/ or financial abuse. Risk of IPV was lowest in those who had recent deployment experience; remote deployment experience (vs. never having deployed) was an independent risk factor for all IPV outcomes (OR range = 2.0 - 3.4). Conclusions: IPV affects an important minority of military families; less severe cases predominate. Mental disorders, high-risk drinking, relationship dissatisfaction, and remote deployment were independently associated with abuse outcomes. The primary limitations of this analysis are its use of self-report data from military personnel (not their intimate partners) and the cross-sectional nature of the survey. Prevention efforts in the CAF need to target the full spectrum of IPV. Mental disorders, high-risk drinking, and relationship dissatisfaction are potential targets for risk reduction. Additional research is needed to understand the association of remote deployment with IPV.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0aa7c977757396ec0c40162e9a8ea5c3",
  "timestamp": "2025-05-15T02:43:06.678912"
}