{
  "id": 3224,
  "title": "Corporate governance and firm's risk behavior: the moderating role of corporate social responsibility",
  "abstract": "PurposeThis study aims to examine the nexus of corporate governance with firms' financial risk-taking behavior under the corporate social responsibility (CSR) disclosures in the context of non-financial listed firms of an emerging economy.Design/methodology/approachThis study investigates the relationship between corporate governance as evaluated by an index and several financial risks, including idiosyncratic, default and systematic risks. The connection of corporate governance with financial risks is also studied while considering the moderation of CSR disclosures. The data are collected from 2014 to 2018 of 73 top 100-index listed non-financial firms of Pakistan Stock Exchange (PSX). Panel regression fixed effect and 2-step generalized method of moments techniques are applied to confirm the hypothesis along with the diagnostic tests to confirm that all outcomes of models must be authentic and reliable.FindingsThe study's findings confirm that enhancing the overall corporate governance measures resulted in an augment in the firm's risk due to weak control and regulations prevailing in emerging economies. Moreover, CSR disclosures enhance stakeholder information, lessen information asymmetry about management policies and mitigate the risk associated with operational uncertainties.Practical implicationsThis study has a practical implementation to policymakers that effective monitoring and controlling measures facilitate the corporate management for minimizing the financial risks. Further, the study's findings shed light that implementing corporate governance measures is not enough to mitigate financial risks until supervisory measures in the form of CSR disclosures are not taken to analyse corporate governance effectiveness.Originality/valueThis paper enhances the key findings in the literature by examining the role of corporate governance measures with respect to firms' financial risks considering the moderating role of CSR disclosures. Furthermore, this research adds to the body of knowledge regarding the implementation of monitoring measures that assist in the mitigation of firms' financial risks hence firm value.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0aad47f5d07fd25233367a56b6c2106a",
  "timestamp": "2025-05-15T02:24:05.024036"
}