{
  "id": 1559,
  "title": "Unveiling multiscale dynamics: exploring financial risk spillover and influencing factors among Chinese financial institutions",
  "abstract": "This paper aims to uncover patterns of financial risk spillover between Chinese financial institutions and investigate influencing factors across various timescales and periods. First, we decompose the transaction prices of financial institutions using the maximal overlap discrete wavelet transform (MODWT). Using the copula model, we construct multiscale, multiperiod interconnected networks between Chinese financial institutions at different timescales. Then, we measure risk spillover between financial institutions using the dynamic Delta-conditional value-at-risk (Delta CoVaR) model. Subsequently, we integrate the correlation matrixes into a spatial econometric model to explore the influencing factors of risk spillover between financial institutions at different timescales and in different periods using samples of 27, 42 and 78 financial institutions listed in China from 2008 to 2023. Our results highlight the critical role of banking and securities institutions in transmitting network risk, although the importance of banks is found to decrease over time. During financial events, the clustering trend within the banking industry decreases. A rise in stock market returns, the size of financial institutions, market-to-book ratios or financial leverage increases the risk spillover to other related financial institutions. Conversely, rising asset returns lead to a reduction in risk spillover to other related financial institutions. Based on these findings, we propose recommendations for preventing financial risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0abc3bcac2973d8c9ecb37894c8814da",
  "timestamp": "2025-05-15T02:04:20.144283"
}