{
  "id": 4106,
  "title": "Fundamental analysis and the use of financial statement information to separate winners and losers in frontier markets: evidence from Vietnam",
  "abstract": "Purpose The pupose of the paper is to study the usefulness of Piotroski (2000)'s F-score in separating winners and losers in Vietnam. Design/methodology/approach The authors adopt a portfolio analysis and regression analysis on a sample of 501 of listed firms between 2009 and 2019 in Vietnam. Findings The authors find that a hedge strategy that buys high-F-score firms and sells low-F-score firms yield market-adjusted return of over 30 percent annually, which is statistically and economically significant. The hedge strategy based on F-score is not only profitable for value (high book-to-market [BM]) firms but also earn abnormal returns in a sample of growth (low BM) firms, suggesting that the usefulness of F-score strategy is not just a phenomenon in value firms as documented in previous literature. Research limitations/implications Whilst the authors' paper documents economically significant returns obtained from the F-score strategy, the authors do not examine what drives the abnormal returns. Practical implications The results provide supporting evidence for the use of financial statement analysis as a screening tool to improve the performance of value investment in Vietnam stock market and for the training of financial reporting and fundamental analysis in universities. Originality/value The authors' research is the first study examining the F-score strategy in Vietnam that provides insights about the usefulness of fundamental analysis in separating winners and losers in a frontier market and contributes to the literature on fundamental analysis and market efficiency in emerging and frontier markets.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ac00ca50c937f50933aca98192e980d",
  "timestamp": "2025-05-15T01:23:58.042214"
}