{
  "id": 522,
  "title": "A Real-Time Framework for Matching Prosumers With Minimum Risk in the Cluster of Microgrids",
  "abstract": "Microgrids provide an economical solution to exploit increasing distributed energy sources by locally consuming generated power. The key to the reliable operation of microgrids is how to cope with the uncertainty of renewables when selling and buying power. Although the surplus power of each microgrid can fluctuate significantly, aggregating the contributions from multiple microgrids may produce a smoothed supply. We study the matching problem in the cluster of cooperative microgrids where surplus power from some microgrids (called sellers) can be consumed by other microgrids (called buyers) in need of more power. We develop a framework for predicting sellers and buyers for every time interval, and matching them based on the prediction. We first formulate the problem of matching sellers and buyers. This problem finds a portfolio of sellers contributions to every buyer with minimum risk of mismatch between supply from sellers and demand from buyers. We characterize the optimal matching and give some insight on how surplus power should be distributed to buyers. The formulation involves several statistical parameters of microgrids. We present a LSTM based method for predicting these parameters. Using surplus power data of real microgrids, we demonstrate that our framework can reduce the risk of mismatch.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ac1f919fafc36201a29b967fa7666e1",
  "timestamp": "2025-05-15T00:37:01.729222"
}