{
  "id": 2540,
  "title": "Modelling of ML-Enablers in 5G Radio Access Network-Conceptual Proposal of Computational Framework",
  "abstract": "The fifth generation (5G) of mobile networks connects people, things, data, applications, transport systems, and cities in smart networked communication environments. With the growth in the amount of generated data, the number of wirelessly connected machines, traffic types, and associated requirements, ensuring high-quality mobile connectivity becomes incredibly difficult for technology suppliers. Mobile operators and network vendors enrolling in 5G face far more rapid demands than any technology before, and at the same time need to ensure efficiency and reliability in the network operations. In fact, intelligent forecasting and decision-making strategies are several of the centerpieces of current artificial intelligence research in various domains. Due to its strong fitting ability, machine learning is seen to have great potential to be employed to solve telecommunication networks' optimization problems that range from the design of hardware elements to network self-optimization. This paper addresses the question of how to apply artificial intelligence to 5G radio access control and feed ML techniques with radio characteristic-based automatic data collection to achieve ML-based evaluation of 5G performance. The proposed methodology endorses ML tools for the 5G portfolio scenarios requirements assessment and integrates into the mature methods for network performance optimization: self-organizing networks (SON) and minimization of drive tests (MDT). In this context, the proposed treatment guides future network deployments and implementations adopted on a 3GPP standard basis.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ad6850710b1dbe9875d47dd4e2013ec",
  "timestamp": "2025-05-15T01:08:10.677948"
}