{
  "id": 2104,
  "title": "Relational capability and strategic alliance portfolio configuration A study of Brazilian technology firms",
  "abstract": "Purpose The purpose of this paper is to focus on evaluating relational capability regarding the configuration of a network of technological partners in Brazilian technology-based firms (TBFs). Design/methodology/approach The data were collected using an online questionnaire made available to technology-based companies resident in Brazilian Technological Parks. A total of 73 companies responded. The data were analyzed using bivariate and multivariate statistical techniques and were processed using Statistical Package for Social Sciences software. The statistical tests included factor analysis, Cronbach's alpha and multiple regression. Findings The paper shows that the strategic alliance portfolio is influenced by organizational learning, diversity of partners, governance structure, intensity of partnership relations and configuration. In particular, the portfolio of alliances with competence orientation is characterized by tacit knowledge exchanges and learning exploration, homogeneity of partners, informal governance mechanisms, strong bonds of trust and reciprocity with partners and low diversification of actors' profiles, their attributions and the results obtained in the portfolio. Meanwhile, the characteristics of alliance portfolios with legitimacy orientation include explicit knowledge exchange and learning exploitation, heterogeneity of partners, formal governance mechanisms, weak bonds of trust and reciprocity with partners and high diversification of the profile of the actors, their attributions and the results obtained from the portfolio. Practical implications The configuration of the alliance portfolio plays an important role in innovation. To stimulate the creation of new technological skills, the executive of a technology-based company from emerging countries such as China, Russia and India, can configure the portfolio of strategic alliances with more homogeneous partners in terms of profile and attribution. However, if this executive is challenged to seek legitimacy and complementary resources in these markets he can invest in the diversification of the strategic alliance portfolio, prioritizing partners with differentiated profiles and attributions. Originality/value The originality of the research lies in the adoption of a complementary and multidimensional theoretical prism, considering the relational capacity of TBFs in the configuration of alliances, both in the intra-firm and portfolio perspective. Furthermore, it was considered that the configuration of alliances can be based on both competence and legitimacy factors.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ad6f34c214bcdb5f7a1990545aeabc9",
  "timestamp": "2025-05-15T01:03:03.659807"
}