{
  "id": 7908,
  "title": "The Prognostic Value of Proliferative Activity in Cutaneous Melanoma: A Pilot Study Evaluating the Mitotic Rate and Ki67 Index to Predict Patient Outcomes",
  "abstract": "Proliferative activity in cutaneous melanomas can be appreciated both histopathologically by counting mitotic figures and immunohistochemically through the Ki67 index, but the prognostic value of each method is still a matter of debate. In this context, we performed a retrospective study on 33 patients diagnosed with cutaneous melanomas between 2013 and 2018 in order to evaluate progression-free survival and overall survival. Multivariate Cox proportional hazards regression was performed by considering both clinical histopathological and immunohistochemical features. The mitotic rate was significantly independently associated with both outcomes, while the Ki67 index was not an independent prognostic factor. However, the Ki67 predictive accuracy could be improved by establishing both a cut-off value and a standardized protocol for evaluating its expression. Until these desiderata are met, the mitotic rate remains superior to the Ki67 index for predicting prognosis in cutaneous melanomas, as also has the advantage of being easily interpreted in a standard histopathological examination regardless of the pathologist's experience and with no further financial expenses. Importantly, this is one of very few articles that has shown perineural invasion to be an independent prognostic factor for both progression-free survival and overall survival in cutaneous melanomas. As a consequence, this parameter should become a mandatory feature in the histopathological evaluation of cutaneous melanomas as it can improve the identification of patients who are at high risk for disease progression.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0adfea68691e1372aee1a8cce92b56c9",
  "timestamp": "2025-05-15T03:13:04.998555"
}