{
  "id": 7909,
  "title": "A Long, Unnerving Road: Malpractice Claims Involving the Surgical Management of Thyroid and Parathyroid Disease",
  "abstract": "Background Given their profound emotional, physical, and financial toll on patients and surgeons, we studied the characteristics, costs, and contributing factors of thyroid and parathyroid surgical malpractice claims. Methods Using the Controlled Risk Insurance Company Strategies' Comparative Benchmarking System database, representing similar to 30% of all US paid and unpaid malpractice claims, 5384 claims filed against general surgeons and otolaryngologists from 1995-2015 were reviewed to isolate claims involving the surgical management of thyroid and parathyroid disease. These claims were studied, and multivariable regression analysis was performed to identify factors associated with plaintiff payout. Results One hundred twenty-eight thyroid and parathyroid surgical malpractice claims were isolated. The median time from alleged harm event to closure of a malpractice case was 39 months. The most common associated complications were bilateral recurrent laryngeal nerve (RLN) injury (n = 23) and hematoma (n = 18). Complications led to death in 18 cases. Patient payout occurred in 33% of claims (n = 42), and the median cost per claim was $277,913 (IQR $87,343-$783,663). On multivariable analysis, bilateral RLN injury was predictive of patient payout (OR 3.58, p = 0.03), while procedure, death, and surgeon specialty were not. Conclusion Though rare, malpractice claims related to thyroid and parathyroid surgery are costly, time-consuming, and reveal opportunities for early surgeon-patient resolution after poor outcomes.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ae229dcdef2cda972f7cebfb0c30bbb",
  "timestamp": "2025-05-15T03:13:05.003549"
}