{
  "id": 195,
  "title": "A time-varying stock portfolio selection model based on optimized PSO-BiLSTM and multi-objective mathematical programming under budget constraints",
  "abstract": "Choosing the optimal portfolio is an ongoing challenging research area and a complex process involving selecting the best investment plan according to various factors, such as investor preferences for expected return, risk, and duration of investments. Although various methods have been presented so far, they failed to obtain a holistic approach to the existing data, and the need for a comprehensive mechanism based on the investor's time preferences is felt. In this paper, by considering the fundamental characteristics, technical indicators, time-series data, and budget constraints, we developed a comprehensive and time-varying methodology to forecast stock prices and form an optimal portfolio. The proposed method consists of recurrent neural networks and multi-objective mathematical programming (MOMP). In this regard, the bidirectional long short-term memory model is adopted and optimized by the particle swarm optimization (PSO) algorithm, called PSO-BiLSTM. Furthermore, the hybrid MOMP models are developed based on long-, mid-, and short-term strategies to provide the optimal portfolio of the stocks with investment constraints. The main objectives of this research were to address the following issues: (1) developing a precise and efficient model to forecast the stocks prices, taking account of fundamental characteristics, technical indicators, time-series data appropriate to the period considered by the investor, (2) providing an optimized time-varying portfolio through developing the hybrid MOMP models, and generally (3) proposing a holistic step-by-step methodology considering three groups of market data and deep learning to apply investment constraints as well as investor's time preferences in the process of building more realistic portfolios. The results highlight that the tuned PSO-BiLSTM method performs better than the conventional methods in all three constructed models using fundamental characteristics, technical indicators, and time-series data. Compared to the conventional methods, the proposed methodology outperforms in generalization power, is more precise in forecasting prices, and provides portfolios with more profit.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ae999c8e506b86c9cfb4ceade3fc145",
  "timestamp": "2025-05-15T00:33:06.210353"
}