{
  "id": 1898,
  "title": "Business Failure Prediction Based on a Cost-Sensitive Extreme Gradient Boosting Machine",
  "abstract": "Business failure prediction is very important for the sustainable development of enterprises. Machine learning algorithms, especially ensemble algorithms, have shown great economic benefits in enterprise financial early warning. However, the highly imbalanced class distribution of financial risk data and the inexplainable of most machine learning-based early distress warning models limit their commercial application. To address the above limitations, we enhance the business failure prediction performance by tree-ensemble in a boosting manner. Moreover, to solve the class imbalanced issue in business failure datasets, a weighted objective function, weighted cross-entropy, is embedded into the boosted tree framework, making the weighted XGBoost a cost-sensitive business failure prediction model. Besides, to tackle the second issue, we explore the intrinsic interpretability of the proposed method by visualizing the feature importance and incorporating a partial dependence plot technique to locally interpret the individual business failure event. Experimental results on business failure datasets with different predictive horizons collected from China Security Market Accounting Research (CSMAR) database show the proposed weighted XGBoost is a good solution to reduce the error on recognizing firms in business failure. Furthermore, the visualized feature importance score and partial dependence plot result both demonstrate that the cost-sensitive tree-based ensemble can be a good tool to guide the investors in making rational as well as provide interpretable business prediction results as a reference for the policy-making of the regulators.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0af0bac1727b16a7607864f59ec5259b",
  "timestamp": "2025-05-15T02:08:39.075741"
}