{
  "id": 3942,
  "title": "The influence of age on perceptions of anticipated financial inadequacy by palliative radiation outpatients",
  "abstract": "Objective: A consistent body of knowledge suggests that with advancing age, adults tend to report lower financial strain from their current economic condition. But are more negative perceptions shifted onto their expectations about their future economic condition? This study of seriously ill outpatients investigates whether advancing age is related to more negative expectations of future health-related financial strain, in which illness progression would necessitate greater health care consumption. Methods: Ordinal probit multivariate regression was conducted on survey findings from 268 outpatients initiating palliative radiation for recurrent cancer. Half were retirees age >= 65. Age comparisons are reported when there was no recent work transition. Results: As age advances (from 40 to 84), outpatients incurring low objective financial stress were more likely to reveal that their health insurance and finances would be less adequate to meet future health needs. Conclusion: Previously, these outpatients were reported to minimize perceptions of current financial strain as age advances. Therefore, older outpatients may cope with current circumstances by displacing perceptions of financial inadequacy onto plausible future situations of cancer progression demanding greater healthcare consumption. Practice implications: Financial strain may be hidden in older outpatients initiating palliative radiation. These outpatients appear at risk of foregoing appropriate healthcare. Targeted screening and advocacy are warranted. (c) 2007 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0af564723a40704cc29a7dfdfb31d5f9",
  "timestamp": "2025-05-15T02:31:28.443726"
}