{
  "id": 6611,
  "title": "Determinants of husbands' violence against women in Jordan",
  "abstract": "Background: Intimate partner violence (IPV) is the most common form of abuse against women. It comes in the form of physical, sexual, emotional, and controlling behaviors abuse, and affects women's physical and psychological well-being. Perceived social support decreases IPV risk. Purpose: This study explores the determinants of IPV in J society. Method: One hundred and eighty-seven women exposed to IPV were recruited from J Women Unions to take part in this cross-sectional prospective quantitative design, administering the Arabic version of the Multidimensional Scale of Perceived Social Support (AVMSPSS) to 187, who also answered the demographic characteristics data sheet. Results: Almost 83% of participants perceived that they received lower to moderate PSS. Based on multiple regression, determinants of IPV were PSS, followed by participant education, husband education, participant age, and financial income (p < .001). The number of children and parental level of education showed no statistical significance. Conclusion: The findings highlight the importance of social support systems among IPV women. Alongside socioeconomic development continuing to increase education among both men and women, there is a need to increase societal awareness and foster social support systems to prevent violence against women and offer resources to affected women, targeted at the most at-risk age groups.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0af9b8f9203cb8ba20a3391659a07a35",
  "timestamp": "2025-05-15T02:59:37.103278"
}