{
  "id": 5583,
  "title": "Household financial burden among multidrug-resistant tuberculosis patients in Guizhou province, China A cross-sectional study",
  "abstract": "Multidrug-resistant tuberculosis (MDR-TB) threatens global public health. Poor access to health care due to financial hardship contributes to further transmission of the disease. The study aimed to: 1. quantify the magnitude of financial burden among affected households by MDR-TB in the first year of treatment; 2. measure financial and social protection of local policies for MDR-TB by catastrophic payments; 3. determine associated factors of catastrophic payments in Guizhou, China. A cross-sectional study was conducted in 2 hospitals designated for MDR-TB from January to August 2018. Data were collected by interviewing eligible MDR-TB outpatients and reviewing the medical records. The magnitude of financial burden was documented by total cost and distribution of cost components. Catastrophic payments were measured by 2 indicators: catastrophic health expenditure (CHE) and catastrophic total costs (CTC), both of which were estimated by incidence and intensity. Their associated factors were determined using logistic regression models. Of 161 households affected by MDR-TB, the average total costs due to MDR-TB treatment in the first year was US$ 8266 and consisted of 72% direct medical costs, 5% direct non-medical costs and 23% indirect costs (income loss). Thirty seven percent of direct medical costs were covered by insurance. Overall, the incidence of CHE and CTC was 68.3% and 87.0%, respectively. Both incidence and intensity for the 2 defined catastrophic costs increased when a households income decreased. Five significant factors of catastrophic costs were low household income, absence of students in a family, hospital length of stay, male gender, and job/productivity loss. Households with MDR-TB patients shouldered a high financial burden which was mainly driven by direct medical costs and income loss in Guizhou. Greater catastrophic payments were associated with hospital length of stay and socioeconomic status, especially had a dose-response relationship with households income. Our findings suggest that financial and social protection of local policies for MDR-TB should be improved by preparing a uniform and comprehensive insurance package to cover sufficiently direct medical costs, and introducing social pro-poor assistance policies for risk families to protect them from financial hardship.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0afdef91c47b29be8c6589a2786a8fea",
  "timestamp": "2025-05-15T02:49:21.658895"
}