{
  "id": 430,
  "title": "Implied volatility smirk and future stock returns: evidence from the German market",
  "abstract": "Purpose - The purpose of this paper is to investigate the relationship between option's implied volatility smirk (IVS) and excess returns in the Germany's leading stock index Deutscher-Aktien Index (DAX) 30. Design/methodology/approach - The study defines the IVS as the difference in implied volatility derived from out-of-the-money put options and at-the-money call options. This study employs the ordinary least square regression with Newey-West correction to analyse the relationship between IVS and excess DAX 30 index returns in Germany. Findings - The authors find that the German market adjusts information in an efficient way. Consequently, there is no information linkage between option volatility smirk and market index returns over the nine years sample period after considering the control variables, global financial crisis dummies, and the subsample test. Research limitations/implications - This study finds that the option market and the DAX 30 index are informationally efficient. Implications of the findings are that the investors cannot profit from the information contained in the IVS since the information is simultaneously incorporated into option prices and the stock index prices. The findings of this study are applicable to other markets with European options and for market participants who seek to exploit short-term market divergence from efficiency. Originality/value - The relationship between IVS and stock price changes has not been investigated sufficiently in academic literature. This study looks at this relationship in the context of European options using high-frequency transactions data. Prior studies look at this relationship for only American options using daily data. Pricing efficiency of the European option market using highfrequency data have not been studied in the prior literature. The authors find different results for the German market based on this high-frequency data set.",
  "year": 2015,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b008634dcf6387d321b53be55c243af",
  "timestamp": "2025-05-15T01:31:50.757008"
}