{
  "id": 9417,
  "title": "Blood pressure telemonitoring and telemedicine for hypertension management-positions, expectations and feasibility of Latin-American practitioners. SURVEY carried out by several cardiology and hypertension societies of the Americas",
  "abstract": "Purpose To assess the opinion of Latin-American physicians on remote blood pressure monitoring and telehealth for hypertension management. Material and methods Cross-sectional survey of physicians residing in Latin-America. The study was conducted by the Mexico Hypertension Experts Group, Interamerican Society of Hypertension, Interamerican Society of Cardiology Epidemiology and Cardiovascular Prevention Council, and National Cardiologist Association of Mexico. An online survey composed of 40 questions using Google Forms was distributed from 7 December 2021, to 3 February 2022. The survey was approved by the GREHTA Ethics Committee and participation was voluntary and anonymous. Multiple logistic regression models were constructed to identify the challenges of telehealth. Results 1753 physicians' responses were gathered. The responses came from physicians from different Latin-American countries, as follows: 24% from Mexico, 20.6% from Argentina, 14.7% from Colombia, 10.9% from Brazil, 8.7% from Venezuela, 8.2% from Guatemala and 3.2% from Paraguay. Responders with a high interest in carrying out their assistance task through remote telemonitoring reached 48.9% (821), while 43.6% are already currently conducting telemonitoring. A high number, 62%, claimed to need telemonitoring training. There is a direct relation between higher interest in telemonitoring and age, medical specialty, team working, residence in the biggest cities, expectations regarding telemedicine and reimbursement. Conclusions Remote monitoring is feasible in Latin-America. General practitioners and specialists from bigger cities seem eager and are self-perceived as well-trained and experienced. Facilities and resources do not seem to be a challenge but training reinforcement and telemedicine promotion is necessary for those physicians less motivated. PLAIN LANGUAGE SUMMARY What is the context? Hypertension is one of the leading worldwide modifiable risk factors for premature death. Strong evidence supports that effective treatment of this condition results in a significant reduction of hard outcomes. Only 20%-30% of hypertensive patients are within the blood pressure targets recommended by guidelines in Latin-America. There is an urgent need to implement innovative strategies to reverse this alarming health situation. What is new? Latin-American physicians were highly predisposed to telemonitoring practice. This high motivation was not influenced by hardware or software availability, technological knowledge or experience, by volume of monthly consultations, or by area (private-public) where the care activity is carried out. This high motivation may be supported by the conviction that this practice could be very useful as a complement to face-to-face assistance and a highly effective tool to improve adherence even though respondents considered that just 10% of the patients would prefer telemonitoring over office consultation. What is the impact? Facilities and resources do not seem to be a challenge but training reinforcement and telemedicine promotion is necessary for those physicians less motivated. The general perception is that it is necessary to move forward to resolve legal gaps and financial aspects. Physicians must adapt to changes and develop new communication strategies in a world where the unrestricted access to teleinformation makes patients self-perceived as experts.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b0f448e8911e1060501da51581f06cf",
  "timestamp": "2025-05-15T03:28:46.218998"
}