{
  "id": 7026,
  "title": "Parental separation in childhood and adult smoking in the 1958 British birth cohort",
  "abstract": "Background: Parental separation or divorce is a known risk factor for poorer adult health. One mechanism may operate through the uptake of risky health behaviours, such as smoking. This study investigated the association between parental separation and adult smoking in a large British birth cohort and also examined potential socioeconomic, relational and psychosocial mediators. Differences by gender and timing of parental separation were also assessed. Methods: Multiply imputed data on 11 375 participants of the National Child Development Study (the 1958 British birth cohort) were used. A series of multinomial logistic regression models were estimated to investigate the association between parental separation (0-16 years) and adult smoking status (age 42), and the role of potential socioeconomic, relational and psychosocial mediators. Results: Parental separation in childhood was associated with an increased risk of being a current (RRR = 2.14, 95% CI: 1.77, 2.60) or ex-smoker (RRR = 1.50, 95% CI: 1.22, 1.85) at age 42. This association remained after consideration of potential socioeconomic, psychosocial and relational mediators. Relational (parent-child relationship quality, parental involvement and adult partnership status) and socioeconomic factors (overcrowding, financial hardship, housing tenure, household amenities, free school meal receipt and educational attainment) appeared to be the most important of the groups of mediators investigated. No differences by gender or the timing of parental separation were observed. Conclusion: Parental separation experienced in childhood was associated with increased risk of smoking. Families undergoing separation should be further supported in order to prevent the uptake of smoking and to prevent later health problems.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b20736bbabe0c07d19c9bcb2f01c91e",
  "timestamp": "2025-05-15T03:04:22.995471"
}