{
  "id": 233,
  "title": "The Study on Option Pricing Based on Wiener-Itô Chaos Expansion and Generative Adversarial Networks",
  "abstract": "The stochastic volatility model, for pricing complex financial products, adequately considers the skewness and smile shape of asset volatility. However, it is often challenging to obtain analytical solutions for options on asset prices under such models. Therefore, this study proposes a hybrid approach for forecasting the prices of European options based on the Heston model, utilizing the Wiener-It & ocirc; chaos (WIC) expansion and generative adversarial networks (GANs). Firstly, a two-step approach is constructed based on the simulated annealing algorithm and trust region reflective algorithm to globally optimize the Heston model. Secondly, the WIC method is adopted to derive a closed-form approximate pricing formula for European call options under the mixed volatility model, which in turn yields an approximation of option prices under the Heston model. Thirdly, the GANs model, incorporating long short-term memory networks and multi-layer perceptrons, is utilized to train the residual term D, representing the difference between the actual option price and its asymptotic approximation, which substantially improves the forecasting model's accuracy and robustness. Empirical research on SSE 50 ETF options demonstrates that the proposed model achieves better results in terms of accuracy and stability. The empirical results of training the residual term D significantly outperform those of training the actual option price. Additionally, the adversarial game concept of the GANs model leads to significantly better forecast performance compared to other machine learning models.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b2bca1b50df03ea6fed2994b8db58f2",
  "timestamp": "2025-05-15T01:29:44.206020"
}