{
  "id": 8256,
  "title": "The Impact of Uncertainties on Crude Oil Prices: Based on a Quantile-on-Quantile Method",
  "abstract": "There has always been a complex relationship between uncertainty and crude oil prices. Three types of uncertainty, i.e., economic policy uncertainty, geopolitical risk uncertainty, and climate policy uncertainty (EPU, GPR, and CPU for short), have exacerbated abnormal fluctuations in the energy market, making crude oil prices volatile more and more frequently, especially from the perspective of the financial attribute of crude oil. Based on the time-series data related to uncertainties and crude oil prices from December 2001 to March 2021, this paper uses the quantile-on-quantile regression (QQR) method to explore the overall impact of various uncertainties on crude oil prices. Moreover, this paper adopts the QQR method based on the wavelet transform to investigate the heterogeneous effects of various uncertainties on crude oil prices at different time scales. The following conclusions are obtained. First, there are significant differences in the overall impact of the three types of uncertainties on crude oil prices, and this heterogeneity is reflected in quantiles of the peak impact intensity, the impact direction, and the fluctuation change. Second, the impact intensities of the three types of uncertainties on crude oil prices are significantly different at different time scales. This is mainly reflected in the different periods of significant impact of the three uncertainties on crude oil prices. Third, the impact directions and fluctuations of the three types of uncertainties on crude oil prices are heterogeneous at different time scales.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b2cbc38a3bb399edf5216c8cdfae059",
  "timestamp": "2025-05-15T03:16:49.050770"
}