{
  "id": 5486,
  "title": "Reducing Surgical Site Infection in Spinal Surgery With Betadine Irrigation and Intrawound Vancomycin Powder",
  "abstract": "Study Design. Retrospective analysis. Objective. The objective of this study was to evaluate the efficacy of a surgical site infection (SSI) prevention protocol instituted in the Orthopaedic Spine Department at our institution. Summary of Background Data. SSI is an undesired complication of orthopedic spine surgical procedures. It poses a significant risk to the patient, as well as a financial toll on the health care system. A wide range of prophylactic measures have been used to attempt to reduce SSI rates. Methods. A protocol consisting of a combination of 0.3% Betadine wound irrigation and 1 g of intrawound Vancomycin powder application was developed at our institution. Multiple data sources were consolidated for thorough evaluation of changes in SSI rates, patient risk factors, and changes in bacteriology. Identification of risk factors that predispose patients to SSI was performed using mixed-effects logistic regression in a univariate fashion. Risk factors with P values of 0.05 or less in univariate analysis were included together in a multivariate mixed-effects logistic regression model. Results. SSI rates were reduced by 50% after the intervention; chi(2) analysis comparing the SSI rates between the pre- and postintervention periods yielded a P value of 0.042. Rates of methicillin-resistant Staphylococcus aureus dropped from 30% to 7% and the rates of multibacterial infections dropped from 37% to 27%. The risk factors that were statistically significant in multivariate analysis were the following: age (odds ratio [OR] = 0.93), anemia (OR = 30.73), prior operation (OR = 27.45), and vertebral fracture (OR = 22.22). Conclusion. The combination of Betadine wound irrigation and intrawound vancomycin powder application led to both a clinically and statistically significant decrease in SSI rates by 50%. Bacteriology analysis and risk factor assessment proved to be valuable tools in assessing the efficacy of a new prophylactic measure and in the planning of future protocols.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b32f1f8defa9dfb470513eb192944e0",
  "timestamp": "2025-05-15T02:48:23.680407"
}