{
  "id": 5450,
  "title": "Incidence and risk factors for suicidal ideation in a sample of Chinese patients with mixed cancer types",
  "abstract": "Purpose Suicidal ideation (SI) is often overlooked as a risk factor for people with cancer. Because it is often a precursor for suicidal behavior, it is critical to identify and address SI in a timely manner. This study investigated SI incidence and risk factors in a cohort of Chinese patients with mixed cancer types. Methods Data from this cross-sectional study were collected from 588 patients receiving medical therapy for tumors at Nanfang Hospital and the Integrated Hospital of Traditional Chinese Medicine at Southern Medical University. SI was measured using the Self-rating Idea of Suicide Scale (SIOSS). Anxiety and depression were assessed using the Hospital Anxiety and Depression Scale (HADS). The Chinese version of the Demoralization Scale II (DS-II-C) was used to assess demoralization. Univariate and correlation analyses were used to identify correlative factors of SI and multiple stepwise linear regression analysis was used to characterize potential risk factors. Results SI was reported in 24.7% of participants and the SIOSS score was 14.00 (13.00, 15.00) in the SI group. Multiple linear regression results showed that demoralization, medical financial burden, cancer type, living condition, caretaker, working state, residence, gender, and marital status explained 32.1% of the SI in this cohort (F = 28.705, P < 0.001). Conclusion Approximately one-quarter of cancer patients in this study reported SI influenced by both external and internal factors. Characterizing these factors can be informative for prevention and treatment efforts.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b3c26d8b7c20500d8bb67734e796625",
  "timestamp": "2025-05-15T02:47:43.068478"
}