{
  "id": 6519,
  "title": "Associations between Statin Use and Glaucoma in the All of Us Research Program",
  "abstract": "Purpose: To investigate associations between statin use and glaucoma in the 2017 to 2022 All of Us (AoU) Research Program. Design: Cross-sectional, population-based. Participants: 79 742 adult participants aged >40 years with hyperlipidemia and with electronic health record (EHR) data in the AoU database. Methods: Hyperlipidemia, glaucoma status, and statin use were defined by diagnoses and medication information in EHR data collected by AoU. Logistic regression analysis was performed to evaluate the association between statin use and glaucoma likelihood. Logistic regression modeling was used to examine associations between glaucoma and all covariates included in adjusted analysis. Serum low-density lipoprotein cholesterol (LDL-C) was used to assess hyperlipidemia severity. Analyses stratified by LDL-C level and age were performed. Main Outcome Measures: Any glaucoma as defined by International Classification of Diseases codes found in EHR data. Results: Of 79 742 individuals with hyperlipidemia in AoU, there were 6365 (8.0%) statin users. Statin use was associated with increased glaucoma prevalence when compared with statin nonuse (adjusted odds ratio [aOR]: 1.13, 95% confidence interval [CI]: 1.01-1.26). Higher serum levels of LDL-C were associated with increased odds of glaucoma (aOR: 1.003, 95% CI: 1.003, 1.004). Statin users had significantly higher LDL-C levels compared to nonusers (144.9 mg/dL versus 136.3 mg/dL, P value < 0.001). Analysis stratified by LDL-C identified positive associations between statin use and prevalence of glaucoma among those with optimal (aOR = 1.39, 95% CI = 1.05-1.82) and high (aOR = 1.37, 95% CI = 1.09-1.70) LDL-C levels. Age-stratified analysis showed a positive association between statin use and prevalence of glaucoma in individuals aged 60 to 69 years (aOR = 1.28, 95% CI = 1.05-1.56). Conclusions: Statin use was associated with increased glaucoma likelihood in the overall adult AoU population with hyperlipidemia, in individuals with optimal or high LDL-C levels, and in individuals 60 to 69 years old. Findings suggest that statin use may be an independent risk factor for glaucoma, which may furthermore be affected by one's lipid profile and age. Financial Disclosures: Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Glaucoma 2024;7:563-571 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b3f12f7fff959a409d36d0cb8e7e3b8",
  "timestamp": "2025-05-15T02:59:07.410520"
}