{
  "id": 8720,
  "title": "HIV risk among young women who sell sex by whether they identify as sex workers: analysis of respondent-driven sampling surveys, Zimbabwe, 2017",
  "abstract": "Introduction Across sub-Saharan Africa, selling sex puts young women at high risk of HIV. Some young women who sell sex (YWSS) may self-identify as sex workers, while others may not, having implications for how to reach them with HIV prevention. We describe characteristics, sexual behaviours and health service use of YWSS in Zimbabwe, comparing women who identified as female sex workers (FSW) and women who did not (non-identifying-YWSS), and explore factors associated with HIV infection. Methods We analysed data from respondent-driven sampling (RDS) surveys among YWSS aged 18 to 24 implemented in six sites in Zimbabwe from April to July 2017. RDS was used to enrol YWSS into an impact evaluation of the multi-country DREAMS (Determined, Resilient, Empowered, AIDS-free, Mentored and Safe) Partnership, which provides comprehensive HIV prevention programming to adolescent girls and young women. Women completed an interviewer-administered questionnaire and were offered HIV testing services. We used logistic regression (RDS-II-weighted, normalized by site) to identify factors associated with prevalent HIV infection. Results Forty-four seeds recruited 2387 YWSS. RDS-adjusted HIV prevalence was 24%; 67% of women identified as FSW. FSW were older and had lower educational attainment than non-identifying-YWSS. While 40% of FSW reported 10+ clients in the previous month, 9% of non-identifying-YWSS did so. FSW were more likely to have accessed HIV-related services, including HIV testing in the last six months (FSW: 70%; non-identifying-YWSS: 60%). Over half of all YWSS described selling sex as their main financial support (FSW: 88%; non-identifying YWSS: 54%). Increasing age, lower educational attainment, younger age of first selling sex and higher number of clients in the previous month were associated with prevalent HIV. Conclusions YWSS in Zimbabwe have a high prevalence of HIV, reported high numbers of sexual partners and depend financially on selling sex. Non-identifying-YWSS differed socio-demographically to FSW, yet factors associated with HIV risk were similar for all women. Women not identifying as FSW were less likely to access services, suggesting they should be prioritized for HIV prevention. Network-based recruitment may enhance their inclusion in programmes, like DREAMS, which aim to reach young women at highest-risk with comprehensive health, HIV prevention and social protection services.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b4ac10c9969a1c9d7d61dffe430ce93",
  "timestamp": "2025-05-15T03:21:56.585518"
}