{
  "id": 8068,
  "title": "FINANCIAL AID AND DROPOUTS FROM PRIVATE HIGHER EDUCATION INSTITUTIONS IN BRAZIL",
  "abstract": "The dropouts from higher education have become one of the biggest challenges for the Brazilian education and represent, among other things, a waste of public and private resources in times of government budget constraint and struggling economic situation. The main objective of this paper is to investigate whether FIES (Financing Fund the Higher Education Student) contributes to decrease college dropout rates in Brazil. Overall, the number of students in post-secondary programs increased 57.3% from 2009 to 2016 in Brazil. Along the same period, the percentage of people that officially withdrew the courses rose from 5.0% to 11.3% in public universities and, from 8,3% to 17.9% in private one. If students in temporary interruption (leave of absence) are taken into account, the dropout rate rose from 9,4% to 18,1% in public universities and from 15.3% to 29.8% in private ones The Tinto's Model is held in high regard in the field of academic student retention literature and argues that the decision to drop out arises from a combination of student characteristics (pre-entry attributes) and the extent of their academic, environmental and social integration in an institution. There is also a growing body of literature investigating the influence of receiving financial aid on retention. Most found a positive correlation between them. We analyze the relationship between financial aid program (Financing Fund the Higher Education Student - FIES) and dropouts from private universities. FIES is a program in which the Brazilian federal government provides loans to students at a subsided rate. The program was established at the end of the 90's, but stood out only after 2010, when the program was relaunched with lower interest rates and more extended grace period. The study is based on a longitudinal data from Census of Higher Education conducted by National Institute for Educational Studies and Research 'Anisio Teixeira' (INEP) that contains information about student situation, loan and other variables about students, faculty and institutions and in which is possible to follow a specific cohort in time, with available data from 2009 to 2015. A Duration Model is used to investigate the contribution of FIES in reducing dropouts. The model also shows what factors influence the decision of leaving the course. The Cox regression results show that students that get FIES have a lower risk of withdrawing than those who do not, which is an evidence of the importance of government financial aid programs. Variables as gender, race, and age are significant and, surprisingly, participation in extra-curricular activities increases attrition.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b50778356ecbd2919c8c188828f115d",
  "timestamp": "2025-05-15T03:15:09.314445"
}