{
  "id": 689,
  "title": "Robo-Sukuk pricing for Chinese equities",
  "abstract": "Sukuks have assumed increasing importance in the global financial industry, with both institutional and retail investors realizing the benefits of Sukuk, both in terms of their adherence to Islamic principles, as well as being more stable and robust. The growing importance of the Sukuk markets has happened simultaneously with the significant development of China. With the financial crisis and other recent events reducing the trust and confidence of investors in the existing financial system structures, Islamic financial products have received great attention due to their connection to real assets and risk-sharing. While Sukuk financial instruments differ significantly from their conventional bond counterparts, pricing has mostly followed conventional bond pricing methodologies. This represents a significant challenge as the characteristics of Sukuk are not considered, misrepresenting the value and associated performance of the Sukuk. An innovative data-driven methodology for the pricing of Sukuk in the Chinese equity market is presented. It overcomes the challenges with conventional bond pricing methodologies applied to Sukuk pricing. The methodology integrates a deep learning framework for the estimation and forecasting of Sukuk prices, considering factors, such as cashflows, net income, and stock price performance, in addition to textual information. Illustrated on thirty major Chinese corporations listed on the Hong Kong Stock Exchange, the framework provides a more market and value-based approach to pricing Sukuk considering the partnership nature of the Islamic financial product.Copyright (c) 2022, Borsa Istanbul Anonim S , irketi. Production and hosting by Elsevier B.V. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b50ae5cbafa8457f0e8b7d52237dca0",
  "timestamp": "2025-05-15T01:41:29.804080"
}