{
  "id": 9323,
  "title": "Leverage and IPO under-pricing: high-tech versus low-tech IPOs",
  "abstract": "Purpose - The extant literature on initial public offerings (IPOs) generally assumes that a high degree of pre-IPO leverage serves as a positive signal of firm quality as it forces a firm's managers to adhere to tough budget constraints. The purpose of this paper is to question the. validity of this assumption when it is indiscriminately applied to all firms, while other potentially important determinants of a firm's optimal capital structure are ignored. High-tech versus low-tech firms are specifically focused on. Design/methodology/approach - Multivariate regression controlling is used for various firm and offer characteristics, market and industry returns, and potential enclogeneity between investment bank rankings, price revisions, and under-pricing. Findings - It is found that debt only serves as a signal of better firm quality for low-tech IPOs, as reflected in smaller price revisions and lower under-pricing. For high-tech IPOs, the effect of leverage is reversed: for these firms, higher leverage is associated with increased risk and uncertainty as reflected by higher price revisions and greater under-pricing. The results remain significant after controlling for various firm variables as mentioned above. Practical implications - The research results allow managers of high-tech firms that contemplate going public to better understand the effect their company's capital structure will have on the pricing of their IPO. Prior research generally suggests that - irrespective of a firm's underlying characteristics - higher financial leverage results in lower under-pricing. The findings highlight the falsity of this generalization and point out that it only holds for low-tech firms. Firms that operate in a high-tech sector, on the other hand, will leave less money on the table if they use equity rather than debt financing. Originality/value - It is shown that leverage only serves as a positive signal for low-tech firms. The IPOs of these firms generally undergo smaller price revisions and are less under-priced than the IPOs of low-tech firms that use little debt in their capital structure. While this result is consistent with earlier studies, it is show that the relationship between these variables reverses for high-tech IPOs. Specifically, it is found that high-tech IPOs with high leverage undergo larger price revisions and are more under-priced than high-tech firms with low leverage. In contrast to earlier findings, this suggests that for high-tech IPOs, higher leverage implies increased ex-ante uncertainty and risks.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b55eaaf5e1d75e4f0612f83c6dfe062",
  "timestamp": "2025-05-15T03:27:53.318670"
}