{
  "id": 1177,
  "title": "An artificial neural network model for evaluating the risk of hyperuricaemia in type 2 diabetes mellitus",
  "abstract": "Type 2 diabetes with hyperuricaemia may lead to gout, kidney damage, hypertension, coronary heart disease, etc., further aggravating the condition of diabetes as well as adding to the medical and financial burden. To construct a risk model for hyperuricaemia in patients with type 2 diabetes mellitus based on artificial neural network, and to evaluate the effectiveness of the risk model to provide directions for the prevention and control of the disease in this population. From June to December 2022, 8243 patients with type 2 diabetes were recruited from six community service centers for questionnaire and physical examination. Secondly, the collected data were used to select suitable variables and based on the comparison results, logistic regression was used to screen the variable characteristics. Finally, three risk models for evaluating the risk of hyperuricaemia in type 2 diabetes mellitus were developed using an artificial neural network algorithm and evaluated for performance. A total of eleven factors affecting the development of hyperuricaemia in patients with type 2 diabetes mellitus in this study, including gender, waist circumference, diabetes medication use, diastolic blood pressure, gamma-glutamyl transferase, blood urea nitrogen, triglycerides, low-density lipoprotein cholesterol, high-density lipoprotein cholesterol, fasting glucose and estimated glomerular filtration rate. Among the generated models, baseline & biochemical risk model had the best performance with cutoff, area under the curve, accuracy, recall, specificity, positive likelihood ratio, negative likelihood ratio, precision, negative predictive value, KAPPA and F1-score were 0.488, 0.744, 0.689, 0.625, 0.749, 2.489, 0.501, 0.697, 0.684, 0.375 and 0.659. In addition, its Brier score was 0.169 and the calibration curve also showed good agreement between fitting and observation. The constructed artificial neural network model has better efficacy and facilitates the reduction of the harm caused by type 2 diabetes mellitus combined with hyperuricaemia.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b694d35af16a332d99dbf251c1dd7e4",
  "timestamp": "2025-05-15T01:59:56.261637"
}