{
  "id": 8250,
  "title": "Health-related quality of life in adolescents and young adults with and without cancer, using propensity score matching",
  "abstract": "Purpose To assess health-related quality of life (HRQOL) among adolescents and young adults (AYAs) with and without cancer, using Andersen's behavioral model of health services use. Methods We used a cross-sectional, matched case-control design; data were from the Texas Behavioral Risk Factor Surveillance System for 2015-2019. AYAs aged between 18 and 39 years and with cancer were matched to controls using propensity score matching to control for predisposing and enabling factors. Chi-square tests were used to compare differences in need for care, health practices, and health services utilization between AYAs with cancer and controls without cancer. Multiple logistic regression models were used to compare HRQOL outcomes. Results The final study sample consisted of 276 AYAs diagnosed with cancer and 828 controls after propensity score matching. The AYAs with cancer were more likely to have chronic comorbidities, smoke, and avoid health services utilization because of cost in comparison with the matched controls. Multiple logistic regressions showed significant differences in HRQOL between AYAs with cancer and controls: AYAs with cancer were more likely to have worse general health (OR = 2.488; 95% CI, 1.305-4.741) and worse perceived cognitive function (OR = 2.070; 95% CI, 1.076-3.919). Conclusion AYAs with cancer experience more chronic comorbidities, smoking, financial barriers to health service, and worse HRQOL than do AYAs without cancer. Implications for Cancer Survivors Age-appropriate tailored surveillance and survivorship supports/resources are needed for AYAs with cancer.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b6f620ba57946a83c0fa7ac9985e523",
  "timestamp": "2025-05-15T03:16:49.015862"
}