{
  "id": 7637,
  "title": "The nexus of debt financing and corporate innovation by exploring market competition's moderating and enterprise maturity's influential role: evidence from China",
  "abstract": "The study investigates the association between debt financing and corporate innovation in Chinese listed firms from 2007-2017. It also examines the interplay of market competition and enterprise maturity in this nexus. Debt financing represents all transactional credits, and innovation is measured using R&D expenditures and patent counts. The fixed-effect negative binomial regression and a two-step system GMM are applied for empirical estimates. The findings validate that debt has an inverted U-Shaped impact on enterprise innovation. The break-even points representing the optimum debt undertaking are evaluated, higher in patent than R&D activities. The results validate that market competition moderates and enterprise maturity influences high-tech firms' debt undertaking. High-tech firms uphold a lower break-even point in a competitive environment that represents restraining the takeover risk costs associated with creditors' complex restrictions. The influence of enterprise maturity elevates the optimum debt ratio, exhibiting business history's financial edge in innovative activities. Managers should refine debt policies by restoring the relationship with creditors so that high-tech firms can elevate the optimum usage of debt. In economies that focus on radical growth, effective monetary stimulation policies are crucial to achieving technology leadership, especially for mature firms and in a competitive environment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b781527c6844669792eff5547b1b431",
  "timestamp": "2025-05-15T03:10:33.028780"
}