{
  "id": 8535,
  "title": "Long-term retention and positive deviant practices in Uganda's community client-led antiretroviral distribution groups (CCLADs): a mixed-methods study",
  "abstract": "Background HIV testing and starting antiretroviral therapy (ART) are pivotal in treating people living with HIV (PLHIV) but sustaining PLHIV on treatment remains challenging. We assessed retention and attrition in community client-led antiretroviral distribution groups (CCLADs) in Uganda and identified positive deviant practices that foster long-term retention.Methods Using explanatory mixed methods, we collected longitudinal medical data from 65 health facilities across 12 districts in East Central Uganda. Quantitative phase, from 18 April 2021 to 30 May 2021, employed survival analysis and Cox regression to assess retention and identify attrition risk factors. Qualitative inquiry focused on four districts with high attrition from 11 August 2021 to 20 September 2021, where we identified nine health facilities exhibiting high retention in CCLADs. We purposively selected 50 clients for in-depth interviews (n=22) or focus group discussions (n=28). Using thematic analysis, we identified positive deviant practices. We integrated quantitative and qualitative findings into joint displays.Results Involving 3055 PLHIV, the study showed retention rates of 97.5% at 6 months, declining to 89.7% at 96 months. Attrition risk factors were lower levels of care (health centre three (adjusted HR (aHR) 2.80, 95% CI 2.00 to 3.65) and health centre four (aHR 3.61, 95% CI 2.35 to 5.54)); being unemployed (aHR 2.21, 95% CI 1.00 to 4.84); enrolment year into CCLAD (aHR 23.93, 95% CI 4.66 to 123.05) and virological failure (aHR 3.41, 95% CI 2.51 to 4.63). Of 22 clients interviewed, 8 were positive deviants. Positive deviants were characterised by prolonged retention in CCLADs, improved clinical outcomes and practised uncommon behaviours that enabled them to find better solutions than their peers. Positive deviant practices included fostering family-like settings, offering financial or self-development advice, and promoting healthy lifestyles.Conclusions Findings underscore the importance of addressing factors contributing to attrition and leveraging positive deviant practices to optimise retention and long-term engagement in HIV care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b797afb38378116f3aa3929f53428ed",
  "timestamp": "2025-05-15T03:19:52.114650"
}