{
  "id": 9373,
  "title": "National Experience of Technology-based Eye Care Services",
  "abstract": "Purpose: Technology-based Eye Care Services (TECS) is a tele-ophthalmology program operating in the Veterans' Health Administration since 2015. This study explores characteristics of the national TECS population, evaluates implementation and sustainability of TECS, and analyzes possible associations and effects of demographic characteristics and social determinants of health on being diagnosed with a vision-threatening (VT) disease. Design: Implementation and sustainability of TECS from 2015 to 2022 were examined along with the sociodemographic characteristics of veterans served through TECS in 2021. Participants: Veteran patients seen in TECS nationwide. Main Outcome Measures: Characteristics, disease prevalence and diagnoses, implementation success rate, sustainability rate, and preliminary analysis of outcomes and disparity. Methods: Per quarter from 2015 to 2022, TECS sites were classified as implementing, active, or sustained. Standard query language was used to determine sociodemographic data, and logistic regression models were used to identify risk factors associated with VT eye diagnosis. Results: A total of 21 712 Veterans, 52.1% rural or highly rural, were served by TECS in 2021. The average age was 64.7 years, with women comprising 10.9% of the population served. From 2015 to 2022, of the 67 TECS sites initiated, 6 were implementing with 51 of 61 initiated sites still operational in the first quarter (Q1) of 2022 (83.6% success rate). Age-related macular degeneration (AMD) and cataracts were more prevalent in rural and highly rural populations (7.6% and 11.3%, and 48.8% and 55.0%, respectively) versus urban populations (5.8% and 47.8%); glaucoma and diabetic retinopathy (DR) had the opposite association. The prevalence of any type of VT eye disease was lowest in the Mountains/Central region (0.54%) and highest in the Southeast region (3.2%) of the United States. Rural and highly rural residents were 1.3 and 2.5 times as likely, respectively, to be diagnosed with a VT eye disease than urban residents. Conclusions: Implementation and sustainability of TECS have been promising. The data provide key information that can be used to improve the deployment of TECS and similar programs, along with the possible future direction of TECS. Moreover, experience from one national ocular telehealth program clearly illustrates that telemedicine can address eye care disparities in the Veteran population and may be used for other vulnerable groups as well. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2025;132:442-451 Published by Elsevier on behalf of the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0b7a21f7b9f9abc38dc0bcf185eda29d",
  "timestamp": "2025-05-15T03:28:17.544386"
}