{
  "id": 6987,
  "title": "ART INVESTMENT IN SOUTH AFRICA: PORTFOLIO DIVERSIFICATION AND ART MARKET EFFICIENCY",
  "abstract": "Art has been suggested as a good way to diversify investment portfolios during times of financial uncertainty. The argument is that art exhibits different risk and return characteristics to conventional investments in other asset classes. The new Citadel art price index offered the opportunity to test this theory in the South African context. Moreover, this paper tests whether art prices are efficient. The Citadel index uses the hedonic regression method with observations drawn from the top 100, 50 and 20 artists by sales volume, giving approximately 29 503 total auction observations. The Index consists of quarterly data from the period 2000Q1 to 2013Q3. A vector autoregression of the art price index, Johannesburg stock exchange all-share index, house price index, and South African government bond index were used. Results show that, when there are increased returns on the stock market in a preceding period and wealth increases, there is a change in the Citadel art price index in the same direction. No significant difference was found between the house price index and the art price index, or between the art and government bond price indices. The art market is also found to be inefficient, thereby exacerbating the risk of investing in art. Overall, the South African art market does not offer the opportunity to diversify portfolios dominated by either property, bonds, or shares.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ba5760cf7d4c2be9823ee07c095ea6a",
  "timestamp": "2025-05-15T03:03:55.757669"
}