{
  "id": 2673,
  "title": "Corporate Financial Performance vs. Corporate Sustainability Performance, between Earnings Management and Process Improvement",
  "abstract": "The main objective of the paper is to assess the relationship between firms' financial resilience and firms' strategic sustainable development vulnerabilities, in the context of implications of the COVID-19 pandemic on firms' business environment. Background: The last decade has emphasized an increase in business models' uncertainty and risk exposure. The COVID-19 pandemic has highlighted the awareness in this direction, especially in a changing context, that looks more and more for corporate sector operations' orientation towards sustainable development. The question we would address in this paper is how the nexus between corporate sustainability performance and corporate financial resilience is affected by management decision through process improvements, product quality assurance, or managers' preference to improve corporate financials by earnings management practice instead, especially in the context of specific corporate financial risk management. Methods: The data are extracted from the Refinitiv database. The sample is limited to 275 European Union listed firms, selected based on data availability. The empirical analysis consists of an OLS multiple regression. For robustness purposes, a quantile regression model is estimated as well. Results: The approach considers implications of the pandemic on firms' business environment and earnings management accounting based policies and strategies as well. The result suggests that alignment to sustainability frameworks lead to the deterioration of firms' financial resilience. Similar results show the negative impact of firms' financial vulnerability (credit default risk) on firms' financial resilience. Instead, the risk of bankruptcy, firms' liquidity, or high product quality and business process improvement determine the positive impact on firms' financial resilience. Conclusions: The study highlights several insights both for management and policy makers. First, the results underline the relevance of management's choice for earnings management on ensuring firms' financial resilience, which ask for better corporate governance and high-quality and effective institutional regulatory and enforcement mechanisms. Second, the paper brings evidence on the impact of the COVID-19 pandemic on firms' financial sustainable development. Third, the study emphasizes the importance of the efforts of corporate process improvements and high-quality products on generating value-add, by looking on the relevance of those drivers on the level of corporate economic value-add, a measure that limits the impact of discretionary management accrual-based accounting choices on our discussion.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bb2f9569d4ce1c75c1becfdc1135d57",
  "timestamp": "2025-05-15T02:18:06.140959"
}