{
  "id": 2394,
  "title": "Forecasting financial signal for automated trading: An interpretable approach",
  "abstract": "Traders can now use online trading applications to increase their capital by benefiting from financial markets fluctuations. The foreign exchange (forex) market, the silver and gold exchange markets, and stock indices (e.g. S&P 500) are among the most famous financial markets. Traders must identify the correct trends in any given market and take appropriate actions to increase their earnings. High levels of knowledge and competency are required to conduct profitable transactions. Deep learning and data clustering were employed in this study to propose an interpretable automated financial market trading model. In the proposed method, feature vectors are first extracted from the market price index and the values of useful indicators (e.g., RSI and MA). Data labeling is then performed through clustering. After that, a dataset is created to train a deep learning model in order to identify and adopt the best action (buy, sell, or no action). In financial markets, prices may change drastically and disrupt the performance of learning models. Therefore, an autoencoder network was designed to identify drastic fluctuations (outliers) in the market and avoid trading at such cases. This could prevent a steep drawdown. Experiments were performed on different markets to compare the proposed approach with the state-of-the-arts. The results indicate higher profitability with respect to the trading risk in comparison with other methods.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bb7105f44770f6319ff97b522ca079c",
  "timestamp": "2025-05-15T02:14:50.323236"
}