{
  "id": 5307,
  "title": "Financial Innovation in Building Agricultural Sector Resilience: New Horizons and Challenges for Blended Finance in Poland",
  "abstract": "The main objective of this article is to assess the potential of financial innovations as a tool for strengthening the resilience of the agricultural sector in Poland, with particular emphasis on the role of mixed financing, and to identify factors influencing farmers' propensity to implement these innovations. Our attention is focused on mixed instruments represented by a combination of grants with loans or credit. This research is based on a critical literature study method, a logistic regression model, and a direct survey method using a structured questionnaire survey. The results show that the implementation of an innovative financial instrument combining a grant with a loan or credit has the potential for development. It is perceived by farmers as a reliable and attractive way of financing. The propensity to utilise this instrument has been demonstrated to increase significantly among farmers for whom agriculture is the main source of livelihood and who have previous experience with credit. The influence of farmers' perceptions of insurance as a risk management tool, as well as the age of farmers, is also a critical factor in this analysis. Less interest in this financing option is characteristic of farmers with traditional, extensive agricultural production. Our research identifies market trends, contributes new data, and provides an understanding of the impact of different factors on the propensity to use an instrument combining subsidies with a loan or credit, providing new insights into complex decision-making mechanisms in agriculture. The results of the research can be useful for policymakers and financial institutions to better tailor innovative financial product offerings to farmers' needs.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bbf9a7ad192dc559d311fe486671b9e",
  "timestamp": "2025-05-15T02:46:16.287197"
}