{
  "id": 6052,
  "title": "A Minimal Agent-Based Model Reproduces the Overall Topology of Interbank Networks",
  "abstract": "The description of the empirical structure of interbank networks constitutes an important field of study since network theory can be used as a powerful tool to assess the resilience of financial systems and their robustness against failures. On the other hand, the development of reliable models of interbank market structure is relevant as they can be used to analyze systemic risk in the absence of transaction data or to test statistical hypotheses regarding network properties. Based on a detailed data-driven analysis of bank positions (assets and liabilities) taken from the Bankscope database, we here develop a minimal, stochastic, agent-based network model that accounts for the basic topology of interbank networks reported in the literature. The main assumption of our model is that loans between banks attempt to compensate assets and liabilities at each time step, and the model renders networks comparable with those observed in empirical studies. In particular, our model is able to qualitatively reproduce degree distributions, the distribution of the number of transactions, the distribution of exposures, the correlations with nearest-neighbor out-degree, and the clustering coefficient. As our simple model captures the overall structure of empirical networks, it can thus be used as a null model for testing hypotheses relative to other specific properties of interbank networks.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bc80f637784eba79fcb037a7300fc71",
  "timestamp": "2025-05-15T02:54:03.508466"
}