{
  "id": 9164,
  "title": "Operational Currency Exposure and Firm Level Performance: Evidence from India",
  "abstract": "Purpose - To study the determinants and effects of Operational exchange rate exposure resulting from the mismatch between cost and revenues of the firms by using data on 500 Indian firms. Design/methodology/approach - We conduct detailed empirical analysis of the determinants of firm level exposure and their impact using panel regression techniques and conduct several robustness tests to confirm the validity of these results. Findings - Among other factors, exchange rate volatility appears as a significant determinant of average firm level exposure with the direction of relationship supporting the presence of Moral Hazard in firm's risk-taking behavior. Further large operational exposure is associated with significantly lower output growth, profitability, and capital expenditure during episodes of large currency depreciation at the firm level. Research limitations/implications - This paper leaves several questions to be answered. Further research is called for to explore the nature of distortions in the production process encouraged by exchange rate volatility and their impact on firm level productivity. Looking at the relationship between the use of financial and operational hedges is another fruitful area of future research. Practical implications - Our results have important implications for policy makers worried about mitigating the impact of exogenous shocks. Implicit and explicit guarantees with regards to the value of exchange rate tend to raise the vulnerability of the economy to exchange rate shocks at same time that they encourage capital expenditures and possibly output growth during normal times. Our findings indicate that the policy makers must take into account the incentive effects of their intervention in foreign exchange markets. Originality/value - Unlike the existing papers in the literature, we use a measure of operational currency exposure based on foreign currency revenues and costs of firms. In most of the existing papers the focus is on the mismatch between the currency denomination of assets and liabilities. Little attention has been paid to the currency mismatch between costs and revenues of the firms. Such operational mismatches are potentially equally important and deserve attention of policy makers and academics alike.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bd01b274ec61345288da23215de7435",
  "timestamp": "2025-05-15T03:26:25.874184"
}