{
  "id": 525,
  "title": "Bundled Payment vs. Fee-for-Service: Impact of Payment Scheme on Performance",
  "abstract": "Healthcare reimbursements in the United States have been traditionally based on a fee-for-service (FFS) scheme, providing incentives for high volume of care, rather than efficient care. The new healthcare legislation tests new payment models that remove such incentives, such as the bundled payment (BP) system. We consider a population of patients (beneficiaries). The provider may reject patients based on the patient's cost profile and selects the treatment intensity based on a risk-averse utility function. Treatment may result in success or failure, where failure means that unforeseen complications require further care. Our interest is in analyzing the effect of different payment schemes on outcomes such as the presence and extent of patient selection, the treatment intensity, the provider's utility and financial risk, and the total system payoff. Our results confirm that FFS provides incentives for excessive treatment intensity and results in suboptimal system payoff. We show that BP could lead to suboptimal patient selection and treatment levels that may be lower or higher than desirable for the system, with a high level of financial risk for the provider. We also find that the performance of BP is extremely sensitive to the bundled payment value and to the provider's risk aversion. The performance of both BP and FFS degrades when the provider becomes more risk averse. We design two payment systems, hybrid payment and stop-loss mechanisms, that alleviate the shortcomings of FFS and BP and may induce system optimum decisions in a complementary manner.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bd964d7101e43e56bb55f0587435619",
  "timestamp": "2025-05-15T01:39:38.169036"
}