{
  "id": 8308,
  "title": "Individual-level behavioural smoking cessation interventions tailored for disadvantaged socioeconomic position: a systematic review and meta-regression",
  "abstract": "Background Socioeconomic inequalities in smoking cessation have led to development of interventions that are specifically tailored for smokers from disadvantaged groups. We aimed to assess whether the effectiveness of interventions for disadvantaged groups is moderated by tailoring for socioeconomic position. Methods For this systematic review and meta-regression, we searched MEDLINE, PsycINFO, Embase, Cochrane Central Register, and Tobacco Addiction Register of Clinical Trials and the IC-SMOKE database from their inception until Aug 18, 2019, for randomised controlled trials of socioeconomic-position-tailored or non-socioeconomic-position-tailored individual-level behavioural interventions for smoking cessation at 6 months or longer of follow-up in disadvantaged groups. Studies measured socioeconomic position via income, eligibility for government financial assistance, occupation, and housing. Studies were excluded if they were delivered at the community or population level, did not report differential effects by socioeconomic position, did not report smoking cessation outcomes from 6 months or longer after the start of the intervention, were delivered at a group level, or provided pharmacotherapy with standard behavioural support compared with behavioural support alone. Individual patient-level data were extracted from published reports and from contacting study authors. Random-effects meta-analyses and mixed-effects meta-regression analyses were done to assess associations between tailoring of the intervention and effectiveness. Meta-analysis outcomes were summarised as risk ratios (RR). Certainty of evidence was assessed within each study using the Cochrane risk-of-bias tool version 2 and the grading of recommendations assessment, development, and evaluation approach. The study is registered with PROSPERO, CRD42018103008. Findings Of 2376 studies identified by our literature search, 348 full-text articles were retrieved and screened for eligibility. Of these, 42 studies (26 168 participants) were included in the systematic review. 30 (71%) of 42 studies were done in the USA, three (7%) were done in the UK, two (5%) each in the Netherlands and Australia, and one (2%) each in Switzerland, Sweden, Turkey, India, and China. 26 (62%) of 42 studies were trials of socioeconomic-position-tailored interventions and 16 (38%) were non-socioeconomic-position-tailored interventions. 17 (65%) of 26 socioeconomic-position-tailored interventions were in-person or telephone-delivered behavioural interventions, four (15%) were digital interventions, three (12%) involved financial incentives, and two (8%) were brief interventions. Individuals who participated in an intervention, irrespective of tailoring, were significantly more likely to quit smoking than were control participants (RR 1.56, 95% CI 1.39-1.75; I-2=54.5%). Socioeconomic-position-tailored interventions did not yield better outcomes compared with non-socioeconomic-position-tailored interventions for disadvantaged groups (adjusted RR 1.01, 95% CI 0.81-1.27; beta=0.011, SE=0.11; p=0.93). We observed similar effect sizes in separate meta-analyses of non-socioeconomic-position-tailored interventions using trial data from participants with high socioeconomic position (RR 2.00, 95% CI 1.36-2.93; I-2=82.7%) and participants with low socioeconomic position (1.94, 1.31-2.86; I-2=76.6%), although certainty of evidence from these studies was graded as low. Interpretation We found evidence that individual-level interventions can assist disadvantaged smokers with quitting, but there were no large moderating effects of tailoring for disadvantaged smokers. Improvements in tailored intervention development might be necessary to achieve equity-positive smoking cessation outcomes. Copyright (C) 2019 The Author(s). Published by Elsevier Ltd.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bdb01694c7bdd66b3624dd114a86650",
  "timestamp": "2025-05-15T03:17:21.600107"
}