{
  "id": 7969,
  "title": "Effects of policy and economic uncertainty on investment activities and corporate financial reporting: a study of developing countries in Asia-Pacific",
  "abstract": "PurposeThis study investigates the impact of government and economic policy uncertainty (EPU) on companies' business operations, especially risk-taking tendencies and corporate financial reporting quality (FRQ).Design/methodology/approachThe study employs the generalised least squares regression model. The final sample comprised 27,376 company-year observations from eight countries in the Asia-Pacific region.FindingsEPU has a negative and significant effect on investment activity and FRQ. Higher EPU leads to a decline in investment and FRQ.Research limitations/implicationsThere are several limitations in this study. First, the authors used abnormal investments to measure investments, without considering the degree of irreversibility investment objectives. Second, although control variables are included at the company and country levels, they may only partially control for companies' mitigation effects. Third, the sample is limited to developing countries with unique characteristics in Asia-Pacific; therefore, the findings cannot be generalised.Practical implicationsThe findings can help investors, analysts and regulators evaluate EPU's impact on companies' business activities by offering an overview regarding the decline in investment efficiency and FRQ. The results can also be used as input for regulators in formulating policies that encourage companies to regulate investment levels without harming other stakeholders and maintain FRQ during periods of uncertainty.Originality/valueThis research provides intriguing insights into EPU's effects on companies' investment activity and FRQ in developing countries, which are sensitive to changes in macroeconomic conditions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bdf8064cecc02abb87d1d5e39f311d7",
  "timestamp": "2025-05-15T03:14:07.158239"
}