{
  "id": 4102,
  "title": "The Effect of Loan Portfolio Concentration Level on Financial Stability and Performance: A Comparatıve Analysis in Dual Banking System",
  "abstract": "In this study, the effect of loan portfolio concentration on financial stability and performance was investigated in both conventional and Islamic banking systems. In the study examining the period of 2005-January and 2021-December, the long and short-term effects of credit portfolio concentration on financial stability and performance in the bilateral banking system were analyzed by cointegration tests. According to the empirical results, in which ARDL method for the conventional banking system and fully modified ordinary least squares (FMOLS), dynamic ordinary least squares (DOLS) and canonical cointegrating regression (CCR) methods for the Islamic banking system were used, it has been found that the diversification of the loan portfolio reduces the bankruptcy risk in the conventional banking system in the long run and it has both positive and negative lagged effects in the short run. In the Islamic banking system, while there is no relationship between this diversification and financial stability in the long run, it has been concluded that it increases the risk of bankruptcy in the short run. When evaluated in terms of banking performance, it is seen that loan portfolio diversification does not cause a serious effect in the long or short term and does not cause differentiation within the bilateral banking system",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0be58d2157d75fa628633879b01ab54f",
  "timestamp": "2025-05-15T02:33:03.540373"
}