{
  "id": 2122,
  "title": "An approach for discovering firm-specific technology opportunities: Application of link prediction to F-term networks",
  "abstract": "Technology opportunity discovery (TOD) based on firm's technology portfolio is categorized into text miningbased and patent classification-based approaches. Despite their apparent benefits, the former has reproducibility issues due to the experts' subjectivity, whereas the latter lacks consideration of technical attributes that constitute individual technologies. The F-term, a multi-dimensional subject indexing system, provides patent classification codes representing technical attributes and structures that vary according to subject technology. The present study proposes a TOD model employing a link prediction analysis of F-terms. The proposed model based on F-terms comprises four steps: 1) constructing a universal F-term network using F-term co-occurrences; 2) generating a firm-centered F-term network highlighting a target firm's technology portfolio; 3) applying a proposed link prediction index to identify opportunity F-terms; and 4) assessing these opportunities in terms of technical attributes using a visual map with technology impact and heterogeneity indices. A case study is conducted on a Japanese firm to demonstrate the function and validity of this model, which aims to assist firms to identify technology opportunities with high practicality considering both their technology portfolios and the entire technology ecology. Moreover, this study represents a contribution to an early attempt to apply large-scale F-terms to the quantitative TOD.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0befcbddcf19033c3ac8f5849d04a56a",
  "timestamp": "2025-05-15T01:03:03.771733"
}