{
  "id": 1992,
  "title": "Study on the country risk rating with distributed crawling system",
  "abstract": "This paper built a system containing the Distributed Crawling Module, the Database Module and the Analysis Module to collect a large number of objective data, clean the data and realize the business intelligence representation. The distributed crawling system includes the Distributed Crawling Module building from Hadoop, the Database Module by SQL Server and the Analysis Module by the SAS system. The first two modules support a distributed way to collect and convert non-structural data into structural data for the last module processing. Then, this paper extends research fields from theory to application about B&R, constructs rating system from the perspective of political risk, economic risk, financial risk, business environment risk and legal risk, establishes a 140 rating index, collects 46,200 sample data, and adopts Model of Principal Components Analysis, Analytic Hierarchy Process and Efficacy Function to access the Belt & Road Initiative 66 countries for 5 consecutive years of export credit insurance in the country risk rating. This paper also gives a detail explanation on 2015 rating results, showing that, Singapore wins the highest credit rating among the country; the credit rating of Latvia, Estonia, Slovakia, Turkey, Malaysia, Russia, Thailand and other countries is very high; Afghanistan, Ukraine, Laos, Iran, Arabia, Republic of Syria, Iraq, Burma, Republic of Yemen, East Timor and other countries with poor credit ratings. The conclusion is consistent with the domestic and overseas well-known rating agencies.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bfb122afaf311bd21457e9996d2a6fc",
  "timestamp": "2025-05-15T02:09:48.399950"
}