{
  "id": 6426,
  "title": "Epidemiology of burns in a humanitarian setting: A national study among refugees in Lebanon",
  "abstract": "Introduction: Burns represent one of the leading causes of morbidity worldwide and disproportionately impact women, children, and socioeconomically disadvantaged individuals. Syrian refugees who fled conflict to land in overcrowded informal settlements across Lebanon are a particularly vulnerable population. This study aims to assess the etiology and risk factors for burns in this population. Methods: This cross-sectional, cluster-based population study adopted the Surgeons Overseas Assessment of Surgical Need (SOSAS) version 3.0 to capture data from refugees residing in informal settlements in multiple regions across Lebanon. The tool was contextualized and used to collect detailed information on burn cases sustained by refugees during the last 12 months prior to data collection. Univariate logistic regression models were performed to assess the relationship between burns and associated risk factors. Results: From the 1468 households surveyed, a total of 223 households experienced a burn in the last 12 months. Over 63% of burns occurred in children under the age of ten years and almost 57% of burns occurred in females. More than 70% of burns resulted from hot liquid, while 17% were caused by direct heat contact. Over 3/4ths of burns occurred while preparing food (77.4%). Approximately 32% of those burned did not seek healthcare, of which almost 85% noted the cause was mainly due to financial limitations. Conclusion: Burns are a common injury in the Syrian refugee population living in Lebanon. Children and women are particularly impacted, often during cooking. Multi-level interventions are necessary to reduce burn injuries and improve care for those affected by burns. Community kitchens can be used to separate cooking and living environments and get stoves and hot liquids off the floor. Importantly, policies should allow for refugees to receive medical care when necessary without a major financial burden. (c) 2024 Elsevier Ltd and ISBI. All rights reserved.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bfd3037d76be5157ccead87f928fa7d",
  "timestamp": "2025-05-15T02:58:05.595653"
}