{
  "id": 7133,
  "title": "GamTest: Psychometric Evaluation in a Low-Gambling General Population",
  "abstract": "Instruments that investigate different aspects of gambling activities are needed to distinguish negative consequences. Because gambling is a complex activity that occurs both offline and online, different questionnaires are necessary for screening and risk classification. GamTest, an instrument used by several gambling companies, was designed to cover different aspects of gambling: money and time spent, as well as social, financial, and emotional consequences. This study explores GamTest's psychometric properties in a general population. A total of 2,234 Swedish respondents completed an online survey containing demographic questions, the questionnaire (GamTest), and the Problem Gambling Severity Index (PGSI). A confirmatory factor analysis was performed and GamTest's reliability and validity tested. The confirmatory factor analysis yielded an inclusive fit. The internal consistency (omega) for the five factors was high (.79-.91), indicating good reliability, and a high positive correlation with the PGSI supported the validity of the GamTest. The inclusive fit of the confirmatory factor analysis can be explained by the low endorsement of negative consequences of gambling in the sample. However, GamTest seems to have good reliability and validity. The utility of GamTest is discussed in relation to its psychometric properties and its use in the responsible gambling tool Playscan.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0bfeab01a02b70e6063c2ddd851bbba5",
  "timestamp": "2025-05-15T03:05:32.033623"
}