{
  "id": 3315,
  "title": "Towards the achievement of universal health coverage in the Democratic Republic of Congo: does the Country walk its talk?",
  "abstract": "In 2009, the Democratic Republic of Congo (DRC) started its journey towards achieving Universal Health Coverage (UHC). This study examines the evolution of financial risk protection and health outcomes indicators in the context of the commitment of DRC to UHC. To measure the effects of such a commitment on financial risk protection and health outcomes indicators, we analyse whether changes have occurred over the last two decades and, if applicable, when these changes happened. Using five variables as indicators for the measurement of the financial risk protection component, there as well retained three indicators to measure health outcomes. To identify time-related effects, we applied the parametric approach of breakpoint regression to detect whether the UHC journey has brought change and when exactly the change has occurred. Although there is a slight improvement in the financial risk protection indicators, we found that the adopted strategies have fostered access to healthcare for the wealthiest quantile of the population while neglecting the majority of the poorest. The government did not thrive persistently over the past decade to meet its commitment to allocate adequate funds to health expenditures. In addition, the support from donors appears to be unstable, unpredictable and unsustainable. We found a slight improvement in health outcomes attributable to direct investment in building health centres by the private sector and international organizations. Overall, our findings reveal that the prevention of catastrophic health expenditure is still not sufficiently prioritized by the country, and mostly for the majority of the poorest. Therefore, our work suggests that DRC's UHC journey has slightly contributed to improve the financial risk protection and health outcomes indicators but much effort should be undertaken.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c1dc9f17a5251b211491582d1df9196",
  "timestamp": "2025-05-15T02:25:13.617496"
}