{
  "id": 7406,
  "title": "Care Needs of Community-Dwelling Older Adults Living in Poverty and Their Relationship With Other Biopsychosocial Variables: A Cross-Sectional Study",
  "abstract": "AimTo assess the care needs of older adults living in poverty in a high-income country and to analyse their relationship with other outcome variables.DesignA cross-sectional study.MethodData were collected between September 2022 and February 2024 from 384 older adults in southeastern Spain. Descriptive statistics were calculated to assess older adults' care needs. A multiple linear regression analysis was carried out to determine the percentage by which the socio-demographic or outcome variables could explain the number of met care needs among older adults in poverty.ResultsAround 20% of the care needs amongst older adults living in poverty were unmet. The most frequently unmet care need was related to money (53.6%). Almost 30% of participants were at risk of malnutrition, 18% felt lonely, and 80% perceived a low level of social support. Age, history of falls, emergency room visits, functionality, perceived social support, quality of life and nutritional status significantly predicted the number of needs met.ConclusionThe health conditions of older adults living in poverty are suboptimal and may negatively influence their care needs. Nurses should consider these factors when designing, implementing and evaluating interventions to promote the biopsychosocial health of this population.Implications for the Profession and/or Patient CareNursing interventions to promote health amongst older adults living in poverty should focus on identifying unmet care needs, particularly those related to financial and social support. Interventions should prioritise improving nutritional status, enhancing social support networks and addressing loneliness.ImpactLiving in poverty increases older adults' vulnerability due to unmet financial, nutritional and social support needs. These unmet needs can negatively affect older adults' physical and mental health.Reporting MethodThe study has been reported following the STROBE guidelines.Patient or Public ContributionThe study's participants only participated in the data collection process.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c2441924b72d1dc8ee74f9d0436b7e7",
  "timestamp": "2025-05-15T03:08:00.893427"
}