{
  "id": 6370,
  "title": "Predictors of oral chemotherapy adherence at home among Chinese cancer patients: An observational prospective study",
  "abstract": "Aims and Objectives To explore whether medication non-adherence experience, readiness for hospital discharge, financial toxicity and symptoms predicted oral chemotherapy adherence at home for Chinese cancer patients. Background Oral chemotherapy adherence is critical to determine the treatment efficacy among cancer patients. Identifying predictors before discharge from hospital based on transition theory could assist healthcare providers to improve oral chemotherapy adherence at home. Design An observational prospective study. Methods Between October 2018 and December 2019, self-reported questionnaires were used to collect data among 151 cancer patients with oral chemotherapy at home. At discharge, baseline data of patient-perceived readiness for hospital discharge, financial toxicity and non-adherence experience were collected, while symptoms and adherence of oral chemotherapy at home were collected after finishing one cycle of oral chemotherapy at home (21 days, the first 14 days received oral chemotherapy). Regression analyses were performed for the predictors' explorations. The STROBE guidelines were followed. Results Among 151 participants with oral chemotherapy at home, 30.46% of patients reported medication non-adherence experience at discharge and 82.12% of patients reported adherence to oral chemotherapy at home. Patients with non-adherence experience at discharge were 5.4 times more likely to being non-adhered to oral chemotherapy at home. Numbness were the most frequent and severe symptoms during at home, patients with numbness were 6.6 times more likely to being non-adhered to oral chemotherapy. Although patients reported high level of readiness for discharge and financial toxicity at discharge, which did not predicted oral chemotherapy adherence at home. Conclusions Patients with medication non-adherence experience at discharge and symptom of numbness from oral chemotherapy suggested a higher risk of oral chemotherapy non-adherence at home. Relevance to clinical practice Preventive interventions should focus on patients with previous medication non-adherence experience at discharge and experiencing numbness to promote oral chemotherapy adherence.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c3346a9a7aec3c0dbae8abc6aa2aa22",
  "timestamp": "2025-05-15T02:57:38.688690"
}