{
  "id": 7695,
  "title": "Determinants of the Most Significant Characteristics of Reproductive Health",
  "abstract": "Introduction Reproductive health of women is determined by females' demographic and socio-economic characteristics, their behaviour, and the complex of environmental factors. Objective The paper examines the predictive impact of personal and environmental characteristics, health and healthcare characteristics regarding the most important aspects of reproductive health. Methods From a sample of 2,718 women, aged 20-49 years, we collected information on various characteristics using a structured questionnaire. Based on factorial analysis (principal components method, Kaisser Varimax criterion) we selected representative variables (factors), describing personal (demographic and socio-economic) characteristics of women, their environment (family, household, community), health (attitudes towards health, life-style, health status), healthcare (independent) and the characteristics of reproductive health (dependent variables). The predictors were analyzed by multiple regression and correlation. Results Sexual behaviour was determined by socio-economic status, personal tidiness, rest, presence of risk factor(s), health evaluation and attitude toward personal responsibility, trust in physicians etc. The predictors of contraception involved satisfaction with one's own health, serious health problems, health evaluation. The presence and number of abortions were determined by personal psychological maturity, rest, risk factors, life-style, health evaluation and its manifestations, and the continuity and timely healthcare. The predictors of adequate protection of reproductive health involved the cultural level of the community, financial standing of the household, satisfaction with one's own life, tidiness and rest, presence of risk factors, health evaluation, attitude towards personal responsibility, and trust in physicians. HIV control was determined by satisfaction with one's own life, physical activity of women, presence of serious health problems, and the content of primary healthcare. Postpartal protection was determined by the cultural level of the community, reasons for dissatisfaction with one's own life, presence of risk factors and deficiencies, and timely contraception. The predictors of reproductive period duration are availability of health care in a community and personal tidiness of women. Conclusion The study confirmed predictive impact of most of the studied characteristics.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c3701e461f84a84ab6615c288102ef8",
  "timestamp": "2025-05-15T03:11:04.591962"
}