{
  "id": 8355,
  "title": "Focused screening for occult carotid artery disease: Patients with known heart disease are at high risk",
  "abstract": "Objectives: Stroke puts a major financial burden on our healthcare system. However, carotid duplex scanning performed as a screening test for occult carotid artery stenosis (CAS) currently is not reimbursed by Medicare. The goals of this study were to develop a cost-effective stroke screening program, to determine the prevalence of potential causes of stroke in this population, and to define a population at high risk in which screening would be most effective. Methods: In a community-based stroke screening program, patients were eligible if they were older than 60 years and had a history of either hypertension, heart disease, or cigarette smoking, or a family history of stroke. Screening included blood pressure determination, an electrocardiographic rhythm strip, and a previously validated modified carotid duplex ultrasound examination to detect CAS 50% or greater. The relationships between standard demographic risk factors and screening outcomes were analyzed. Results: Screening was performed in 610 patients. Unilateral or bilateral CAS was detected in 66 patients (10.8%). The finding of occult CAS was more prevalent than that of new hypertension (2.6%) or new atrial fibrillation (0.5%). Patients with known hypertension were significantly more likely to, have CAS than were those without hypertension (12.7% vs 7.8%; P = .05). Patients with heart disease were significantly more likely to have CAS than were those without heart disease (18.2% vs 8%; P < .0001). Patients with both risk factors were significantly more likely to have occult carotid artery disease than were patients without either risk factor (22.1% vs 8.5%; P < .0001). Multivariate analysis with logistic regression revealed a history of heart disease as an independent predictor of occult carotid artery disease (odds ratio 95% confidence interval, 1.4-4.4). Type of heart disease was not a significant factor in predicting occult CAS. Direct cost of the screening, including community outreach, nurses, technicians, support staff, and miscellaneous expenses, was less than $75 per patient. Conclusions: In a screening program for treatable causes of potential stroke, CAS was the most commonly diagnosed disease. More than one of every five patients with known hypertension and heart disease had occult CAS. Known heart disease of any type was a significant independent predictor of occult CAS. Screening for treatable causes of potential stroke can be cost-effective. This information could help to further target populations to screen for occult CAS and to justify reimbursement for screening carotid duplex scanning examinations.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c6d6aa8b003974f99b34dc77f3fca1f",
  "timestamp": "2025-05-15T03:17:49.197524"
}