{
  "id": 9313,
  "title": "Assessing the household economic burden of non-communicable diseases in India: evidence from repeated cross-sectional surveys",
  "abstract": "Background Financing for NCDs is encumbered by out-of-pocket expenditure (OOPE) assuming catastrophic proportions. Therefore, it is imperative to investigate the extent of catastrophic health expenditure (CHE) on NCDs, which are burgeoning in India. Thus, our paper aims to examine the extent of CHE and impoverishment in India, in conjunction with socio-economic determinants impacting the CHE. Methods We used cross-sectional data from nationwide healthcare surveys conducted in 2014 and 2017-18. OOPE on both outpatient and inpatient treatment was coalesced to estimate CHE on NCDs. Incidence of CHE was defined as proportion of households with OOPE exceeding 10% of household expenditure. Intensity of catastrophe was ascertained by the measure of Overshoot and Mean Positive Overshoot Indices. Further, impoverishing effects of OOPE were assessed by computing Poverty Headcount Ratio and Poverty Gap Index using India's official poverty line. Concomitantly, we estimated the inequality in incidence and intensity of catastrophic payments using Concentration Indices. Additionally, we delineated the factors associated with catastrophic expenditure using Multinomial Logistic Regression. Results Results indicated enormous incidence of CHE with around two-third households with NCDs facing CHE. Incidence of CHE was concentrated amongst poor that further extended from 2014(CI = - 0.027) to 2017-18(CI = - 0.065). Intensity of CHE was colossal as households spent 42.8 and 34.9% beyond threshold in 2014 and 2017-18 respectively with poor enduring greater overshoot vis-a-vis rich (CI = - 0.18 in 2014 and CI = - 0.23 in 2017-18). Significant immiserating impact of NCDs was unraveled as one-twelfth in 2014 and one-eighth households in 2017-18 with NCD burden were pushed to poverty with poverty deepening effect to the magnitude of 27.7 and 30.1% among those already below poverty on account of NCDs in 2014 and 2017-18 respectively. Further, large inter-state heterogeneities in extent of CHE and impoverishment were found and multivariate analysis indicated absence of insurance cover, visiting private providers, residing in rural areas and belonging to poorest expenditure quintile were associated with increased likelihood of incurring CHE. Conclusion Substantial proportion of households face CHE and subsequent impoverishment due to NCD related expenses. Concerted efforts are required to augment the financial risk protection to the households, especially in regions with higher burden of NCDs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c8fc88825c76ca899441a366440f45f",
  "timestamp": "2025-05-15T03:27:53.285559"
}