{
  "id": 8110,
  "title": "Unscheduled revisits to a pediatric emergency department - Risk factors for children with fever or infection-related complaints",
  "abstract": "Objective: Unscheduled revisits (URVs) may serve as markers of quality of care and may be costly both in financial terms as well as in limitations they place on primary care. We performed this study to examine the association between characteristics easily obtainable during an emergency department (ED) visit and URV to identify a subpopulation of children who may warrant interventions to decrease URV. Methods: This is a case-control study of patients visiting an urban tertiary care pediatric ED for a fever or infectious disease-related complaint. Cases were defined as patients who had URVs that occurred within 72 hours of an initial ED visit. Control patients were selected by simple random sampling of an enumerated computerized list of all ED visits. Data on independent variables of interest were collected from a chart review and telephone interview with the patient's caregiver. Bivariate and multivariate analyses were performed to determine factors associated with URV. Results: Seventy-five percent of cases and controls participated in the study. Logistic regression analysis revealed 3 factors independently associated with URV for fever or infectious disease-related complaints in children. These included presence of chronic disease (adjusted odds ratio 1.75, 95% confidence interval 1.01-3.03), Medicaid insurance (adjusted odds ratio 1.86, 95% confidence interval 1.04-3.32) and acute triage category (adjusted odds ratio 1.83, 95% confidence interval 1.08-3.10). Conclusions: These factors may be used to identify children in the ED at greater risk for URV and may point to a need for improved discharge instructions and enhanced communication with primary care and systems to arrange follow-up. Results of this work may also identify at-risk populations for future qualitative research or intervention studies on URV to EDs.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c90f80e9cd021d58e003a514b4cddeb",
  "timestamp": "2025-05-15T03:15:09.461486"
}