{
  "id": 7636,
  "title": "Material hardship among custodial grandparents in COVID-19 and its associations with Grandchildren's physical and mental health: A latent class analysis",
  "abstract": "COVID-19 has increased economic hardship for many families, including custodial grandparent-headed families. We aim to examine latent classes of material hardship among custodial grandparent-headed families, to assess predictors associated with identified classes, and to investigate associations with grandchildren's physical and mental health outcomes during COVID-19. A cross-sectional survey was administered via Qualtrics Panels in June 2020. The sample comprised of 362 grandparents. Latent class analysis and multinomial and binary logistic regression were conducted. Three latent classes of material hardship were identified: Class 1 low overall hardship with high medical hardship, class 2 moderate overall hardship with high utility hardship, and class 3 severe overall hardship. Factors, including race, household income, labor force status, years of care, and financial assistance status, were associated with class membership. Class 2 was significantly associated with grand-children's physical health. Our findings suggest that material hardship is heterogeneous among custodial grandparents during COVID-19, and children in households experiencing utility hardship have a higher risk for poorer physical health outcomes. Results highlight the need to meet grandparents' material needs and call for future research to examine possible mechanisms that explain the link between material hardship and grand-children's outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c9041ab18ee5e7153d25c4785a4954b",
  "timestamp": "2025-05-15T03:10:33.027767"
}