{
  "id": 3355,
  "title": "Bull, Bear, or Rat Markets: Rat Stock Market Task Reveals Human-Like Behavioral Biases",
  "abstract": "Investors often exhibit behavioral biases (e.g., loss aversion) that are putatively under-pinned by mechanisms supporting reinforcement learning in the brain, which are largely evolutionarily conserved across mammalian species. Although previous research has demonstrated that rats, similar to humans, exhibit behavioral economic biases in certain contexts, asset market contingencies have gone largely unexplored. Thus, we developed an experimental stock market' task in which cohorts of 4 rats drove asset prices up and down by selecting and subsequently buying, selling, or holding stocks to earn sweet liquid reward. Profits and losses were operationalized as reward volumes larger than and smaller than a reference volume of reward, respectively. Following a loss, rats moved more slowly to collect the reward and spent less time licking at the reward spigot, indicative of lower motivation to approach and savor a loss reward. Rats also tended to respond suboptimally following a loss, which corresponded to an increase in risk-seeking behavior characterized by a bias against the optimal hold option in that context. Rats' choice of the sell option demonstrated a robust tendency toward realizing gains more quickly than losses, which is characteristic of the disposition effect in human stock markets. Our results indicate that rats exhibit behavioral biases similar to human investors, emphasizing the suitability of the rat stock market model to future work into the behavioral neuroscience of suboptimal financial decision-making.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c99d85760d91b6245ae6f5fbd334383",
  "timestamp": "2025-05-15T02:25:13.778016"
}