{
  "id": 440,
  "title": "A Novel Hybrid Model for Credit Risk Assessment of Supply Chain Finance Based on Topological Data Analysis and Graph Neural Network",
  "abstract": "Supply Chain Finance (SCF) in the energy sector has emerged as a critical area of focus due to the need for sustainable and efficient financial solutions to manage the complex interactions between various stakeholders, including suppliers, financial institutions, and energy companies. This study proposes a novel hybrid Topological Data Analysis (TDA) and Graph Neural Network (GNN) to optimize credit risk assessment in SCF. By leveraging BallMapper (BM) topological data analysis model and network-based features, the proposed model provides deeper insights into credit risk factors, enhancing the accuracy and dependability of credit risk evaluation for SMEs. Results demonstrate that the proposed BallMapper- Graph Neural Network (BM-GNN) model achieves higher accuracy and F1-scores, outperforming traditional machine learning approaches. Notably, incorporating network-based features alongside financial ratios yields the most favorable results in credit risk assessment. The SHapley Additive exPlanations (SHAP) model highlights the pivotal role of certain features in predicting bankruptcy, offering valuable insights for risk mitigation strategies. These results contribute to the growing body of evidence supporting the efficacy of TDA and GNN in financial applications, particularly in credit risk evaluation for SMEs in supply chain finance. Using network-based models opens up new avenues for improving accuracy and reliability in risk assessment, ultimately empowering financial institutions and stakeholders to make more informed decisions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0c9bc987ce565a802b6aa9bd64e14cd1",
  "timestamp": "2025-05-15T01:50:52.657623"
}