{
  "id": 4288,
  "title": "HR technology goal realization: predictors and consequences",
  "abstract": "Purpose Drawing on the HR technology (HRT) and information systems (IS) literatures, this study seeks to identify macro-level factors that influence the performance of HRT systems. A second objective is to assess the relative contribution that HRT goal realization makes to organizational satisfaction with HR services. Design/methodology/approach This investigation draws on a web-based survey of 169 US and Canadian firms targeting HR executives as key informants. Structural equation modeling (SEM) tested the roles that organizational support, capabilities and aspects of the environment play in technology goal attainment and collective satisfaction with HR services. Exploratory factor analysis (EFA) evaluated the properties of several key scales and supported their usage. Moderated regression analysis further assessed whether HRT age influenced certain relationships. Findings As predicted, system goal realization was positively related to the level of support from an HRT champion and an HR innovation climate, while being negatively related to HRT mimetic isomorphism. HR service satisfaction, in turn, was positively related to HRT goal realization, the HR innovation climate and HR environmental munificence. It also was determined that HRT champions had a stronger positive impact on goal realization for younger technology portfolios. This too was expected. Research limitations/implications External validity would be strengthened by not only increasing sample sizes for the USA and Canada, but also targeting more nations for data collection. The model's explanatory power may also be enhanced by improving the measurement of several predictors (e.g. top management support, absorptive capacity), as well incorporating constructs that focus on users (e.g. group potency, collective efficacy). Practical implications These findings underscore the need to proactively screen and structure the surrounding environment to facilitate portfolio success. Greater emphasis must be placed on (1) identifying and empowering HRT champions, (2) fostering an innovation climate in the HR function and (3) conditioning HRT purchases on mindful adoption. Doing so should not only increase the prospects of realizing goals, but also elevate satisfaction with HR services. Originality/value This is the first study to formally assess the effects that organizational and environmental context have on overall HRT systems performance. Prior research has focused on linking the local conditions of individual users to their perceptions and usage of HR technologies.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0cb61ae9ad7a6dcd82b14ae2c8e2c8f1",
  "timestamp": "2025-05-15T01:25:23.430344"
}