{
  "id": 5759,
  "title": "Competition, performance and financial stability in US agricultural banking",
  "abstract": "Purpose The number of US commercial banks has declined by about 50% over the last two decades. This change could lead to a potential decline in competition and a potential increase in market power in the agricultural banking market. The focus of this study is to examine whether the risk of failure and the performance of agricultural banks has been affected by bank consolidations. Design/methodology/approach The impact of bank competition on performance and financial stability of agricultural banks is studied using a Lerner index as a measure of market power. A Z-score is constructed to measure bank stability. Similarly, the return on assets (net income to total assets ratio), return on equity (net income to the total equity ratio), agricultural loan ratio and agricultural loan volume are used as performance measures for agricultural banks. Two-way fixed effect regression models are estimated to measure the impact of competition on financial stability and performance. Findings Results indicate that bank competition has a U-shaped effect on the probability of default and an inverted U-shaped effect on volume and proportion of agricultural lending. There also exists evidence of a positive but non-linear effect of bank market power on the profitability of agricultural banks. Originality/value There is limited literature on the impact of bank competition on financial stability and performance of US agricultural banks. Agricultural banks hold more than 40% of US farm debt. A decrease in the number of banks or the level of competition in agricultural banking may cause an adverse effect on relationship lending. The key findings imply that bank regulatory strategies should focus on enhancing (reducing) competition in more (less) concentrated banking markets to improve the financial health and performance of agricultural banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0cc3a8182e7bbefa7c90ccf9a9dd039c",
  "timestamp": "2025-05-15T02:50:54.023990"
}