{
  "id": 3413,
  "title": "Tail dependence and indicators of systemic risk for large US depositories",
  "abstract": "In this study, we investigate the extreme loss tail dependence between stock returns of large US depository institutions. We find that stock returns exhibit strong loss dependence even in their limiting joint extremes. Motivated by this result, we derive extremal dependence-based systemic risk indicators. The proposed systemic risk indicators reflect downturns in the US financial industry very well. We also develop a set of firm-level average extremal dependence measures. We show that these firm-level measures could have been used to identify the firms that were more vulnerable to the 2007-2008 financial crisis. Additionally, we explore the performance of selected systemic risk indicators in predicting the crisis performance of large US depository institutions and find that the average stock return correlations are also good predictors of crisis period returns. Finally, we identify factors predictive of extremal dependence for the US depository institutions in a panel regression setting. Strength of extremal dependence increases with asset size and similarity of financial fundamentals. On the other hand, strength of extremal dependence decreases with capitalization, liquidity, funding stability and asset quality. We believe the proposed indicators have the potential to inform the prudential supervision of systemic risk. Published by Elsevier B.V.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0cd134b31d946dc55ca3a72201274d69",
  "timestamp": "2025-05-15T02:26:09.110928"
}