{
  "id": 3591,
  "title": "Carbon emission effect of energy transition and globalization: inference from the low-, lower middle-, upper middle-, and high-income economies",
  "abstract": "The importance of income to environmental sustainability especially in the perspective of economic development has been rigorously examined in recent times. To further deepened the income-environmental sustainability narrative, the current study explore the cases of income-classified countries vis-a-vis the high-income, low-income, lower middle-income, and the upper middle-income countries and territories. As such, the current study examined the impact of renewable energy and fossil fuel energy consumption and globalization on CO(2)emissions over the period of 1970 to 2014 for the case of (1) the panel of income-classified countries and territories and (2) the time series of each of the income-classification. By employing the Pooled Mean Group of the Autoregressive Distributed Lag (ARDL) approach, the study found that fossil fuel consumption in the panel of examined income classification aggravates environmental hazards in both the short-long run, while the share of renewable energy usage improves the environmental quality only in the short run. Like the renewable energy consumption, globalization exacts negative and positive impacts in the short run and long run, respectively. From the second (time series) approach, the study found that fossil fuel energy worsen the environment in each of the fours income-categorized economies. Similarly, renewable energy usage exerts a significant and desirable impact on the environment in all but one (lower middle income) of the four income-categorized economies. However, globalization observably plays a significant and desirable role only in the lower middle-income economies. Hence, the study posits policy guide in the context of increased diversification of energy portfolio for each of the four income-categorized countries and territories especially the lower middle-income economies.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0cd18fd45dd7d4f96f468279309483d5",
  "timestamp": "2025-05-15T01:19:00.604786"
}