{
  "id": 7821,
  "title": "The impact of corporate governance and firm-specific characteristics on dividend policy: an emerging market case",
  "abstract": "Purpose The present study aims to investigate the impact of corporate governance proxies by ownership structure and firm-specific characteristics, i.e. firm size, leverage, growth opportunities, previous year dividend, firm risk, profitability, and liquidity on dividend behavior of the Pakistan Stock Exchange (PSX) listed firms. Design/methodology/approach Final sample of the study consists of 140 PSX-listed firms. The study covers a period of six years, starting from 2015 to 2020. Dividend payout dummy, dividend payout ratio, and dividend yield were used to assess the dividend behavior of the sample firms. The appropriate regression procedures (logistic, probit, ordinary least square (OLS), and fixed effect regression) are used to test the study hypothesis. To check the robustness of the result, a system GMM estimation technique is also used in the present study. Findings The study reveals that institutional ownership, foreign ownership, and individual ownership have a significant positive whereas managerial ownership has a significant negative impact on the dividend decision of sample firms. Among firm-specific characteristics, it was found that liquidity, profitability, and the previous year's dividend were significantly positive, while growth opportunities were significantly inversely associated with dividend payout decisions of PSX-listed firms. Practical implications This study sheds light on the relationship between dividend policy, ownership structure, and firm-specific factors in the context of an emerging market like Pakistan. The study's findings have important implications for managers, minority shareholders, lawmakers, and investors looking for guidance on the dividend policy of publicly-traded non-financial firms. Originality/value The literature lacks studies that together analyze the ownership characteristics and firm-specific variables on dividend decisions, particularly in the context of developing economies. The current study aims to fill this gap.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ce548b8aebbcbee159879d87b501ff0",
  "timestamp": "2025-05-15T03:12:36.401003"
}