{
  "id": 1072,
  "title": "A hybrid model for stock market forecasting and portfolio selection based on ARX, grey system and RS theories",
  "abstract": "In this study, the moving average autoregressive exogenous (ARX) prediction model is combined with grey systems theory and rough set (RS) theory to create an automatic stock market forecasting and portfolio selection mechanism. In the proposed approach, financial data are collected automatically every quarter and are input to an ARX prediction model to forecast the future trends of the collected data over the next quarter or half-year period. The forecast data is then reduced using a GM(1,N) model, clustered using a K-means clustering algorithm and then supplied to a RS classification module which selects appropriate investment stocks by applying a set of decision-making rules. Finally, a grey relational analysis technique is employed to specify an appropriate weighting of the selected stocks such that the portfolio's rate of return is maximized. The validity of the proposed approach is demonstrated using electronic stock data extracted from the financial database maintained by the Taiwan Economic journal (TEJ). The predictive ability and portfolio results obtained using the proposed hybrid model are compared with those of a GM(1,1) prediction method. It is found that the hybrid method not only has a greater forecasting accuracy than the GM(1,1) method, but also yields a greater rate of return on the selected stocks. (C) 2008 Elsevier Ltd. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0cf1f3164029aaea6505218e5a35f555",
  "timestamp": "2025-05-15T00:51:25.944906"
}