{
  "id": 6831,
  "title": "Neutrophil Extracellular Traps (NETs) Are Associated with Type 2 Diabetes and Diabetic Foot Ulcer Related Amputation: A Prospective Cohort Study",
  "abstract": "Introduction: The prevalence of diabetes mellitus and its sequelae has been on the rise, and diabetic foot ulcer (DFU) is the leading cause of non-traumatic lower limb amputation globally. The rising occurrence and financial burden associated with DFU necessitate improved clinical assessment and treatment. Diabetes has been found to enhance the formation of neutrophil extracellular traps (NETs) by neutrophils, and excessive NETs have been implicated in tissue damage and impaired wound healing. However, there is as yet insufficient evidence to clarify the value of NETs in assessing and predicting outcomes of DFU. Methods: We designed this prospective study with three cohorts formed from type 2 diabetes mellitus (T2DM) patients with DFU (n = 200), newly diagnosed T2DM patients (n = 42), and healthy donors (n = 38). Serum levels of NETs were detected for all groups, and the prognostic value for DFU-related amputation was analyzed. Results: The results showed that serum NET levels of the DFU group were significantly higher than in the T2DM group (P < 0.05), which also had significantly elevated serum NET levels compared to healthy donors (P < 0.05). Multivariate Cox regression showed that serum NET levels, diabetic foot surgical history, and Wagner grade were the risk factors for amputation (P < 0.05), and these three variables also exhibited the highest coefficient values in additional Lasso Cox regression. For patients with DFU, Kaplan-Meier curves showed that high serum NET levels associated with higher amputation probability (HR = 0.19, P < 0.01) and ROC curve based on NET value showed good validity for amputation (AUC: 0.727, CI 0.651-0.803). Conclusion: Elevated serum NET levels serve as an easily accessible serological prognostic marker for assessing the risk of DFU-related amputation, thereby offering evaluation metrics for healthcare providers. Further investigations are necessary to understand the mechanisms driving this relationship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d04223684aae7e011533c7f3da4c96d",
  "timestamp": "2025-05-15T03:02:07.465979"
}