{
  "id": 3591,
  "title": "An Online Sequential Learning Non-parametric Value-at-Risk Model for High-Dimensional Time Series",
  "abstract": "Online Value-at-Risk (VaR) analysis in high-dimensional space remains a challenge in the era of big data. In this paper, we propose an online sequential learning non-parametric VaR model called OS-GELM which is an autonomous cognitive system. This model uses a Generalized Autoregressive Conditional Heteroskedasticity (GARCH) process and an online sequential extreme learning machine (OS-ELM) to cognitively calculate VaR, which can be used for online risk analysis. The proposed model not only learns the data one-by-one or chunk-by-chunk but also calculates VaR in real time by extending OS-ELM from machine learning to the non-parametric GARCH process. The GARCH process is also extended to one-by-one and chunk-by-chunk mode. In OS-GELM, the parameters of hidden nodes are randomly selected. The output weights are analytically determined based on the sequentially arriving data. In addition, the generalization performance of the OS-GELM model attains a small training error and generates the smallest norm of weights. Experimentally obtained VaRs are compared with those given by GARCH-type models and conventional OS-ELM. The computational results demonstrate that the OS-GELM model obtains more accurate results and is better at forecasting the online VaR. OS-GELM model is an autonomous cognitive system to dynamically calculate Value-at-Risk, which can be used for online financial risk assessment about human being's behavior. The OS-GELM model can calculate VaR in real time, which can be used as a tool for online risk management. OS-GELM can handle any bounded, non-constant, piecewise-continuous membership function to realize real-time VaR monitoring.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d08a2bf47a9da97550d6d6cda038687",
  "timestamp": "2025-05-15T02:27:54.085402"
}