{
  "id": 498,
  "title": "Household financial health: a machine learning approach for data-driven diagnosis and prescription",
  "abstract": "Household finances are being threatened by unprecedented social and economic upheavals, including an aging society and slow economic growth. Numerous researchers and practitioners have provided guidelines for improving the financial status of households; however, the challenge of handling heterogeneous households remains nontrivial. In this study, we propose a new data-driven framework for the financial health of households to address the needs for diagnosing and improving financial health. This research extends the concept of healthcare to household finance. We develop a novel deep learning-based diagnostic model for estimating household financial health risk scores from real-world household balance sheet data. The proposed model can successfully manage the heterogeneity of households by extracting useful latent representations of household balance sheet data while incorporating the risk information of each variable. That is, we guide the model to generate higher latent values for households with risky balance sheets. We also show that the gradient of the model can be utilized for prescribing recommendations for improving household financial health. The robustness and validity of the new framework are demonstrated using empirical analyses.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d1afa1fd040e1161e32da73c99491ca",
  "timestamp": "2025-05-15T01:38:59.288253"
}