{
  "id": 6972,
  "title": "Do consolidation and foreign ownership affect bank risk taking in an emerging economy? An empirical investigation",
  "abstract": "Purpose - The purpose of this paper is to examine the effect of bank consolidation and foreign ownership on bank risk taking in the Egyptian banking sector. Design/methodology/approach - Following prior studies (e.g. Yeyati and Micco, 2007; Barry et al., 2011), this study uses pooled Ordinary Least Squares regression models under two main analyses to test the relation between concentration and foreign ownership on one hand and bank risk-taking behavior on the other hand, where observations are pooled across banks and years for the 2000-2011 period. The reform plan was launched in 2004 and resulted in various restructuring activities in the banking system. Thus, to control for the effect of implementing the financial sector reform plan on bank insolvency and credit risk, this study includes a reform dummy variable (RFM) for the post-reform period in models testing the association between consolidation, foreign ownership and bank risk. Therefore, this categorical variable identifies whether bank risk is related to the reform activities that have been observed during the post-restructuring period, 2005-2011. Moreover, to accommodate the possibility that effects of bank concentration and foreign ownership on bank risk differ due to the implementation of the reform plan, the author create two interaction terms: one uses the product of the reform dummy variable and concentration measures, while the other uses the product of the reform dummy and foreign ownership variables to capture interactions. These interaction terms and the dummy variable provide ample room to capture the effect of bank concentration and foreign ownership on bank risks during the post-reform period. Findings - This study provides empirical evidence that bank concentration is associated with low insolvency risk and credit risk as measured by loan loss provisions (LLP) in the post-reform period. These results are consistent with the concentration-stability view, suggesting that concentration of the banking sector will enhance stability. Moreover, evidence shows that while a higher presence of foreign banks reduces bank credit risk in the post-reform period, it appears to increase insolvency risk. These results are robust to using alternative measures. These findings imply that regulators in emerging countries should support foreign investments in banks to transfer better managerial skills and systems. However, government-owned banks are found to be more prone to insolvency and credit risks; thus, their ownership should not be encouraged. Finally, policy makers should reinforce bank consolidation, be prudent in determining the capital adequacy ratio (CAR) and monitor intensively less profitable, well-capitalized and small-sized banks. Practical implications - Consolidation of the banking sector decreases insolvency risk and credit risk, as measured by LLP in the post-reform period. This study proposes that bank supervisors implement prudent polices in determining the bank CAR, and monitor intensively less profitable, well-capitalized and smaller banks, as they have incentives to increase risk. In addition, regulators should encourage foreign investment in the banking sector and facilitate their operations in Egypt. Social implications - Bank supervisors should intensely monitor banks with high-CARs that exceed mandatory requirements because they may be more likely to engage in more risk-taking activities. Originality/value - It provides empirical evidence from a country-specific, emerging market perspective, in which restructuring events affect the national economy. Egypt, similar to other emerging countries in Africa, pursues an institutionally based (bank-based) system of corporate governance, where banks are the primary sources of finance for firms. Therefore, restructuring banks and other financial institutions and supervising their operations ensure the soundness and stability of these institutions, which represent the nerve of emerging economies. Because emerging countries tend to share common characteristics and economic conditions, and the reform of their financial systems is significant for economic development, the Egyptian banking reform and restructuring program should be of interest to other emerging countries to capitalize on this experiment. While international studies on these relationships are mostly cross-country or focus on US banks, firm-specific studies are scant. Furthermore, the findings of this study should be of interest to Egyptian regulators, bank supervisors and policy makers studying the implications of bank reforms.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d1b73c0298bea5364062c22a18494c8",
  "timestamp": "2025-05-15T03:03:55.682886"
}