{
  "id": 1930,
  "title": "The Risk Monitoring of the Financial Ecological Environment in Chinese Outward Foreign Direct Investment Based on a Complex Network",
  "abstract": "Aiming at the risk problem of financial ecological environment in outward foreign direct investment (OFDI), this paper constructs a risk monitoring model of the financial ecological environment based on complex network theory, and analyzes the general laws of financial risk evolution in Chinese OFDI by using data from 2008 to 2017 in 20 countries. First, the key risk factors are found through centrality analysis, then the correlation between risk indicators is obtained by cohesive subgroup analysis. Finally, we calculate network density, clustering coefficient and global efficiency to explore the time-spatial laws of the financial risk evolution in OFDI are obtained. At the same time, Kruskal's algorithm is used to generate the minimum spanning tree (MST), and the change trend of risk transmission path is obtained. The results show that the following four risk indicators: M2/GDP, foreign exchange reserve, stock exchange turnover rate, total government debt as a percentage of GDP play an important role in the whole risk network and are the key nodes of risk evolution. The internal financial risks in Pakistan, the United States, Israel and Poland are more complex and highly transmissible. The risk transmission path based on MST shows that Australia and Bulgaria play an important role in risk transmission, and the length of risk transmission path has an overall upward trend. The conclusions of this study have guiding significance for overseas investment companies to prevent investment risks and ensure their sustainable development overseas.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d28f555282e5b4493b169b455aa7bc1",
  "timestamp": "2025-05-15T02:09:14.343668"
}