{
  "id": 576,
  "title": "A Visual Analytics Approach to Understanding Gradient Boosting Tree via Click Prediction on Ads",
  "abstract": "As an iterative algorithm consisting of multiple decision trees, gradient boosting decision tree (GBDT) is widely used in problems such as classification and regression prediction. The ensemble decision trees of the algorithm obtain predictive effect by automatically filtering and combining new feature vectors, which contributes to discovering effective feature combinations. However, gradient boosting tree (GBT) is a tedious model, especially the boosting tree approach. It is difficult to interpret the principle of the model due to the characteristic of each tree of the model with weights and the unique structural properties of each decision tree, which is a challenge in many fields that require high interpretation such as financial risk control. In this paper, we design an interactive visual analytic system to solve this problem, to explain the structure and prediction process of the gradient boosting tree model, and to help experts in related fields to perform efficient analysis. We have designed a graphical representation of the feature information and a visual model of the boosting tree to show the basic mechanism of the GBT algorithm in a comprehensive way. The case study is conducted on the dataset of Kaggle competition to prove the effectiveness of the system.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d2f1cf69f4039c7ae808bbe1aa0eb54",
  "timestamp": "2025-05-15T01:52:49.411741"
}