{
  "id": 8678,
  "title": "A cost analysis of sorafenib for desmoid tumors",
  "abstract": "Introduction A recent randomized trial demonstrated that sorafenib improved progression free survival (PFS) in patients with desmoid tumors despite many patients experiencing stable disease or spontaneous regression without treatment. Utilizing these trial data, we performed a cost analysis of sorafenib efficacy through two years of treatment. Methods Current Medicare Part D rates for sorafenib were utilized (dose 400 mg/day, cost $309/day). Annual costs per progression and objective response were calculated. Radiologic progression and response were defined using RECIST criteria. Patients with disease progression were separately analyzed in two groups: both clinical and radiologic (CAR), and radiologic alone. Results 84 previously randomized patients were analyzed (placebo: 35, sorafenib: 49). At one year, sorafenib was associated with a 43% absolute risk reduction (ARR) of CAR progression and number-needed-to-treat (NNT) of 2.3 patients/year, costing $259,406. At two years, ARR was 48% and NNT of 2.1 patients/year, costing $473,697. When evaluating only patients with RECIST defined radiologic progression, sorafenib patients experienced ARR of 13.9% with NNT 7.2 and estimated costs of $812,052 at one year. Two-year ARR was 17.5% with NNT 5.7 and estimated costs $1,285,052. Sorafenib patients experienced improved RECIST partial response rates at 1 and 2 years of 14.7% and 14.3%, with NNT 6.8 and 6.9, and costs of $766,938 and $1,556,433; respectively. Conclusion For the treatment of desmoid tumors, Sorafenib led to improved PFS, but at a significant cost per patient. Favorable RECIST outcomes were less likely and costlier. Patients should be informed of possible benefits of treatment versus potential financial burden.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d314a0164e1a80d318c9aef2604e209",
  "timestamp": "2025-05-15T03:21:24.647924"
}