{
  "id": 9334,
  "title": "Examining the Relationship Between Hearing Health Beliefs and Social Determinants of Health in Black Adults",
  "abstract": "Objectives:Hearing loss is a highly prevalent condition; however, it is widely under-treated, and Black Americans have been found to have significantly lower rates of hearing aid utilization than other ethnic/racial groups. In this exploratory study, we aimed to identify hearing health beliefs among Black adults, guided by the Health Belief Model, with social determinants of health, and examine individual differences in these perspectives.Design:The Hearing Beliefs Questionnaire (HBQ) was administered online to measure constructs of the Health Belief Model among 200 Black adults aged 18 to 75 (M = 39.14, SD = 14.24). Approximately 13% reported hearing difficulty. In addition, 11 social determinants of health questions were included. Participants were recruited from a university otolaryngology clinic and local Black congregations, meeting inclusion criteria of being 18 or older and Black/African American. Mean scores and SDs for HBQ subscales were calculated. Analysis included analysis of variance and t tests to explore relationships with demographic variables and social determinants of health. Multiple regression analyses predicted HBQ subscale scores from sociodemographic variables.Results:Mean HBQ subscale scores ranged from 3.88 (SD = 2.28) for Perceived Barriers to 6.76 (SD = 1.93) for Perceived Benefits. Positive correlations were observed between Perceived Severity, Perceived Benefits, and Perceived Self-Efficacy scores and participant educational attainment. Lower economic stability was correlated with poorer scores in Perceived Self-Efficacy, Perceived Severity, and Perceived Benefits. Black adults' willingness to purchase a hearing aid was heavily influenced by their Perceived Benefit, Perceived Severity, and Perceived Self-Efficacy scores, with lower scores correlating with unwillingness to purchase devices. Higher frequency of racism/discrimination and financial hardship correlated with increased Perceived Barriers scores for accessing hearing healthcare. In addition, hearing health beliefs between participants with self-reported hearing difficulty and those without trouble only exhibited differences in the Perceived Susceptibility subscale, with those experiencing hearing difficulty having higher scores in this subscale; no other distinctions were identified.Conclusions:The Health Belief Model, used with social determinants of health, revealed associations, and variations, in the hearing health beliefs held by Black adults. The present investigation reveals heterogeneity within this group and pinpoints individuals at higher risk for untreated hearing loss, stemming from their negative perceptions about hearing healthcare. These beliefs are influenced by demographics and social determinants of health, underscoring areas ripe for intervention.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d37772f7efb48a09cc70516aa2abbab",
  "timestamp": "2025-05-15T03:27:53.345818"
}