{
  "id": 8814,
  "title": "The burden of catastrophic and impoverishing health expenditure in Armenia: An analysis of Integrated Living Conditions Surveys, 2014-2018",
  "abstract": "Armenia's health spending is characterized by low public spending and high out-of-pocket expenditure (OOP), which not only poses a financial barrier to accessing healthcare for Armenians but can also impoverish them. We analyzed Armenia's Integrated Living Condi- tions Surveys 2014-2018 data to assess the incidence and correlates of catastrophic health expenditure (CHE) and impoverishment. Households were considered to have incurred CHE if their annual OOP exceeded 40 percent of the per capita annual household non-food expenditure. We assessed impoverishment using the US$1.90 per person per-day interna- tional poverty line and the US$5.50 per person per-day upper-middle-income country pov- erty line. Logistic regression models were fitted to assess the correlates of CHE and impoverishment. We found that the incidence of CHE peaked in 2017 before declining in 2018. Impoverishment decreased until 2017 before rising in 2018. After adjusting for socio- demographic factors, households were more likely to incur CHE if the household head was older than 34 years, located in urban areas, had at least one disabled member, and had at least one member with hypertension. Households with at least one hypertensive member or who resided in urban areas were more likely to be impoverished due to OOP. Paid employ- ment and high socioeconomic status were protective against both CHE and impoverishment from OOP. This detailed analysis offers a nuanced insight into the trends in Armenia's finan- cial risk protection against catastrophic and impoverishing health expenditures, and the groups predominantly affected. The incidence of CHE and impoverishment in Armenia remains high with a higher incidence among vulnerable groups, including those living with chronic disease, disability, and the unemployed. Armenia should consider different mecha- nisms such as subsidizing medication and hospitalization costs for the poorest to alleviate the burden of OOP.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d3baee15ce4dc22de22e0dcf16ddd23",
  "timestamp": "2025-05-15T03:22:57.844707"
}