{
  "id": 6944,
  "title": "Child maltreatment in the Children of the Nineties: deprivation, class, and social networks in a UK sample",
  "abstract": "Aim: To determine risk factors for child maltreatment within the socio-economic environment of a contemporary UK child population. Methods: The research is based on a large cohort study, the Avon Longitudinal Study of Parents and Children. Out of 14,256 children participating in the study, 115 have been identified as having been placed on local child protection registers prior to their 6th birthday. Data on the socio-economic environment of the families have been obtained from a series of questionnaires administered during pregnancy and the first 3 years of life. Risk factors have been analyzed using logistic regression analysis. Results: Four indicators of deprivation all showed significant relationships with registration. Adjusted odds ratios were 2.33 for paternal unemployment; 7.65 for council housing; 2.16 for overcrowding; and 2.33 for car ownership. There was a strong relationship between the number of indicators of deprivation and the risk of maltreatment. In a second model, maternal unemployment, high mobility (> 3 house moves in the previous 5 years) and a poor social network were also significant with odds ratios of 2.82, 2.81, and 3.09, respectively. Conclusions: This study confirms the importance of social factors in the etiology of child maltreatment. Social deprivation is an important determinant of child maltreatment, and encompasses a number of different aspects, including financial security, housing situation and material benefits; in addition, the job situation of the parents and the stability and richness of their social networks all have a significant impact on risk of maltreatment. Interventions at both an individual and a community level are important to support families and reduce the risk of maltreatment. (C) 2002 Elsevier Science Ltd. All rights reserved.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d4a43e145940c7c34177e35294bcc7c",
  "timestamp": "2025-05-15T03:03:13.504137"
}