{
  "id": 6096,
  "title": "Size, conditional idiosyncratic risk and price momentum: an international study",
  "abstract": "PurposeThis paper jointly examines how firm size and idiosyncratic risk impact momentum returns.Design/methodology/approachUsing regression analysis, the authors investigate how firm size and idiosyncratic risk impact price momentum. The authors review firm price data in 25 country markets in the Thomson Financial Datastream database from 1979 to 2009.FindingsThis study's findings suggest price momentum is more significant among stocks with smaller size and higher idiosyncratic risk. The authors find that winner and loser portfolios have significantly smaller size and higher idiosyncratic risk than portfolios in the middle quintiles.Research limitations/implicationsThis study's results are consistent with the notion that firm size matters in price momentum and mispricing is greatest for small firms because of the greater risk potential to arbitrageurs. In addition, this finding that firms with higher idiosyncratic risk have greater price momentum supports the idea that investors underreact to firm-specific information.Practical implicationsThis work finds evidence that investors underreact to firm-specific information. As such, these findings are of particular interest for investors looking to exploit opportunities for abnormal returns through price momentum trading.Originality/valueThis paper jointly examines the effects of firm size and idiosyncratic risk on momentum returns. This investigation considers these effects in the global markets. This work adds to the research base by illustrating that both winner and loser portfolios have significantly smaller size and higher idiosyncratic risk than portfolios in the middle quintiles. Also unique to this study, the authors capture the time-variation of expected IdioRisk and the asymmetric effects of volatility by using an exponential general autoregressive conditional heteroskedastic (EGARCH) model to calculate conditional idiosyncratic risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d4c00c57e741626e307cafced993c61",
  "timestamp": "2025-05-15T02:54:38.876621"
}