{
  "id": 8507,
  "title": "Impacts of Medicaid Expansion on Health Insurance and Coverage Transitions among Women with or at Risk for HIV in the United States",
  "abstract": "Background: As employment, financial status, and residential location change, people can gain, lose, or switch health insurance coverage, which may affect care access and health. Among Women's Interagency HIV Study participants with HIV and participants at risk for HIV attending semiannual visits at 10 U.S. sites, we examined whether the prevalence of coverage types and rates of coverage changes differed by HIV status and Medicaid expansion in their states of residence.Methods: Geocoded addresses were merged with dates of Medicaid expansion to indicate, at each visit, whether women lived in Medicaid expansion states. Age-adjusted rate ratios (RRs) and rate differences of self-reported insurance changes were estimated by Poisson regression.Results: From 2008 to 2018, 3,341 women (67% Black, 71% with HIV) contributed 43,329 visits at aged less than 65 years (27% under Medicaid expansion). Women with and women without HIV differed in their proportions of visits at which no coverage (14% vs. 19%; p < .001) and Medicaid enrollment (61% vs. 51%; p < .001) were reported. Women in Medicaid expansion states reported no coverage and Medicaid enrollment at 4% and 69% of visits, respectively, compared with 20% and 53% of visits for those in nonexpansion states. Women with HIV had a lower rate of losing coverage than those without HIV (RR, 0.81; 95% confidence interval [CI], 0.70 to 0.95). Compared with nonexpansion, Medicaid expansion was associated with lower coverage loss (RR, 0.62; 95% CI, 0.53 to 0.72) and greater coverage gain (RR, 2.32; 95% CI, 2.02 to 2.67), with no differences by HIV status.Conclusions: Both women with HIV and women at high risk for HIV in Medicaid expansion states had lower coverage loss and greater coverage gain; therefore, Medicaid expansion throughout the United States should be expected to stabilize insurance for women and improve downstream health outcomes.(c) 2022 Jacobs Institute of Women's Health, George Washington University. Published by Elsevier Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d55a8611e5a79a56c552b5d5856b869",
  "timestamp": "2025-05-15T03:19:21.379004"
}