{
  "id": 9038,
  "title": "Borrower characteristics and mortgage rate choice in Sweden",
  "abstract": "Purpose - The purpose of this paper is to investigate driving forces behind mortgage rate choice among homeowners in a market of no mortgage rate spread. The study reported on was conducted in Sweden, a country relatively spared both from effects of the subprime crisis and the on-going Euro-crisis. A number of potentially influential factors, such as respondents' risk aversion, financial vulnerability, experience, expectations as well as the impact of media and bank advisors are examined and a number of demographic factors controlled for. Design/methodology/approach - The study reported on is based on data from a national randomized survey conducted in Sweden in 2012. An empirical analysis is carried out on a sample of 474 households with mortgages. A logistic regression is performed to test a model based on hypothesized factors. Findings - The study shows that consumers choosing fixed rate mortgages (FRMs) have high LTV and high risk aversion and perceive their choice as having been influenced by bank advisors. This is in line with earlier findings. Lower levels of - or no - FRMs (more adjustable rate mortgages) seems to be attractive for the wealthier with higher education and previous experience of home owning. Other factor negatively affecting the choice of FRMs are: being younger; being influenced by media; and perceiving oneself as financially vulnerable. Research limitations/implications - To summarize, this paper contributes to research in two major ways: first, the Swedish case is modeled against a review of international research on mortgage rate choice. Second, a number of consumer-related factors are investigated, and their relative contribution as drivers of a choice of FRMs are tested. This gives input to more theoretical research conceptualizing a model for the understanding of how consumer mortgage rate choices are made. Practical implications - The results should serve as an alarm bell for the industry, as the consumers described - the youngest mortgage holders, the financially vulnerable with low repayment capacity and those easily influenced by reports in media - are a potential threat to stable development of long term customer relations and mortgage portfolios. Social implications - The results gives reason for policy makers to address the question and reasons to call for more studies of the preferences and choices of the younger consumers. Originality/value - This study represents an investigation into some factors not often studied in relation to mortgage rate choice. It also highlights the Swedish case and puts it in an international context.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d59bcfef48b6063d79ee42cc3146576",
  "timestamp": "2025-05-15T03:24:54.908268"
}