{
  "id": 1142,
  "title": "An intelligent model for stock investment with buffett strategy, classifier system, neural network and linear programming",
  "abstract": "The Intelligent Model for Stock Investment with Buffett Strategy, Classifier System, Neural Network and Linear Programming was studied for developing an intelligent model which call learn more knowledge regarding to stock investment with artificial intelligence technology. Classifier system, neural network, fundamental financial investment factors and linear programming are the fundamental components for the research. Knowledge transformation and Genetic evolution capability was discussed in the article, too. Furthermore, the investment strategy developed by Warren E. Buffett[17], the great financial investment master, was the major knowledge which was practiced in the article. For realizing more detail about learning system, a lot of topics regarding to artificial intelligence were discussed in advanced. including A Market-Based Rule Learning System [1], Dynamic Trading Strategy Learning Model using Learning Classifier System [2], 'Nonlinear Index Prediction [3], Financial Decision Support with Hybrid Genetic and Neural Based Modeling Tool [4] and Fuzzy Interval methods in Investment risk Appraisal [5]. According to the Study mentioned above, the ideas to give intelligent model, especially with genetic algorithm, bring the direction for the advanced financial investment strategy and operation. Therefore, it was why a novel intelligent model with Buffett strategy, classifier system, neural network and linear programming proposed in the article.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d6092535974b46278ab1e42eb05fe58",
  "timestamp": "2025-05-15T01:59:21.642402"
}