{
  "id": 8484,
  "title": "Demographic Disparities and Factors Influencing Cancer Treatment Decision-Making",
  "abstract": "This study aims to explore disparities in cancer treatment decision-making and the factors associated with the decision to pursue treatment. We used Behavioral Risk Factor Surveillance System (BRFSS) data collected between 2017 and 2022. We employed the PRECEDE-PROCEED model to guide our analysis of factors associated with treatment decisions. Descriptive statistics and multivariable logistic regression analysis were conducted to assess the association between treatment decision-making and the predisposing, enabling, and reinforcing factors (following the PRECEDE-PROCEED model). All analyses were weighted and adjusted for the demographic characteristics of the participants. Our sample included N = 19,388 cancer patients, 20.98% of whom refused treatment. American Indians, younger adults, and breast cancer patients were more likely to decide to go for treatment. Patients who had private insurance (OR = 1.25, P = .037) and those who did not have problems affording care (OR = 1.22, P = .02) were more likely to decide to get treatment. The more patients had regular doctors, the more they decided to continue to pursue treatment for cancer (Only one doctor: OR = 1.20, P = .042; More than one: OR = 1.28, P = .007). Finally, the more days patients experienced a bad health situation, the more they decided to have cancer treatment (for 14 + days with bad health: OR = 1.20, P < .001). The results suggest the need for enhanced patient education to improve cancer treatment adherence and informed decision-making. It highlights the importance of culturally tailored educational programs, age-related concerns, addressing financial barriers, and emphasizing the importance of regular healthcare visits for cancer patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d623116f1bdd9f967cda677a21da37f",
  "timestamp": "2025-05-15T03:19:21.321286"
}