{
  "id": 9348,
  "title": "Metamodel-Assisted Disciplining Algorithm for Detecting Spoofed GNSS Time Signals",
  "abstract": "The cost and technological barriers required to successfully spoof Global Navigation Satellite Positioning System (GNSS) signals have fallen greatly. At the same time, the use of GNSS signals for personal, civil and military applications has grown dramatically. The risk of a successful spoofing event to wreak havoc on commercial or civil interests is no longer a minor one, and in a world of 'big data' the consequences are potentially catastrophic in terms of financial or societal harm. The communication and data infrastructure we take for granted is at risk of attack, causing denial of use or even systemic failure. Due to technological restrictions and IP constraints it is hard to determine how GNSS receivers will react to spoofing of GNSS signals without having specialized equipment, and spending a considerable number of man hours. Unnoticed spoofing for an extended period of time can cause some GNSS receivers to drift by a substantial time difference. Therefore, it is essential to be able to identify if a GNSS receiver or signal has been tampered with, since many critical systems (e.g., stock markets, power grids, and communications) are dependent on its timing systems. This research presents an algorithm that is used to detect and mitigate GNSS receiver time signal abnormalities that can arise by spoofing attempts altering GNSS signals before they reach the receiver. We have implemented a GNSS-receiver-independent solution that is added to the disciplining algorithm of a Global Positioning System Disciplined Oscillator (GPSDO) System in order to detect and filter abnormalities without introduction of any additional hardware to the timing system. A metamodeling approach is used to help accurately predict the behavior of the un-spoofed GNSS receiver and the internal oscillator of the system. To this end, parameters such as internal oscillator aging, temperature and previous error history are taken into account. The spoof prediction algorithm uses metamodels to enhance the disciplining process which is then able to reject bad data caused by spoofed GNSS timing data. Since the accuracy of the metamodel is a key to this approach, we are considering different variants of models: neural networks and other common multidimensional regression/interpolation models. Two different metamodels are used in the proposed algorithm: the short-term (coarse) model is created by using data from short time intervals to allow fast real-time calculations. A second, long-term (refined) model that is created from very long time intervals, takes into account overall behavior of an internal oscillator over an extended period of time. Using both models adds another protection layer in case that the offset of the spoofed timing signal is so minuscule that it is not detected by the coarse metamodel. The error offset introduced into a system by a spoofing attempt is greatly reduced by the algorithm even if it fails to detect a spoofing attempt significantly increasing the time it takes to induce a large scale error.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d69f0136832a5f57e8a2b855a6c5101",
  "timestamp": "2025-05-15T03:27:53.388002"
}