{
  "id": 5584,
  "title": "Protocol for a systematic review and individual participant data meta-analysis for risk factors for lung cancer in individuals with lung nodules identified by low-dose CT screening",
  "abstract": "Background Worldwide, lung cancer (LC) is the second most frequent cancer and the leading cause of cancer related mortality. Low-dose CT (LDCT) screening reduced LC mortality by 20-24% in randomised trials of high-risk populations. A significant proportion of those screened have nodules detected that are found to be benign. Consequently, many individuals receive extra imaging and/or unnecessary procedures, which can have a negative physical and psychological impact, as well as placing a financial burden on health systems. Therefore, there is a need to identify individuals who need no interval CT between screening rounds.Methods and analysis The aim of this study is to identify risk factors predictive of LC, which are known at the time of the scan, in patients with LDCT screen-detected lung nodules. The MEDLINE and EMBASE databases will be searched and articles that are on cohorts or mention cohorts of screenees with nodules will be identified. A data extraction framework will ensure consistent extraction across studies. Individual participant data (IPD) will be collected to perform a one-stage IPD meta-analysis using hierarchical univariate models. Clustering will be accounted for by having separate intercept terms for each cohort. Where IPD is not available, the effects of risk factors will be extracted from publications, if possible. Effects from IPD cohorts and aggregate data will be reported and compared. The PROBAST (Prediction model Risk Of Bias ASsessment Tool) will be used for assessment of quality of the studies.Ethics and dissemination Ethical approval was not required as this study is a secondary analysis. The results will be disseminated through publication in peer-reviewed journals and presentations at relevant conferences.PROSPERO registration number CRD42022309515",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d851e0734727b0c6636828bdfe3672c",
  "timestamp": "2025-05-15T02:49:21.668950"
}