{
  "id": 4420,
  "title": "Financial intermediation through risk sharing vs non-risk sharing contracts, role of credit risk, and sustainable production: evidence from leading countries in Islamic finance",
  "abstract": "The asset side of Islamic banks has two different portfolios running side by side, namely risk-sharing (PLS) and non-risk sharing (non-PLS) financing. The segregation of PLS and non-PLS financing has gathered some attention recently owning to its relative importance for sustainable economic output. This study attempts to analyze the impact of decomposed Islamic financing modes (PLS and non-PLS) with a particular focus on their impact on real economic activity. In addition, we moderated the relationship with asset quality of aggregate Islamic banking sector. Quarterly data from 2014 to 2021 have been sourced from datasets of the Islamic financial service board (IFSB), the International Monetary Fund (IMF), World Bank, and Central banks' data streams. Eleven countries have been selected based on the highest local and global share in global Islamic financial assets. Panel data regression model has been used in this study. The findings indicate that PLS financing is a weaker driver to channelize funds. However, industrial production output is significantly affected by non-PLS financing. Further the results suggest, Islamic finance-output nexus found to have a stronger relationship in the presence of higher asset quality of Islamic banks. The results show that firms mostly rely on non-PLS financing, due to reduced asymmetry and higher transparency in non-PLS contracts compared to PLS modes. The results have implications for governing bodies of Islamic financial system in boosting risk-sharing contracts and firms to limit agency conflicts arising from fluctuating cost of financing.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d8a2c32cdaa478fa1c1c41587fd0b06",
  "timestamp": "2025-05-15T02:37:16.746717"
}