{
  "id": 4314,
  "title": "Is Equity Crowdfunding the Leapfrog to Companies' Success? Financial Performance in China",
  "abstract": "As the fastest-growing crowdfunding model, equity crowdfunding (ECF) brings high returns and uncertainty. In this context, it is crucial to understand these crowdfunding projects' actual performance. Since ECF is currently in the early stage of integration, there are still a lot of risk issues, such as the uncertainty of equity structure, capital supervision, or project management. Therefore, this paper develops a new profitability indicator, return on registered capital, to test its impact on the ECF project's actual return. This paper studies which factors affect the financial performance of ECF projects through the traditional statistical model and a deep neural network (DNN) model. There is evidence that return on registered capital affects the actual return of the project. At the same time, the company's operating time and the number of employees had an unexpected effect on project performance. In addition, the recognition accuracy of the DNN model in this study exceeds 97%, which affirms the applicability of the DNN model in the analysis of ECF success factors. This paper also uses tenfold cross-validation to prove that deep learning has certain advantages in this topic's accuracy and generalization error. This study explores whether company representatives' gender and knowledge level affect project performance. The results will be described in detail in the paper.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d8e6488f3557152caa0d19bca016e4c",
  "timestamp": "2025-05-15T02:36:05.134919"
}