{
  "id": 3040,
  "title": "Incentives or Mandates? Determinants of the Renewable Energy Policies of US States, 1970-2012",
  "abstract": "Why might states adopt policy instruments of one type over another, and how does this choice impact the overall portfolio of policy instruments a state adopts? To address these questions this article examines renewable energy policy instrument adoption by U.S. states and argues that states adopt instruments of different types based on their state-level economic, political, institutional, and cultural characteristics. I test these claims by examining the tax incentive-and regulatory mandate-based policy instruments adopted to promote renewable energy generation by U.S. states over a 40-year period. Using random effects Poisson regression analysis, I find that state affluence, environmental movement organization density, and fossil fuel production predict the number of policies a state is likely to adopt, while an affinity for a neoliberal ideology, U.S. senators environmental voting records, and prior policy actions predict the types of policies a state adopts. These results reinforce perceptions of economic factors as key predictors of renewable energy policy, but also highlight the importance of less frequently examined cultural factors for explaining a state's portfolio of policies. These analyses offer a robust picture of the relationship between tax incentive and regulatory mandates, the two types of programmatic approaches that have dominated many policy domains in the United States over the past 40 years.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d8ebc95439a363e99e8804124fb3a45",
  "timestamp": "2025-05-15T01:13:09.797000"
}