{
  "id": 8915,
  "title": "Relationship between Social Networks, Support Patterns, and Health Problems among the General Hungarian Population during the Last Phase of the COVID-19 Pandemic",
  "abstract": "Numerous research works prove that social relationships and the support they provide have particular importance in maintaining both mental and physical health: they help to deal with stressful life situations, overcome diseases, and maintain health. It is also known that certain periods of life and life events can be critical in terms of social support, as they involve the narrowing of possible sources of support, so the lack of a network of contacts and social support increases not only the risk of becoming lonely but also the occurrence or worsening of diseases. This study investigates the relationship between social network factors and support provided through networks and health problems, taking into account the perceived personal and general impact of COVID-19. The data came from a cross-sectional study, a representative sample of 5000 Hungarian participants was conducted during the dwindling period of the pandemic. We used a latent profile analysis to separate the different groups of respondents based on the support received from different sources of relationships, aiming at capturing the diversity of supported support combinations based on the type of relationships in the network, the form of support, and frequency. Multilevel regression was used to examine the impact of social connectivity factors, emerging patterns, and COVID-19-related perceived consequences on health conditions. Our results confirm that the poorly supported network plays a key role in the occurrence of chronic diseases and depression. It seems interesting, however, that the probability of poor physical and mental health was higher in the group of those receiving financial and in-kind support mainly from family compared to the group of those receiving support from multiple sources of relationships. The models also suggest that network integration plays a major role in maintaining mental and physical health during an epidemic crisis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d94d780a8035a7f4ca9efd95b1e1ce0",
  "timestamp": "2025-05-15T03:23:56.024212"
}