{
  "id": 6796,
  "title": "Toward an Understanding of Gig Work Risks and Worker Agency on Different Digital Labor Platforms",
  "abstract": "The rise of the digitally enabled gig economy has prompted debate about gig working conditions and labor regulation, calling for research on the interactions between gig workers and digital labor platforms (DLPs). This study examines the working conditions on place-based and remote-work platforms by focusing on worker perspective and addressing two questions: What risks do workers perceive when engaging in different types of gig work? How is labor agency exercised on different digital labor platforms? To answer these research questions, we chose a comparative qualitative case-study research design and drew on labor agency theory to use the classification of resistance, resilience, and reworking as a starting point for categorizing labor agency actions on different DLPs. Narratives of workers through semi-structured surveys were collected from 102 California-based gig workers registered on three types of DLPs: delivery, ridesharing, and microtask crowdworking. Our thematic analysis shows that workers on the three types of DLPs shared four types of risk- employment, financial, mental health, and technological-but the frequencies of these risks differed across the platforms. Two risks-entrepreneurial and physical health risks-were primarily perceived by workers engaging in delivery and ridesharing. The study reveals that workers' enactment of the three types of labor agency (resistance, reworking, and resilience) varied by risk types and DLPs and provides a nuanced understanding of the gig work risks and worker agency across DLPs, extending labor agency theory from traditional workplaces to gig work environments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d9df41556eef3fa0c5b6b538acde4fa",
  "timestamp": "2025-05-15T03:01:31.465226"
}