{
  "id": 4019,
  "title": "Institutional ownership and the extent to which stock prices reflect future earnings",
  "abstract": "Articles in the financial press suggest that institutional investors are overly focused on current profitability, which suggests that as institutional ownership increases, stock prices reflect less current period information that is predictive of future period earnings. On the other hand, institutional investors are often characterized in academic research as sophisticated investors and sophisticated investors should be better able to use current-period information to predict future earnings compared with other owners. According to this characterization, as institutional ownership increases, stock prices should reflect more current-period information that is predictive of future period earnings. Consistent with this latter view, we find that the extent to which stock prices lead earnings is positively related to the percentage of institutional ownership. This result holds after controlling for various factors that affect the relation between price and earnings. It also holds when we control for endogenous portfolio choices of institutions (e.g., institutional investors may be attracted to firms in richer information environments where stock prices tend to lead earnings). Further, a regression of stock returns on order backlog, conditional on the percentage of institutional ownership, indicates that institutional owners place more weight on order backlog compared with other owners. This result is consistent with institutional owners using non-earnings information to predict future earnings. It also explains, in part, why prices lead earnings to a greater extent when there is a higher concentration of institutional owners.",
  "year": 2002,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d9d5da6661217c579cb7654dc2e1c4d",
  "timestamp": "2025-05-15T01:23:07.354963"
}