{
  "id": 4886,
  "title": "Exposing the Care Conundrum of Low-Energy Pelvic Ring Fractures in Older Adults: A Review of 322 Patients",
  "abstract": "Introduction A care conundrum for low-energy pelvic ring fracture patients in which they face financial burden after not qualifying for an inpatient stay of 3 days or more has been noted in the literature. The purpose of this study was to identify factors that lead to inpatient length of stay (IP LOS) >= 3 days in older adults with nonoperative pelvic ring fragility fractures and to highlight the challenging financial decision-making of those with IP LOS <3 days in the context of the Medicare 3-day rule. Methods This was a retrospective review of 322 patients aged >= 65 presenting from March 2016 and February 2019 to either of 2 emergency departments (EDs) after a ground-level fall resulting in a pelvic ring fracture. Patient demographic, IP LOS, and mortality data were extracted. Case management notes were analyzed to summarize financial decision-making for patients with IP LOS <3 days. Multivariate logistic regression analysis was conducted to identify factors that predicted IP LOS >= 3 days and mortality. Results IP LOS >= 3 days was associated with presentation to level I hospital (OR .30 [.19, 0.50]) and being single (OR 2.50 [1.10, 5.68]). 70.3% required a post-acute skilled nursing facility (SNF) stay. Of patients with LOS <3 days, 25.0% were financially responsible for their SNF stay, while 7.9% elected home care due to financial reasons. Overall 30-day, 90-day, and 1-year mortality were 2.5%, 8.1%, and 20.8%, respectively. For patients with LOS <3 days, returning to assisted living compared to discharging to a SNF increased 90-day mortality risk (HR 8.529, P = .0451). Having Medicare trended towards increased 90-day mortality risk compared to commercial insurance (HR 4.556, P = .0544). Conclusion The current system is failing older adult patients who sustain nonoperative low-energy pelvic ring fractures in terms of financial coverage of necessary post-acute treatment. This care conundrum has yet to be solved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0d9f7f735a3df0a2f245264766054596",
  "timestamp": "2025-05-15T02:42:04.866669"
}