{
  "id": 7426,
  "title": "Economic impacts of chickpea grain classification: how 'seed quality is Queen' must be considered alongside 'yield is King' to provide a princely income for farmers",
  "abstract": "Chickpeas (Cicer arietinum L.) are a high value crop for farmers, but price penalties will be imposed or grain rejected whenever the standards are not met by growers whose crops suffer grain defects in a particular season. Australian chickpeas are renowned for their high quality and are generally in high demand globally because of good farming practice and strict grain quality standards. However, small quantities of defective seed in grain loads can reduce the price paid to individual farmers, with significant financial impacts. Information is scarce on the types of defects causing price penalties and there is no information on the magnitude of those penalties. An online farmer survey was conducted to capture information on the types of grain defects, price penalties imposed and load rejections with respect to the delivery of their 2017 chickpea crop. Here we show that the cost to individual chickpea farmers affected by price penalties or load rejections ranged from AU$743 to $1 293 750. Furthermore, the total cost of seed defects was calculated to be $154.2 million in that season, equating to a revenue loss of 23.7% of gross value of production in Australia. Chickpea seed defects also contributed to additional costs including seed cleaning, further transport costs and harvest delays, with subsequent risk of yield losses and further quality defects. Too often, crop yields are the focus while seed quality is overlooked as an essential driver of farmer profitability. We demonstrate how important seed quality is to farmer profitability; if 'yield is King' then seed quality is certainly Queen. We suggest that farmers prioritise harvest of their chickpea crops ahead of harvest of cereal crops to minimise the risk of chickpea seed defects and seed loss, and to maximise profits from this higher value crop. Additional surveys over several seasons are warranted to refine information on the types of seed defects occurring in chickpea and their financial impacts on farmers, and they could be expanded to other crops and countries. We suggest that misclassification of seed defects needs further exploration, as does research into minimising the major causes of seed defects. Improvements to grain classification systems globally should be sought to provide better support for farmer profitability so that they can continue to feed the world.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0da52387051b22d7b475d67428468834",
  "timestamp": "2025-05-15T03:08:37.779332"
}