{
  "id": 126,
  "title": "The Risk Early-Warning Model of Financial Operation in Family Farms Based on Back Propagation Neural Network Methods",
  "abstract": "In order to solve the financial management risks of rural family farms and promote the healthy development of rural finance in China, a risk early warning (REW) model of family farm financial operation is built under the back propagation neural network (BPNN) on the basis of in-depth research of rough set theory (RST) and risk assessment, prediction, and prevention theory. Then, the concept of BPNN is elaborated, and finally, RST is combined to construct a REW index system of family farms financial operation. Besides, a BPNN-based REW model of family farms financial operation is constructed, and the family farms financial operation risk indexes from the past four years are selected, which are compared with the predicted value of the model. The results show that the designed REW model can accurately predict the financial operation of family farms, and the calculating classification accuracy of the RS model is not less than 81.88%. The operation risk and profitability risk are predicted, of which the operation risk is in the safe range for a long term, but the weight of profitability risk is extremely high. Therefore, it is necessary to strengthen the profit-making risk control level of the family farmers' financial management sharing early-warning model investigated in this study. The BPNN-based REW model of financial operation in family farms is highly feasible under the RST investigated in this study, thereby providing a theoretical basis for the research of the financial operation REW model of family farms in China.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0da9f559780d85944df5ecbd40423802",
  "timestamp": "2025-05-15T01:47:14.008973"
}