{
  "id": 2107,
  "title": "Role of International Trade Competitive Advantage and Corporate Governance Quality in Predicting Equity Returns: Static and Conditional Model Proposals for an Emerging Market",
  "abstract": "This paper aims to develop some static and conditional (dynamic) models to predict portfolio returns in the Borsa Istanbul (BIST) that are calibrated to combine the capital asset-pricing model (CAPM) and corporate governance quality. In our conditional model proposals, both the traditional CAPM (beta) coefficient and model constant are allowed to vary on a binary basis with any degradation or improvement in the country's international trade competitiveness, and meanwhile a new variable is added to the models to represent the portfolio's sensitivity to excess returns on the governance portfolio (BIST Governance) over the market. Some robust and Bayesian linear models have been derived using the monthly capital gains between December 2009 and December 2019 of four leading index portfolios. A crude measure is then introduced that we think can be used in assessing governance quality of portfolios. This is called governance quality score (GQS). Our robust regression findings suggest both superiority of conditional models assuming varying beta coefficients over static model proposals and significant impact of corporate governance quality on portfolio returns. The Bayesian model proposals, however, exhibited robust findings that favor the static model with fixed beta estimates and were lacking in supporting significance of corporate governance quality.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0dae9f568342590b4a74176a1a915221",
  "timestamp": "2025-05-15T01:03:03.683947"
}