{
  "id": 4777,
  "title": "Safety culture and accident risk control: Perceptions of professional divers and offshore workers",
  "abstract": "Safety management emphasises the importance of cultivating a positive safety culture within high reliability industries such as the offshore industry. The present study investigated workers' perception of significance of safety culture in achieving accident risk control, relative to supervisory quality, worker competency and time/financial pressure. Participants were 212 male professional divers (70% with offshore diving experience and 30% who had not dived offshore) and 108 male offshore workers. Participants rated likelihood of an accident given varying levels of safety culture, supervisory quality, worker competency and time/financial pressure. Ordered logit regression was used to estimate the relative importance of each attribute in accident control. Results: All four attributes significantly affected perception of accident risk (P < 0.001) but offshore divers gave less weight to safety culture in controlling accident risk than did offshore workers or non-offshore divers. Participant supervisory status, personal accident history and current employment in offshore industry were not significantly related to weightings of safety culture. Offshore divers lesser emphasis on safety culture may reflect less exposure to continuing, consistent safety culture education, as this group were most likely to be short-term contract workers. The conjoint analysis technique could be used to explore acceptance of the safety culture principle in other groups, or before and after training programmes. (c) 2005 Elsevier Ltd. All rights reserved.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0dd775d4a331d7cd3c4f6bd80951eab9",
  "timestamp": "2025-05-15T02:41:00.799125"
}