{
  "id": 8045,
  "title": "Squamous Carcinoma and Dysplasia of the Conjunctiva and Cornea An Analysis of 101 Cases",
  "abstract": "Objective: To evaluate clinical and histopathologic factors of squamous conjunctival neoplasia associated with recurrence. Design: Retrospective, clinical case series. Participants: One hundred one eyes of 99 patients with squamous conjunctival dysplasia, carcinoma in situ, or squamous cell carcinoma. Methods: Review of the medical records, pathology reports, and color photographs. Main Outcome Measures: Demographic information, laterality, tumor size, extension, pathologic diagnosis, seventh edition of the American Joint Committee on Cancer Classification (AJCC) staging system stage, treatment methods, recurrence, and duration of follow-up. Results: Malignant squamous conjunctival neoplasia was seen most commonly in males at a median age of 71 years. Recurrences were seen in 12.9% (n=13/101), with 92.3% occurring 6 to 12 months after primary treatment. Recurrence was not correlated significantly to age, gender, laterality, clinical appearance or focality of the tumor at presentation. However, tumors larger than 5 mm in diameter, tumors extending more than 2 mm onto the cornea, and tumors with local invasion (corneal, scleral, intraocular or orbital invasion) were associated with a higher risk of recurrence. Increasing AJCC T-stage was correlated strongly to the incidence of recurrence (P=0.0006). Rates were 1.7% for Tis-staged tumors, 0% for T1- and T2-staged tumors, 34.3% for T3-staged tumors, and 50% for T4-staged tumors. Histopathologic diagnosis was correlated to recurrence (P=0.037). None of the tumors defined histologically as dysplasia showed recurrence, whereas 12.8% of carcinoma in situ tumors and 22.2% of squamous cell carcinoma tumors recurred. Although the overall recurrence rate was 12.9%, the rate for tumors treated primarily at the authors' center was 4%, significantly less than the recurrence rate in previously operated tumors (P=0.0003). Lymph nodes demonstrated positive results in 1%, and in no patient did distant metastasis develop. Conclusions: Advanced AJCC T-stage, locally invasive tumors, and more pathologically aggressive tumors were at higher risk for recurrence. Inadequate initial therapy also was an important risk factor for recurrence. Treatment strategies should be affected by tumor staging at presentation. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012; 119: 233-240 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ddbde3eba8c8e687badd9087af029dd",
  "timestamp": "2025-05-15T03:14:37.369706"
}