{
  "id": 7784,
  "title": "Importance of left atrial mechanical function as a predictor of atrial fibrillation risk following cardiac surgery",
  "abstract": "Postoperative atrial fibrillation (POAF) after cardiac surgery is a major health problem that is associated with a significant financial burden and increased early morbidity and mortality. We investigated the accuracy of new echocardiographic derived indices to predict patients at higher risk of developing POAF. 84 consecutive patients (age 57.9 +/- 6.9, 32% female) hospitalized for isolated CABG underwent comprehensive echocardiographic evaluation before surgery. Left atrial (LA) function was quantified through the assessment of phasic LA volumes to calculate LATEF. Speckle tracking echocardiography STE was used to measure LA reservoir strain, conduit strain and booster strain. Patients who developed POAF had increased LA volumes and impaired LA functions assessed by both the volumetric phasic changes and STE. By univariable analysis, all LA function parameters significantly predicted POAF. Multivariate regression analysis showed that age (P = 0.03, OR 1.134, 95% CI 1.012-1.271) and LATEF (P = 0.001, OR 0.814, 95% CI 0.725-0.914) were strong independent factors for POAF with LATEF showing the highest predictive accuracy. After multivariable adjustment to include LA strain indices to the base model, LA contractile strain LACtS (23.93 +/- 4.19 vs 37.0 +/- 3.35, p < 0.001) was the best discriminated for the highest predictive accuracy (OR 0.429, 95% CI 0.26-0.708). The ROC Curve was calculated for the greatest performance for prediction of POAF (AUC LACtS: 0.992; LATEF: 0.899). Adding new left atrial mechanics parameters is a more sensitive, independent tool that provides an incremental predictive value to discriminate patients at more risk for POAF.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0df0a405890868b02a30709b48a564c4",
  "timestamp": "2025-05-15T03:12:11.596068"
}