{
  "id": 9351,
  "title": "Dynamic and marketing capabilities as determinants of firm performance: evidence from automotive industry",
  "abstract": "Purpose This study aims to explore the roles and relations of dynamic capabilities (DCs) and marketing capabilities (MCs) to generate firm performance through new empirical data from the automotive industry in an emerging market, Turkey, where volatile market conditions may compel firms to use both their DCs and MCs. The automotive industry dynamic character, which is shaped by fierce competition among car manufacturers, fluctuating customer demands and strong effect of environmental forces, provides an ideal context for examining the performance outcomes of MC and DC in non-static environments. This study aims to show whether better financial performance can be achieved through an integrated MC and DC framework; if the level of environmental dynamism (ED) influences the utilization of MCs; and the impact of MC and DC convergence on firm performance by using emerging market data, which is rare in the extant literature. Design/methodology/approach This paper empirically investigates the role of MCs on the relationship between DCs and firm performance and the effect of ED in marketing capability development through a study of 162 top level managers from the automotive industry in Turkey using multiple regression methods. A self-administered questionnaire was used to collect data. A maximum concern was given to obtain at least three questionnaires from each firm to minimize the risk of getting biased answers from only one manager. Findings The data were analyzed by the regression method, and the mediation and moderation tests were conducted to test the established hypotheses. The direct relationship between MCs and firm performance was examined through linear regression, and a significant relationship was found (ss = 0.408; t = 5.656; p < 0.001). Pricing (ss = 0.404; p < 0.001), marketing research (ss = 0.367; p < 0.001) and marketing strategy and implementation (ss = 0.336; p < 0.001) had the strongest association with firm performance. The mediating role of MC on the relationship between DC and firm performance was assessed, and the analysis result yielded a significant result (ss = 0.439; t = 6.174; p < 0.001). Finally, the moderating effect of ED on the direct relationship between MC and firm performance was assessed. Yet, the interaction term was insignificant (ss = 0.013; t = 0.103; p = 0.918) in predicting firm performance. Research limitations/implications Although the data set covers a broad range of firms operating in the Turkish automotive industry, the generalization of findings should only be possible through obtaining fresh evidence from other emerging markets that possess the similar market characteristics of Turkey. The cross-sectional nature of the study may offer insights only for a certain period of time; thus, additional longitudinal studies are recommended to see the dynamic changes on the constructs and relationships between them. Future studies may also include qualitative methods, i.e. interviews with top managers to have a deeper understanding on how DC-MC interaction creates better performance. Practical implications This study empirically shows the importance of MCs for firm performance; thus, managers should allocate significant efforts and resources for improving MCs. The demand for the electric and even autonomous vehicles is likely to increase in the following years, and this new era in the automotive industry requires more R&D and innovation-based products, i.e. green vehicles with low carbon footprint, the use of robotics and long-life batteries for electric vehicles. The cost-related pricing may no longer be a competitive advantage for the firms in emerging markets such as Turkish automotive industry; thus, more investment for disruptive technologies should be considered. Originality/value The results show that MCs of firms mediated the relationship between DCs and economic performance. Yet, ED did not play a moderating role on the relationships between MCs and performance. It is concluded that DCs were associated with improved firm performance via MCs. Furthermore, the insignificant impact of ED on the development of MCs leading to better performance was explained by firms' given over-performing efforts in the context of emerging markets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e09608a1f0ebe6feb6ddc8477d08765",
  "timestamp": "2025-05-15T03:27:53.396503"
}