{
  "id": 7329,
  "title": "Mental health status of married women during COVID-19 pandemic in Bangladesh: A cross-sectional study",
  "abstract": "Aim: The uncontrolled spread of COVID-19 has demanded unparalleled measures, from the imposition of quarantine to the declaration as a public health emergency of international concern. COVID-19 poses a severe threat to our day-to-day life as well as physical and mental health. This study explores mental health status among married women that remain understudied in Bangladesh during the COVID-19 pandemic. Methodology: A cross-sectional study was conducted among 597 married women via face-to-face interview, maintaining all safety protocols. A semi-structured questionnaire was assembled that included socio-demographics and the DASS-21 scale. Descriptive analysis and logistic regression were performed to examine the associations between variables. Result: Almost 35% of the respondents had stress, 20% had anxiety, and 44% had depression ranging from mild to extremely severe. Metropolitan city inhabitants, being housewives, higher educational status, number of children, financial condition, comorbidities, family members assistance in household activities, relocation during COVID-19, social media use, concern about family, infected family members, tendency to get COVID-19 updates had been found significant in multivariable and univariate regression analysis with depression, anxiety, and stress. Conclusion: In this study, we found high rates of stress, anxiety, and depression among the study participants. These findings provide us with an epidemiological picture of the mental health status of our target population that could be a key benchmark for identifying high-risk groups and developing policies as well. Results could also be used to formulate psychological interventions that might be helpful during the COVID-19 period and later.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e0a66f9c0b2a72b8561455fbfe19346",
  "timestamp": "2025-05-15T03:07:31.875756"
}