{
  "id": 9084,
  "title": "The Nearest Neighborhood Method to Improve Uncertainty Estimates in Statistical Building Energy Models",
  "abstract": "Accurate estimation of uncertainty in energy use predictions from statistical models finds applications in a number of diverse areas of interest to building energy professionals. Examples include the determination of measured energy savings in monitoring and verification (M&V) projects; continuous commissioning; and automated fault detection, wherein improper building or equipment performance is to be detected. All these applications generally involve identifying a baseline statistical model representative of energy use prior to the retrofit (or to energy use under fault-free operation) and then ascertaining the energy savings (or the penalty for faulty operation) as the difference between the measured post-retrofit energy use and the corresponding model-predicted value. Unfortunately, the model residual outliers are ill-behaved, and estimates of the uncertainty in the energy savings tend to be unrealistic. Developing a general methodology for determining more realistic, robust, and credible estimates of the uncertainty in energy savings would be of great value and is the objective of this paper. The proposed approach is to determine the uncertainty from local system behavior rather than from global statistical indices of the model fit, such as root-mean-square error and other measures, as is the current practice. This is done using the nonparametric nearest-neighborhood-points approach, which is well known in traditional statistics. The methodology is applicable to any type of statistical model approach, such as regression, time series, and neural networks, and could be coded into a computer package that can be appended to existing M&V analysis programs. Two case study examples using daily building energy-use data serve to illustrate the proposed methodology. The ultimate benefit of such a reliable and statistically defensible method is to lend more credibility to the determination of risk associated with energy savings from energy efficiency projects and thereby induce financial agencies to become more involved in white tag and allied certification programs.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e1484d502c599b606e32c89f5f7c2a3",
  "timestamp": "2025-05-15T03:25:27.710475"
}