{
  "id": 7227,
  "title": "Assessing the impact of macroeconomic uncertainties on bank stability: Insights from ASEAN-8 countries",
  "abstract": "This research examines the effect of economic uncertainties on bank stability in ASEAN-8 countries. We use estimations with fixed effects for a panel dataset of bank stability, bank characteristics, banking system characteristics, and macroeconomic uncertainties from 2010 to 2020. Geopolitical risk (GPR), economic policy uncertainty (EPU), climate policy uncertainty (CPU), world pandemic uncertainty (WPU), global supply chain pressure (GSCP), and monetary policy uncertainty (MPU) are used as proxies for economic uncertainty (MU) in this research. We find that although an increase in macroeconomic uncertainties weakens bank stability, GPR is positively related to bank stability. An alternative measurement of bank stability, endogenous tests, and quantile regression corroborate our primary findings. Further analyses focus on the heterogeneous influence of macroeconomic uncertainties on bank stability with diversified bank specifics and the country's financial openness. Our paper supplies deep insights for bank managers and macro policymakers in the ASEAN region relevant to the effect of macroeconomic uncertainties on bank stability. Most crucially, experimental results from this research enrich a wealth of knowledge about the regional banking industry's stability; they are the basis for the establishment of bank strategies and macroprudential policies geared to managing the increased macro-unpredictability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e180fe9db67e34ac4a7c9696ce44bd7",
  "timestamp": "2025-05-15T03:06:35.350956"
}