{
  "id": 7849,
  "title": "Household income and maternal education in early childhood and activity-limiting chronic health conditions in late childhood: findings from birth cohort studies from six countries",
  "abstract": "Background We examined absolute and relative relationships between household income and maternal education during early childhood (<5 years) with activity-limiting chronic health conditions (ALCHC) during later childhood in six longitudinal, prospective cohorts from high-income countries (UK, Australia, Canada, Sweden, Netherlands, USA). Methods Relative inequality (risk ratios, RR) and absolute inequality (Slope Index of Inequality) were estimated for ALCHC during later childhood by maternal education categories and household income quintiles in early childhood. Estimates were adjusted for mother ethnicity, maternal age at birth, child sex and multiple births, and were pooled using meta-regression. Results Pooled estimates, with over 42 000 children, demonstrated social gradients in ALCHC for high maternal education versus low (RR 1.54, 95% CI 1.28 to 1.85) and middle education (RR 1.24, 95% CI 1.11 to 1.38); as well as for high household income versus lowest (RR 1.90, 95% CI 1.66 to 2.18) and middle quintiles (RR 1.34, 95% CI 1.17 to 1.54). Absolute inequality showed decreasing ALCHC in all cohorts from low to high education (range: -2.85% Sweden, -13.36% Canada) and income (range: -1.8% Sweden, -19.35% Netherlands). Conclusion We found graded relative risk of ALCHC during later childhood by maternal education and household income during early childhood in all cohorts. Absolute differences in ALCHC were consistently observed between the highest and lowest maternal education and household income levels across cohort populations. Our results support a potential role for generous, universal financial and childcare policies for families during early childhood in reducing the prevalence of activity limiting chronic conditions in later childhood.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e1bcf86942df221dc2c06b7cae719e2",
  "timestamp": "2025-05-15T03:12:36.536032"
}