{
  "id": 6290,
  "title": "Financial toxicity in cancer patients and subsequent risk of repeat acute care utilization",
  "abstract": "Background: Acute care (AC) visits by cancer patients are costly sources of healthcare resources and can exert a financial burden of oncology care both for individuals with cancer and healthcare systems. We sought to identify whether cancer patients who reported more severe initial financial toxicity (FT) burdens shouldered excess risks for acute care utilization.Methods: In 225 adult patients who participated in the Economic Strain and Resilience in Cancer (ENRICh) survey study of individuals receiving ambulatory cancer care between March and September 2019, we measured the baseline FT (a multidimensional score of 0-10 indicating the least to most severe global, material, and coping FT burdens). All AC visits, including emergency department (ED) and unplanned hospital admissions, within 1-year follow-up were identified. The association between the severity of FT and the total number of AC visits was tested using Poisson regression models.Results: A total of 18.6% (n = 42) of patients had any AC visit, comprising 64.3% hospital admissions and 35.7% ED visits. Global FT burden was associated with the risk of repeat AC visits within 1-year follow-up (RR = 1.17, 95% CI 1.07-1.29, P < 0.001 for every unit increase), even after adjusting for sociodemographic and disease covariates. When examining subdimensions of FT, the burden of depleted FT coping resources (coping FT) was strongly associated with the risk of repeat AC visits (RR = 1.27, 95% CI 1.15-1.40, P < 0.001) while material FT burden showed a trend toward association (RR = 1.07, 95% CI 0.99-1.15, P = 0.07).Conclusion: In this prospective study of acute oncology care utilization outcomes among adult cancer patients, FT was a predictor of a higher burden of acute care visits. Patients with severely depleted material and also practical and social coping resources were at particular risk for repeated visits. Future studies are needed to identify whether early FT screening and intervention efforts may help to mitigate urgent acute care utilization burdens.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e280aef89195cdad3ff3e4472d50b4a",
  "timestamp": "2025-05-15T02:56:37.493781"
}