{
  "id": 258,
  "title": "Hierarchical Clustering as a Dimension Reduction Technique in the Markowitz Portfolio Optimization Problem",
  "abstract": "Optimal portfolio selection is a common and important solution to an optimization problem. It is often difficult to apply existing methods of optimal portfolio selection in practice, because of the large number of securities available for investment (and, as a consequence, the high dimensionality of the input data). In this article, we propose a method to reduce the dimensionality of the input data based on the hierarchical clustering of the securities available for investment. Many algorithms and methods have already been developed for clustering widely used in computer science. Pearson's pairwise correlation coefficient is used as a measure of proximity of securities for hierarchical clustering. Next, we investigate the impact of the proposed method on the quality of the optimal solution obtained using several examples of the optimal portfolio selection according to the Markowitz model. The influence of hierarchical clustering parameters (intercluster distance metrics and clustering threshold value) on the change in the quality of the obtained optimal solution is also examined. The dependence between the target portfolio return and dimensionality reduction using the proposed method is analyzed. For each considered example, graphs and tables with the main obtained results of the application of the method are given: dimensionality reduction and return drop (reduction of the quality of the optimal solution) of the portfolio selected using the proposed method as compared to the portfolio selected without the proposed method. The Python programming language and its libraries are used for the experiments: SciPy for clustering and CVXPY for solving the optimization problem (optimal portfolio selection).",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e398a88041655a7ab91aea4ca5b5bc1",
  "timestamp": "2025-05-15T00:41:04.757066"
}