{
  "id": 5830,
  "title": "Cryptocurrency and audit report lag: new evidence from the European countries",
  "abstract": "PurposeThis study aims to examine the relation between the audit risk and the audit report lag (ARL), in the context of popularity of blockchain-based cryptocurrency used as a financial asset by the firms.Design/methodology/approachThis study uses a quantitative research approach, using pooled ordinary least squares regression and quantile regression methodologies to analyse the impact of blockchain-based cryptocurrency (Bitcoin trading volume) on audit report lag (ARL). A sample of 84 country-year observations from 12 European countries, where crypto asset trading is legally allowed, is analysed for the years 2013-2019. Audit report lag data is sourced from the Audit Analytics database, while country-level control variables are obtained from the World Bank database. The robustness of the results is further tested to ensure consistency and reliability.FindingsThe findings indicate that this paper will observe an increase in the engagement of the firm's stakeholders because of timely audited information. Policymakers will get a better understanding about how to use disruptive technology to reduce the adverse consequences related to ARL.Research limitations/implicationsThe findings of this study will assist audit firms to find how to generate timely report, which will help their client firms to enhance trust among their stakeholders in their quality financial reports. In addition, the theoretical models supporting the findings will help the firms to understand when to adapt the recent technology and how their choice of adaptation of technology could assist their audit firms to produce timely reports.Originality/valueThe findings will help the audit firms to understand the significance of the use of blockchain technology to efficiently assess the main audit risks and how to produce quality audit reports on time.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e40a9d3b661fb9738b77c0d32ff9d38",
  "timestamp": "2025-05-15T02:51:58.567691"
}