{
  "id": 1668,
  "title": "Modeling the Performance Indicators of Financial Assets with Neutrosophic Fuzzy Numbers",
  "abstract": "This research sets the basis for modeling the performance indicators of financial assets using triangular neutrosophic fuzzy numbers. This type of number allows for the modeling of financial assets performance indicators by taking into consideration all the possible scenarios of their achievement. The key performance indicators (KPIs) modeled with the help of triangular fuzzy neutrosophic numbers are the return on financial assets, the financial assets risk, and the covariance between financial assets. Thus far, the return on financial assets has been studied using statistical indicators, like the arithmetic and geometric mean, or using the financial risk indicators with the help of the squared deviations from the mean and covariance. These indicators are well known as the basis of portfolio theory. This paper opens the perspective of modeling these three mentioned statistical indicators using triangular neutrosophic fuzzy numbers due to the major advantages they have. The first advantage of the neutrosophic approach is that it includes three possible symmetric scenarios of the KPIs achievement, namely the scenario of certainty, the scenario of non-realization, and the scenario of indecision, in which it cannot be appreciated whether the performance indicators are or are not achieved. The second big advantage is its data series clustering, representing the financial performance indicators by which these scenarios can be delimitated by means of neutrosophic fuzzy numbers in very good, good or weak performance indicators. This clustering is realized by means of the linguistic criteria and measuring the belonging degree to a class of indicators using fuzzy membership functions. The third major advantage is the selection of risk mitigation analysis scenarios and the formation of financial assets' optimal portfolios.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e48eecddf9483aa1b8eb99c844d139b",
  "timestamp": "2025-05-15T02:06:22.389584"
}