{
  "id": 8661,
  "title": "Gaps in Insurance Coverage for Pediatric Patients With Acute Lymphoblastic Leukemia",
  "abstract": "Purpose Continuous insurance coverage is an important component of effective health care. Evaluation of insurance gaps in pediatric cancer care is an understudied area. Methods We conducted a retrospective analysis of payer data from outpatient oncology encounters at Primary Children's Hospital (Salt Lake City, UT) over the first 2 years of therapy for pediatric patients with acute lymphoblastic leukemia diagnosed from 1998 to 2010 (N = 380). Using logistic regression, we evaluated demographic and clinical predictors (age at diagnosis, sex, ethnicity, high/standard acute lymphoblastic leukemia risk, and rural/urban county of residence at diagnosis) of a gap in health insurance. Results The median age at diagnosis was 4 years (interquartile range, 3 to 8 years), and 172 patients (45%) were girls. In the first 2 years of treatment, 45 patients (12%) experienced a gap in health insurance. The odds of having a gap in insurance coverage decreased by 16% each year from 1998 to 2010 (odds ratio, 0.84; 95% CI, 0.76 to 0.93; test for trend, P = .001). Public insurance at diagnosis was associated with a four-fold increased likelihood of experiencing an insurance gap (odds ratio, 4.09; 95% CI, 1.98 to 8.44; P < .001) compared with patients with private insurance at diagnosis. Conclusion Gaps in insurance coverage during pediatric cancer treatment are not uncommon, which highlights the importance of discussing insurance status at diagnosis and throughout a patient's treatment course to help patients and their families prepare for any changes and avoid unnecessary financial burden. Future research should focus on examining the effect of insurance gaps on patient outcomes and evaluating likelihood of gaps in insurance after health care reform.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e4b00883fcaedb6a34a0252dc0c6e96",
  "timestamp": "2025-05-15T03:20:56.009989"
}