{
  "id": 7288,
  "title": "Shareholders' wealth dynamics: study of M&A announcements and target and acquirer financial performance in the Indian corporate landscape",
  "abstract": "Purpose - The article investigates the wealth generation from takeover bids through an event study, analyzing the impact of announcements on stock returns of target and bidder firms across the industries and related and unrelated industry acquisitions. It aims to provide insights into financial implications for shareholders and market participants, contributing to understanding merger dynamics and informing investment decisions. Design/methodology/approach - The methodology involves data collection of announcement dates, defining event and estimation windows. Market models and four-factor models are applied to compute abnormal returns. Linear regression estimates return, which is aggregated and tested for significance, providing insights into the wealth effects of takeover announcements. Findings - Analysis reveals positive returns for both firms' shareholders on the announcement day, particularly significant for target firms. Pre-announcement, positive abnormal returns suggest potential information leakage, but reverse post announcement. Comparative model analysis emphasizes the role of systematic risk. Notably, a prolonged bidding process benefits the target firm. Trading in target company stocks under unrelated industry acquisitions appears to be more beneficial during the bidding. Originality/value - This article introduces a novel approach by utilizing a four-factor model for computing abnormal returns, unlike previous research relying solely on the market model. It also focuses separately on related and unrelated industry acquisitions. This methodology captures comprehensive systematic risk, resulting in more conservative and robust abnormal returns. This methodological advancement addresses existing gaps in the literature and provides actionable insights for stakeholders in mergers and acquisitions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e55675c7164ee74ef12b1649adc9aec",
  "timestamp": "2025-05-15T03:07:02.630292"
}