{
  "id": 2913,
  "title": "Analysis of aggregation between the components of financial literacy through inconsistency in intertemporal choices",
  "abstract": "Financial literacy refers to skills and knowledge needed to make responsible financial decisions. It, therefore, consists of a set of components, including basic knowledge, money management skills, understanding of financial products, risk awareness, planning and self-control. It can be broken down into three main components: financial knowledge, financial behaviour and financial attitude. Since a good level of financial literacy leads to more informed choices, the present paper investigates which method of aggregation between the three main components is the best to quantify the degree of financial literacy. The operators under investigation, with respect to the sum operation, are the OWA and the Choquet integral. The comparison measure for ranking the quality of decision-making refers to the degree of inconsistency in intertemporal choices using a direct measure between normative and empirical preferences defined by recent research. Results prove that Choquet's integral defines a better match between the aggregation of the components of financial literacy and the quality of choices in the intertemporal context. The applicability of the present work aims, through a multidisciplinary approach involving mathematical finance and multi-criteria methods, to support the client classification requirement of the Markets in Financial Instrument Directive.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e5705ce166e89187093d873a2413537",
  "timestamp": "2025-05-15T02:20:48.091849"
}