{
  "id": 8960,
  "title": "A Laparoscopic Approach Does Reduce Short-Term Complications in Patients Undergoing Ileal Pouch-Anal Anastomosis",
  "abstract": "BACKGROUND: Studies to date examining the impact of laparoscopy in the IPAA have failed to demonstrate a significant, consistent benefit in terms of a reduction in short-term morbidity or length of stay. OBJECTIVE: The aim of this study was to establish the impact of the operative approach (laparoscopic or open) on outcomes after IPAA formation. DESIGN, SETTING, AND PATIENTS: With use of the American College of Surgeons National Surgical Quality Improvement Program participant use file (2005-2008), the records of patients who underwent open or laparoscopic IPAA with diverting ileostomy were examined. MAIN OUTCOME MEASURES: Risk-adjusted 30-day outcomes and length of stay were assessed by use of regression modeling, adjusting for patient characteristics, comorbidities, and operative approach. RESULTS: Six hundred seventy-six cases were included, of which 339 (50.1%) were laparoscopic procedures. After adjustment, a laparoscopic approach was associated with a lower rate of major (OR = 0.67, 95% CI: 0.45-0.99, P = .04) and minor (OR = 0.44, 95% CI: 0.27-0.70, P = .01) complications. Laparoscopy was not associated with a significant reduction in length of postoperative stay compared with open pouch formation (laparoscopic vs open approach, -0.05 +/- 0.30 d (P = .87)). LIMITATIONS: The sampling strategy used by the National Surgical Quality Improvement Program means that only a proportion of all relevant cases would have been analyzed and no data are available about the potential impact of surgeon experience on outcome. CONCLUSIONS: A laparoscopic approach to ileal pouch formation was associated with a significant reduction in both major and minor complications compared with the traditional open approach. Given the high financial costs associated with complications arising from this procedure, this study provides support for the adoption of the laparoscopic approach in the formation of an IPAA.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e5cb62af813ee90198e96fb5f5e5ebf",
  "timestamp": "2025-05-15T03:23:56.194857"
}