{
  "id": 1575,
  "title": "Modelling seasonal pasture growth and botanical composition at the paddock scale with satellite imagery",
  "abstract": "Seasonal pasture monitoring can increase the efficiency of pasture utilization in livestock grazing enterprises. However, manual monitoring of pasture over large areas is often infeasible due to time and financial constraints. Here, we monitor changes in botanical composition in Tasmania, Australia, through application of supervised learning using satellite imagery (Sentinel-2). In the field, we measured ground cover and botanical composition over a 12-month period to develop a supervised classification approach used to identify pasture classes. Across seasons and paddocks, the approach predicted pasture classes with 75-81 % accuracy. Botanical composition varied seasonally in response to biophysical factors (primarily climate) and grazing behaviour, with seasonal highs in spring and troughs in autumn. Overall, we demonstrated that 10-m multispectral imagery can be reliably used to distinguish between pasture species as well as seasonal changes in botanical composition. Our results suggest that farmers and land managers should aim to quantify within-paddock variability rather than paddock average cover, because the extent and duration of very low ground cover puts the paddock/field at risk of adverse grazing outcomes, such as soil erosion and loss of pasture biomass, soil carbon and biodiversity. Our results indicate that satellite imagery can be used to support grazing management decisions for the benefit of pasture production and the improvement of environmental sustainability.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e663eddcb3da9dadf01c12d7da8033d",
  "timestamp": "2025-05-15T02:05:08.124596"
}