{
  "id": 6363,
  "title": "Relationship Between Financial Toxicity and Surgical Treatment for Early-Stage Breast Cancer: A Propensity Score-Matched Comparison of Breast-Conserving Therapy and Mastectomy",
  "abstract": "BACKGROUND: Financial toxicity (FT) can lead to decreased quality of life and poor treatment outcomes. However, there is limited published data on the extent to which the various surgical treatment approaches for early-stage breast cancer are determinants for FT. STUDY DESIGN: We performed a single-institution cross-sectional survey of adult female patients with stage 0 to II breast cancer undergoing unilateral breast-conserving therapy or unilateral mastectomy. FT was measured using the Comprehensive Score for Financial Toxicity (COST) survey. Propensity matching was performed to optimize comparability of study groups. A multivariate regression model was used to identify factors associated with worsening FT as a robustness check. Our secondary end point was prevalence of coping strategies associated with cost of cancer care. RESULTS: Among 294 patients who met inclusion criteria, 203 underwent breast-conserving therapy and 91 received mastectomy. We generated 72 total matched pairs and noted no differences in demographic and socioeconomic characteristics. Of these, 55 pairs had complete COST information, which was comparable on adjusted analysis (26.6 vs 24.7; p = 0.481). High annual income (0 = 4.83; p < 0.001) and supplemental insurance (0 = 5.37; p < 0.001) were significantly associated with higher COST scores, while change in employment status (0 = -4.81; p < 0.001) correlated significantly with lower COST scores. No significant differences were observed in coping strategies. CONCLUSIONS: Choice of BCT or mastectomy was not associated with a differential risk for FT in early-stage cancer. Decisions on ablative approach should be made based on patient preferences and disease-specific criteria. Transparent counseling on FT for high-risk populations promotes patient-centricity. (C) 2021 by the American College of Surgeons. Published by Elsevier Inc. All rights reserved.)",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e6b10186d4bb482c92127ece9a5ce5f",
  "timestamp": "2025-05-15T02:57:38.672131"
}