{
  "id": 7587,
  "title": "Factors affecting time to treatment initiation after diagnosis for multidrug-resistant/rifampicin-resistant tuberculosis patients: A mixed-methods study in Jakarta, Indonesia",
  "abstract": "Objective: To investigate the time to treatment initiation (TTI) for multidrug-resistant/rifampicin-resistant tuberculosis (MDR/RR-TB) patients after diagnosis in Indonesia and biological, psychological and social factors associated with the time interval. Methods: This study was conducted in Persahabatan Hospital, Jakarta using a mixed-methods approach. Registry data and medical records of MDR/RR-TB patients were collected and matched (hospital dataset), and linked with psychosocial assessment results (linked dataset). Descriptive analysis was conducted to understand patient characteristics and the distribution of TTI after RR-TB diagnosis by GeneXpert. Generalised linear regression was used to analyse factors associated with delay duration, and logistic regression to explore factors associated with the delay longer than the median duration for both datasets (basic vs. extended model). In-depth interviews were conducted with patients and healthcare workers to understand the procedure of treatment initiation and how different factors led to delay. Results: The hospital dataset included 275 patient-matched cases, and 188 were further linked with psychosocial assessment results. The median time interval was 24 days [interquartile range (IQR) 23.5] and 26 days (IQR 21.25), respectively. Regression analysis showed that in the extended model, comorbidities (exp [coefficient] = 1.93), unemployment (exp [coefficient] = 1.80) and poor knowledge of MDR/RR-TB (exp (coefficient) = 1.67) seemed to have the strongest effects on prolonging the time interval (p < 0.05). Unsuccessful TB treatment history was the only factor that significantly increased the risk of delay longer than the median duration (p < 0.05) in the basic model, while none of the factors were significant in the extended model. The qualitative study identified provider-side factors (centralised service provision and insufficient human resources) and patient-side factors (physical weakness, psychological stress and financial concern) associated with treatment delay. Conclusion: MDR/RR-TB patients in Persahabatan Hospital, Jakarta, Indonesia waited around 25 days for treatment initiation after RR-TB diagnosis. Health system solutions are needed to address challenges facing both MDR/RR-TB patients and healthcare providers to reduce delay in treatment initiation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e86e9808fb67fcb3aac0ee768ab1c04",
  "timestamp": "2025-05-15T03:10:05.564644"
}