{
  "id": 8589,
  "title": "Incidence of Acute Cystoid Macular Edema after Starting a Prostaglandin Analog Compared with Other Classes of Glaucoma Medications",
  "abstract": "Purpose: There is a longstanding belief that prostaglandin analogs (PGAs) may predispose patients with glaucoma to develop acute cystoid macular edema (CME). However, there is little solid evidence supporting this notion. The purpose of this study is to compare CME incidence rates among patients initiating treatment with different glaucoma medication classes. Design: Database study. Participants: A total of 39 948 patients who were newly prescribed glaucoma medications Methods: Using data from 10 health systems contributing data to the Sight Outcomes Research Collaborative Ophthalmology Data Repository, we identified all adults with glaucoma who had been newly started on a topical glaucoma medication. Patients with pre-existing documentation of macular edema were excluded. We assessed the incidence of CME among patients with glaucoma who were newly started on PGAs, topical beta blockers (BBs), alpha agonists (AAs), and carbonic anhydrase inhibitors (CAIs). Using multivariable logistic regression, and adjusting for sociodemographic factors, we assessed the odds of developing CME among patients prescribed each of the 4 glaucoma medication classes. We also performed a subset regression analysis including lens status as a covariate. Main outcome measures: Incidence of CME within 3 months of initiating therapy with different topical glaucoma medications. Results: Among the 39 948 patients who were newly treated with a topical glaucoma medication, 139 (0.35%) developed CME. The incidence of CME was 0.13%, 0.65%, 0.55%, and 1.76% for users of PGAs, BBs, AAs, and CAIs, respectively. After adjusting for sociodemographic factors, users of topical BBs, AAs, and CAIs had substantially higher odds of developing CME compared with PGA users (P < 0.001 for all comparisons). The subset analysis also showed higher odds ratio of the non-PGA medication classes in association with CME. Conclusions: Clinicians should reconsider the notion that PGAs carry a higher risk of CME versus other glaucoma medication classes. If additional studies support the findings of these analyses, clinicians may feel more comfortable prescribing PGAs to patients with glaucoma without fear they will predispose patients to CME. Financial Disclosures: Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Glaucoma 2025;8:4-11 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e861c71cb89abce280d8a91f77eabd5",
  "timestamp": "2025-05-15T03:20:22.247551"
}