{
  "id": 8707,
  "title": "Role of Area-Level Access to Primary Care on the Geographic Variation of Cardiometabolic Risk Factor Distribution: A Multilevel Analysis of the Adult Residents in the Illawarra-Shoalhaven Region of NSW, Australia",
  "abstract": "Background:Access to primary care is important for the identification, control and management of cardiometabolic risk factors (CMRFs). This study investigated whether differences in geographic access to primary care explained area-level variation in CMRFs.Methods:Multilevel logistic regression models were used to derive the association between area-level access to primary care and seven discrete CMRFs after adjusting for individual and area-level co-variates. Two-step floating catchment area method was used to calculate the geographic access to primary care for the small areas within the study region.Results:Geographic access to primary care was inversely associated with low high density lipoprotein (OR 0.94, CI 0.91-0.96) and obesity (OR 0.91, CI 0.88-0.93), after adjusting for age, sex and area-level disadvantage. The intra-cluster correlation coefficient (ICCs) of all the fully adjusted models ranged between 0.4-1.8%, indicating low general contextual effects of the areas on CMRF distribution. The area-level variation in CMRFs explained by primary care access was <= 10.5%.Conclusion:The findings of the study support proportionate universal interventions for the prevention and control of CMRFs, rather than any area specific interventions based on their primary care access, as the contextual influence of areas on all the analysed CMRFs were found to be minimal. The findings also call for future research that includes other aspects of primary care access, such as road-network access, financial affordability and individual-level acceptance of the services in order to gain an overall picture of the area-level contributing role of primary care on CMRFs in the study region.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e88ff1cf6286c9bc3fd88fa2c980bfc",
  "timestamp": "2025-05-15T03:21:24.737144"
}