{
  "id": 8578,
  "title": "Decomposing health inequality with population-based surveys: a case study in Rwanda",
  "abstract": "Background: Ensuring equal access to care and providing financial risk protection are at the center of the global health agenda. While Rwanda has made impressive progress in improving health outcomes, inequalities in medical care utilization and household catastrophic health spending (HCHS) between the impoverished and non-impoverished populations persist. Decomposing inequalities will help us understand the factors contributing to inequalities and design effective policy instruments in reducing inequalities. This study aims to decompose the inequalities in medical care utilization among those reporting illnesses and HCHS between the poverty and nonpoverty groups in Rwanda. Methods: Using the 2005 and 2010 nationally representative Integrated Living Conditions Surveys, our analysis focuses on measuring contributions to inequalities from poverty status and other sources. We conducted multivariate logistic regression analysis to obtain poverty's contribution to inequalities by controlling for all observed covariates. We used multivariate nonlinear decomposition method with logistic regression models to partition the relative and absolute contributions from other sources to inequalities due to compositional or response effects. Results: Poverty status accounted for the majority of inequalities in medical care utilization (absolute contribution 0.093 in 2005 and 0.093 in 2010) and HCHS (absolute contribution 0.070 in 2005 and 0.032 in 2010). Health insurance status (absolute contribution 0.0076 in 2005 and 0.0246 in 2010) and travel time to health centers (absolute contribution 0.0025 in 2005 and 0.0014 in 2010) were significant contributors to inequality in medical care utilization. Health insurance status (absolute contribution 0.0021 in 2005 and 0.0011 in 2010), having under-five children (absolute contribution 0.0012 in 2005 and 0.0011 in 2010), and having disabled family members (absolute contribution 0.0002 in 2005 and 0.0001 in 2010) were significant contributors to inequality in HCHS. Between 2005 and 2010, the main sources of the inequalities remained unchanged. Conclusions: Expanding insurance coverage and reducing travel time to health facilities for those living in poverty could be used as policy instruments to mitigate inequalities in medical care utilization and HCHS between the poverty and non-poverty groups.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e914ad24daa57096989fde4257a32d6",
  "timestamp": "2025-05-15T03:20:22.203397"
}