{
  "id": 943,
  "title": "Innovative Risk Early Warning Model Based on Internet of Things Under Big Data Technology",
  "abstract": "An innovative financial risk early warning model based on the Internet of Things (IoT) big data technology is proposed to maintain the long-term stable development of Internet finance. The Internet credit finance is introduced, a financial risk identification method based on the big data technology is proposed, and a risk assessment method for Internet finance based on back propagation neural network (BPNN) is put forwarded in this study. The actual Internet financial data is selected for verification and analysis. The results reveal that the identification and prediction model of Internet credit finance risk based on big data technology can realize risk analysis of online credit in the Internet credit finance, and can give corresponding credit ratings to new customers on credit platforms. The training error is the lowest when the number of hidden layer nodes is 14; and the training error is the smallest when the learning rate is 0.06; Based on the BPNN, it can accurately assess the financial risks of the Internet credit platform, and the accuracy of its risk level prediction has reached 100%. This study can provide a theoretical basis for the application of IoT big data technology and neural network models in the financial field, and also give an important reference for the risk management of Internet finance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e92f06587ca1b7d77f8788705401542",
  "timestamp": "2025-05-15T01:56:49.655177"
}