{
  "id": 3701,
  "title": "The hedging role of US and Chinese stock markets against economic and trade policy uncertainty: lessons from recent turbulences",
  "abstract": "PurposeThis study analyses the impact of economic and trade policy uncertainty on US and Chinese stock markets. Also, this study examines the hedge and safe-haven properties of US and China stocks against both US and Chinese economic and trade policy uncertainty.Design/methodology/approachTo achieve the desired goals, the authors employ Dynamic Conditional Correlation through Glosten et al. (1993) model based on the Generalized Autoregressive Conditional Heteroscedasticity (DCC-GJR-GARCH (1, 1)) and Quantile cross-spectral (QS) models. The study uses monthly observations spanning from March 2010 to June 2022.FindingsThis study evidence that the economic and trade policy uncertainty between USA and China is extremely sensitive and has high volatility clustering effects on DJChina88 and DJUS, respectively. Conversely, against the Chinese economic and trade policy uncertainty, the US stock market indexes show both hedging properties across the period and safe-haven during COVID-19 and Russia-Ukraine crises. In contrast, among the Chinese stock markets, only DJShenzhen and DJShanghai stock indices might provide strong hedging and safe-haven properties against the US economic and trade policy uncertainties; however, DJShenzhen (DJChina88) stock shows weak hedge and safe-haven properties (hedging benefits) against Chinese trade policy uncertainty (CTPU) (Chinese economic policy uncertainty [CEPU]).Practical implicationsThe findings have significant implications for investors, portfolio managers and regulators in hedging and making proper decisions under uncertain circumstances.Originality/valueThe study extends the literature on stock market performance to cover the economic and trade policy uncertainty by providing novel evidence during the recent COVID-19 and Russia-Ukraine invasion.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e98007b2f037615069490739958c449",
  "timestamp": "2025-05-15T01:20:03.395195"
}