{
  "id": 3540,
  "title": "B2B eCommerce: an empirical investigation of information exchange and firm performance",
  "abstract": "Purpose - The purpose of this study is to evaluate the performance effects of information exchange by observing actual information exchange between industrial trading partners. Information exchange facilitates coordination through sharing both order cycle and enhanced information. Increased exchange may lead to closer relationships with the expectation of improved performance. This study moves away from perceived measures of information exchange and firm performance by integrating two datasets: one capturing historical firm performance and the second capturing electronic information exchange data. Design/methodology/approach - Quantitative data of electronic information exchange between firms are observed and compared with operational performance results. Longitudinal regression analyses are conducted using data gathered from an electronically-mediated industrial exchange network. This unique dataset provides distinct insights into the application and performance outcomes related to information exchange. Findings - Results show that information characteristics vary by firm and the position of the firm within the supply chain. Manufacturers benefit from exchanging more basic information and from stability in their trading partner portfolio. Retailers enhance performance when there is more turnover in their trading partner portfolio and when information is exchanged reciprocally with suppliers. Practical implications - Results from this study provide insight into the potential performance outcomes of sharing information within industrial relationships. The study demonstrates how greater information exchange changes the nature of supply chain relationships. Closer supply chain relationships may improve firm performance, but the extent of this varies based on the firm's position within its supply chain. Consequently, firms should consider the strategic implications of the way in which they exchange information with their trading partners. Originality/value - This study contributes to the literature by identifying and testing specific information characteristics using actual observed exchanges of information between firms. The data set supports the measurement of information exchange between multiple firms and trading partners which allows for testing at a level of granularity beyond existing studies.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e9c0d34a0a82900e42981df93daa190",
  "timestamp": "2025-05-15T01:18:20.488515"
}