{
  "id": 3143,
  "title": "Forty years of directed evolution and its continuously evolving technology toolbox: A review of the patent landscape",
  "abstract": "Generating functional protein variants with novel or improved characteristics has been a goal of the biotechnology industry and life sciences, for decades. Rational design and directed evolution are two major pathways to achieve the desired ends. While rational protein design approach has made substantial progress, the idea of using a method based on cycles of mutagenesis and natural selection to develop novel binding proteins, enzymes and structures has attracted great attention. Laboratory evolution of proteins/enzymes requires new tools and analytical approaches to create genetic diversity and identifying variants with desired traits. In this pursuit, construction of sufficiently large libraries of target molecules to search for improved variants and the need for new protocols to alter the properties of target molecules has been a continuing challenge in the directed evolution experiments. This review will discuss the in vivo and in vitro gene diversification tools, library screening or selection approaches, and artificial intelligence/machine-learning-based strategies to mutagenesis developed in the last 40 years to accelerate the natural process of evolution in creating new functional protein variants, optimization of microbial strains, and transformation of enzymes into industrial machines. Analyzing patent position over these techniques and mechanisms also constitutes an integral and distinctive part of this review. The aim is to provide an up-to-date resource/technology toolbox for research-based and pharmaceutical companies to discover the boundaries of competitor's intellectual property (IP) portfolio, their freedom-to-operate in the relevant IP landscape, and the need for patent due diligence analysis to rule out whether use of a particular patented mutagenesis method, library screening/selection technique falls outside the safe harbor of experimental use exemption. While so doing, we have referred to some recent cases that emphasize the significance of selecting a suitable gene diversification strategy in directed evolution experiments.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0e9d6d69b2226e841b23d17173ceab7a",
  "timestamp": "2025-05-15T01:14:16.128365"
}