{
  "id": 5702,
  "title": "Mandatory climate disclosures: impacts on energy and agriculture markets",
  "abstract": "PurposeWith the rise of mandating climate-related disclosures (CRD), this paper aims to investigate how energy and agriculture markets are exposed to climate disclosure risk.Design/methodology/approachUsing the multivariable simultaneous quantile regression and data from 1 January 2017 to 29 February 2024, the authors examine daily and monthly responses of energy and agriculture markets to climate disclosure risk, energy risk, market sentiment, geopolitical risk and economic policy risk. The sample covers the global market, Australia, Canada, European Union (EU), Hong Kong, Japan, New Zealand, Singapore, the UK and the USA.FindingsThe results show that climate disclosure risk creates both positive and negative shocks in the energy and agriculture markets, and the impacts are asymmetric across quantiles in different economies. The higher the climate disclosure risk, the greater impact of crude oil future on the energy sector in North America (Canada and the USA) and Europe (EU and the UK), but no greater effects in Asia Pacific (Australia, New Zealand and Singapore). The agriculture sector can hedge against economic policy and geopolitical risks, but it is highly exposed to climate disclosure and energy risks.Originality/valueThis study timely contributes to the modest literature on the asymmetric effects of climate disclosure risk on the energy and agriculture markets at the global and national levels. The findings offer practical implications for policymakers and investment practitioners in understanding financial effects of mandating CRD to diversify risks depending upon market conditions and policy uncertainty.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ea089f4f86c7d4c93d08e011ef30266",
  "timestamp": "2025-05-15T02:50:21.333805"
}