{
  "id": 3977,
  "title": "Electricity Consumption and Economic Growth Nexus: Evidence from Maki Cointegration",
  "abstract": "The current study revisits the dynamic relationship between electricity consumption, real gross domestic product per capita and carbon dioxide emissions in Nigeria. To do this, we adopt the Zivot-Andrews (1992) unit root test to ascertain the stationarity properties of the interest variables. Maki (2012) cointegration test which accounts for multiple structural breaks is used for long-run equilibrium relationship between the variables while the long run regressions of dynamic ordinary least square (DOLS) and fully modified ordinary least square (FMOLS) for long-run coefficients as estimation techniques. The direction of causality is detected via the Toda-Yamamoto (1995) causality test for annual time series data from 1971-2014. Empirical evidence shows there exists a long-run equilibrium relationship between electricity consumption, real gross domestic product per capita and carbon dioxide emissions. The long-run regression suggests statistical significant and positive relationship between economic growth and electricity consumption. Thus, validating the electricity-induced growth hypothesis for Nigeria. According to the Toda-Yamamoto (1995) causality test, one-way causality is observed from electricity consumption to economic growth. This is in line with apriori expectation. However, there is an environmental implication of our study findings as elecfricity consumption spur increases carbon dioxide emissions. It is on the above premise that the study calls for diversification of Nigeria's energy portfolio to cleaner/environmental friendly sources like renewables.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0eb4556522b150299deff83c8fd64da8",
  "timestamp": "2025-05-15T01:22:39.417473"
}