{
  "id": 8140,
  "title": "Seizures in dogs under primary veterinary care in the United Kingdom: Etiology, diagnostic testing, and clinical management",
  "abstract": "Background Although seizures are common in dogs, limited published information is available on the classifications of seizures, diagnostic approaches, or clinical management of seizure-affected patients in the veterinary primary care setting. Objectives Explore seizure etiology, diagnostic testing, and clinical management of seizure-affected dogs in the primary care veterinary setting. Animals A total of 455 553 dogs in VetCompass. Methods Cross-sectional analysis by cohort clinical data. Results From 2834 incident seizure cases, we identified 579 (20.5%) dogs with epilepsy based on the International Veterinary Epilepsy Task Force (IVETF) classification system, including 484 (17.1%) with idiopathic epilepsy, 95 (3.4%) with structural epilepsy, and 179 dogs (6.3%) with reactive seizures. In their clinical first opinion records, 245 (8.6%) cases were recorded with epilepsy. Overall, 1415 (49.9%) cases received diagnostic evaluation equivalent to or higher than IVETF Tier 1 diagnostic testing. Being <12 years of age and being insured were risk factors for receiving IVETF Tier 1 or higher diagnostic evaluation among seizure cases. Anti-seizure drug (ASD) treatment was not prescribed for 1960/2834 (69.2%) dogs in association with the incident seizure event. Of the remainder, 719 (25.3%) dogs received 1 ASD, whereas 155 (5.5%) an ASD combination. Conclusion and clinical importance The differences between seizure classifications in the clinical records and those retrospectively assigned by the researchers support the need for clearer diagnostic guidelines in clinical practice. Insured dogs and dogs <12 years of age were more likely to receive advanced diagnostic evaluation, suggesting that financial and perceived prognostic factors influence case management.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0eb5f7b14161839f9feef4b53815a963",
  "timestamp": "2025-05-15T03:15:38.410755"
}