{
  "id": 5125,
  "title": "Neural- Network- based Evaluation of the Effect of Variable on Time Contingency Estimation",
  "abstract": "Implementing the project without considering risk variables is practically impossible. The consequences of these variables such as non-estimated raw material, lack of coordination with subcontractors, boycott, economical conditions, financial resources, etc. directly affect the estimated time. In major industries, regarding the large scope of work and exorbitant cost; clients tend to conclude the EPC contract in order to transfer the consequence of risks. The failure of executing projects within the predicted time schedule is not only due to surplus cost imposed on contractors to eliminate the obstacles, but also causes some delay penalties, opposing to release Good Performance Guarantees, any Payment Reduction and additional related to the extension of the insurances. Estimating safety time to present time schedule to the clients is applied in this paper. In this research, a back-propagation neural network is used to learn the relationship between real and forecast time. This is achieved by training the network with dwelling on 120 projects of engineering, procurement and construction (EPC project) in one of the Iran Power Plant projects Management Companies, 20 projects for validation and tests the model by focusing on 20 projects. According to the validation cross and results, it was found that the relation between the actual output and network output with the average value of 0.68 was relatively good. Furthermore, MAD, Bias and tracking signal were demonstrated the positive estimation trend in training data.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ec524d5c9dc3b60918319a8b6841867",
  "timestamp": "2025-05-15T02:44:43.823089"
}