{
  "id": 3418,
  "title": "Women Microfinance Users and Their Association with Improvement in Quality of Life: Evidence from Pakistan",
  "abstract": "The present study aimed to examine improvements in the quality of life of women utilizing microfinance in urban Lahore, Pakistan. Random sampling was used to identify 5 microfinance providers in the region, and at a second stage of the study, quota sampling was used to interview 149 women users from microfinance site offices. A questionnaire was developed to measure quality of life in four categories: economic, family, health, and decision-making ability. Data was analyzed through the mixed methods approach of reporting descriptive statistics with user comments and use of multivariate regression analysis. Findings reveal that majority women users of microfinance are poor, illiterate, and employed as unskilled labor. Of significance is that some non-economic variables of quality of life were evidenced to improve after loan-taking. Multivariate logistic regression was performed to obtain an odds ratio of relationships between loan portfolio characteristics and improved quality of life. It was evidenced that group borrowing use of loan for self, not taking loan repayment assistance from household members, attending monthly meetings, and receiving skill and development training all displayed higher odds of improved quality of life in women users. It is recommended that microfinance service provision should not be limited to financial services and should indude urgent and compulsory social development features for women clients.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ed53198e6d049247568e6f81b228095",
  "timestamp": "2025-05-15T01:16:55.523699"
}