{
  "id": 4248,
  "title": "The moderating impact of auditor industry specialisation on the relationship between fair value disclosure and audit fees: empirical evidence from Jordan",
  "abstract": "PurposeThis paper investigates the application of the product differentiation and shared efficiency approaches to understand the impact of the auditor industry specialisation (IS) on audit fees in relation to Fair Value Disclosures (FVD).Design/methodology/approachThe study uses 1,470 firm-year observations for the period 2005-2018 and is focused on Jordanian financial firms. Two competing theoretical approaches of IS proxied by audit fee-based measures were employed: firstly, the product differentiation approach measured using Market Share-based (MS) measure and secondly, the shared efficiency approach measured using Portfolio Share-based (PS) measure. The paper employs the Ordinary Least Squares regression to test the association between the proportion of fair-valued assets (using fair value hierarchy inputs) and audit fees.FindingsThe results suggest that the association between the proportion of fair-valued assets and audit fees is strengthened (weakened) when the client hires specialist auditors identified by MS (PS). This association varied across the fair value inputs. Level 1 assets were found to be only moderated by both scenarios positively (negatively) for MS (PS) experts. The results are robust after controlling the endogeneity of auditor self-selection.Practical implicationsThe results provide valuable insights for policymakers into challenges of auditing FVD. These insights present a valuable input for the development of FVD policies and practices as well as providing guidance for updating auditor prices. Additionally, the results provide a foundation for policymakers and regulators to introduce and update fair value auditing practices. The current findings are generalisable to other countries, including the Middle East and North Africa, and are particularly beneficial for those countries which have adopted the fair value model.Originality/valueThis study contributes to the theory by demonstrating the impact of the auditor industry expertise on post-implementation costs of FVD. The novelty of the study lies in introducing principle-based standards requirements of FVD to test the relationship. This approach is based on the IFRS disclosure requirements using data from the Jordanian financial sector to examine this relationship.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ed9845056ff6269f4622cf97fabf24e",
  "timestamp": "2025-05-15T01:25:23.225232"
}