{
  "id": 8910,
  "title": "Place of Death in Patients with Lung Cancer: A Retrospective Cohort Study from 2004-2013",
  "abstract": "Introduction Many patients with cancer die in an acute hospital bed, which has been frequently identified as the least preferred location, with psychological and financial implications. This study looks at place and cause of death in patients with lung cancer and identifies which factors are associated with dying in an acute hospital bed versus at home. Methods and Findings We used the National Lung Cancer Audit linked to Hospital Episode Statistics and Office for National Statistics data to determine cause and place of death in those with lung cancer; both overall and by cancer Network. We used multivariate logistic regression to compare features of those who died in an acute hospital versus those who died at home. Results Of 143627 patients identified 40% (57678) died in an acute hospital, 29% (41957) died at home and 17% (24108) died in a hospice. Individual factors associated with death in an acute hospital bed compared to home were male sex, increasing age, poor performance status, social deprivation and diagnosis via an emergency route. There was marked variation between cancer Networks in place of death. The proportion of patients dying in an acute hospital ranged from 28% to 48%, with variation most notable in provision of hospice care (9% versus 33%). Cause of death in the majority was lung cancer (86%), with other malignancies, chronic obstructive pulmonary disease (COPD) and ischaemic heart disease (IHD) comprising 9% collectively. Conclusions A substantial proportion of patients with lung cancer die in acute hospital beds and this is more likely with increasing age, male sex, social deprivation and in those with poor performance status. There is marked variation between Networks, suggesting a need to improve end-of-life planning in those at greatest risk, and to review the allocation of resources to provide more hospice beds, enhanced community support and ensure equal access.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0ee390e2b64b85a68771c846996d3b29",
  "timestamp": "2025-05-15T03:23:27.892873"
}