{
  "id": 4124,
  "title": "Predictors of Depressive Symptoms and Post Traumatic Stress Disorder Among Women Engaged in Commercial Sex Work in Southern Uganda",
  "abstract": "This study examined the factors associated with depressive symptoms and post traumatic depressive disorder (PTSD) among economically vulnerable women engaged in commercial sex work (WESW) in southern Uganda. Baseline data from a longitudinal cluster randomized study involving 542 self-identified WESW (18-55 years), recruited from 19 HIV hotspots were analyzed. Hierarchical linear regression modelling was utilized to estimate individual, family-level and economic-level predictors of depressive symptoms and PTSD. Family cohesion, sex work stigma, HIV status, financial distress, household assets, number of children and number of household income earners, were associated with PTSD. Similarly, family cohesion, number of people in the household, HIV status, sex work stigma, financial distress, and household assets, were associated with depressive symptoms. Women engaged in commercial sex work are at a higher risk of HIV and poor mental health outcomes. Sex work stigma and financial distress elevate levels of depressive symptoms and PTSD, over and above an individual?s HIV status. Family and economic-level factors have the potential to mitigate the risk of poor mental health outcomes. As such, integrating stigma reduction and economic strengthening components in the programming targeting WESW?a key population, may be critical to address their mental health outcomes.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0efc60e081cec665a46979ba9ac19f4d",
  "timestamp": "2025-05-15T02:33:42.013408"
}