{
  "id": 3721,
  "title": "Stock returns, trading volume, and volatility: The case of African stock markets",
  "abstract": "The presence of the African Stock Markets (ASMs) in the global frontier markets indices confirms their global portfolio diversification role. This study investigates the asymmetric and intertemporal causality among the stock returns, trading volume, and volatility of eight ASMs. Results based on the linear model reveal that return generally Granger cause trading volume. However, evidence from the quantile regression shows that lagged trading volume has a negative causal effect on returns at low quantiles and positive causal effects at high quantiles. This evidence is consistent with volume-return equilibrium models, disposition and overconfidence models, and information asymmetry models. The positive causal effects of volatility on volume support the dispersion of beliefs model. In contrast, intertemporal evidence of contemporaneous and lagged causal relationships from trading volume to volatility supports the mixture of distribution hypothesis, sequential information acquisition hypothesis, and dynamic efficient market hypothesis. Volume-return and return-volume causality dynamics are quantile-specific and therefore driven by market conditions. However, the volume-volatility causality is dependent on volatility regimes. The linear model results confirm how model mi-sspecification can distort and even reverse empirical evidence relative to nonlinear models.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f070cc9e92258cd2650c7809170b776",
  "timestamp": "2025-05-15T01:20:03.487985"
}