{
  "id": 7852,
  "title": "Health, Access to Health Care, and Health Care use Among Homeless Women with a History of Intimate Partner Violence",
  "abstract": "Among a sample of sheltered homeless women, we examined health, access to health care, and health care use overall and among the subgroup of participants with and without intimate partner violence (IPV). We recruited homeless women from a random sampling of shelters in New York City, and queried them on health, access to health care and health care use. Using multivariable logistic regression, we determined whether IPV was associated with past-year use of emergency, primary care and outpatient mental health services. Of the 329 participants, 31.6% reported one or more cardiovascular risk factors, 32.2% one or more sexually transmitted infections, and 32.2% any psychiatric condition. Three-fourths (73.5%) had health insurance. Health care use varied: 55.4% used emergency, 48.9% primary care, and 75.9% outpatient mental health services in the past year. Across all participants, 44.7% reported IPV. Participants with IPV compared to those without were more likely to report medical and psychiatric conditions, and be insured. Participants with IPV reported using emergency (64.4%) more than primary care (55.5%) services. History of IPV was independently associated with use of emergency (Adjusted odds ratio (AOR) 1.7, 95% CI 1.0-2.7), but not primary care (AOR 1.5, 95% CI 0.9-2.6) or outpatient mental health services (AOR 1.9, 95% CI 0.9-4.1). Across the whole sample and among the subgroup with IPV, participants used emergency more than primary care services despite being relatively highly insured. Identifying and eliminating non-financial barriers to primary care may increase reliance on primary care among this high-risk group.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f0e48e35fbcf3d902c45a4d9159a3cc",
  "timestamp": "2025-05-15T03:12:36.539528"
}