{
  "id": 1949,
  "title": "Weirdnodes: centrality based anomaly detection on temporal networks for the anti-financial crime domain",
  "abstract": "Analyzing the financial domain presents significant challenges, particularly due to the lack of publicly available data and the limited opportunities for the scientific community to test methods and algorithms on real datasets. This paper explores the application of network analysis to the Anti-Financial Crime (AFC) domain, leveraging a large dataset of over 80 million cross-border wire transfers. Our goal is to detect outliers potentially involved in malicious activities, in alignment with financial regulations. We address this problem with WeirdNodes, a centrality-based methodology for ranked anomaly detection in temporal networks. Unlike many existing approaches that rely on rule-based algorithms or general machine learning models, WeirdNodes harnesses the evolving structure and relationships within financial transaction networks. By focusing on minimal disruptions in otherwise stable ecosystems-such as those built upon large set of international financial transactions-our approach tracks the temporal evolution of centrality-based rankings. This enables the detection of abrupt role shifts, signaling anomalies that warrant further investigation by domain experts. Beyond anomaly detection, this analysis represents a step toward automating AFC and Anti-Money Laundering (AML) processes, equipping AFC officers with a comprehensive, top-down perspective to enhance their efforts. By providing a bird's eye view of financial data, our approach mitigates the risk of overlooking complex behaviors that single-node or narrowly focused transactional analyses may fail to detect.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f1302c768a8966b7291e2242be53226",
  "timestamp": "2025-05-15T02:09:14.413846"
}