{
  "id": 6809,
  "title": "The effect of referral and transfer patients on hospital funding in a capitated health care delivery system",
  "abstract": "Objectives: (1) To investigate whether inpatients referred or transferred between facilities result in increased financial loss compared with those admitted directly, in a health care delivery system funded by capitation methods. (2) To determine whether the higher cost of those patients transferred or referred is fairly compensated by a diagnosis-based risk adjustment system, and whether tertiary care facilities bear an unfair financial burden for such patients in a capitated financing environment. Methods: The study cohort included all Veterans Affairs (VA) beneficiaries who received inpatient care during fiscal year (FY) 2004. Referral was defined as an outpatient visit to 1 facility followed by an admission to another facility. Transfers were consecutive inpatient stays at different hospitals. We defined loss as cost minus the share of budget determined by a Diagnostic Cost Group-based allocation. Both t tests and linear regression were used to compare the effect on cost and loss for patients transferred or not and referred or not. Results: Mean loss to a facility for patients transferred in was $1231 more than for those not transferred. Mean loss for referred patients was $3341 more than for those not referred, controlling for disease burden. For tertiary hospitals, the difference in losses for transfer patients was less than for other hospitals but greater for referral patients. Conclusions: Patients referred or transferred from other facilities are more costly than those who are not. The difference may not be compensated by a diagnosis-based allocation system. A capitated health care system may consider additional funding to cover the cost of such patients.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f1a83b24a6dc764393f31e08b439d2f",
  "timestamp": "2025-05-15T03:01:31.495307"
}