{
  "id": 2912,
  "title": "Financial literacy and risk-taking behavior: a study of graduates and undergraduates",
  "abstract": "PurposeThis study examines the relationship between financial literacy and risk-taking behavior in the stock market for both graduates and undergraduates.Design/methodology/approachThis study conducted two surveys on two groups: graduates and undergraduates. The questionnaires were sent to the two groups via Google Form. The surveys were undertaken from March to October 2021, with final data on 500 undergraduates and 400 graduates. The three techniques used are multiple linear regression (MLR), structural equation model (SEM) and ordinal logit regression (OLR) to examine the causal relationships.FindingsBased on survey data on 400 graduate and 500 undergraduate students, our results show that financial literacy is positively associated with risk-taking behavior (i.e. use of debt and willingness to use debt) after controlling for demographics. Graduates with higher levels of financial literacy are more likely to use debt. Undergraduates with higher levels of financial literacy are more willing to use debt. In addition, parental education has a significant moderating effect on the association between financial literacy and debt use among undergraduate students. The results are robust compared to the alternatives.Research limitations/implicationsAlthough this study finds a positive association between financial literacy and risk-taking behavior among graduates and undergraduates, and these results are robust to the alternatives, the scope of this study is limited and only focuses on Vietnam. Hence, it needs to be expanded overseas. Next, graduates may make investment decisions based on stock prices or valuations, and as a result, the link between financial literacy and stock valuations should be investigated in subsequent research. Last but not least, further studies should also examine the digital financial literacy level of the younger generation, as it plays an important role in the digital age.Practical implicationsFirst, this study finds that higher financial literacy tends to use more debt, implying that financially literate people know how to use debt smartly to earn more profits. Second, students with higher-educated parents are less likely to use debt for stock investment, meaning that parents help students avoid possible risks while in the university. Finally, female graduates and college students all perform lower in financial literacy than their male counterparts. This can create a larger gender gap in financial literacy between women and men, particularly, in a society in which men often play the leading role in the family. As a result, it calls for policymakers, educators and parents to pay more attention to improving financial literacy among girls and women in general.Originality/valueThis study has three contributions. First, this is the first study to examine the impact of financial literacy on risk-taking behavior between two groups of graduates and undergraduates. The results show that individuals with a higher level of financial literacy are more likely to engage in risk-taking behavior (i.e. debt use) in terms of the stock market. Recent research, for example, Phung et al. (2022), examines investors' informal debt (from families and friends), while this study investigates graduates' debt use (from brokerage firms). Second, parental education is a significant mediator between college students' financial literacy and debt use. The literature on parental socialization mainly documents parents' direct influence on children's financial knowledge and performance (Shim et al., 2010; Phung, 2023). Unlike previous research, this study finds that parental education plays a moderating role between college students' financial literacy and their risk-taking behavior. Finally, three methods and multiple models are used to test causal relationships. The results are robust compared to the alternatives.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f283a8706092efd93d0290e74f9d706",
  "timestamp": "2025-05-15T02:20:17.006851"
}