{
  "id": 133,
  "title": "Application of genetic algorithm and BP neural network in supply chain finance under information sharing",
  "abstract": "The supply chain finance industry will generate the flow of funds and commodities when providing financing services to small and medium-sized enterprises (SMEs). At this time, banks will face multiple risks such as policy, operation, market and credit. The investigation on supply chain finance under information sharing from the aspect of credit risk assessment will be conducted. The genetic algorithm combined with support vector machine and BP neural network is selected to evaluate the credit risk of supply chain finance. In the support vector machine method, the parameter selection method adopts genetic algorithm. In the included data, the gap in growth capacity of SMEs is relatively large. The standard deviations of main business, net profit and total assets are all above 30%, and the standard deviations of current ratio and quick ratio are small, which means that the two are more stable and healthier. In addition, among all the investigated enterprises, the cost gap is large, and the standard deviation of the inventory decline price reserve is small, which means that most enterprises have good inventory quality. After classification, 32 high-quality enterprises, 46 neutral enterprises and 55 risk enterprises are obtained in the total sample. In the test sample, there are 21 high-quality enterprises, 12 neutral enterprises, and 26 risk enterprises. The overall classification accuracy of the support vector machine method optimized by genetic algorithm is relatively lower than that of the BP neural network method. The classification accuracy of the support vector machine method optimized by genetic algorithm is 76.27%, and the classification accuracy of BP neural network method is 89.83%. The supply chain financial risk assessment of SMEs is mainly explored from the perspective of banks. The results can provide theoretical support for reducing the probability of bank's profit damage and increasing the bank's profitability. (C) 2020 Elsevier B.V. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f2a3cb84a0f0fe6d6ab1fa392555983",
  "timestamp": "2025-05-15T01:47:14.083447"
}