{
  "id": 4662,
  "title": "It is like an umbrella covering you, yet it does not protect you from the rain: a mixed methods study of insurance affordability, coverage, and financial protection in rural western Kenya",
  "abstract": "Countries in Sub-Saharan Africa are increasingly adopting mandatory social health insurance programs. In Kenya, mandatory social health insurance is being implemented through the national health insurer, the National Hospital Insurance Fund (NHIF), but the level of coverage, affordability and financial risk protection provided by health insurance, especially for rural informal households, is unclear. This study provides as assessment of affordability of NHIF premiums, the need for financial risk protection, and the extent of financial protection provided by NHIF among rural informal workers in western Kenya.Methods We conducted a mixed methods study with a cross-sectional household survey (n = 1773), in-depth household interviews (n = 36), and 6 focus group discussions (FGDs) with community stakeholders in rural western Kenya. Health insurance status was self-reported and households were categorized into insured and uninsured. Using survey data, we calculated the affordability of health insurance (unaffordability was defined as the monthly premium being > 5% of total household expenditures), out of pocket expenditures (OOP) on healthcare and its impact on impoverishment, and incidence of catastrophic health expenditures (CHE). Logistic regression was used to assess household characteristics associated with CHE.Results Only 12% of households reported having health insurance and was unaffordable for the majority of households, both insured (60%) and uninsured (80%). Rural households spent an average of 12% of their household budget on OOP, with both insured and uninsured households reporting high OOP spending and similar levels of impoverishment due to OOP. Overall, 12% of households experienced CHE, with uninsured households more likely to experience CHE. Participants expressed concerns about value of health insurance given its cost, availability and quality of services, and financial protection relative to other social and economic household needs. Households resulted to borrowing, fundraising, taking short term loans and selling family assets to meet healthcare costs.Conclusion Health insurance coverage was low among rural informal sector households in western Kenya, with health insurance premiums being unaffordable to most households. Even among insured households, we found high levels of OOP and CHE. Our results suggest that significant reforms of NHIF and health system are required to provide adequate health services and financial risk protection for rural informal households in Kenya.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f4168767d15a5cc620fc3345d75f385",
  "timestamp": "2025-05-15T02:39:27.094223"
}