{
  "id": 6381,
  "title": "What are the impacts of livelihood capital and distance effect on farmers' willingness to pay for coastal zone ecological protection? Empirical analysis from the Beibu Gulf of China",
  "abstract": "Coastal farmers earn their living by the sea, and their willingness to pay (WTP) is particularly important for coastal zone ecological protection (CZEP). What are the specific impacts of livelihood capital and distance effect on farmers' WTP for CZEP? And what are the impact paths of these effects? To answer these questions, taking the coastal zone of the Beibu Gulf of China as an example, this paper constructs an index system based on sustainable livelihood theory, carries out research and design combined with the contingent valuation method (CVM), and conducts an empirical study on the relationship between livelihood capital, distance effect and WTP for ecological protection with the help of the entropy method, ordinary least squares (OLS) linear regression model and bootstrap method. The results show that (1) only 56.23% of the respondents have a WTP for CZEP, while 43.77% of the respondents refuse to pay. (2) The scores of each dimension of farmers' livelihood capital are as follows: risk perception (0.635) > natural capital (0.531) > financial capital (0.406) > human capital (0.299) > social capital (0.130) > physical capital (0.110), and farmers' livelihood capital and distance effect have an inverted U-shaped relationship with the WTP for ecological protection. (3) The ecological protection payments of pure farmers, type 1 farmers, type 2 farmers and nonfarmers were 151.83, 112.73, 78.87 and 95.58 RMB/year, respectively, and the influencing factors are heterogeneous. (4) We found that the mediating effects of natural capital, physical capital and financial capital are negative, social capital and risk perception are positive, while the mediating effects of human capital are not significant. Therefore, the government should establish a comprehensive management system that is cross-regional, cross-departmental, coordinated, systematic and efficient across the coastal zone.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f47e2633e39ce0fd71e4c874a1a29d5",
  "timestamp": "2025-05-15T02:57:38.731765"
}