{
  "id": 7484,
  "title": "Electrification of Online Ride-Hailing Vehicles in China: Intention Modelling and Market Prediction",
  "abstract": "Significant negative impact caused by climate changes, such as economy and life losses, has been experienced globally in recent years, which has called for imminent development and adoption of low carbon technologies in order to mitigate the impact. In 2020, the Chinese government outlined the 'Dual Carbon' Goal where its carbon emission will peak before 2030 whilst China will become 'Carbon Neutral' before 2060. In China, the amount of carbon emissions from the transportation industry stands in second place and it is predicted that the carbon emission of China's automobile industry will reach between 21.5 and 30 billion tons in 2030. Actions should be taken as quickly as possible to facilitate the transition from traditional fossil fuel vehicles to low carbon vehicles such as electric vehicles in order to reduce carbon emissions effectively. Based on the questionnaire that is designed to survey the electrification of online ride-hailing vehicles, this paper first establishes a consumer purchase intention model according to the perceived value theory. By evaluating six aspects including functional value, emotional value, social value, functional risk, financial risk and physical and mental risk, the regression model of the consumer purchase intention for electric vehicles is built. Subsequently, the average operating models for petroleum fuel vehicles, hybrid vehicles and electric vehicles are established, and on top of this, a fossil fuel price model can be derived. This price model can identify from which price it will be advantageous to use electric vehicles to run an online ride-hailing service. Moreover, a multi-agent model is established to illustrate the spread of electric vehicles in the online ride-hailing sector and the private car sector, which is used to predict the trend of the EV market development in China from 2020 to 2040.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f4e9a294625f9301be64a3d39db18d3",
  "timestamp": "2025-05-15T03:09:07.272064"
}