{
  "id": 8582,
  "title": "The likelihood of using crowdfunding-Waqf model in Malaysia",
  "abstract": "Purpose - This paper investigates the probability that people (prospective donors) would be willing to use the crowdfunding-Waqf model (CWM), depending on certain variables and characteristics. This study aims to develop an alternative financial model to address Malaysia's Waqf land financing problem. Design/methodology/approach - A survey study was conducted to assess the probability that people would be willing to use the CWM. This study used descriptive analysis and the logistic regression model as analytical tools. Descriptive analysis was conducted using frequencies, which means the number of respondents for each variable or item, such as demographic variables. The logistic regression model was used to obtain the probability that individuals would be willing to use the CWM, based on certain variables. Findings - This study found that perceived usefulness, perceived ease of use, gender and Waqf knowledge positively affected the likelihood that people would willingly use the CWM for developing Waqf land. In contrast, other factors such as age group, marital status, income level, internet usage, perceived risk of crowdfunding and Waqf perception did not affect this likelihood. Further investigation indicated that being of middle-income level and possessing crowdfunding knowledge positively affected the likelihood that people were willing to use the CWM. The highest probability of the willingness to use the CWM was identified among middle-income males who knew about Waqf and perceived the CWM as useful and easy to use. Research limitations/implications - The results of this study and other key findings are expected to be implemented by Waqf institutions in Malaysia to develop policies related to Waqf land in general or to the CWM in particular. The findings are also expected to benefit individuals, organisations and countries, and they could also be adapted and validated in other nations. Originality/value - This study focused on developing a better chance of finding people with specific characteristics and factors that lead them to intentionally use the CWM. The probability of willingness to use the CWM based on certain variables has not yet been evaluated. Recognising how higher probabilities can be identified using every factor and characteristic will enable future CWM users to be better mapped, which is expected to increase the effectiveness of developing the CWM.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f53b33da7c7fec18c1ecb703b7e9795",
  "timestamp": "2025-05-15T03:20:22.220936"
}