{
  "id": 125,
  "title": "RETRACTED: Evaluation of Enterprise Financial Risk Level under Digital Transformation with Artificial Neural Network (Retracted Article)",
  "abstract": "With the continuous development of the national economy, enterprises have gradually entered the digital age from the industrial age, and digital transformation has become a must for enterprise survival. Digital transformation empowers the high-quality development of enterprises and puts forward higher requirements for financial risk management. The problem of enterprise financial risk is one that every business must deal with at some point during its operations. The digital age has ushered in a new era for enterprise financial risk management. Digital transformation is also a weather vane, which is beneficial to comprehensively avoid financial risks, do a good job in system defense and multiparty coordination, and can quickly and accurately manage corporate finances and solve risks in a timely manner. Starting from the background of digital transformation, this article clarifies the significance of preventing corporate financial risks in the new era. Combining it with artificial neural networks, this work proposes an intelligent method for assessing the financial risk level of enterprises in this context. This work proposes an EFRL-ResNet neural network, which is improved on the basis of ResNet. At the same time, the depth-wise separable convolution (DSConv) structure in Mobile-Net is combined with the ResNet network to build a lightweight deep neural network. Through the case of enterprise financial risk, it is verified that the method can reduce the training time of the model without losing the accuracy of grade evaluation. At the same time, this paper improves the loss function in the network model for the problem of an unbalanced number of data samples in the financial risk level assessment model.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f5b78bcb3702dcc0f50e9031d8b5184",
  "timestamp": "2025-05-15T01:47:14.007975"
}