{
  "id": 369,
  "title": "Development of an AI framework using neural process continuous reinforcement learning to optimize highly volatile financial portfolios",
  "abstract": "High volatility presents considerable challenges in the optimization of financial portfolio assets. This study develops and explores model-based reinforcement learning (MBRL) in this context. Existing literature suggests that while model-free approach offers certain computational advantages, it frequently fails to encapsulate the nature of highly dynamic capital markets. This limitation is due to an insufficient consideration of the interactions between agents and environmental states within the reinforcement learning framework. Conversely, MBRL encounters inaccuracies representing stochastically evolving states typical of volatile capital markets. To address these limitations, we introduce an innovative AI framework in the MBRL domain by integrating attentive neural processes with continuous-time MBRL. This novel approach, termed Neural Process Continuous Reinforcement Learning (NPCRL), is posited to enhance the ability of MBRL to adapt to volatile fluctuations in capital markets. The effectiveness of NPCRL is empirically evaluated through a series of experiments using three important performance indicators of financial portfolios: returns, risk, and drawdown recovery. The results demonstrate that NPCRL surpasses other methods in achieving a balanced trade-off between long-term returns and risk management. This study advances our understanding of machine learning development by suggesting methods that are more proficient at capturing and adapting in volatile training environments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f601f2bc0cd4534261c30486b6315b4",
  "timestamp": "2025-05-15T01:50:14.002352"
}