{
  "id": 792,
  "title": "Beating a Benchmark: Dynamic Programming May Not Be the Right Numerical Approach",
  "abstract": "We analyze dynamic investment strategies for benchmark outperformance using two widely used objectives of practical interest to investors: (i) maximizing the information ratio (IR), and (ii) ob-taining a favorable tracking difference (cumulative outperformance) relative to the benchmark. In the case of the tracking difference, we propose a simple and intuitive objective function based on the quadratic deviation (QD) from an elevated benchmark. In order to gain some intuition about these strategies, we provide closed-form solutions for the controls under idealized assumptions. For more realistic cases, we represent the control using a neural network (NN) and directly solve a sampled optimization problem, which approximates the original optimal stochastic control formulation. Un-like the typical approach based on dynamic programming (DP), e.g., reinforcement learning, solving the sampled optimization with an NN as a control avoids computing conditional expectations and leads to an optimization problem with a small number of variables. In addition, our NN param-eter size is independent of the number of portfolio rebalancing times. Under some assumptions, we prove that a traditional DP approach results in a high-dimensional problem, whereas directly solving for the control without using DP yields a low-dimensional problem. Our analytical and numerical results illustrate that, compared with IR-optimal strategies with the same expected value of terminal wealth, the QD-optimal investment strategies result in comparatively more diversified asset allocations during certain periods of the investment time horizon.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f6d310eee072a64b5e9804ce3c9ef34",
  "timestamp": "2025-05-15T00:48:22.256848"
}