{
  "id": 1687,
  "title": "Measuring financial risk and portfolio reversion with time changed tempered stable Levy processes",
  "abstract": "Given that underlying assets in financial markets exhibit stylized facts such as leptokurtosis, asymmetry, clustering properties and heteroskedasticity effect, this paper applies the stochastic volatility models driven by tempered stable Levy processes to construct time changed tempered stable Levy processes (TSSV) for financial risk measurement and portfolio reversion. The TSSV model framework permits infinite activity jump behaviors of returns dynamics and time varying volatility consistently observed in financial markets by introducing time changing volatility into tempered stable processes which specially refer to normal tempered stable (NTS) distribution as well as classical tempered stable (CTS) distribution, capturing leptokurtosis, fat tailedness and asymmetry features of returns in addition to volatility clustering effect in stochastic volatility. Through employing the analytical characteristic function and fast Fourier transform (FFT) technique, the closed form formulas for probability density function (PDF) of returns, value at risk (VaR) and conditional value at risk (CVaR) can be derived. Finally, in order to forecast extreme events and volatile market, we perform empirical researches on Hangseng index to measure risks and construct portfolio based on risk adjusted reward risk stock selection criteria employing TSSV models, with the stochastic volatility normal tempered stable (NTSSV) model producing superior performances relative to others. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f789804ca44a5e8d62d7749a15a9d95",
  "timestamp": "2025-05-15T02:06:22.457221"
}