{
  "id": 8305,
  "title": "Association of exogenous factors with the access to innovative pharmaceutical products in Hungary",
  "abstract": "IntroductionAccess to innovative pharmaceuticals is thought to be associated with several exogenous factors related to the local legal or financial framework of pharmaceutical reimbursement. Our aim was to describe the association between the outcome of the reimbursement procedure on innovative pharmaceutical submissions in Hungary and several potential explanatory variables related to the legal or financial framework of reimbursement procedures, such as the submission implying a need for a legal act to conclude on a positive decision; having a risk-sharing agreement (RSA) in place at the time of submission; the aim of the submission and expenditure on individual funding requests. MethodsPublicly available administrative announcements of the Hungarian National Health Insurance Fund Manager were used to construct the analysis dataset including all concluded procedures between 1 January 2018 and 7 June 2021, complemented with information on the overall aim of the submission (new compound or new indication). Logistic regression models were used to estimate odds ratios while adjusting for potential confounding. ResultsNeeding a legislative change as a proxy of involving high-level decision makers to reimburse had a lower (OR = 0.05, CI95%:0.02-0.11), whereas having an RSA had a statistically significant higher chance of a positive decision (OR = 3.49, CI95%:1.56-7.82). In contrast, neither the overall purpose of the submission (OR = 1.32, CI95%:0.65-2.69), nor the average biennial expenditure on individual funding requests exceeding 200 million HUFs (OR = 1.04, CI95%:0.92-1.19) had a statistically significant association with the decision. ConclusionsThis study quantitatively demonstrated that the need for legal acts to conclude on a positive decision decreases, whereas having an RSA for the particular product increases the likelihood of a positive reimbursement decision in Hungary. The role of other factors remain unclear. Our findings suggest that the legal requirements and RSAs play key roles in the reimbursement of innovative pharmaceuticals and can be viewed as potential areas of policy interventions in expanding access to these products, although the feasibility of such interventions need strong commitment from decision-makers, as well as implying increased autonomy to the entities involved in reimbursement procedures. Further research is needed to assess the impact of endogenous and exogenous factors in a coherent framework.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f7cdd0d4652a3566a64d2a2f7c4094f",
  "timestamp": "2025-05-15T03:17:21.591565"
}