{
  "id": 4962,
  "title": "Risks in Intellectual Property Management",
  "abstract": "The article reviews theoretical and practical aspects of intellectual property risks. The goal of this study is to identify and systematize risks that occur in the intellectual property rights market. These risks are the integral part of the risk management system and they ensure effective intellectual property management that allows preventing possible financial losses of economic entities. The practice of using exclusive rights in economic activity justify the relevance of the research. The methodological base for this study is formed with general research methods such as analysis, systematization and classification. Judicial practice discussed in the article discloses practical aspects of intellectual property risks and emphasizes the significance of risk management system for an enterprise. Cases from judicial practice allow the authors to conduct deeper research into risks confronting different subjects of the intellectual property market and to identify the weaknesses of the risk management system. Analysis of the factors that cause risk emergence in the intellectual property market reveals the lack of systematic approach towards risk management, insufficient control and level of competence in the issues of protection of the intellectual property rights. The study identifies main elements of the intellectual property risk management system. This system is aimed at preventing risks and minimizing economic losses for the economic entities in the exclusive rights market.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f940071e3cfbe56fd241d38f96c16f9",
  "timestamp": "2025-05-15T02:42:36.325370"
}