{
  "id": 738,
  "title": "Proposing a new loan recommendation framework for loan allocation strategies in online P2P lending",
  "abstract": "PurposeLenders in online peer-to-peer (P2P) lending platforms are always non-experts and face severe information asymmetry. This paper aims to achieve the goals of gaining high returns with risk limitations or lowering risks with expected returns for P2P lenders.Design/methodology/approachThis paper used data from a leading online P2P lending platform in America. First, the authors constructed a logistic regression-based credit scoring model and a linear regression-based profit scoring model to predict the default probabilities and profitability of loans. Second, based on the predictions of loan risk and loan return, the authors constructed linear programming model to form the optimal loan portfolio for lenders.FindingsThe research results show that compared to a logistic regression-based credit scoring method, the proposed new framework could make more returns for lenders with risks unchanged. Furthermore, compared to a linear regression-based profit scoring method, the proposed new framework could lower risks for lenders without lowering returns. In addition, comparisons with advanced machine learning techniques further validate its superiority.Originality/valueUnlike previous studies that focus solely on predicting the default probability or profitability of loans, this study considers loan allocation in online P2P lending as an optimization research problem using a new framework based upon modern portfolio theory (MPT). This study may contribute theoretically to the extension of MPT in the specific context of online P2P lending and benefit lenders and platforms to develop more efficient investment tools.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0f9a410b9c2ea8609493a31a0df5c747",
  "timestamp": "2025-05-15T00:47:18.662660"
}