{
  "id": 8412,
  "title": "Anger and confrontation during the COVID-19 pandemic: a national cross-sectional survey in the UK",
  "abstract": "Objectives To investigate factors associated with anger or confronting others due to COVID-19. Design Online cross-sectional survey. Setting Data were collected between 17 and 20 July 2020. Participants A total of 2237 participants living in the UK aged 16-75 years. Main outcome measures Reporting having had arguments, felt angry or fallen out with others because of COVID-19. Reporting having confronted or reported someone to the authorities, or that you had been confronted or reported to the authorities, for not wearing a face covering; not keeping your distance from others or being in too large a group; or alternatively following recommended measures too carefully. We used logistic regression analyses to identify factors associated with anger and confrontation. Results Most participants reported having had arguments, feeling angry or fallen out with others because of COVID-19 (56%, n = 1255). Twenty-two percent (n = 500) of participants reported that they had confronted or reported someone. Fourteen percent (n = 304) of participants reported that they had been confronted or reported by someone. Confronting someone, having been confronted and feeling angry or having had arguments were strongly associated with each other. Anger and confrontation were associated with younger age, greater likelihood of experiencing significant financial difficulties due to the pandemic, greater perceived risk of COVID-19 and getting information about COVID-19 from social media. Conclusions Measures put in place to prevent the spread of COVID-19 have caused considerable strain. Increased support, clear messaging on the rationale for easing restrictions and combatting misinformation on social media may all help decrease tension.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fa746d358ca122cd8b37cacb2cd4fc9",
  "timestamp": "2025-05-15T03:18:19.702967"
}