{
  "id": 3738,
  "title": "Cost-effectiveness of first-trimester screening with early preventative use of aspirin in women at high risk of early-onset pre-eclampsia",
  "abstract": "Objective Pre-eclampsia (PE) remains a leading cause of maternal and fetal morbidity and mortality. A first-trimester screening algorithm predicting the risk of early-onset PE has been developed and validated. Early prediction coupled with initiation of aspirin at 11-13weeks in women identified as high risk is effective at reducing the prevalence of early-onset PE. The aim of this study was to evaluate the cost-effectiveness of this first-trimester screening program coupled with early use of low-dose aspirin in women at high risk of developing early-onset PE, in comparison to current practice in Canada. Methods A decision analysis was performed based on a theoretical population of 387 516 live births in Canada in 1 year. The clinical and financial impact of early preventative screening using the Fetal Medicine Foundation algorithm for prediction of early-onset PE coupled with early (< 16 weeks) use of low-dose aspirin in those at high risk was simulated and compared with current practice using decision-tree analysis. The probabilities at each decision point and associated costs of utilized resources were calculated based on published literature and public databases. Results Of the theoretical 387 516 births per year, the estimated prevalence of early PE based on first-trimester screening and aspirin use was 705 vs 1801 cases based on the current practice. This was associated with an estimated total cost of C$9.52 million with the first-trimester screening program compared with C$23.91 million with current practice for the diagnosis and management of women with early-onset PE. This equals an annual cost saving to the Canadian healthcare system of approximately C$14.39 million. Conclusions The implementation of a first-trimester screening program for PE and early intervention with aspirin in women identified as high risk for early PE has the potential to prevent a significant number of early-onset PE cases with a substantial associated cost saving to the healthcare system in Canada. Copyright (c) 2018 ISUOG. Published by John Wiley & Sons Ltd.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fb5e6150888852f1db077b4a9295493",
  "timestamp": "2025-05-15T02:29:28.039412"
}