{
  "id": 3816,
  "title": "A novel separation-ensemble analyzing and forecasting method for the gold price forecasting based on RLS-type independent component analysis",
  "abstract": "Gold has practical applications in jewellery, technology, investors and by central banks. This diversity of gold demand and self-balancing nature of the gold market underpin gold's robust qualities as an investment asset. Accurately forecasting gold price is conductive to protect and promote portfolio's performing. The extant studies, however, fail to capture the volatility in gold price from the perspective of analyzing and forecasting. In this study, a novel separation-ensemble method, which incorporates decomposition, separation, prediction and integration (DSPI) approaches, is proposed to analyze and predict the international gold price. In particular, the proposed DSPI method begins with extreme-point symmetric mode decomposition (ESMD) for retrieving the intrinsic mode functions (IMFs), which is used to generate the multi-channel mixed signals of the gold price. Next, hierarchical agglomerative clustering (HAC) algorithm is utilized to reconstruct the IMFs. Additionally, the recombination of IMFs is regarded as input of separation module and independent components (ICs) can be separated by the RLS-type independent component analysis (RLS-ICA). Especially, we compare the interactive relationship between the gold price and underlying meanings of the ICs. Finally, the proposed heterogeneous forecasting scheme based on induced ordered weighted averaging (IOWA) approach, in the sense that it assigns a diverse contribution to the forecasting results of the ICs predicted by the individual forecasting approaches, is utilized to achieve the forecasting result of the gold price. Experimental results on the gold price collected from World Gold Council confirm the effectiveness of the proposed DSPI approach, and the comparison results show that it is superior to the extant combination methods.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fb6fd6967d06469f51a5098eb45158d",
  "timestamp": "2025-05-15T01:21:08.227850"
}