{
  "id": 7989,
  "title": "Incidence and consequence of acute kidney injury in unselected emergency admissions to a large acute UK hospital trust",
  "abstract": "Background: AKI is common among hospital in-patients and places a huge financial burden on the UK National Health Service, causing increased length of hospital stay and use of critical care services, with increased requirement for complex interventions including dialysis. This may account for up to 0.6% of the total Health Service budget. To investigate the incidence and consequences of AKI, all unselected emergency admissions to a large acute UK single centre University Teaching Hospital over two separate 7 day periods were reviewed. Methods: A retrospective audit of 745 case records was undertaken (54.6% male) including laboratory data post-discharge or death, with classification of AKI by RIFLE, AKIN and AKIB criteria. Participants were included whether admitted via their general practitioners, the emergency department, or as tertiary specialty transfers. Outcome measures were presence or absence of AKI recorded using each of the three AKI criteria, length of hospital stay (LOS), admission to, and LOS in critical care, and mortality. The most severe grade of AKI only, at any time during the admission, was recorded to prevent double counting. Renal outcome was determined by requirement for renal replacement therapy (RRT), and whether those receiving RRT remained dialysis dependent or not. Results: AKI incidence was 25.4% overall. With approximately one third present on admission and two thirds developing post admission. The AKI group had LOS almost three times higher than the non AKI group (10 vs 4 days). Requirement for critical care beds was 8.1% in the AKI group compared to 1.7% in non AKI group. Overall mortality was 5.5%, with the AKI group at 11.4% versus 3.3% in the non AKI group. Conclusions: AKI in acute unselected hospital admissions is more common than existing literature suggests, affecting 25% of unselected admissions. In many this is relatively mild and may resolve spontaneously, but is associated with increased LOS, likelihood of admission to critical care, and risk of death. If targeted effective interventions can be developed it seems likely that substantial clinical benefits for the patient, as well as financial and structural benefits for the healthcare organisation may accrue.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fbb37ddadc4b6659ccce86aef865393",
  "timestamp": "2025-05-15T03:14:07.252558"
}