{
  "id": 8058,
  "title": "A Contemporary Cost Analysis of Postoperative Morbidity After Coronary Artery Bypass Grafting With and Without Concomitant Aortic Valve Replacement to Improve Patient Quality and Cost-Effective Care",
  "abstract": "Background. The financial burden of postoperative morbidity after cardiac operations remains ill defined. This study evaluated the costs associated with the performance of coronary artery bypass grafting (CABG) with and without aortic valve replacement (AVR) and determined the incremental costs associated with major postoperative complications. Methods. A total of 65,534 regional patients undergoing CABG (n = 55,167) +/- AVR (n = 10,367) were evaluated from 2001 to 2011. Patient-related, hospital-related, and procedure-related cost data were analyzed by use of Medicare-based cost reports. Hierarchical multi-variable regression modeling was used to estimate risk-adjusted incremental cost differences in postoperative complications. Results. The mean age was 64 years, and women accounted for 31% of patients. CABG + AVR patients had higher rates of overall complication (40% vs 35%, p < 0.001) and operative mortality (5% vs 3%, p < 0.001) than did CABG patients. CABG + AVR patients also accrued increased median postoperative lengths of stay (7 vs 5 days, p < 0.001) and total costs ($26,527 vs $24,475, p < 0.001). After mortality risk adjustment, significant positive relationships existed between total costs and major postoperative complications. Interestingly, the highest incremental costs among CABG patients included newly instituted hemodialysis ($71,833), deep sternal wound infection ($56,003), and pneumonia ($50,025). Among CABG D AVR patients, these complications along with perioperative myocardial infarction ($68,917) dominated costs. Conclusions. Postoperative complications after CABG +/- AVR are associated with significantly increased incremental costs. The most costly complications include newly instituted hemodialysis, infectious complications, and perioperative myocardial infarction. Identification of the most common and the most costly complications provides opportunities to target improvement in patient quality and the delivery of cost-effective care. (C) 2013 by The Society of Thoracic Surgeons",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fc71c54b9ef0cbee1881efe513a29a2",
  "timestamp": "2025-05-15T03:14:37.411889"
}