{
  "id": 7710,
  "title": "What is the Most Frequent Cause of Disability in Childhood? An Overview of Cerebral Palsy Spectrum from the Perspective of Rare Diseases",
  "abstract": "Aim: Cerebral palsy (CP), with its comprehensive definition, is the most common cause of disability in children under the age of 18 years. In rehabilitation-oriented approach, many diseases with different etiologies that cause physical disability are evaluated as CP. The aim is to make the etiologic classification of patients referred for rehabilitation and medical counseling. This study is important in terms of reflecting the medical data of patients under the age of 18 in a rehabilitation center with major neurological involvement or risk of neurodevelopmental disorder. Methods: A total of 594 patients were evaluated with detailed medical history, examination of the medical records, and general medical and neurological evaluation. In this retrospective study, chronological age of the cases, history of preterm birth, presence of multiple pregnancies, need for pediatric intensive care unit and the number of days if any, and parental consanguinity were noted in detail. Results: The study revealed that 193 cases had CP secondary to trauma and various birth complications, 73 cases were risky babies due to risk of neurodevelopmental disorders, 95 had definite genetic diagnosis, and 172 had possible genetic etiology. The rest of the cases were individuals with autism and other behavioral problems. In the series, 220 cases of rare neurogenetic diseases constituted the largest group, followed by 193 patients with CP. Conclusion: This study in disabled children group reveals that rare diseases are as common as CP. Rare diseases, mostly of genetic origin, are becoming increasingly important among the current differential diagnoses of CP. The diagnosis of rare neurogenetic diseases, the majority of which is called CP, is of great importance for families to receive genetic counseling and to prevent unnecessary examinations and referrals that cause financial burden.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fc925eb03f17bafe7e7b91a4a1ffeb2",
  "timestamp": "2025-05-15T03:11:04.656435"
}