{
  "id": 7211,
  "title": "Factors Affecting the Development of Vietnamese Construction and Real Estate Companies",
  "abstract": "This study aims to investigate the factors that contribute to the sustainable development of 334 Vietnamese construction and real estate companies listed on the Stock Exchange of Vietnam over a 5-year period from 2016 to 2020. By using regression analysis with the support of STATA software through examining the financial statements, which involves looking into crucial ratios including capital structure, profitability, firm size, accounts receivable management, and tangible assets investment, this study sheds light on whether these accounting indicators could help predict the construction and real estate companies growing potential in the future. Nevertheless, these ratios slightly contribute to the explanation of the change in revenue growth ratio, with a result of 1.6%, indicating that the value relevance of accounting information provides a modest and insignificant effect on investment decisions. This is understandable because the Vietnamese construction and real estate market still has many shortcomings in handling unexpected events, as well as the industry's peculiarities related to major capital sources from bank loans. Based on this study, governmental authorities and business executives should plan appropriate risk management policies and measures to contribute to the sustainable development of construction and real estate companies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fcabc4dc66e5d2b18174d2d23df6dbe",
  "timestamp": "2025-05-15T03:06:01.338592"
}