{
  "id": 8899,
  "title": "Merit-Based Incentive Payment System: How Are Plastic Surgeons Performing?",
  "abstract": "Background: The Merit-based Incentive Payment System (MIPS) is a payment model implemented to promote high-value care through performance-based adjustments of Medicare reimbursements. Higher scores indicate superior performance in health care quality, efficiency, and interoperability, which can result in financial advantages. Given the paucity of literature, the authors aimed to characterize plastic surgery performance in MIPS. Methods: The Centers for Medicare and Medicaid Services online data repository was queried for data on MIPS performance of plastic surgeons from 2019 to 2021. Descriptive analyses and multivariable logistic regression were conducted to identify predictors of receiving bonus payment for exceptional performance. Results: Approximately 1400 surgeons were sampled in each year. The median number of Medicare beneficiaries and percentage of dually eligible beneficiaries-eligible for Medicare and Medicaid-were higher in 2019 (P < 0.001). Beneficiary median hierarchical condition category risk score, which measures expected health care costs and needs based on health status, was lower in 2021 (P < 0.001). The most common reporting schema was reporting as a group. Total MIPS score increased from 2019 to 2020 to 2021 (90.2 versus 96.4 versus 98.3, respectively; P < 0.001), but quality score progressively decreased (98.8 versus 95.5 versus 89.90, respectively; P < 0.001). Fewer physicians received positive adjustment and bonus payments in 2020 and 2021. Predictors of receiving bonus payments were reporting as an alternative payment model, practice size greater than 24, and having 10% to 49% of dually eligible beneficiaries (P < 0.05). Conclusion: Understanding performance of plastic surgeons in MIPS can guide future policy direction and ensure that high-quality care translates into improved patient outcomes across all fields and levels of social vulnerability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fce515e6a61e3f6795a50801cb3e6ec",
  "timestamp": "2025-05-15T03:23:27.864187"
}