{
  "id": 8516,
  "title": "Material Need Insecurities among People on Hemodialysis: Burden, Sociodemographic Risk Factors, and Associations with Substance Use",
  "abstract": "Background Despite their relevance to health outcomes, reports of food insecurity and housing instability rates among adults on hemodialysis are limited. Their relation to sociodemographic and behavioral factors are unknown for this population.Methods We enrolled a convenience sample of people receiving hemodialysis at Baltimore and Washington, DC metropolitan area facilities. Participants completed measures of socioeconomic position, food insecurity, housing instability, and substance use disorder. We cross-referenced participant and facility zip codes with measures of area poverty and residential segregation. We examined associations between individual-level and area-level sociodemographic characteristics, food insecurity, and housing instability using multivariable logistic regression models.Results Of the 305 participants who completed study surveys, 57% were men and 70% were Black, and the mean age was 60 years. Thirty-six percent of the sample reported food insecurity, 18% reported housing instability, and 31% reported moderate or high-risk substance use. People on hemodialysis who were younger, with lower educational attainment, with lower incomes, or experiencing financial strain were more likely to have material need insecurities (P < 0.05 for all). Among participants living in segregated jurisdictions, men had increased odds of food insecurity compared with women (odds ratio 3.7; 95% confidence interval, 1.61 to 8.53); younger participants (age <55 years) had increased odds of food insecurity compared with older participants (odds ratio 3.3; 95% confidence interval, 1.49 to 7.32). Associations between sex or younger age category and food insecurity were not statistically significant in less segregated counties (P interaction for residential segregationxsex: P = 0.006; residential segregationxyounger age category: P = 0.12).Conclusions Food insecurity, housing instability, and substance use were common among this sample of adults on hemodialysis. Younger adults on hemodialysis, particularly those living in residentially segregated jurisdictions, were at increased risk for food insecurity. Future research should examine whether material need insecurities perpetuate disparities in dialysis outcomes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fd5009deedb551784d2d01d27598b4d",
  "timestamp": "2025-05-15T03:19:51.977323"
}