{
  "id": 6914,
  "title": "Institutional ownership and executive compensation Evidence from US banks during the financial crisis",
  "abstract": "Purpose - The purpose of this paper is to examine the association between institutional investor ownership and the compensation of executives at US banks during the financial crisis period. Design/methodology/approach - This paper uses a linear regression model to examine the association between institutional ownership and the level of executive compensation at US banks. Findings - Institutional investors influence executive compensation at banks with the impact being most pronounced for the CEO.Ownership by the top five investors is associated with greater total compensation. Active investors have the strongest impact on executive compensation as evidenced by a positive association between active ownership and both equity compensation and total compensation. As well, active ownership is negatively associated with bonus compensation. The paper also finds that passive and grey investors influence compensation but to a less significant extent than active investors. Research limitations/implications - The results suggest that the monitoring role of active and passive institutional investors is different in the banking industry. As well, institutional investors were likely a driving factor in shaping the compensation packages of the top executive team during the financial crisis period. Practical implications - Stakeholders at banks should be aware that not all types of institutional investors act as effective monitors over issues such as controlling the amount of executive compensation paid to the highest paid executive, the CEO. Prospective investors should consider the type of institutional investor that owns large blocks of equity when making an investment decision. Namely, the interests of existing institutional investors may differ from their own interests. Originality/value - This paper provides a new perspective on the monitoring roles played by different types of institutional investors. Furthermore, it provides a more comprehensive analysis by investigating the role of institutional investors in shaping the compensation packages of CEOs and other top executives including chief financial officers (CFOs) who play a vital role in risk management at banks.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fdb4f413390a6a759f45e3d97fbeadb",
  "timestamp": "2025-05-15T03:03:13.386662"
}