{
  "id": 9195,
  "title": "How to improve the financial performance of Islamic banks in the MENA region? A Shariah governance perspective",
  "abstract": "PurposeThe purpose of this study is to investigate the impact of Shariah Advisory Board (SAB), Audit committee (AC) and board of directors (BD) characteristics on the performance of Islamic banks (IBs) in the MENA region.Design/methodology/approachThe paper employs a quantitative approach, utilizing both ordinary least squares (OLS) regression and panel data analysis (random effects models) to examine the relationship between corporate governance variables and the performance of IBs. The sample consists of 50 IBs from 10 countries, spanning a seven-year period (2010-2016), with the exclusion of the Covid-19 pandemic period. To ensure the robustness of the results, various sensitivity tests were conducted, including pooled regression OLS and subsample analysis based on adhering to the Accounting and Auditing Organization for Islamic Financial Institutions (AAOIFI) standards.FindingsThe study's findings suggest that the size of the SAB and the membership of at least one member of the SAB on the AAOIFI have a notable adverse effect on the performance of IBs. On the other hand, the AC independence has a positive influence on bank performance. However, there was no significant impact observed for AC size, meeting frequency and BD characteristics on bank performance. The research also revealed nuanced relationships between governance variables and bank performance when analyzing the sample based on AAOIFI adoption. Among banks not adhering to AAOIFI standards, SAB size and CEO duality negatively affected return on assets, while AC independence positively impacted it. For AAOIFI-compliant banks, AC independence significantly improved bank performance, whereas AC meetings exhibited a negative effect. Furthermore, there were no significant relationships observed for return on equity among banks not adhering to AAOIFI standards, whereas AAOIFI-compliant banks experienced positive impacts from AC independence. These results offer valuable insights into the intricate connection between governance attributes and bank performance, particularly in the context of AAOIFI standards adoption.Practical implicationsThe study's findings have important practical implications for various stakeholders in the Islamic banking industry. For bank practitioners and management, the study highlights the significance of enhancing the independence of AC to improve decision-making and risk management, leading to better bank performance. Moreover, careful selection of SAB members can mitigate potential negative effects on performance. Policymakers may consider promoting AAOIFI standards to shape the relationship between governance and bank performance. Investors can use the insights to make informed decisions, and banks with stronger governance may attract more investments.Originality/valueThrough quantitative analysis and AAOIFI-based sample division, this study adds to the growing literature on corporate governance and the performance of IBs by examining the impact of multiple corporate governance variables on the performance of IBs in the MENA region. To provide a theoretical basis for this relationship, three theories, namely agency, stewardship and stakeholder theories, are employed and discussed.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fe3bfed5e0120d918f5b724e585b275",
  "timestamp": "2025-05-15T03:26:26.010493"
}