{
  "id": 4579,
  "title": "Vulnerability and psychosocial impacts of extreme weather events among young people in Australia",
  "abstract": "Aims: There is growing awareness of the negative impact that extreme weather events (also known as climate disasters) have on psychological and social wellbeing. Adolescents are particularly vulnerable to the psychosocial impacts of these events, but research specific to this population is scant. This study examined the impact of exposure to extreme weather events on climate concerns, psychological distress, and social exclusion in a large nationwide sample of adolescents. Method: Data on exposure to extreme weather events, climate concerns, psychological distress, and indicators of social exclusion were obtained from the 2023 Mission Australia Youth Survey-Australia's largest cross-sectional survey of adolescents aged 15 to 19 (N = 19,501). Multivariable multinomial and logistic regression analyses were used to identify participant-specific characteristics that were associated with exposure to extreme weather events and examine the association between event exposure and psychological distress/social exclusion. Results: Adolescents living outside major cities, in lower socioeconomic areas, who identify as trans or gender diverse, living with disability, culturally or linguistically diverse (CALD) and/or Indigenous, were more likely to encounter extreme weather events. Compared to adolescents who were not exposed to extreme weather events, those who were exposed were at greater risk of experiencing climate concerns, psychological distress, financial hardships, and housing challenges. Adolescents whose households were impacted experienced greater financial hardship and housing challenges than those whose communities (but not households) were impacted. Conclusions: Adolescents impacted by extreme weather events experience an increased risk of psychological distress, housing challenges and financial difficulties. Post-event recovery/resilience strategies need to prioritise mental health, housing, and financial support services, with a particular emphasis on supporting adolescents from historically disadvantaged or marginalised backgrounds.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "0fe3994e6eb72909fcf4f307ae24a613",
  "timestamp": "2025-05-15T02:38:56.297273"
}