{
  "id": 7355,
  "title": "Health Insurance Is Associated With Preventive Care but Not Personal Health Behaviors",
  "abstract": "Background: Economists posit 2 mechanisms increasing financial risk to insurers after health insurance gain: ex ante moral hazard (riskier behavior because of reduced personal costs) and ex post moral hazard (increased use of care because of lower care costs). In contrast, the Health Belief Model (HBM), would anticipate no increase in risk behaviors while also predicting increased health care utilization following insurance gain (because of reduced financial barriers to accessing care). Empirical studies examining the association of insurance change with changes in preventive care and health behaviors have been limited and yielded mixed findings. The objective of this study was to examine the association of health insurance change (gain or loss of coverage) with changes in preventive care and health behaviors in a large, nationally representative sample. Methods: We analyzed data from adults >= 18 years old and enrolled for 2 years in the 2000 to 2009 Medical Expenditure Panel Surveys (n = 76,518). Conditional logistic regression analyses modeled year-to-year individual changes in preventive care and health behaviors associated with individual changes in insurance status, adjusting for characteristics varying year to year (income, employment, total health care expenditures, office visits, prescriptions, availability of usual source of care, and health status). Preventive care included adherence to influenza vaccination, colorectal cancer screening, mammography, and Papanicolaou and prostate-specific antigen testing. Health behaviors examined were becoming nonobese, quitting smoking, and adopting consistent use of seatbelts. Results: Insurance gain (loss) was associated with increases (decreases) in preventive care (adjusted odds ratios [95% confidence intervals]: influenza vaccine, 1.27 [1.04-1.56]; colorectal cancer screening, 1.48 [0.96-2.29]; Papanicolaou testing, 1.56 [1.22-2.00]; mammography, 1.70 [1.21-2.38]; prostate-specific antigen, 1.42 [0.98-2.05]). Insurance change was not associated with significant changes in health behaviors. Conclusions: Consistent with both economic theory and the HBM, preventive care increased (decreased) after gaining (losing) coverage. In contrast, health behaviors changed little after insurance change, consistent with the HBM but not with the potential for decreased personal health care costs (ex ante moral hazard).",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1000f1ac17e962c1810d6de1f1e9d7c9",
  "timestamp": "2025-05-15T03:07:32.003661"
}