{
  "id": 4232,
  "title": "The Effects of Financial Stress and Household Socio-Economic Deprivation on the Malnutrition Statuses of Children under Five during the COVID-19 Lockdown in a Marginalized Region of South Punjab, Pakistan",
  "abstract": "The lockdown after the COVID-19 pandemic not only caused public health crises and income stress but also put millions at risk of food insecurity and malnutrition across the globe, especially in low and middle-income countries [LMICs]. This study evaluated the effects of financial stress and household socio-economic deprivation on the nutritional status of 1551 children under the age of five during COVID-19 in Pakistan. A self-administered questionnaire was used between November 2020 and April 2021 to collect information on age, height, children's weight, and socio-economic status from 1152 rural households from underdeveloped regions in Punjab, Pakistan. With the help of the proportionate simple random sampling method, this study employed a model (binary logistic regression) to calculate the likelihood of malnourishment. The findings showed that the stunting, underweight, and wasting prevalence rates during COVID-19 were 58.86%, 41.89%, and 8.11%, respectively, in the Bahawalpur region. According to the binary logistic regression analysis, among the household deprivation status (HDS) categories, the risks of childhood malnutrition were lesser in HDS-2 (OR = 0.05, 95% CI: 0. 005-0.879) and HDS-3 (OR = 0.04, 95% CI: 0.008-0.193). Similar to this, within the financial stress index (FSI) categories, the children in homes with medium financial stress had reduced odds of malnutrition (OR = 0.10, 95% CI: 0.018-0.567), and the children in households with low financial stress had reduced risks of malnutrition (OR = 0.006, 95% CI: 0.005-0.061). The proposed research found that stunting and underweight increased by 17.26% and 12.29% during the COVID-19 lockdown in the Bahawalpur region. Additionally, financial stress and socio-economic deprivation strongly affected children's nutritional statuses during the COVID-19 lockdown in the Bahawalpur region of Southern Punjab.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1018b032bf87df42d63ff33d4a85681f",
  "timestamp": "2025-05-15T02:34:48.900658"
}