{
  "id": 1297,
  "title": "Optimization Trading Strategy Model for Gold and Bitcoin Based on Market Fluctuation",
  "abstract": "As a new type of digital currency, Bitcoin is considered as future gold by various scholars. Therefore, this study considers Bitcoin and gold as a group of hedging assets to conduct investment research and it also discusses the investment rules between Bitcoin and gold: prediction of the rise and fall of Bitcoin, comparison of the characteristics of Bitcoin and gold, and the impact of the transaction procedures of Bitcoin and gold on the final trading results, and formulates trading strategies through optimization algorithms. Then, four machine learning algorithms, i.e., LSTM, BP neural network, Adaboost, and Bagging, are introduced to predict the rise and fall of gold and Bitcoin the next day, and then, the entropy weight method is used to synthesize four predicted results to ensure the robustness of the predicted results. To establish the optimal trading strategy, this study considers the maximum expected return as the goal to develop a single-objective optimization model and historical five-day price volatility as a risk factor. In this study, ant colony, simulated annealing, and genetic algorithms are used to solve the single-objective optimization model. Finally, we conclude that Bitcoin, similar to other financial assets, e.g., gold, is sensitive to shocks and volatile and possesses a relatively quiet cycle. When Bitcoin has an asymmetric impact, Bitcoin and gold can equally treat transactions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "102aaf5f0a9ce129d2281bc014b47c9a",
  "timestamp": "2025-05-15T02:01:11.881902"
}