{
  "id": 3499,
  "title": "Intelligent Evaluation and Early Warning of Liquidity Risk of Commercial Banks Based on RNN",
  "abstract": "With the downward pressure of China's economy and the impact of the epidemic, the accumulated market risk has increased the liquidity pressure of the banking industry, and the mismatch between deposit maturity and loan maturity is the main cause for the increase of liquidity risk. The twenty-first century is the era of rapid and in-depth development of data management technology. The explosive growth of massive financial data makes the information data related to the liquidity risk of commercial banks present the characteristics of complexity, diversity, and heterogeneity. The traditional risk early warning model cannot deal with the influence between a large number of influencing factors and the nonlinear factors of commercial bank liquidity risk. Based on this transformation, the circular neural network model is introduced into the field of liquidity risk early warning of commercial banks from the perspective of the mismatch risk of financing maturity of commercial banks, and the driving factors and risk warning signs of liquidity risk of commercial banks are further analyzed from the institutional level, policy level, industry level, and micro commercial bank level. This paper uses network crawler technology, text analysis, and grounded analysis technology to intelligently identify the liquidity risk of commercial banks and establishes an early warning index system based on the influencing factors of commercial banks and internal liquidity risk. Also, it constructs an intelligent early warning model of commercial bank liquidity risk based on deep learning and uses the data of commercial banks from 2000 to 2020 for early warning. The results show that the constructed model has high accuracy, which can provide support for banks and relevant government departments to formulate and resolve bank liquidity risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10593b29cfa5f2995f3e08410a3ccd5f",
  "timestamp": "2025-05-15T02:26:48.582122"
}