{
  "id": 5592,
  "title": "Dependence between selected perspectives in the Balanced Scorecard",
  "abstract": "Balanced Scorecard (BSC) is one of the methods for measuring of the company's performance, strategy formulation and subsequent management leading to improving competitiveness. Nowadays company performance has an important role because the competitive environment is much more changeable and more difficult to predict because of the influence of globalization. BSC is worldwide used both in large, medium and small businesses regardless of the field of business. According to Knapkova, Homolka and Pavelkova (2014), this model is used only by 13% of the enterprises in the Czech Republic. BSC monitors business performance from four perspectives: Financial, Customer, Internal Process, Learning and Growth. The main aim of this paper is to verify whether there is a correlation between Learning and Growth and Financial perspective. Data were obtained from the database Albertina Gold and from quantitative research in companies in 2015. As sample small and medium enterprises in Czech Republic were chosen by random selection. Data were analysed by using regression analysis. Based on the analysis the dependence of some financial indicators on the attitude of the company to the risk and on long-term or short-term orientation was proved. BSC is spread in 30-50% companies all over the word, in Australia this method is used even in 88% companies (Al Sawalqa, Holloway and Alam, 2011). Due to proven dependence it would be appropriate to raise Czech companies' awareness of advantages of this method.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "105abb7b0e41908dfb3682cf86d0a5a8",
  "timestamp": "2025-05-15T02:49:21.716827"
}