{
  "id": 2715,
  "title": "Exploring the non-linear dynamics between Commercial Real Estate and systemic risk",
  "abstract": "The commercial real estate (CRE) market significantly influences financial stability, given its size, use as collateral, and cyclicality. This study explores macro-financial vulnerabilities arising from the CRE market, revealing that adverse developments in CRE capital values amplify systemic risk across financial sub-sectors, namely, banks, insurance companies and investment trusts, consistent with the collateral channel hypothesis. The CRE and financial markets relationship, however, displays nonlinearities. We introduce a UK CRE Misalignment index which integrates various market indicators to assess deviations from fundamental values in the CRE sector. We find that during market misalignments, the link between systemic risk and CRE growth weakens, suggesting that further property price increases in an overheated market could lead to a bubble and heightened systemic risk, in line with the deviation hypothesis. Finally, we employ a quantile regression model that captures another aspect of this non-linear relationship. We find that positive (negative) developments in the CRE market decrease (increase) the right tail of the historical systemic risk distribution, but CRE variation has a weak impact on the left tail and cannot effectively reduce systemic risk in periods of growth.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "108030cb4cb4f3e04d3fadd42d9e30ee",
  "timestamp": "2025-05-15T02:18:37.024773"
}