{
  "id": 5334,
  "title": "Accurate diagnosis of term-preterm births by spectral analysis of electrohysterography signals",
  "abstract": "Preterm delivery contributes to an increased risk of fetal and maternal death as well as several health deficiencies, thereby requiring special care and treatment that result in high financial costs. It is therefore of key importance to diagnose preterm delivery in advance in order to avoid or minimize its undesirable consequences. This paper proposes a novel method for non-invasive diagnosis of preterm delivery based on the classification of electrohysterography (EHG) signals. First, the EHG signal, which is related to the electrical activity of uterine muscles is recorded from the maternal fundus using surface electrodes. Then, the signal is sliced into frames for spectral analysis. Next, spectral analyses of the individual EHG signal frames are carried out and centroid frequencies of the frames are computed, establishing the elements of a feature vector that represents the time-varying spectral content of the EHG signal. Finally, this feature vector is employed for the classification of the underlying EHG signal for term-preterm diagnosis. The efficiency of the proposed approach is evaluated and compared with representative methods from the literature. Our results demonstrate that the proposed approach exhibits superior performance over other methods.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "109466c79a1dbfd16306c7cace12a716",
  "timestamp": "2025-05-15T02:46:44.903325"
}