{
  "id": 4136,
  "title": "Resources extraction and geopolitical risk: A novel perspective of World's biggest economies",
  "abstract": "During the last three decades, the issue of the nexus between natural resource extraction and economic growth is still unresolved. Due to conflicting evidence regarding natural resources' role in economic development and the absence of empirical assessment concerning geopolitical risk, this study examines the nexus between these variables in the World's largest economies from 1989 to 2021. This study used panel diagnostic tests to validate the non-normal distribution, slope heterogeneity, and cross-section dependence. Three cointegration estimators validate the long-run equilibrium relationship between the study variables. Using the non-parametric approach, this study found that natural resource extraction, geopolitical risk, and financial development boost these economies' economic growth and performance throughout quantiles. In contrast, the findings validate renewable energy consumption's adverse influence on economic growth across quantiles. The bootstrap quantile regression authenticates the empirical findings as a robust panel estimator. This study suggests efficient extraction and utilization of natural resources, improved financial sector, and reduced geopolitical risk to accelerate economic performance and growth. Also, this study recommends further investment in research and development to enhance renewable production and its efficient consumption.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "109edcd7bfc0d116da1f4b2dad3fd094",
  "timestamp": "2025-05-15T02:33:42.051295"
}