{
  "id": 864,
  "title": "Credit default swap prediction based on generative adversarial networks",
  "abstract": "Purpose Financial price forecast issues are always a concern of investors. However, the financial applications based on machine learning methods mainly focus on stock market predictions. Few studies have explored credit risk predictions. Understanding credit risk trends can help investors avoid market risks. The purpose of this study is to investigate the prediction model that can effectively predict credit default swaps (CDS). Design/methodology/approach A novel generative adversarial network (GAN) for CDS prediction is proposed. The authors take three features into account that are highly relevant to the future trends of CDS: historical CDS price, news and financial leverage. The main goal of this model is to improve the existing GAN-based regression model by adding finance and news feature extraction approaches. The proposed model adopts an attentional long short-term memory network and convolution network to process historical CDS data and news information, respectively. In addition to enhancing the effectiveness of the GAN model, the authors also design a data sampling strategy to alleviate the overfitting issue. Findings The authors conduct an experiment with a real dataset and evaluate the performance of the proposed model. The components and selected features of the model are evaluated for their ability to improve the prediction performance. The experimental results show that the proposed model performs better than other machine learning algorithms and traditional regression GAN. Originality/value There are very few studies on prediction models for CDS. With the proposed novel approach, the authors can improve the performance of CDS predictions. The proposed work can thereby increase the commercial value of CDS predictions to support trading decisions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10a3ba0cb1b11635a354d95969860917",
  "timestamp": "2025-05-15T01:56:17.461799"
}