{
  "id": 7075,
  "title": "Impact of transition in work status and social participation on cognitive performance among elderly in India",
  "abstract": "Introduction Transition to the oldage marks a change in work and social participation. Socio-economic and physical conditions arising from this change pose a risk for cognitive outcomes among the elderly. Gender shows different pathways to deal with the pattern of participation and to maintain cognitive health. In India, work participation in the oldage is an outcome of financial deprivations and lack of support. At the same time, alterations in social interactions can induce stress and precipitate cognitive decline in oldage. A dearth of studies in this domain motivates us to estimate the effect of change in work and social participation on cognitive performance of the elderly in the Indian context. Methods The study has used the cross-sectional data on 5212 elderly from the World Health Organization's Study on global AGeing and adult health (Wave 1) (2007-08) in India. A composite score for cognition was generated. Interaction between gender, work status and social participation with respect to cognition was performed using multivariate linear regression. A linear prediction of the cognitive scores across all levels of social participation was post-estimated thereafter. Results The study found that the elderly who were 'presently working' and showed 'more' social participation had a higher mean score for cognitive performance than their counterparts. Results of regression did not indicate any gender interaction with work or social participation. Participation in social activities 'sometimes' by those who were 'retired' or 'presently working' showed a positive and significant co-efficient with cognition among respondents. The post-estimated values for cognition specified that 'retired' and 'presently working' elderly had higher cognition scores. In the age group of 60-69 years, cognition scores were higher for those who were 'retired' and did 'more' social participation as compared to the other elderly. Conclusion Cognitive aging is attenuated by higher participation in work and social activities. Adequate financial schemes or the pension system can protect the elderly from developing further stress. Retirement at an appropriate age, along with a reasonable amount of social participation, is a boon for cognitive wellbeing. Hence, building more support can contain the detrimental effect of participation restriction on cognitive outcome among elderly.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10adffa85cc5d17709adf9f9ad759b9e",
  "timestamp": "2025-05-15T03:05:03.379987"
}