{
  "id": 673,
  "title": "Integrated Artificial Intelligence and Visualization Technique for Enhanced Management Decision in Today's Turbulent Business Environments",
  "abstract": "The dramatic deterioration in a corporate's profitability not only threatens its own interests, employees, and investors, but can also impact external entities and people through financial losses and high risk exposure. Thus, in today's turbulent market environments an essential issue arises as to how to set up an effective pre-warning model that provides managers with specific avenues to avoid financial troubles from getting worse and offers investors useful directions to adjust their investment portfolios. However, extant forecasting models are not yet capable of fully explaining the relationships between past and future performances, which may be due to the omission of some critical information. To capture the multidimensional nature of performance assessment, this study extends a singular data envelopment analysis (DEA) specification to multiple DEA specifications and further incorporates them with a risk-adjusted metric so as to present an overarching reflection of corporates' operations. To make the outcome much more accessible to non-specialists, we utilize a visualization technique to represent the data's main structure and then feed the analyzed data into a twin parametric-margin support vector machine (TPSVM) to construct the forecasting model. Due to the obscure nature of the SVM-based model, this study executes the multiple instances learning (MIL) algorithm to extract the inherent decision logics and to represent them in human readable way. After examining it with real cases, the proposed model is a promising alternative for performance assessment and forecasting.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10b47effb99ac57cbff4f718cae803e3",
  "timestamp": "2025-05-15T01:53:59.304882"
}