{
  "id": 4136,
  "title": "CancerTrialMatch: a computational resource for the management of biomarker-based clinical trials at a community cancer center",
  "abstract": "Motivation The widespread implementation of next-generation sequencing in cancer care has enabled routine use of molecular and biomarker profiling. At our cancer center, as with many others, biomarker-based clinical trials are increasingly available to oncologists as potential treatment options via molecular tumor boards. To better support this effort, we developed CancerTrialMatch, a systematic approach to capture structured clinical trial data and match patients to trials based on their disease characteristics and sequencing profiles.Results CancerTrialMatch is an open-source application designed to streamline clinical trial curation and patient trial matching, while also enabling an institution's curated trial portfolio to be distributed across the institution for easy access to providers, care teams and researchers. It facilitates curating, updating, and searching for trials through a semi-automated interface built using R Shiny, MongoDB, and Docker. While much of the trial data is retrieved via the clinicaltrials.gov Application Programming Interface, certain items like biomarkers and disease subtypes are entered manually. The user inputs disease type using the OncoTree classification, and provides relevant biomarker details, such as mutations, copy numbers, fusions, and other disease-specific markers. This resource reduces the time required for institutional trial management and helps to identify potential clinical trials for patients, ultimately supporting larger clinical trial enrollment and enhancing the clinical application of precision oncology.Availability and implementation CancerTrialMatch was implemented and tested on Windows 11 (64-bit, 32 GB RAM) using WSL2 with Ubuntu 22.04. Docker 27.0.3 and Docker Compose 2.28.1 were used to build images and containers. Users can build it by cloning the repo and following the README instructions and supplemental file (cancertrialmatchsupplemental.pdf) . The source code and example data are available in GitHub and Figshare at https://github.com/AveraSD/CancerTrialMatch and 10.6084/m9.figshare.28447367 respectively.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10c608105a3f55cc4c3bf6a9922f092f",
  "timestamp": "2025-05-15T01:23:58.192979"
}