{
  "id": 5943,
  "title": "Impact of socioeconomic status on longitudinal accumulation of cardiovascular risk in young adults: the CARDIA Study (USA)",
  "abstract": "Our objectives were to describe the trajectories of biological risk factors of cardiovascular disease in young adults, and to study the association of socioeconomic status (SES) with aggregate risk scores that summarize longitudinal risk accumulation from multiple risk factors. We used data from a prospective, bi-racial. cohort study of 18-30-year-old adults in the USA, initiated in 1985, with 10-year follow-up. SES was measured by parental education level. financial hardship during the study, and the participant's education level by the end of the study. We studied growth patterns of seven biological risk factors for cardiovascular disease using a semi-parametric, class-mixture model to identify clusters, of individuals with distinct growth trajectories. Risk scores that summarize risk from all seven risk factors were created to reflect risk at baseline, longitudinal risk change over 10 years. and total accumulated risk. Multivariable regression was used to study their associations with SES within each race/gender group. We found tracking of all seven risk factors: in each case, the cluster with the highest baseline value maintained its position as the highest-risk cluster over the next 10 years. After adjustment for age, lifestyle, and healthcare access. SES was associated inversely with baseline risk score in women (black and white), with risk change score in all four race/gender groups, and with accumulated risk score in women (black and white) and in white men. Our findings suggest that individuals with high overall cardiovascular risk in midlife can be identified by their relatively higher values of risk factors in younger ages and that socioeconomic differences in cardiovascular risk start accumulating early in life. (C) 2004 Elsevier Ltd. All rights reserved.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10c9f97d9e7df39dc329b57e2bcd20e2",
  "timestamp": "2025-05-15T02:53:03.111855"
}