{
  "id": 4161,
  "title": "Living alone and the risk of depressive symptoms: a cross-sectional and cohort analysis based on the China Health and Retirement Longitudinal Study",
  "abstract": "BackgroundThere were a few studies that examined the longitudinal association between living alone and depressive symptoms, and the vast majority of them were conducted in patients with certain diseases, such as heart failure, cancer, and glaucoma. This study aimed to examine the association between living alone and depressive symptoms in a large representative older Chinese population.MethodsThe China Health and Retirement Longitudinal Study (CHARLS) data from 2015 to 2018 were used. Living alone was defined as participants who did not live with others ever or more than 11 months in the past year at baseline. Depressive symptoms were measured using the 10-item Center for Epidemiological Studies-Depression Scale (CES-D10). The multivariate logistic regression was used to estimate the relationship between living alone and depressive symptoms.ResultsThere were 5,311 and 2,696 participants >= 60 years old included in the cross-sectional and cohort analysis, respectively. The risk of depressive symptoms in participants who lived alone was significantly higher than those who lived with others in both cross-sectional (OR:1.33; 95%CI:1.14,1.54) and cohort analysis (OR:1.23; 95%CI:0.97,1.55). There was a significant interaction between financial support and living alone (Pinteraction = 0.008) on the risk of depressive symptoms. Stratified analyses showed that, compared to those who lived with others, the risk of depressive symptoms in participants who lived alone increased by 83% (OR:1.83; 95%CI:1.26,2.65) in participants receiving lower financial support. However, we did not find statistically significant associations in participants with medium (OR:1.10; 95%CI: 0.74,1.63) and higher financial support (OR: 0.87; 95%CI: 0.53,1.41).ConclusionLiving alone was associated with a higher risk of depressive symptoms in the Chinese older population, and this association was moderated by the receipt of financial support. Living alone may be an effective and easy predictor for early identification of high-risk populations of depression in the older population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10cfde331406bdd9183fee32e9f82a71",
  "timestamp": "2025-05-15T02:33:42.170517"
}