{
  "id": 1144,
  "title": "Nexus between vulnerability and adaptive capacity of drought-prone rural households in northern Bangladesh",
  "abstract": "Bangladesh is one of the world's most climate-vulnerable countries. The appraisal of household vulnerability and capacity to adapt under climate change is therefore crucial for developing effective disaster risk reduction policies. This study explored the nexus between vulnerability and capacity of rural drought-prone households using survey data of 400 respondents from northern Bangladesh. Through extensive rigorous literature review, 22 and 25 indicators were employed to develop the vulnerability and capacity index, respectively. Co-occurrence network analysis was employed to show the nexus among different classes of capacity and vulnerability. Spearman correlation was also performed to analyze the nexus between vulnerability and capacity. The results reveal that households' vulnerability varies across livelihood assets (human, social, financial, physical, and natural), but capacity follows a similar distribution pattern. A significant negative association was found between vulnerability and adaptive capacity, whereas the strong correlations between social and human capital, human and financial capital, social and financial capital, and physical and natural capital were identified in this study. Future projection (up to 2024) using support vector machine algorithm shows that overall drought adaptive capacity will increase, while vulnerability will decrease. The outcomes of this study would help planners and policy-makers in planning and taking proper initiatives that might be useful for adopting efficient disaster risk reduction strategies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10e06cffcccd8fda0df4fd4142a8a3f1",
  "timestamp": "2025-05-15T01:59:21.657279"
}