{
  "id": 4116,
  "title": "Loss given default determinants in a commercial bank lending: an emerging market case study",
  "abstract": "The purpose of this paper is to analyse the loss given default (LGD) determinants in case of a typical loan portfolio consisting of SME loans in a commercial bank operating in one of the quickly developing banking markets, i.e. in Slovenia. Accurate LGD estimates of defaulted bank claims are important for provisioning reserves for credit losses, calculating adequate risk capital and determining fair pricing risky bank loans. While most of the empirical literature in the field concentrates on corporate bond markets to estimate losses in the event of default, we use a unique individual bank data set on SME loan losses. Due to the proprietary nature of data only few studies of this kind have been published so far and to our knowledge none of them covers the Eastern European banking markets. In the first stage of the analysis we estimate the LGD variable by applying the discounted cash flow approach, while in the second stage we analyse its determinants by using the ordinal regression analysis. Our findings suggest that reliable LGD estimates can be produced by discounting expected loan related future cash flows and that explanatory factors, such as type of collateral, type of industrial sector, last available loan rating, size of the debt and loan maturity satisfactorily explicate variability of the LGD variable in the specific banking market. All the results are not only relevant to the impairment policy determination and capital adequacy calculation in the specific bank, but also to the evaluation of SME loans characteristics in developing markets.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10e04f0cf4af1c84c3671a429a3caeeb",
  "timestamp": "2025-05-15T01:23:58.077429"
}