{
  "id": 6071,
  "title": "Gender inequality increases women's risk of HIV infection in Moshi, Tanzania",
  "abstract": "This study examined the hypothesis that multiple dimensions of gender inequality increase women's risk for HIV infection using a population-based survey of 1418 women aged 20 to 44 in Moshi, Tanzania. Three forms of HIV exposures were assessed reflecting gender power imbalance: economic exposures (age difference between partners and partner's contributions to children's expenses), physical exposures (coerced first sex and intimate partner violence) and social exposures (ever had problems conceiving). Behavioural risk factors included number of sexual partners for women in the last three years, partner had other wives or girlfriends, non-use of condom and alcohol use at least once a week in the last 12 months. Multivariate logistic regression analysis showed that a woman had a significantly elevated risk for HIV if she had a partner more than 10 years older (OR=2.5), her partner made low financial contributions to children's expenses (OR= 1.7), or she experienced coerced first sex before age 18 years (OR=2.0) even after taking into account the effects of risk behaviour factors. The association between ever had problem conceiving and HIV infection was explained away by risk behaviour factors. The findings lend support to the hypothesis that economic deprivation and experience of sexual violence increase women's vulnerability to HIV, providing further evidence for extending the behavioural approach to HIV interventions to incorporate women's economic empowerment, elimination of gender-based violence and promotion of changing attitudes and behaviours among men.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10f12f9b8733f48348bf83b5a80ac590",
  "timestamp": "2025-05-15T02:54:38.739369"
}