{
  "id": 8998,
  "title": "Describing quality of life trajectories in young Hispanic women with breast cancer: 5-year results from a large prospective cohort",
  "abstract": "Introduction: Cancer treatments have a detrimental impact on the quality of life (QoL) of young women with breast cancer (YWBC). Research exploring QoL trajectories has been mostly centered on postmenopausal women. Here we report longitudinal changes across all QoL domains and associated factors in YWBC. Methods: In this prospective longitudinal cohort study, women aged <= 40 with stage I-III BC completed the European Organization for the Research and Treatment of Cancer Core QoL questionnaire at diagnosis and during 4 follow-up visits over 5 years, alongside demographic and clinical data collection. Group-based multivariate trajectory modeling was used to identify patient groups based on their functional and symptom scores, finding 3 groups (best, good, and poor). Factors associated with each trajectory pattern were identified with multinomial logistic models. Results: A total of 477 women (median age: 36; IQR: 32-38) were clustered into the best (n = 259, 54 %), good (n = 79, 17 %), or poor trajectory groups (n = 139, 29 %). Throughout the disease, patients with a poor QoL experienced clinically significant impairment in emotional functioning, nausea and vomiting, and pain. They also had significant cognitive impairment, dyspnea, and diarrhea. Patients with a good QoL had clinically meaningful diarrhea for the first 7 months, while those with the best QoL had clinically important nausea and vomiting during the first 2 months since diagnosis. Noteworthy, all groups experienced significant financial difficulties throughout their follow-up. Regular alcohol consumption at diagnosis (aOR [adjusted odds ratio] 1.64; 95 % CI [confidence interval] 1.02-2.65) and HER2-positive BC (aOR 2.53; 95 % CI 1.35-4.73) were independent factors associated with classification to the poor and good groups, respectively. Conclusion: This study underscores the variability in QoL among YWBC and the importance of ongoing monitoring. Strategies to improve access to economic resources, manage treatment-related adverse effects, and support patients in discontinuing modifiable risk factors are needed.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10f66670ebbc93f61ec8f6849b065847",
  "timestamp": "2025-05-15T03:24:26.395078"
}