{
  "id": 7305,
  "title": "The Role of Financial Insecurity, Racial Discrimination, and Comorbid Health Conditions on Mental Health in Canada and the United States During the COVID-19 Pandemic",
  "abstract": "Canada and the United States have long histories of racism that permeate every institution and structure in our societies. While anti-racism movements have gained strength in recent years, we know very little about current rates of discrimination in the two countries or the impact on communities during the COVID-19 pandemic. Informed by critical race feminist theory, this paper examines levels of discrimination experienced by survey participants from Canada and the United States during the COVID-19 pandemic with a cross-sectional survey conducted during October 2021. We then assessed the broader impact of experiencing discrimination on depressive symptoms using logistic regression analysis. In both Canada and the US, multivariate logistic regression maintained that experiencing discrimination resulted in higher probabilities of reporting moderate to severe depressive symptoms. Other important factors included age, financial insecurity, and comorbid health conditions. Overall findings suggest that Indigenous, Black, and other racialized communities who experienced discrimination reported higher rates of depressive symptoms despite controlling for other factors. From a comparative perspective, discrimination rates were similar in Canada and the US, and had similar proportions across racial/ethnic groups. Discrimination rates did not vary significantly by gender, nor was gender a statistically significant risk factor for depressive symptoms. Further research, including qualitative studies, could fully assess the impact of gender on experiences of racism and depressive symptoms during the pandemic. The paper concludes with policy and public education suggestions to combat racial discrimination and highlights the need for added government action during times of crises.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10f707ed536f44a31af245b68513fd1a",
  "timestamp": "2025-05-15T03:07:02.705726"
}