{
  "id": 5121,
  "title": "The prevalence and correlates of psychological distress in Australian tertiary students compared to their community peers",
  "abstract": "Objective: To examine differences between university students, vocational education and training (VET) students, tertiary students combined and non-students in the prevalence of psychological distress and the socio-demographic and economic characteristics associated with psychological distress. Method: The Kessler Psychological Distress Scale was used to estimate the prevalence of moderate (16-21) and high (22-50) distress with data from three national surveys: the 2007 Household, Income and Labour Dynamics in Australia (HILDA) survey, the 2007-08 National Health Survey (NHS), and the 2007 National Survey of Mental Health and Wellbeing (NSMHWB). Multinomial logistic regression models were also estimated using the HILDA survey to examine any differences in the characteristics associated with moderate and high distress between the groups. Results: There was evidence of a higher prevalence of moderate distress in tertiary students than non-students in the HILDA survey (27.1% vs 21.2%, p < 0.05) and the NSMHWB (27.4% vs 19.5%, p < 0.05), but not the NHS (26.1% vs 22.5%, p > 0.05). However, standardized rates for age and gender attenuated the difference in moderate distress in the HILDA survey and the NSMHWB. The prevalence of high distress was similar between the groups in all three surveys. The multinomial regression analyses using the HILDA survey showed the following subgroups of students to be at a greater risk of high distress relative to those with low distress: younger university students, and university and VET students with financial problems. Compared to VET students and non-students, younger university students and those who worked 1-39 hours per week in paid employment were at a greater risk of high distress. Conclusions: There is evidence that tertiary students have a greater prevalence of moderate, but not high distress than non-students. Financial factors increase the risk of high distress and are likely to take on more importance as the participation rate of socio-economically disadvantaged students increases.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "10f711c1e443d4d3f66531e54a5dd017",
  "timestamp": "2025-05-15T02:44:43.813046"
}