{
  "id": 8001,
  "title": "Patient and Perioperative Variables Affecting 30-Day Readmission for Surgical Complications After Hip and Knee Arthroplasties: A Matched Cohort Study",
  "abstract": "Background: Changes in reimbursement for total hip and knee arthroplasties (THA and TKA) have placed increased financial burden of early readmission on hospitals and surgeons. Our purpose was to characterize factors of 30-day readmission for surgical complications after THA and TKA at a single, highvolume orthopedic specialty hospital. Methods: Patients with a diagnosis of osteoarthritis and who were readmitted within 30 days of their unilateral primary THA or TKA procedure between 2010 and 2014. Readmitted patients were matched to nonreadmitted patients 1: 2. Patient and perioperative variables were collected for both cohorts. A conditional logistic regression was performed to assess both the patient and perioperative factors and their predictive value toward 30- day readmission. Results: Twenty-one thousand eight hundred sixty-four arthroplasties (THA = 11,105; TKA = 10,759) were performed between 2010 and 2014 at our institution, in which 60 patients (THA = 37, TKA = 23) were readmitted during this 5- year period. The most common reasons for readmission were fracture (N = 14), infection (N = 14), and dislocation (N = 9). Thirty-day readmission for THA was associated with increased procedure time (P =.05), length of stay (LOS) shorter than 2 days (P =.04), discharge to a skilled nursing facility (P =.05), and anticoagulation use other than aspirin (P =.02). Thirty-day readmission for TKA was associated with increased tourniquet time (P = .02),LOS < 3 days (P <.01), and preoperative depression (P = .02). In the combined THA/TKA model, a diagnosis of depression increased 30- day readmission (odds ratio 3.5 [1.4-8.5]; P <.01). Conclusion: Risk factors for 30- day readmission for surgical complications included short LOS, discharge destination, increased procedure/tourniquet time, potent anticoagulation use, and preoperative diagnosis of depression. A focus on risk factor modification and improved risk stratification models are necessary to optimize patient care using readmission rates as a quality benchmark. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1101d8583e0c2a9d45bfab910241fbb1",
  "timestamp": "2025-05-15T03:14:07.306008"
}