{
  "id": 2319,
  "title": "Seismic erratic noise attenuation using unsupervised anomaly detection",
  "abstract": "This study introduces a new attribute to identify seismic erratic noise, i.e. outlier, in the context of unsupervised anomaly detection and is defined as local outlier probabilities. The local outlier probabilities calculate scores of degrees of isolation, i.e. outlier-ness, for each object in a data set, which represents how far an object is deviated from its surrounding objects. Since the local outlier probabilities combines a density-based outlier detection method with a statistically oriented scheme, its scoring system provides regularized outlier-ness, which is an outlier probability, to be used for making a binary decision to do inclusion or exclusion of an object; such a decision only requires a simple and straightforward threshold on a probability. Based on the binary decision that flags outliers versus non-outliers, local outlier probabilities-denoising workflows are developed by combining multiple steps to complete an application of the local outlier probabilities to attenuate seismic erratic noise. Higher stability and improved robustness in the detection and rejection of seismic erratic noise have been achieved by implementing moving windows and decision tree-based processes. To avoid loss of useful signal energy, signal enhancement applications are additionally suggested. Numerical experiments on synthetic data investigate the applicability of the proposed algorithms to seismic erratic noise attenuation. Field data examples demonstrate the feasibility of a local outlier probabilities-denoising application as an effective tool in seismic denoising portfolio.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1118580f9a06b94f3b3971520aaa396d",
  "timestamp": "2025-05-15T01:05:39.652646"
}