{
  "id": 3907,
  "title": "Digital transformation of technological IP portfolio analysis for complex domain of satellite communication innovations",
  "abstract": "The latest mobile network protocols, currently adopted by most of global telecom-services, are at the level of fifth generation (5G) technological standards. However, 5G speed and bandwidth will not be likely to catch up with the advanced AI- and IoT-based applications, which require very low latency with wide coverage. Thus, industry is looking ahead beyond 5G (B5G) communication enabling technologies. Further, in order to provide global communications without disconnections due to geographical barriers (e.g., oceans and high mountains lacking base stations), low earth orbit (LEO) satellites become the ideal solution for connecting entire global network with terrestrial and non-terrestrial links. In this research, the integration of LDA topic modeling, clustering algorithm, technology-function matrix, and s-curve modeling is proposed to analyze complex IP portfolio for B5G satellite technologies. The domain ontology, which describes the transdisciplinary features of the B5G satellite technology taxonomy, is derived and refined in a hierarchical schema after thorough literature review and 2357 domain patents being collected and analyzed. This research aims to discover the main trends and the potentials of satellite communication technologies through novel tech-mining techniques in both macro- and micro-levels. During macro-analyses, trends of global inventions, the leading assignees, and the distribution of technology categories are depicted. We identify the leading patent assignees with their domain patents (published from 2012 to 2021) and distributions under sub-technical categories. Further, the micro-analyses discover the innovations of major technological themes, showing key R&D hot-spots, cold-spots and lifecycle maturities of sub-technical categories. Finally, the research strategies for technical-savvy countries (e.g., Taiwan, with advances in its semiconductor and ICT industries) are presented highlighting its strategic innovations related to the complex communication domain.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1120586d98ce717bdd4309237a690e72",
  "timestamp": "2025-05-15T01:22:11.833533"
}