{
  "id": 940,
  "title": "Volatility transmission and volatility impulse response functions in crude oil markets",
  "abstract": "Using daily data from July 2005 to February 2011 for WTI, Dubai and Brent futures contracts, we employ a VAR-BEKK model to investigate crude oil markets integration on the second moment. We also quantify the size and persistence of these connections through the analysis of Volatility Impulse Response Functions (VIRF) for two historical shocks, namely the 2008 Financial Crisis and the BP Deepwater Horizon oil spill. We observe that Brent and Dubai crude are highly responsive to market shocks, whereas WTI crude shows the least responsiveness of the three benchmarks, which creates questions about its predominance as a benchmark crude oil. Furthermore, we fit the density of the VIRF at different forecast horizons. These fitted distributions are asymmetric, showing that the probability of observing a large impact of a shock is lower while the probability of a relatively smaller impact is much higher. Finally, we simulate the VIRF for a given probability of a random shock. The VIRF shows that only a large shock (derived from a smaller probability) will result in an increase in expected conditional volatilities. These results provide useful insights into the volatility transmission mechanism in crude oil markets and their associated risk estimation, and may have significant implications for various market participants and regulators. (C) 2012 Elsevier B.V. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1133a40b2d4a5338eee5ba8f194b9621",
  "timestamp": "2025-05-15T01:44:35.480179"
}