{
  "id": 3208,
  "title": "Big Data Analysis with Momentum Strategy on Data-driven Trading",
  "abstract": "Data-driven trading approaches have become more widespread in quantitative hedge funds due to the availability of large amount of financial data and the popularization of quantitative trading strategies. One of the most popular trading strategy is called momentum strategy which seeks the opportunity of market volatility by buying the stock when the price goes up and selling them as soon as there is a sign showing they would go down. Although this concept is clear to the majority, building one concrete momentum strategy remains a problem to every investor. In response to this concern, in this paper, we propose a the detailed algorithm to build a concrete momentum strategy. First, we compare the performance of four basic momentum strategies with respect to their return in S&P 500 index and its option investment. Then we optimize the momentum trading strategy by adding one extra accelerating factor and then enhance with decision tree investment method so as to capture more market trading opportunities and become more profitable. From the experiment, we find that straddle hedging strategy is proved to effectively lower the draw-down risk. In addition, although using options rather than stocks would largely raise the portfolio variance, it will significantly avoid the bad performance of momentum strategy during the bear market.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11362c0bf67bd1f724e9bab9b1176713",
  "timestamp": "2025-05-15T02:23:33.621807"
}