{
  "id": 7834,
  "title": "Adoption of Renewable Energy Technology on Farms for Sustainable and Efficient Production: Exploring the Role of Entrepreneurial Orientation, Farmer Perception and Government Policies",
  "abstract": "Traditional energy consumption raises greenhouse gas emissions, which is a major concern in China. Agricultural energy consumption accounts for one third of China's greenhouse gas emissions. Thus, current patterns of energy consumption on farms are both unsustainable and inadequate since rural communities in emerging nations have limited access to energy sources. This study explores the factors affecting the adoption of renewable energy on farms and examines the effect of such adoption on technical efficiency. The data were collected from 801 farmers selected through a multistage random and purposive sampling method in a face-to-face survey in China. Logistic regression, data envelopment analysis and propensity score matching were used to analyze the data. The descriptive statistics depicted that renewable energy technology was adopted by more than 25% of the total farmers. The logistic regression results depicted that education, farm size, government financial support, perceptions of renewable energy (usefulness, cost effectiveness, environmental friendliness and information availability) and farmer entrepreneurial orientation dimensions (risk-taking, innovativeness and pro-activeness) all significantly affected the adoption of renewable energy technology on farms. Farmers who perceived renewable energy as more useful and cost-effective than conventional energy technology were 1.89 and 2.13 times more likely to adopt it on their farms, respectively. Farmers who perceived renewable energy as more environmentally friendly than traditional energy technology were 1.54 times more likely to use it on their farms. The findings also showed that innovative farmers were 2.24 times more likely to adopt renewable energy technology on their farms. The propensity score matching results showed that the technical efficiency of adopters of renewable energy was 10% higher than that of nonadopters. The study suggests that agriculture must be transformed to fulfill the existing and forthcoming demand for food and energy in an impartial and ecologically sustainable manner.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1137f37762e786ccdb70aa99dbbba5fb",
  "timestamp": "2025-05-15T03:12:36.472097"
}