{
  "id": 7423,
  "title": "Knowledge management disclosure and banking performance: evidence from the European listed banks",
  "abstract": "PurposeThe purpose of this paper is to explore the impact of knowledge management, measured through a new disclosure index, on the financial performance of European listed banks. By developing the disclosure indicator, this paper analyzes the evolution over time of the level of disclosure of knowledge management. Therefore, this paper aims to investigate the disclosure index and its role as a lever to improve banking performance.Design/methodology/approachThis paper is built upon different steps. First, this paper applies the content analysis research method on European listed banks, analyzing information from the annual reports to elaborate a disclosure-based indicator. Second, this paper performs a multiple regression between the indicator, banks' efficiency, market-based measures and risk to detect the role of knowledge management in the different performance configurations.FindingsBased on an analysis of European listed banks, the results have revealed that disclosure of knowledge management information is not a common practice, but a growing awareness is present. Furthermore, the adoption of the disclosure of these themes is positively associated with financial performance, in particular with profit measures and market-based measures. However, the findings cannot be extended to all performance configurations, highlighting a specific characterization of the impact of knowledge management disclosure.Practical implicationsEvidence contributes to extending the existing literature and drafting the state of the art of the quality and quantity of knowledge management information in the banks' disclosure in the European scenario. The results confirm that the lack of a commonly accepted framework for knowledge reporting affects the quality and quantity of disclosure, failing to cover stakeholder needs. Policymakers can play a greater role in supporting knowledge management disclosure. This paper gives managers a metric to use to determine areas where knowledge practices and behaviors are well disclosed. This paper is a useful baseline for academics, practitioners and decision-makers to understand the effect on different areas of financial performance.Originality/valueFirst, the originality of the findings derives from the need to establish an adequate knowledge disclosure measure. The work provides a starting framework for this measurement. Most of the studies conducted in this field have examined the effect on the bank's overall performance or have focused only on intellectual capital. To the best of the authors' knowledge, this paper is one of the first attempts to find empirical support for the role of knowledge management disclosure within European banks on financial performance. This study can also provide valuable insights and guidance for researchers and managers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11479586c5d141f0eb6fe2a197a8a71b",
  "timestamp": "2025-05-15T03:08:37.767216"
}