{
  "id": 7310,
  "title": "Impact of the implementation of a nurse-managed outpatient parenteral antibiotic therapy (OPAT) system in Baltimore: a case study demonstrating cost savings and reduction in re-admission rates",
  "abstract": "Objectives: Evidence supports the safety and effectiveness of outpatient parenteral antibiotic therapy (OPAT). A registered nurse (RN)-managed multidisciplinary team OPAT model was implemented at our hospital. We evaluated the impact of the new OPAT model on readmissions during OPAT and other core OPAT processes. Methods: All potential OPAT cases from 1 November 2013 to 31 June 2017 discharged from the Johns Hopkins Bayview Medical Center were followed up in a retrospective cohort study. Relevant clinical and patient characteristics were collected for the first OPAT course per patient. The primary outcome was all-cause readmission to any facility part of the Johns Hopkins Health System within 30 days of OPAT discharge. Proportions of OPAT patients readmitted before and after the implementation of the new OPAT model were compared. A log-binomial regression was used to compare the risk of readmission, adjusted for age, sex, race/ethnicity, site of OPAT care, opioid dependence and OPAT treatment duration. Results: Five hundred and seventeen OPAT patients were included in the analysis; 51.1% were discharged after the implementation of the new OPAT model. Readmission rates decreased from 20.2% to 13.3% following the RN-managed OPAT programme (P = 0.04). The results of the adjusted model indicated that nurse management was associated with a 39% reduction in the risk of readmission (adjusted relative risk 0.61; 95% CI 0.41-0.91; P = 0.01). Our financial evaluation estimated that the reduction in readmissions achieved by the RN-managed model saved the hospital $649 416 over 15 months. Conclusions: The RN-managed OPAT programme was associated with a significant reduction in readmissions.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "115a5e60b36d04da97f734e79b9d20b8",
  "timestamp": "2025-05-15T03:07:02.724790"
}