{
  "id": 3365,
  "title": "How Overconfident Financial Knowledge Hinders Retirement Planning? Mediating Analysis and Heterogeneity of Retirement Funding Sources",
  "abstract": "Under the background of general financial knowledge confidence and insufficient retirement planning, this study investigates the relationship between overconfident financial knowledge and consumer retirement planning. Using data from the National Financial Capability Study, this study employs probit regressions and finds that consumers with overconfident financial knowledge are less likely to have retirement planning, that is, contribute to retirement accounts regularly. This study further explores the mediators in this relationship and concludes that consumers who are overconfident in their financial knowledge tend to be more preference to risk, fail to make ends meet, and do not care about their financial situation, therefore are less likely to plan for retirement. Furthermore, compared to retirement accounts such as 401(k) that are through an employer, consumers with overconfident financial knowledge are more willing to engage in those such as IRA that are not through an employer. This study also finds that underconfident financial knowledge, another type of incorrect subjective evaluation of financial knowledge, is positively associated with retirement planning. Based on these findings, this study recommends policymakers reduce financial knowledge overconfidence, guide individuals to regularly pay attention to their financial situation, and encourage employers to actively participate in retirement plans.JEL Classification: D12, N30, D80, D91. Using data from the NFCS in 2012, 2015, 2018, and 2021, this study investigates the relationship between overconfident financial knowledge and retirement planning. This study finds that consumers who are overconfident in their financial knowledge are less likely to plan for retirement, namely not regularly contribute to a retirement account like a 401(k) or IRA. Mediating analyses reveal that consumers who are overconfident on their financial knowledge tend to be more preference to risk, fail to make ends meet, and do not care about their own financial situation, therefore are less likely to plan for retirement. This study also distinguishes the different types of retirement accounts and concludes that the negative relationship between overconfident financial knowledge and retirement planning is more significant in consumers that only engage in 401(k)-type (through an employer) compared to those only engage in IRA-type (not through an employer). Besides, this study also finds a positive relationship between underconfident financial knowledge and retirement planning.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1177a0a0a24fac4e9241ed4377deecbb",
  "timestamp": "2025-05-15T02:25:40.073770"
}