{
  "id": 2228,
  "title": "Relative technological diversification measure using patent data: Analysis of firms' strategies in the Fast Moving Consumer Goods (FMCG) sector",
  "abstract": "Technological diversification of firms is an essential research topic as it has significant effects on their performance. However, we still lack consistent results whether the diversification has positive effects. We focus on the relevance of its measures as one of the causes of the inconsistency. This study aims to develop a technological diversification measure by including relativity of firms' technological portfolio, because major conventional methods, e.g., Herfindahl-Hirschmann Index and entropy, consider only one firm's absolute portfolio. We analyzed each firm's relative position from a common core of the industrial technologies for four global major firms in Fast Moving Consumer Goods sector. The product set of International Patent Classification (IPC) among them was defined as the core of industrial technology. We quantified firms' chronical shifts from there, and compared them with those by conventional methods. The proposed measure clarified the firms' relative positions in a manner that conventional ones cannot identify. The firms' qualitative information supported the validity of the observations. Our approach can take more IPC data into account, less affected by the largest number of IPC, which are among its advantages; it further allows for analysis from new aspects that complement the conventional absolute technological portfolio measures.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1182bc49a9ccfade8ba92eae66eac783",
  "timestamp": "2025-05-15T01:04:27.479686"
}