{
  "id": 7898,
  "title": "Job loss during pregnancy and the risk of miscarriage and stillbirth",
  "abstract": "STUDY QUESTION Does the exposure to job loss during pregnancy increase the risk of miscarriage or stillbirth?SUMMARY ANSWER The experience of own or partner's job loss during the pregnancy is associated with an increased risk of miscarriageand stillbirth.WHAT IS KNOWN ALREADY Prior research on the psycho-social aspect of pregnancy loss has investigated the contextual and the individual-level stressors. At the contextual level, natural disasters, air pollution, and economic downturns are associated with higher risk of pregnancy loss. At the individual level, intense working schedules and financial strain are linked with increased risk of pregnancy loss both at early and later stages of the gestation.STUDY DESIGN, SIZE, DURATION This work draws on high-quality individual data of 'Understanding Society', a longitudinal survey that has interviewed a representative sample of households living in the UK annually since 2009. Approximately 40 000 households were recruited. The analyses use all the available survey waves (1-12, 2009-2022).PARTICIPANTS/MATERIALS, SETTING, METHODS The final sample consisted of 8142 pregnancy episodes that contain complete informationon pregnancy outcome and date of conception. Ongoing pregnancies at the time of the interview were excluded from the final sample. The outcome variable indicated whether a pregnancy resulted in a live birth or a pregnancy loss whereas the exposure variable identified the women's or their partner's job loss because of redundancy or a dismissal. Logistic regression models were employed to estimate the relation between job loss during pregnancy and pregnancy loss. The models were adjusted for an array of socio-demographic and economic characteristics following a stepwise approach. Several sensitivity analyses complemented the main findings.MAIN RESULTS AND THE ROLE OF CHANCE Baseline models controlling for women's demographic background and prior experience of miscarriage estimated an increased risk of pregnancy loss when women were exposed to their own or their partner's job loss during their pregnancy (odds ratio (OR) = 1.99, 95% CI: 1.32, 2.99). When the models were adjusted for all socio-economic and partnership-related covariates the association remained robust (OR = 1.81, 95% CI: 1.20, 2.73).LIMITATIONS, REASONS FOR CAUTION First, the pregnancy outcome and the date of conception were self-reported and may besubjected to recall and social desirability bias. Second, although we adjusted for an array socio-demographic characteristics and self-reported health, other contextual factors might be correlated with both job loss and pregnancy loss. Third, owing to the limited sample size, we could not assess if the main finding holds across different socio-economic strata.WIDER IMPLICATIONS OF THE FINDINGS By showing that exposure to a job loss during pregnancy increases the risk of miscarriage and stillbirth, we underline the relevance of pregnancy loss as a preventable public health matter. This result also calls for policy designthat enhances labour market protection and social security buffers for pregnant women and their partners.STUDY FUNDING/COMPETING INTERESTS The authors received the following financial support for the research, authorship, and/or publication of this article: H2020 Excellent Science, H2020 European Research Council, Grant/Award Number: 694262 (project DisCont-Discontinuities in Household and Family Formation) and the Economic and Social Research Centre on Micro-Social Change (MiSoC). There are no conflicts of interest to declare.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1186df52396a6bf67d3a5ca8d1c6dc55",
  "timestamp": "2025-05-15T03:13:04.957589"
}