{
  "id": 6436,
  "title": "Managerial sentiment, life cycle and corporate investment: a large language model approach",
  "abstract": "PurposeThis paper investigates the relationship between managerial sentiment and corporate investment in emerging capital markets. Further, we begin with the assertion that the positive impact of managerial sentiment on corporate investment varies according to the corporate life cycle. Lastly, we investigate whether the relationship between managerial sentiment and corporate investment can be moderated by factors like (1) economic policy uncertainty/geo-political risk, (2) size of the firm, (3) financial constraint, (4) industrial competition, and (5) Environmental Social and Governance (ESG) rating.Design/methodology/approachThis study has considered Indian listed companies (465 firms) for the period spanning from 2003-2004 to 2022-2023. This study constructs the managerial sentiment using a novel large language model-financial bidirectional encoder representation from the Transformers (FinBERT), as well as on management discussion and analysis reports. Then, we employ fixed effect regression to investigate the relationship between managerial sentiment and corporate investment. Additionally, we use propensity score matching, two-stage least squares instrumental variables, and a two-step system generalized method of moments approach for robustness tests.FindingsThe findings show a positive and significant relationship between managerial sentiment and corporate investment. Additionally, our results demonstrate that this relationship is evident only during the growth and maturity phase of the corporate life cycle. Moreover, uncertainty pertaining to the economy and geopolitical issues, firm size, financial health, industry dynamics, and ESG disclosure also play a crucial role in shaping the investment-sentiment relationship.Originality/valueThe study is unique because it determines the relationship between managerial sentiment and corporate investment by using the novel FinBERT model. In addition, we have introduced a corporate life cycle, which is an essential aspect of our study. Additionally, this research was conducted in an emerging market with more information asymmetry and weaker disclosure rules. Thus, other emerging markets can benchmark the outcomes.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "118663e0611dbd168be88b6e855a4846",
  "timestamp": "2025-05-15T02:58:05.687268"
}