{
  "id": 8196,
  "title": "Postpartum navigation decreases severe maternal morbidity most among Black women",
  "abstract": "BACKGROUND: Postpartum care is crucial for addressing conditions associated with severe maternal morbidity and mortality. Examination of programs that affect these outcomes for women at high risk, including disparate populations, is needed.OBJECTIVE: This study aimed to examine whether a postpartum navigation program decreases all-cause 30-day postpartum hospitaliza-tions and hospitalizations because of severe maternal morbidity identified using the US Centers for Disease Control and Prevention guidelines. The effect of this program was explored across patient demographics, including race and ethnicity.STUDY DESIGN: This was a retrospective cohort study that used health records of women who delivered at 3 large hospitals in the New York metropolitan area (Queens and Long Island) between April 2020 and November 2021 and who were at high risk of severe maternal morbidity. The incidence rates of 30-day postpartum all-cause hospitalization and hospitalization because of severe maternal morbidity were compared between women who were and were not enrolled in a novel postpartum transitional care management program. Navigation included standardized assessments, development of care plans, clinical management, and connection to clinical and social services that would extend beyond the postpartum period. Because the program prioritized enrolling women of the greatest risk, the risk-adjusted incidence was estimated using multi-variate Poisson regression and stratified across patient demographics.RESULTS: Patient health records of 5819 women were included for analysis. Of note, 5819 of 19,258 deliveries (30.2%) during the study period were identified as having a higher risk of severe maternal morbidity. This was consistent with the incidence of high-risk pregnancies for tertiaryhospitals in the New York metropolitan area. The condition most identified for risk of severe maternal morbidity at the time of delivery was hypertension (3171/5819 [54.5%]). The adjusted incidence of all-cause rehospitalization was 20% lower in enrollees than in nonenrollees (incident rate ratio, 0.80; 95% confidence interval, 0.67-0.95). Rehospitalization was decreased the most among Black women (incident rate ratio, 0.57; 95% confidence interval, 0.42-0.80). The adjusted incidence of rehospitalization because of indicators of severe maternal morbidity was 56% lower in enrollees than in nonenrollees (incident rate ratio, 0.44; 95% confidence interval, 0.24-0.77). Furthermore, it decreased most among CONCLUSION: High-risk medical conditions at the time of delivery increased the risk of postpartum hospitalization, including hospitalizations because of severe maternal morbidity. A postpartum navigation program designed to identify and resolve clinical and social needs reduced postpartum hospitalizations and racial disparities with hospitalizations. Hospitals and healthcare systems should adopt this type of care model for women at high risk of severe maternal morbidity. Cost analyses are needed to evaluate the financial effect of postpartum navigation programs for women at high risk of severe maternal morbidity or mortality, which could influence reimbursement for these types of services. Further evidence and details of novel postpartum interventional models are needed for future studies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11a27cac775fe083eb5f27ccdd0a7342",
  "timestamp": "2025-05-15T03:16:17.421887"
}