{
  "id": 5953,
  "title": "Impact of Linking Livelihood Resilience of Smallholder Households and the Risk Management Strategies: The Case of China from Socioeconomic Perspectives",
  "abstract": "The government of China has implemented the Southern Shaanxi Disaster Resettlement program since 2011, which aims to address the problems of reduced livelihood resilience, increased livelihood risks, and single-risk management strategies caused by the frequent occurrence of natural disasters. This study considers the specific situation of disaster resettlement in Ankang Prefecture, southern Shaanxi Province, and draws on Quandt's measurement idea to quantify livelihood resilience at the household scale in terms of five types of capital assets: natural, physical, human, financial, and social. A coarsened exact matching model was used to control confounding factors in the observational data to reduce sample selection bias, and then multinomial logit regression models were used to examine how livelihood resilience affects risk management strategies; moreover, the effects of different indicators of livelihood resilience, relocation characteristics, and follow-up support measures on risk management strategies were analyzed. Results show that livelihood resilience is higher among new-stage relocation, voluntary relocation, and centralized resettlement households, and working outside of the home accounts for the largest proportion of risk management strategies chosen by the sample households. In addition, livelihood resilience and its dimensions and indicators, relocation characteristics, and follow-up support measures have different impacts on risk management strategies. These results have considerable significance in guiding research on risk management strategies at the household scale and can serve as a reference for disaster resettlement in other developing nations and regions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11a706b07e36eeacfa7e7e7e25c0fdfc",
  "timestamp": "2025-05-15T02:53:03.163851"
}