{
  "id": 8733,
  "title": "Household catastrophic health expenditure for COVID-19 during March-August 2021, in South India: a cross-sectional study",
  "abstract": "Background The Coronavirus disease 2019 (COVID-19) pandemic increased the utilisation of healthcare services. Such utilization could lead to higher out-of-pocket expenditure (OOPE) and catastrophic health expenditures (CHE). We estimated OOPE and the proportion of households that experienced CHE by conducting a cross-sectional survey of 1200 randomly selected confirmed COVID-19 cases.Methods A cross-sectional survey was conducted by telephonic interviews of 1200 randomly selected COVID-19 patients who tested positive between 1 March and 31 August 2021. We collected household-level information on demographics, income, expenditure, insurance coverage, direct medical and non-medical costs incurred toward COVID-19 management. We estimated the proportion of CHE with a 95% confidence interval. We examined the association of household characteristics; COVID-19 cases, severity, and hospitalisation status with CHE. A multivariable logistic regression analysis was conducted to ascertain the effects of variables of interest on the likelihood that households face CHE due to COVID-19.Results The mean (95%CI) OOPE per household was INR 122,221 (92,744-1,51,698) [US$1,643 (1,247-2,040)]. Among households, 61.7% faced OOPE, and 25.8% experienced CHE due to COVID-19. The odds of facing CHE were high among the households; with a family member over 65 years [OR = 2.89 (2.03-4.12)], with a comorbid individual [OR = 3.38 (2.41-4.75)], in the lowest income quintile [OR = 1.82 (1.12-2.95)], any member visited private hospital [OR = 11.85 (7.68-18.27)]. The odds of having CHE in a household who have received insurance claims [OR = 5.8 (2.81- 11.97)] were high. Households with one and more than one severe COVID-19 increased the risk of CHE by more than two-times and three-times respectively [AOR = 2.67 (1.27-5.58); AOR = 3.18 (1.49-6.81)].Conclusion COVID-19 severity increases household OOPE and CHE. Strengthening the public healthcare and health insurance with higher health financing is indispensable for financial risk protection of households with severe COVID-19 from CHE.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11b55f55b6ce1ddaad2ac4230a367981",
  "timestamp": "2025-05-15T03:21:56.615009"
}