{
  "id": 7891,
  "title": "Socioeconomic inequalities in pandemic-induced psychosocial stress in different life domains among the working-age population",
  "abstract": "Background Psychosocial stress is considered a risk factor for physical and mental ill-health. Evidence on socioeconomic inequalities with regard to the psychosocial consequences of the COVID-19 pandemic in Germany is still limited. We aimed to investigate how pandemic-induced psychosocial stress (PIPS) in different life domains differed between socioeconomic groups.Methods Data came from the German Corona-Monitoring nationwide study - wave 2 (RKI-SOEP-2, November 2021-February 2022). PIPS was assessed using 4-point Likert scales with reference to the following life domains: family, partnership, own financial situation, psychological well-being, leisure activity, social life and work/school situation. Responses were dichotomised into not stressed/slightly stressed/rather stressed (0) versus highly stressed (1). The sample was restricted to the working-age population in Germany (age = 18-67 years, n = 8,402). Prevalence estimates of high PIPS were calculated by sex, age, education and income. Adjusted prevalence ratios (PRs) were estimated using Poisson regression to investigate the association between education/income and PIPS; high education and income were the reference groups.Results The highest stress levels were reported in the domains social life and leisure activity. Women and younger participants reported high stress levels more frequently. The highest inequalities were found regarding people's own financial situation, and PIPS was higher in low vs. high income groups (PR 5.54, 95% CI 3.61-8.52). Inequalities were also found regarding partnerships with higher PIPS in low vs. high education groups (PR 1.68, 95% CI 1.13-2.49) - and psychological well-being with higher PIPS in low vs. high income groups (PR 1.52, 95% CI 1.14-2.04).Conclusion Socioeconomic inequalities in PIPS were found for different life domains. Generally, psychosocial support and preventive interventions to help people cope with stress in a pandemic context should be target-group-specific, addressing the particular needs and circumstances of certain socioeconomic groups.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11beb11bcc3fc63b1a99b0dd95cb6f03",
  "timestamp": "2025-05-15T03:13:04.931016"
}