{
  "id": 3827,
  "title": "Changes in rural financial exclusion's supply and demand factors from the perspective of digital inclusive financial policies",
  "abstract": "This paper employs a Regression Discontinuity Design (RDD) methodology, utilizing data from the Chinese Household Finance Survey (CHFS), China Rural Statistical Yearbook, China Financial Yearbook, and China Statistical Yearbook. The analysis scrutinizes rural financial exclusion from dual vantage points: the demand and supply sides, with households and provinces serving as fundamental analytical units. Employing years as threshold values, we establish 27 supply-side factors and 18 demand-side factors through RDD models. This analytical framework facilitates an assessment of the existence of breakpoint effects across diverse dimensions of financial exclusion in distinct years and fosters a discourse on rural financial exclusion and its structural dynamics within the context of China's Digital Inclusive Finance policies. The findings of this study are as follows: (1) Supply-side determinants of rural financial exclusion in China have exhibited negligible change over the past decade, with Digital Inclusive Finance policies exerting limited influence. (2) Conversely, demand-side factors have exhibited some degree of variability, characterized by substantial reductions in channel exclusion and financial risk exclusion in 2013 and 2015. Digital Inclusive Finance policies have manifested a favorable impact on the demand side of rural financial exclusion. (3) In 2017, both financial knowledge exclusion and channel exclusion on the demand side of rural financial exclusion witnessed rebounded. Shifts in the orientation of Digital Inclusive Finance policies may precipitate a deterioration in the policy-dependent rural financial landscape, jeopardizing the preservation of their initial positive effects.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11dd0d6eb72960db5d17c5b37b227d72",
  "timestamp": "2025-05-15T02:30:28.653459"
}