{
  "id": 7366,
  "title": "Social vulnerability to climate change in primary producers: A typology approach",
  "abstract": "Adaptation of agricultural industries to climate change will make a major difference to the extent of the impacts experienced as a result of climate change. Vulnerability assessments provide the basis for developing strategies to reduce social vulnerability and plan for climate adaptation. Primary industries have been identified as the most vulnerable industry sector globally. We review how primary producers might be socially vulnerable to climate change and develop a 'vulnerability typology' of cattle producers based on survey responses from 240 producers across northern Australia. We measured social vulnerability according to ten indicators of climate sensitivity (resource dependency) and four indicators of adaptive capacity. Using a K-means clustering analysis we identified four main types' of cattle producers. Type 1 producers (43%) were vulnerable because they had low strategic skills and low interest in changing behaviour. Mean age was 59 years old, they were weakly networked within the industry and businesses were small. Type II producers (41%) had low strategic skills, poorly managed risk and uncertainty, had medium sized businesses and were 51 years old on average. Only 16% of producers (Type III and IV) appeared to have resilience to change. Type III producers (13.4%) had a stronger psychological and financial buffer, were 52 years old on average, were well networked and managed or owned larger businesses. Type IV producers (2.6%) managed risk well, liked to experiment with options and were interested in change. They were 41 years old on average, managed extremely large properties, were well networked, perceived themselves as responsible for the future productivity of their land and were early adopters of new technology. By providing knowledge of the different ways in which people can be vulnerable to climate change, vulnerability assessments can enable decision-makers to prioritise their efforts, provide a basis for early engagement, and tailor a range of adaptation approaches to most effectively accommodate and support the divergent requirements of different types of resource-users. Crown Copyright (C) 2014 Published by Elsevier B.V. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11e46ef79280f0c9daba900b7b05d014",
  "timestamp": "2025-05-15T03:08:00.739683"
}