{
  "id": 4239,
  "title": "Financial characteristics of takeover targets: a French empirical evidence",
  "abstract": "Purpose The purpose of this research is to highlight the financial characteristics of large French targets which were subject to takeovers during the period 2001-2007 and thereafter deduct the implicit motivations of acquirers. Design/methodology/approach Using a global sample of 128 French listed companies (64 targets and 64 non-targets), the authors carried out Wilcoxon-Mann-Whitney testing and logistic regression in order to test nine hypotheses likely to discriminate between the two categories of companies (targets and non-targets). Findings According to the results, target firms are more unbalanced in terms of growth resources and less rich in liquidity than their peers. They have unused debt capacity, offer greater opportunities for growth than firms in the control group and present low levels of value creation. Research limitations/implications The main limitation of this study is regarding the sample size, limited by the exclusive use of large firms (deals of over $100m). The scope of this research could be broadened in future by including medium-sized companies. Practical implications The authors believe that their results have two major implications. First, they enable market investors to achieve abnormal returns by investing in predicted targets through a portfolio of high takeover probability firms. Second, CEO of companies that are potentially targeted can assess their takeover likelihood in order to act and to manage such a situation for the benefit of their shareholders. Originality/value This research concerns the last wave of takeover prior to the subprime-mortgage financial crisis (2001-2007), a period that has not been sufficiently covered in empirical studies. This research contributes to the existing literature in two main respects. First, the results of this study improve our understanding of motivations for takeovers, particularly in the French context. Second, the introduction of new accounting and financial variables, not previously tested in the literature, enriches the available information concerning the profile of takeover targets.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11ea5fcf2b7a3a1bc902c20858c53e39",
  "timestamp": "2025-05-15T01:24:51.553734"
}