{
  "id": 6028,
  "title": "Prevalence and associated risk factors of suicidal behaviors among cancer patients in a tertiary care hospital in Bangladesh",
  "abstract": "Suicide-related behaviors among cancer patients represent a significant yet understudied public health concern in Bangladesh. This study aimed to determine the prevalence of suicidal behaviors (suicidal ideation, suicide plan, suicide attempt) and identify associated risk factors among cancer patients in Bangladesh. A cross-sectional study was conducted at the National Institute of Cancer Research & Hospital using a convenience sampling method among a total of 318 cancer patients between January and February, 2024. Data were collected on socio-demographics, clinical characteristics, and past-year suicidal behaviors. Chi-square tests and logistic regression were used to explore the association between suicidal behaviors and various socio-demographic, and clinical factors. The prevalence of past-year suicidal ideation, plan, and attempt was 22.3%, 13.8%, and 5.7%, respectively. Bladder and cervical cancer patients show the highest rates of suicidal behaviors. Key risk factors for suicidal behaviors included lower income, advanced cancer stages, and inadequate social support (all p < 0.05). Furthermore, higher education and unemployment appeared protective against suicidal ideation (p < 0.05). Among female participants, patients with breast cancer were less likely to attempt suicide than those with cervical cancer (p < 0.05). This study underscores the urgent need for routine mental health screening, risk assessments, and integrated social and financial support programs for cancer patients to reduce suicide risk and improve their quality of life.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11f60a67a58f93ccb88b7e3361f0ccf0",
  "timestamp": "2025-05-15T02:54:03.368117"
}