{
  "id": 3069,
  "title": "Pipeline progress and portfolio management of the top 30 pharma companies over the past two decades",
  "abstract": "For pharmaceutical companies, it is essential to define their long-term corporate strategy. This especially involves the pipeline progress of pharmaceuticals and portfolio management. The objective of this study was to give a broad overview of study durations of the clinical trials from the top 30 pharmaceutical companies worldwide and to investigate what could possibly impact these study durations (e.g., indication areas, companies themselves, etc.) We worked with the clinicaltrials.gov database to examine the pipeline (phase 1-3) and portfolio (after regulatory approval) of the top 30 pharma companies worldwide over 20 years (from 2000-2020). We further calculated the study duration of each clinical study as the difference between the start date and end date. To analyze changes in our measure we estimated multiple linear regression to evaluate the impact of indication areas and companies on the study duration. Most of the clinical studies were conducted in the areas of ONCIM (N = 2720), and META (N = 1993). The indication with the highest study duration was ONCIM (on average 3.9 years per clinical study, SD: 0.8). Values for the study duration vary widely across companies. Mostly they range between 1 and 4 years (e.g., Merck Sharp & Dohme (MSD) on average 2.2 years per clinical study, SD: 1.0). Correlation analysis showed that study phases were positively correlated with the study duration (+ 0.36, p < 0.000), i.e., the higher the study phase, the higher the study duration. Furthermore, we found that indication areas influenced the study duration significantly (+ 0.17, p < 0.000). However, there were wide variations in effect sizes across indications. The results suggest that different indication areas influence the study duration to different extents. Pipeline progress and portfolio management differ widely between indications, companies and over the years. Research findings could help corporate strategy managers to make more informed decisions regarding their business development strategy.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11f92a6d23d2f7bbe2a85fcc62130a1c",
  "timestamp": "2025-05-15T01:13:09.877124"
}