{
  "id": 2780,
  "title": "A new bottom-up method for classifying a building portfolio by building type, self-sufficiency rate, and access to local grid infrastructure for storage demand analysis",
  "abstract": "A building's energy storage demand depends on a variety of factors related to the specific local conditions such as building type, self -sufficiency -rate, and grid connection. Here, a newly developed bottom -up procedure is presented for classifying buildings in an urban building portfolio according to specific criteria. The algorithm uses publicly available building data such as building use, ground floor area, roof ridge height, solar roof potential, and population statistics. In addition, it considers the local gas grid (GG) as well as the district heating (DH) network. The building classification is developed for identifying typical building situations that can be used to estimate the demand for residential energy storage capacity. The developed algorithm is used to identify potential implementation of private photovoltaic(PV)-metal-hydride-storage (MHS) systems, for three scenarios, into the urban infrastructure for the city of Cologne. As result the statistical confidence interval of all analyzed buildings regarding their classification as well as corresponding maps is shown. Since similar data sets as used are available for many German or European metropolitan areas, the method developed with the assumptions presented in this work, can be used for classification of other urban and semi -urban areas including the assessment of their grid infrastructure.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "11f9d40b9d88cd6cf0267277eadc9b3a",
  "timestamp": "2025-05-15T01:10:16.554539"
}