{
  "id": 3926,
  "title": "Appraisal of the USGS Three-Part Mineral Resource Assessment through estimation of the orogenic gold endowment of the Sandstone Greenstone Belt, Yilgarn Craton, Western Australia",
  "abstract": "Regional-scale ground selection presents a significant risk in mineral exploration targeting. As any exploration search space contains a finite and fixed number of ore bodies, selection of barren or depleted search spaces incurs wasted exploration expenditure. By defining regions of estimated high mineral endowment, via generation of quantitative information as to the value of potential discoveries, mineral exploration effectiveness, project acquisition, and exploration portfolio management can be improved. The Three-Part Mineral Resource Assessment, developed by the United States Geological Survey (USGS), is a methodology designed to assist in this process. Here, two separate assessments are applied to estimate the orogenic gold endowment of the Sandstone Greenstone Belt in the Yilgarn Craton, Western Australia. First, the results of a global regression assessment (median endowment of 33 t/1.16 Moz Au, mean of 130 t/4.59 Moz Au), based on an available, but outdated, global grade-tonnage model for low-sulfide gold-quartz vein deposits, suggest that most outcropping and shallow orebodies in the Sandstone Greenstone Belt have been discovered and fully delineated. In contrast, an expert assessment (median endowment of 210 t/7.41 Moz Au, mean of 220 t/7.76 Moz Au), using expert-derived grade and tonnage distributions specific to the Sandstone Greenstone Belt, predicts that significant gold mineralization remains to be discovered, largely beneath cover. The contrasting assessments imply a step change in exploration focus, from surficial deposits at the time of the USGS global grade-tonnage model to those buried under cover at the present time. The expert assessment, in contrast to the global regression assessment, implies the potential for deeper exploration targets within the Sandstone Greenstone Belt. Based on the predicted total number of deposits, much of the undiscovered mineral endowment is likely to be distal to known ore bodies, beneath cover, and at greater depths within the belt.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "120103ee40d7dd41a660f55798ef876f",
  "timestamp": "2025-05-15T01:22:11.927709"
}