{
  "id": 4716,
  "title": "Examining Alternative Measures of Social Disadvantage Among Asian Americans: The Relevance of Economic Opportunity, Subjective Social Status, and Financial Strain for Health",
  "abstract": "Socioeconomic position is often operationalized as education, occupation, and income. However, these measures may not fully capture the process of socioeconomic disadvantage that may be related to morbidity. Economic opportunity, subjective social status, and financial strain may also place individuals at risk for poor health outcomes. Data come from the Asian subsample of the 2003 National Latino and Asian American Study (n = 2095). Regression models were used to examine the associations between economic opportunity, subjective social status, and financial strain and the outcomes of self-rated health, body mass index, and smoking status. Education, occupation, and income were also investigated as correlates of these outcomes. Low correlations were observed between all measures of socioeconomic status. Economic opportunity was robustly negatively associated with poor self-rated health, higher body mass index, and smoking, followed by financial strain, then subjective social status. Findings show that markers of socioeconomic position beyond education, occupation, and income are related to morbidity among Asian Americans. This suggests that potential contributions of social disadvantage to poor health may be understated if only conventional measures are considered among immigrant and minority populations.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12054254f9d5c60f77b56b3a6ef05541",
  "timestamp": "2025-05-15T02:40:27.853217"
}