{
  "id": 7993,
  "title": "Do risk perceptions and constraints influence the adoption of climate change practices among small livestock herders in Punjab, Pakistan?",
  "abstract": "Climate change is severely damaging the agricultural system of many food producing regions worldwide. Small/subsistent livestock herders are the most vulnerable and less resilient group towards climatic disasters within South Asian region including Pakistan. The adoption of climate-smart practices would be beneficial for small livestock herders because of its potential to ensure food security, improve income, and sustain development simultaneously. The purpose of this paper is to investigate factors influencing small livestock herders' adaptation decisions towards changing climate by conducting field-based research. We intend to understand how institutional factors, risk perceptions, adaptations, and personal constraints affect the adaptation decisions related to climate change mitigation and choice of adaptation strategies. For this purpose, a primary data set of 405 small livestock herders from Punjab, Pakistan was used. The regression results of empirical models reveal the probability of adopting specific climate change strategies. The study results showed that zero adaptation (non-adoption) to climate change is higher when there is low literacy rate, less experience, nuclear family system, lack of institutional services, and low level of risk perception about climate change. The marginal outcome showed that the livestock herders with positive risk perception and access to the institutional services do participate more frequently in a higher number of adaptations options for economic and ecological benefits. Therefore, it is suggested that government and other development actors should strengthen institutions for trust building among local community groups and to reduce individuals' risks. Moreover, effective insurance schemes could facilitate small livestock herders to keep less but more productive livestock. The study recommends building viable and potential weather index insurance schemes which will result meaningful marginal scale benefits for smallholders. Finally, the results of major constraints suggest that it is necessary to provide awareness of climatic vulnerabilities, timely information delivery, and adequate financial facilities to offset resource constraints of livestock herders in order to adopt sustainable strategies at their farms.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "120d78742e728a67d6ec28c292b26240",
  "timestamp": "2025-05-15T03:14:07.274588"
}