{
  "id": 1153,
  "title": "Hedge fund allocation: Evaluating parametric and nonparametric forecasts using alternative portfolio construction techniques",
  "abstract": "We propose a model for constructing Asian funds of hedge funds. We compare the accuracy of forecasts of hedge fund returns using an ordinary least squares (OLS) regression model, a nonparametric regression model, and a nonlinear nonparametric model. We backtest to assess these forecasts using three different portfolio construction processes: an optimized portfolio, an equally-weighted portfolio, and the Kelly criterion-based portfolio. We find that the Kelly criterion is a reasonable method for constructing a fund of hedge funds, producing better results than a basic optimization or an equally-weighted portfolio construction method. Our backtests also indicate that the nonparametric forecasts and the OLS forecasts produce similar performance at the hedge fund index level. At the individual fund level, our analysis indicates that the OLS forecasts produce higher directional accuracy than the nonparametric methods but the nonparametric methods produce more accurate forecasts than OLS. In backtests, the highest information ratio to predict hedge fund returns is obtained from a combination of the OLS regression with the Fung-Hsieh eight-factor variables as predictors using the Kelly criterion portfolio construction method. Similarly, the highest information ratio using forecasts generated from a combination of the nonparametric regression using the Fung-Hsieh eight-factor model variables is achieved using the Kelly criterion portfolio construction method. Simulations using risk-adjusted total returns indicate that the nonparametric regression model generates superior information ratios than the analogous backtest results using the OLS. However, the benefits of diversification plateau with portfolios of more than 20 hedge funds. These results generally hold with portfolio implementation lags up to 12 months. (C) 2016 Published by Elsevier Inc.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "123316f78102227a92c23fc3e2065d8a",
  "timestamp": "2025-05-15T00:52:33.825506"
}