{
  "id": 4510,
  "title": "Financial Hardship in Childhood Cancer Survivors Treated with Hematopoietic Cell Transplantation: A Report from the Childhood Cancer Survivor Study",
  "abstract": "Long-term survivors of childhood cancer are at risk for financial hardship. However, it is not known if HCT leads to an incremental change in financial hardship for survivors who received it versus those who did not. We examined financial outcomes among adult survivors of childhood cancer who had undergone HCT. Using a cross-sectional survey in the Childhood Cancer Survivor Study population between 2017 and 2019, self-reported financial hardship was compared between survivors who received HCT, survivors treated without HCT (non-HCT), and siblings and categorized into 3 domains: material hardship/financial sacrifices, behavioral, and psychological hardship. The standardized score of each domain of financial hardship was calculated by adding the item responses and dividing by the standard deviation among siblings. Multivariable linear and logistic regression were used to evaluate associations between sociodemographic characteristics, cancer diagnosis, post-treatment complications, and financial hardship among survivors. The mean adjusted score for each hardship domain was not significantly different between HCT survivors (n = 133) and non-HCT survivors (n = 2711); mean differences were .18 (95% confidence interval [CI], -.05 to .41) for material hardship/financial sacrifices, .07 (95% CI, -.18 to .32) for behavioral hardship, and .19 (95% CI, -.04 to .42) for psychological hardship. Within specific items, a higher proportion of survivors treated with HCT reported greater financial hardship compared to non-HCT survivors. HCT survivors also had significantly higher mean domain scores compared to sibling controls (n = 1027) in all domains. Household income and chronic health conditions, but not HCT, were associated with financial hardship among all survivors. Adult survivors of childhood cancer treated with HCT do not report greater overall financial hardship compared to non-HCT survivors but do report greater overall financial hardship compared to sibling controls. Surveillance and intervention may be nec (c) 2023 The American Society for Transplantation and Cellular Therapy. Published by Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "123e75fd5257bb60cf9fe0bf4c70fa3c",
  "timestamp": "2025-05-15T02:37:47.601826"
}