{
  "id": 3036,
  "title": "Financial Difficulties in Families of Hospitalized Children",
  "abstract": "BACKGROUND: High costs of hospitalization may contribute to financial difficulties for some families. OBJECTIVE: To examine the prevalence of financial distress and medical financial burden in families of hospitalized children and identify factors that can predict financial difficulties. DESIGN, SETTING, AND PARTICIPANTS: Cross-sectional survey of parents of hospitalized children at six children's hospitals between October 2017 and November 2018. MAIN OUTCOMES AND MEASURES: The outcomes were high financial distress and medical financial burden. Multivariable logistic regression identified predictors of each outcome. The primary predictor variable was level of chronic disease (complex chronic disease, C-CD; noncomplex chronic disease, NC-CD; no chronic disease, no-CD). RESULTS: Of 644 invited participants, 526 (82%) were enrolled, with 125 (24%) experiencing high financial distress, and 160 (30%) reporting medical financial burden. Of those, 86 (54%) indicated their medical financial burden was caused by costs associated with their hospitalized child. Neither C-CD nor NC-CD were associated with high financial distress. Child-related medical financial burden was associated with both C-CD and NC-CD (adjusted odds ratio [AOR], 4.98; 95% CI, 2.41-10.29; and AOR, 2.57; 95% CI, 1.11-5.93), compared to no-CD. Although household poverty level was associated with both measures, financial difficulties occurred in all family income brackets. CONCLUSION: Financial difficulties are common in families of hospitalized children. Low-income families and those who have children with chronic conditions are at particular risk; however, financial difficulties affect all subsets of the pediatric population. Hospitalization may be a prime opportunity to identify and engage families at risk for financial distress and medical financial burden. (C) 2020 Society of Hospital Medicine",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "123edc10674b00a9add143c4feea3a79",
  "timestamp": "2025-05-15T02:21:52.209491"
}