{
  "id": 4813,
  "title": "Co-movement and information transmission between conventional and Islamic equities in Sri Lanka",
  "abstract": "PurposeThis study aims to investigate the co-movement and information transmission between conventional and Islamic equity indices in Sri Lanka.Design/methodology/approachThis study uses daily data of All Share Price Index and Dow Jones Islamic Market Sri Lanka Index from 2013 to 2023 for conventional and Islamic proxies. Descriptive statistics, cross-correlation, dynamic conditional correlation (DCC)-GARCH and wavelet analysis were used for the investigation.FindingsAnalyses reveal synchronous correlation yet lead-lag dynamics between the indices. The Islamic index has lower volatility, clustering and persistence than the conventional index. Localized volatility patches and scale-dependent synchronicity suggest diversification opportunities to optimize risk-adjusted returns.Research limitations/implicationsThe insights from this study are important for investors to optimize diversified portfolios by exploiting time-varying correlations. The identified lead-lag dynamics, bidirectional information flows and scale-dependent synchronization between the indices enable both investors to predict market movements for effective asset allocation and regulators to monitor market efficiency and stability and implement shock mitigation measures.Originality/valueThis study uniquely integrates DCC-generalized autoregressive conditional heteroskedasticity (GARCH) and wavelet analysis to examine the dynamic, time-varying relationships between Islamic and conventional equity markets in Sri Lanka's dual financial system. This approach helps embrace both short-run changes and long-run movements to gain in-depth co-movement and spillovers, as well as potential diversification gains within an emerging financial market.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12401de3b8cd69abaeba687b8df9d772",
  "timestamp": "2025-05-15T02:41:32.644829"
}