{
  "id": 5341,
  "title": "The nexus between governance quality, modern slavery disclosure and corporate financial performance",
  "abstract": "PurposeModern slavery is a significant issue addressed in the United Nations' Sustainable Development Goals. In 2015, the UK Government introduced the Modern Slavery Act as part of a crucial broader set of initiatives that aimed to attack modern slavery. Regardless of the initiatives taken to mitigate this risk, little is known about how modern slavery disclosure affects corporate financial performance (CFP). Hence, our study aims to examine the impact of MSD on CFP empirically. It also examines the moderating role of governance quality on the MSD-CFP nexus.Design/methodology/approachWe use computer-based content analysis to assess MSD levels for a sample of non-financial companies' annual reports. We use regression analysis to test our research hypotheses for a sample period of 2013-2019 for Financial Times Stock Exchange (FTSE) All-Share non-financial UK firms. Our sample consisted of 786 observations.FindingsWe provide new empirical evidence that externally communicating modern slavery information in annual report narratives is associated with CFP. The finding is in line with stakeholder theory, which states that engaging in social responsibility practices and responding favourably to the stakeholders' interests and desires would enhance corporations' reputation and ultimately improve their performance. We further highlight the role of governance quality in this nexus and find that the interaction between governance quality and MSD is negative, suggesting a replacement effect.Social implicationsOur findings can be of interest to government, policymakers and other stakeholders. Policymakers need to establish a new, broader set of enforcement arrangements for MSD that may lead to better CFP.Originality/valueOur research idea is original as it links emerging global issues (e.g. MSD) with traditional corporate concerns (financial performance) in a way that is likely to provide new insights as well as managerial and policy implications.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1254915c564f1bcea57bc74aa1621e53",
  "timestamp": "2025-05-15T02:46:44.922855"
}