{
  "id": 3351,
  "title": "Business Models of Ukrainian Banks: the Impact of the Revolution of Dignity, the COVID-19 Pandemic, and Russia's Military Aggression",
  "abstract": "The purpose of the article is to identify key banking activity models in Ukraine and show how they changed under the influence of the Revolution of Dignity, the COVID-19 pandemic, and the imposition of martial law. The proposed method uses cluster analysis of the main indicators for banking activity (concerning assets, liabilities and income) based on Ward's agglomerative hierarchical clustering algorithm and the Tau index in the NbClust package as the criterion for evaluating the optimal number of clusters. The research covers all Ukrainian banks, spanning the period 2013-2022. In 2014 (after the Revolution of Dignity), the actions of the National Bank of Ukraine (NBU) had a positive impact on the models of Ukrainian banks: there was no opaque model of banks and banking models became more transparent and more resilient to financial shocks. Between 2021 and 2022, five banking models were identified: universal banks, wholesale funding banks, corporate -investment banks, retail banks, and commission banks. The negative impact of COVID-19 on the Ukrainian economy was reflected in all banking models by the following: (1) a significant increase in the role of securities in assets, which was caused by a decrease in lending due to an increase in their riskiness; (2) the use of central bank funds to liabilities management, which was evidence of a deterioration in financing conditions in the deposit market. The following main changes in Ukraine's banking system at the end of 2022 (during the war) were identified: (1) a decrease in the number of banks that mainly use funds from the NBU to support their activities; (2) the closure of only four banks by the NBU (including two with ma- jority shareholders from Russia) during the year; (3) an increase in the share of the non -government debt securities portfolio in banks' assets; (4) declines in ROE and ROA for all banking models during the war, and three banking models became unprofitable; (5) the significantly higher share of non -performing loans in the credit portfolio for all banking models, especially for the retail banking model. The value-added of this research is the analysis of how banking models in Ukraine have changed at the micro level (reflected in the financial statements) inter alia in wartime.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "125611f09c3c7bfff51838a24d66782e",
  "timestamp": "2025-05-15T01:16:22.098721"
}