{
  "id": 5601,
  "title": "Financial Exploitation and Psychological Mistreatment Among Older Adults: Differences Between African Americans and Non-African Americans in a Population-Based Survey",
  "abstract": "Purpose: To examine racial differences in (a) the prevalence of financial exploitation and psychological mistreatment since turning 60 and in the past 6 months and (b) the experience-perpetrator, frequency, and degree of upset-of psychological mistreatment in the past 6 months. Design and methods: Random digit dial telephone recruitment and population-based survey (telephone and in-person) of 903 adults aged 60 years and older in Allegheny County (Pittsburgh), Pennsylvania (693 non-African American and 210 African American). Covariates included sex, age, education, marital status, household composition, cognitive function, instrumental activities of daily living/activities of daily living difficulties, and depression symptoms. Results: Prevalence rates were significantly higher for African Americans than for non-African Americans for financial exploitation since turning 60 (23.0% vs. 8.4%) and in the past 6 months (12.9% vs. 2.4%) and for psychological mistreatment since turning 60 (24.4% vs. 13.2%) and in the past 6 months (16.1% vs. 7.2%). These differences remained once all covariates were controlled in logistic regression models. There were also racial differences in the experience of psychological mistreatment in the past 6 months. Risk for clinical depression was also a consistent predictor of financial exploitation and psychological mistreatment. Implications: Although the results will need to be replicated in national surveys, the study suggests that racial differences in elder mistreatment are a potentially serious issue deserving of continued attention from researchers, health providers, and social service professionals.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1264407c7f9dbd02856fd3bf4a519257",
  "timestamp": "2025-05-15T02:49:21.734728"
}