{
  "id": 7681,
  "title": "Impact of diabetes on healthcare utilization and expenditure among older adults in India",
  "abstract": "Background and aims The present study aims to investigate the disparities in healthcare utilization and healthcare burden among individuals with and without diabetes. The prevalence of diabetes is more pronounced among older adults, which can detrimentally influence their health and quality of life while also restricting their capacity to self-manage and giving rise to competing healthcare demands. Thus, it is crucial to understand the implications of diabetes on healthcare demands and expenditures to mitigate its detrimental consequences. Methods Data was used from the initial round of the Longitudinal Aging Study in India (LASI), conducted in 2017-18. The analytical sample included 65,562 individuals aged 45 or above, and 8429 individuals were identified as having diabetes. The primary outcome variable was the out-of-pocket expenditure (OOPE) in the most recent hospitalization. Descriptive statistics and logistic regression are used to find the trend in the prevalence of morbidities both in diabetic and nondiabetic groups. Additionally, quantile regression was used to study the association between the presence of diabetes and the risk of excess healthcare expenditure calculated through out-of-pocket expenditure for hospitalization and expenditure on medicines. Results 16% of people with diabetes were hospitalized in the past year, compared to 9% without diabetes. The mean hospitalization length for diabetics was 13.6 days, compared to 6.5 for nondiabetics. Diabetes is significantly associated with higher OOPE for hospitalization across all quintiles, and its effect on hospitalization is weakest in the highest quintile. Having diabetes is also found to be significantly associated with the expenditure on medicines across all quintiles. Conclusion The study highlights the need for diabetes awareness programs and interventions integrated into national health policies. The quantile regression model provides crucial insights into the association between diabetes and OOPE for hospitalization and medicine The increase of OOPE for hospitalisation and medicine due to the presence of diabetes emphasizes the need to address the financial burden faced by people with diabetes, highlighting the urgency of prioritizing measures to improve access to affordable care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "128bccb8a7b7c5d3f7595675d2ac70a0",
  "timestamp": "2025-05-15T03:11:04.524221"
}