{
  "id": 5730,
  "title": "How risk and ambiguity affect accounting conservatism",
  "abstract": "PurposeThis study aims to examine the diametrically opposite effects of probabilistic (risk) and nonprobabilistic uncertainty (ambiguity) on accounting conservatism. Design/methodology/approachThis study uses panel regression models with year and industry-fixed effects. It uses financial and market data from the communication and energy sectors of 24 countries, encompassing 1,946 firms and 5,838 firm-year observations. FindingsThe study reveals that conservatism is a rational response to risk. However, in the presence of higher ambiguity where uncertainty exceeds firm control and outcomes become unpredictable, management reduces conservative accounting practices. Robustness tests support the validity of these findings across different institutional frameworks, agency risks, sample selection and heterogeneity. Research limitations/implicationsThis study contributes to the existing literature by exploring the contrasting effects of risk and ambiguity on accounting conservatism. It enhances the understanding of how various institutional factors influence the asymmetric recognition of bad news compared to good news under conditions of uncertainty. Practical implicationsBy understanding the role of accounting conservatism in responding to uncertainties, regulators can develop more informed and effective policies that align with the dynamic nature of business environments. Originality/valueThis research provides novel and original ideas suggesting that the change in accounting conservatism is contingent upon the firms' ambiguity or risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1291ff60ee4bda6611440f44b5c3d93b",
  "timestamp": "2025-05-15T02:50:53.893597"
}