{
  "id": 6932,
  "title": "Do the issues of religious minority and coastal climate crisis increase the burden of chronic illness in Bangladesh?",
  "abstract": "Background Chronic illness with disability and its out-of-pocket expenditure (OOPE) remains a big financial challenge in Bangladesh. The purpose of this study was to explore how religious minority problem and coastal climate crisis with other common risk factors determined chronic illness with a disability and its financial burden in Bangladesh. Existing policy responses, especially, social safety net programs and their governance were analyzed for suggesting better policy options that avoid distress financing. Methods Binary logistic and multiple linear regression models were respectively used to identify the factors of disability, and high OOPE based on Bangladesh Household Income and Expenditure Survey 2016 data. Results We found that disable people had relatively higher OOPE than their non-disabled counterparts and this OOPE further surges when the number of disabilities increases. In addition to the common factors, the novelty of our findings indicated that the religious minority problem as well as the coastal climate crisis have bearing on the disability burden in Bangladesh. The likelihood of having a chronic illness with a disability was 13.2% higher for the religious minorities compared to the majorities (Odds ratio (OR): 1.132, 95% confidence interval (CI): 1.033-1.241) and it was 21.6% higher for the people who lived in the exposed coast than those who lived in the non-exposed area (OR: 1.216, 95% CI: 1.107-1.335). With disabilities, people from the exposed coast incurred higher OOPE than those from the non-exposed areas. Although receiving assistance from social safety net programs (SSNPs) seemed to reduce their high OOPE and financial distress such as selling assets and being indebted, the distribution was not equitably and efficiently managed to confirm the process of inclusion leakage-free. On average, those who enrolled from the minority group and the exposed coast paid the relatively higher bribes. Conclusions To reduce burden, the government should strengthen and specify the existing SSNPs more for disable people, especially from the minority group and the exposed coast, and ensure the selection process more inclusive and leakage-free.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1293863a286f0c2a9742af748652b1ab",
  "timestamp": "2025-05-15T03:03:13.449427"
}