{
  "id": 3857,
  "title": "Low-dose CT lung cancer screening uptake: A rural-urban comparison",
  "abstract": "Purpose The US Preventive Services Task Force recommends lung cancer screening with Low-Dose Computed Tomography (LDCT) in high-risk individuals. Our objective was to identify demographic, health, and financial factors associated with screening uptake, with a focus on urban-rural differences. Methods We analyzed data from the 2018 and 2019 Behavioral Risk Factor Surveillance System and its optional Lung Cancer Screening Module to examine factors associated with screening uptake among 20 states that administered the optional module. We compared differences in factors associated with uptake overall and by geographical regions and conducted multivariable logistic mixed-effects regression, accounting for participant clustering by state to assess the impact of these factors on uptake. Findings Overall 1,268 participants underwent LDCT screening with no significant differences observed between rural (16.3%) and urban residents (17.7%, p = 0.67). In multivariable models, rural residents did not differ significantly in their LDCT screening uptake (OR = 0.85; 95% CI: 0.67-1.09, p = 0.20), but uptake was significantly higher for participants with underlying chronic respiratory conditions, veterans, those with higher pack-year history, and those with poor/fair general health and prior history of cancer. Uptake declined with age, higher education level, concerns about paying for medical care, and lack of primary care. Conclusions Modifiable targets can be leveraged to increase LDCT screening. Based on significant predictors of screening uptake, clinicians should prioritize interventions that effectively consider smoking history as well as those identified as effective in veterans' health settings. Additionally, reducing structural barriers to care related to insurance and income will be key to reducing disparities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1299b7c0ee5fe5361cd2b04b3a871f2e",
  "timestamp": "2025-05-15T02:30:28.801461"
}