{
  "id": 6945,
  "title": "Health assessment of French university students and risk factors associated with mental health disorders",
  "abstract": "Objective The first year of university is a particularly stressful period and can impact academic performance and students' health. The aim of this study was to evaluate the health and lifestyle of undergraduates and assess risk factors associated with psychiatric symptoms. Materials and methods Between September 2012 and June 2013, we included all undergraduate students who underwent compulsory a medical visit at the university medical service in Nice (France) during which they were screened for potential diseases during a diagnostic interview. Data were collected prospectively in the CALCIUM database (Consultations Assistes par Logiciel pour les Centres Inter-Universitaire de Medecine) and included information about the students' lifestyle (living conditions, dietary behavior, physical activity, use of recreational drugs). The prevalence of psychiatric symptoms related to depression, anxiety and panic attacks was assessed and risk factors for these symptoms were analyzed using logistic regression. Results A total of 4,184 undergraduates were included. Prevalence for depression, anxiety and panic attacks were 12.6%, 7.6% and 1.0%, respectively. During the 30 days preceding the evaluation, 0.6% of the students regularly drank alcohol, 6.3% were frequent-to-heavy tobacco smokers, and 10.0% smoked marijuana. Dealing with financial difficulties and having learning disabilities were associated with psychiatric symptoms. Students who were dissatisfied with their living conditions and those with poor dietary behavior were at risk of depression. Being a woman and living alone were associated with anxiety. Students who screened positively for any psychiatric disorder assessed were at a higher risk of having another psychiatric disorder concomitantly. Conclusion The prevalence of psychiatric disorders in undergraduate students is low but the rate of students at risk of developing chronic disease is far from being negligible. Understanding predictors for these symptoms may improve students' health by implementing targeted prevention campaigns. Further research in other French universities is necessary to confirm our results.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "129eee60fe6363da7be89ae26c81bf96",
  "timestamp": "2025-05-15T03:03:13.506139"
}