{
  "id": 9022,
  "title": "Global burden of diseases, injuries, and risk factors for young people's health during 1990-2013: a systematic analysis for the Global Burden of Disease Study 2013",
  "abstract": "Background Young people's health has emerged as a neglected yet pressing issue in global development. Changing patterns of young people's health have the potential to undermine future population health as well as global economic development unless timely and effective strategies are put into place. We report the past, present, and anticipated burden of disease in young people aged 10-24 years from 1990 to 2013 using data on mortality, disability, injuries, and health risk factors. Methods The Global Burden of Disease Study 2013 (GBD 2013) includes annual assessments for 188 countries from 1990 to 2013, covering 306 diseases and injuries, 1233 sequelae, and 79 risk factors. We used the comparative risk assessment approach to assess how much of the burden of disease reported in a given year can be attributed to past exposure to a risk. We estimated attributable burden by comparing observed health outcomes with those that would have been observed if an alternative or counterfactual level of exposure had occurred in the past. We applied the same method to previous years to allow comparisons from 1990 to 2013. We cross-tabulated the quantiles of disability-adjusted life-years (DALYs) by quintiles of DALYs annual increase from 1990 to 2013 to show rates of DALYs increase by burden. We used the GBD 2013 hierarchy of causes that organises 306 diseases and injuries into four levels of classification. Level one distinguishes three broad categories: first, communicable, maternal, neonatal, and nutritional disorders; second, non-communicable diseases; and third, injuries. Level two has 21 mutually exclusive and collectively exhaustive categories, level three has 163 categories, and level four has 254 categories. Findings The leading causes of death in 2013 for young people aged 10-14 years were HIV/AIDS, road injuries, and drowning (25.2%), whereas transport injuries were the leading cause of death for ages 15-19 years (14.2%) and 20-24 years (15.6%). Maternal disorders were the highest cause of death for young women aged 20-24 years (17.1%) and the fourth highest for girls aged 15-19 years (11.5%) in 2013. Unsafe sex as a risk factor for DALYs increased from the 13th rank to the second for both sexes aged 15-19 years from 1990 to 2013. Alcohol misuse was the highest risk factor for DALYs (7.0% overall, 10.5% for males, and 2.7% for females) for young people aged 20-24 years, whereas drug use accounted for 2.7% (3.3% for males and 2.0% for females). The contribution of risk factors varied between and within countries. For example, for ages 20-24 years, drug use was highest in Qatar and accounted for 4.9% of DALYs, followed by 4.8% in the United Arab Emirates, whereas alcohol use was highest in Russia and accounted for 21.4%, followed by 21.0% in Belarus. Alcohol accounted for 9.0% (ranging from 4.2% in Hong Kong to 11.3% in Shandong) in China and 11.6% (ranging from 10.1% in Aguascalientes to 14.9% in Chihuahua) of DALYs in Mexico for young people aged 20-24 years. Alcohol and drug use in those aged 10-24 years had an annual rate of change of >1.0% from 1990 to 2013 and accounted for more than 3.1% of DALYs. Interpretation Our findings call for increased efforts to improve health and reduce the burden of disease and risks for diseases in later life in young people. Moreover, because of the large variations between countries in risks and burden, a global approach to improve health during this important period of life will fail unless the particularities of each country are taken into account. Finally, our results call for a strategy to overcome the financial and technical barriers to adequately capture young people's health risk factors and their determinants in health information systems.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12a5afd1573fd3091446dbdaed0fd3e4",
  "timestamp": "2025-05-15T03:24:54.878997"
}