{
  "id": 2268,
  "title": "Does Risk Tolerance Mediates the Relationship Between Financial Literacy and Financial Wellbeing During COVID-19: Empirical Evidence From an Emerging Economy",
  "abstract": "This study aims to explore the role of financial literacy in determining financial well-being during COVID-19. Additionally, we plan to examine how risk tolerance mediates between financial literacy and overall well-being. The data of 367 active individual investors on the Pakistan Stock Exchange was taken utilizing convenience sampling and the survey methodology. The relationship between financial literacy, risk tolerance, and financial well-being was investigated using structural equation modeling. The data were analyzed through Smart PLS. The finding of the study highlights that both advance and basic financial literacy have a positive and significant association with investor well-being. Furthermore, financial literacy has a favorable indirect impact on financial well-being highlighted in this study through risk tolerance. The effect of financial literacy on financial well-being was remarkably consistent across levels of demographic variables such as education, gender and age suggesting that improving financial literacy levels in the population may be an effective strategy to increase financial capability across the board during the COVID-19 crisis. The outcome of the study has several policy implications for investors and policymakers during uncertain times such as COVID-19, as providing literacy positively contributes to their risk tolerance which then translates into higher financial well-being. The paper's novelty is that the authors have explored the mechanism by which basic and advanced levels of financial literacy influence investors' risk tolerance and financial well-being during the COVID-19 pandemic in an emerging economy. It adds to the literature in behavioral finance, explicitly probing the impact of financial literacy on financial well-being; this field is in its initial stage, even in developed countries, while little work has been done in emerging countries.JEL Classification: B21, D01, D91, G11, J26, H31.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12ae8b27f5435d6d134bd0ab35e5c816",
  "timestamp": "2025-05-15T02:13:31.737887"
}