{
  "id": 9244,
  "title": "Examining malaria treatment and prevention spending efficiency in malaria-endemic countries, 2000-2020",
  "abstract": "BackgroundIn 2021, an estimated 750,000 people died from malaria. Despite this significant burden, globally, malaria incidence and mortality rates have substantially dropped over the last 30 years. However, growth in spending on malaria and improved outcomes have recently stagnated. This development has made it more important than ever to understand what constitutes efficient spending on malaria.MethodsData from various sources, including disaggregated data on malaria spending from the WHO Global Malaria Programme, National Health Accounts, and the Global Burden of Disease 2021 study was used in this study. The National Health Account report is produced at the end of a national accounting exercise that aims to map the flow of financial resources from all perspectives-incl. sources, agencies-in the health sector. Malaria spending estimates for all malaria-endemic countries from 2000 to 2020, with government and donor spending disaggregated into 11 key programme areas were generated in this study. Then, these spending estimates were combined with outcome data and estimated country efficiency using robust non-parametric stochastic frontier analysis and linear regression to examine the types of malaria spending associated with better malaria outcomes.ResultsAcross malaria-endemic countries, there is wide variation in malaria spending, with spending associated with the malaria burden within the country. Argentina, Paraguay, and Turkmenistan stood out as examples of low spending relative to their respective malaria incident per person at risk rates, while the Philippines, Guatemala, and Sri Lanka stood out as countries with case fatality ratios that were low relative to their malaria spending. Having a greater proportion of malaria spending sourced from donors or on prevention was associated with increases in incidence efficiency, while having a greater proportion of spending on anti-malarial medicines was associated with increases in case fatality efficiency.ConclusionsPrioritization of spending on prevention, anti-malarial medicines, and health systems strengthening can fight incident cases and fatalities simultaneously, especially in resource-scarce, malaria-endemic countries. Furthermore, improving the availability, frequency of collection, and quality of detailed disaggregated spending data is essential to support work that strengthens the evidence base on spending efficiency and work that improves understanding of how spending on malaria could be leveraged to bridge gaps in equity across population groups.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12c13014f53e565ae38fbde5c2db786a",
  "timestamp": "2025-05-15T03:26:54.587082"
}