{
  "id": 3524,
  "title": "A closer look at the relationship between firm-specific return variation and stock returns",
  "abstract": "PurposePrior studies use two measures of firm-specific return variation (FSRV): idiosyncratic volatility in absolute and relative terms, the latter of which is also termed stock price nonsynchronicity. Whereas most research focuses on investigating the idiosyncratic volatility puzzle, the authors carry out comparison of these two measures and further investigate which of the two constituents of nonsynchronicity explain the association between FSRV and stock returns, emphasising the importance of assessing which component drives stock returns.Design/methodology/approachThe authors use the US individual stock returns from 1925 to 2016 and define the two measures of FRSV based on the Fama and French (1993) model. Specifically, the authors decompose the relative measure into two components: (i) absolute idiosyncratic volatility and (ii) systematic volatility. The authors conduct various tests based on high-minus-low, zero-investment quintile portfolio sorts and perform the Fama-MacBeth analysis by singling out each component.FindingsThe authors find a positive return on the portfolio sorted on relative idiosyncratic volatility or on systematic volatility, but find a negative return sorted on absolute idiosyncratic volatility. The results are robust after controlling for size, BM and other risk characteristics using a double-sorting approach. The Fama-MacBeth regression results show that a positive association between the relative measure and stock returns is driven primarily by the low-systematic-volatility anomaly across firms. The findings are robust to controlling for return residual momentum, skewness, jumps and information discreteness.Originality/valueExtant research posits the idiosyncratic volatility puzzle and the low-volatility anomaly. The authors emphasize the importance of integrating these two streams of research. This study enhances the understanding of the driving force underlying the relationship between FSRV and cross-sectional stock returns.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12d1333ebbe9adbda897ae806198bc63",
  "timestamp": "2025-05-15T01:17:54.156420"
}