{
  "id": 3890,
  "title": "Nominal Price Anomaly in Emerging Markets: Risk or Mispricing?",
  "abstract": "This study examines the nominal price anomaly in the Vietnamese stock market, that is, whether stocks with low nominal price outperform stocks with high nominal price. Using a sample of all 351 companies listed on the Ho Chi Minh Stock Exchange (HOSE) from June 2009 to March 2018, we confirm our hypothesis and document that cheaper stocks yield higher subsequent abnormal returns. The results are robust after controlling for various stock characteristics that have been documented to be value-relevant in prior literature, including firm size, book-to-market ratio, intermediate-term momentum, short-term reversal, skewness, market risk, idiosyncratic risk, illiquidity and extreme daily returns, using both the portfolio analysis and the Fama-MacBeth cross-sectional regression. The negative effect persists in the long term (i.e., after up to 12 months), implying a slow adjustment of stock prices to their intrinsic value. Further analysis show that the observed nominal price anomaly is mainly driven by mispricing but not a latent risk factor proxied by stock price, thus the observed anomaly reflects a mispricing but not a fundamental risk. The study highlights the irrational behaviour of investors and market inefficiency in the Vietnamese stock market and provides important implication for investors in the market.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12d2a7809dcae6ae93aabaeb2317558b",
  "timestamp": "2025-05-15T01:22:11.772480"
}