{
  "id": 779,
  "title": "Introducing the overall risk scoring as an early warning system",
  "abstract": "Business performance is a critical field of study, which should be assessed in more than just credit risk in the banking context. However, much previous research takes business performance in the context of credit risk in banking. In this study, risks will be analyzed to measure business performance in an integrated manner within the framework of non-financial sector dynamics. To this end, brainstorming sessions, risk workshops, surveys, and face-to-face interviews were held with representatives of small medium enterprises in 11 different sectors. Through field studies, risks have been identified and assessed in terms of impact and probability, Key Risk Indicators have been determined, and risks have been scored based on financial and non-financial metrics to estimate the Overall Risk Scoring. Moreover, the Overall Risk Scoring model has been tested using Logit Regression and Artificial Neural Networks (ANN), the Naive Bayes Algorithm, and the C4.5 decision tree model. All methods have statistically verified that the predictive power of the structure of the Overall Risk Scoring is high. Our findings reveal that when business performance is analyzed with non-financial and financial metrics, dynamic and static data, market expectations, and banking needs, the predictive power of the calculated Overall Risk Scoring increases. The created Overall Risk Scoring Model can be used as an early warning system for many objectives by business executives, suppliers, consumers, investors, financial institutions, public bodies, credit rating agencies, and entities like the Credit Guarantee Fund.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12d74dddeed6e304bac207f996348d30",
  "timestamp": "2025-05-15T01:55:07.999848"
}