{
  "id": 3543,
  "title": "LINKAGE OF SIZE EFFECT AND BEHAVIORAL RISK IN INDIAN EQUITY MARKET",
  "abstract": "This paper examined size effect and its linkages to behavioral risk. It also studied the market under reaction and over reaction to information events across size wise portfolios in Indian market over the period spanning from 2004 to 2016. Statistical techniques such as correlation analysis, Regression analysis and Principle Component Analysis were applied in this study. The study observed significant presence of size effect in the portfolio returns which is not in line with the movement of market beta factor. The analysis revealed that behavioral risk factor of the portfolios being inversely related to market size, indicating that the size effect observed as the price for behavioral risk prevailing in the market. In the presence of high optimistic irrational sentiment, the correction in excess returns are higher in large cap portfolios compared to that in small and medium size portfolios and vice versa in case of high pessimistic irrational sentiment in the market even though the sensitivity is not linear across the portfolios. It was observed that behavioral error increases across all the portfolio's returns in the trading on information events with small size portfolios assuming larger behavioral error compared to medium and larger size portfolios. But trading on non-information days leads to reduction in behavioral error across all the portfolios with small size portfolios experiencing larger percentage of correction compared to medium and large size portfolios. Broadly, the results showed that small and medium size portfolios experiencing positive over reaction while larger size portfolios experiencing negative under reaction to information events in Indian equity market. Overall, the study reveals the relevance of considering exposure to behavioral risk factors while constructing portfolios and in pricing of assets. The results also caution about entry and exit timing into the market.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12ea6fb0748df2d9b5ec9afe2abcea44",
  "timestamp": "2025-05-15T01:18:20.508744"
}