{
  "id": 6085,
  "title": "Is investigator background related to outcome in head to head trials of psychotherapy and pharmacotherapy for adult depression? A systematic review and meta-analysis",
  "abstract": "Background The influence of factors related to the background of investigators conducting trials comparing psychotherapy and pharmacotherapy has remained largely unstudied. Specializations emphasizing biological determinants of mental disorders, like psychiatry, might favor pharmacotherapy, while others stressing psychosocial factors, like psychology, could promote psychotherapy. Yet financial conflict of interest (COI) could be a confounding factor as authors with a medical specialization might receive more sponsoring from the pharmaceutical industry. Method We conducted a meta-analysis with subgroup and meta-regression analysis examining whether the specialization and affiliation of trial authors were associated to outcomes in the direct comparison of psychotherapy and pharmacotherapy for the acute treatment of depression. Meta-regression analysis also included trial risk of bias and author conflict of interest in relationship to the pharmaceutical industry. Results We included 45 trials. In half, the first author was psychologist. The last author was psychiatrist/MD in half of the trials, and a psychologist or statistician/other technical in the rest. Most lead authors had medical affiliations. Subgroup analysis indicated that studies with last authors statisticians favored pharmacotherapy. Univariate analysis showed a negative relationship between the presence of statisticians and outcomes favoring psychotherapy. Multivariate analysis showed that trials including authors with financial COI reported findings more favorable to pharmacotherapy. Discussion We report the first detailed overview of the background of authors conducting head to head trials for depression. Trials co-authored by statisticians appear to subtly favor pharmacotherapy. Receiving funding from the industry is more closely related to finding better outcomes for the industry's elective treatment than are factors related to authors' background. Limitations For a minority of authors we could not retrieve background information. The number of trials was insufficient to evidence subtler effects.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "12f8ec5be4504b1fb0b20e333ef39446",
  "timestamp": "2025-05-15T02:54:38.810974"
}