{
  "id": 7413,
  "title": "Prospective associations between early childhood mental health concerns and formal diagnosis of neurodevelopmental disorders in adolescence",
  "abstract": "Introduction Understanding associations between psychosocial development in early childhood and formal diagnosis of neurodevelopmental disorders (NDDs) in adolescence is critical for early identification and for tailoring interventions and support. This study investigated whether the Strengths and Difficulties Questionnaire (SDQ) scores in early childhood (4-5 years) predict mental health (MH) problems as evidenced by SDQ scores and formal diagnosis of NDDs in adolescence (16-17 years).Methods This study analysed data from a sample of 4968 children and adolescents using data from the Longitudinal Study of Australian Children. We used hierarchical regression models to determine the association between SDQ subscales and total scores at ages 4-5 years (primary exposure) and total SDQ scores and NDD diagnoses at ages 16-17 years (outcomes) whilst controlling for sociodemographic risk factors.Results Each unit increase in SDQ score at age 4-5 led to a rise in SDQ scores at age 16-17. Autism and ADHD diagnoses, female gender, lower maternal education, and financial hardship were associated with higher SDQ scores at age 16-17. Furthermore, parent reported SDQ at age 4-5 was linked to higher likelihoods of formal diagnoses of ADHD, autism, and ADHD/autism at age 16-17. Additionally, social determinants of health such as female gender, culturally and linguistically diverse (CALD) backgrounds, and financial hardship were associated with increased odds of ADHD, autism, and ADHD/autism diagnoses at age 16-17.Conclusion Our findings highlight the opportunity for early identification of transdiagnostic developmental and MH issues in the preschool period. Findings also emphasise the critical role of social determinants of health in the longitudinal trajectory of MH and NDDs and highlight the need for implementing early supports for improving peer relations and behavioural support strategies. If coupled with wrap around social care, early support strategies can enhance MH and wellbeing in adolescence and beyond.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "131d28363effccf24c235f12b8292d21",
  "timestamp": "2025-05-15T03:08:37.722070"
}