{
  "id": 6421,
  "title": "Barriers to Healthcare Access and Long-Term Survival After an Acute Coronary Syndrome",
  "abstract": "Barriers to healthcare are common in the USA and may result in worse outcomes among hospital survivors of an acute coronary syndrome (ACS). To examine the relationship between barriers to healthcare and 2-year mortality after hospital discharge for an ACS. Longitudinal study. Survivors of an ACS hospitalization were recruited from 6 medical centers in central Massachusetts and Georgia in 2011-2013. Study participants with a confirmed ACS reported whether they had a financial-related healthcare barrier, no usual source of care, or a transportation-related healthcare barrier around the time of hospital admission. None. Cox regression analyses calculated adjusted hazard ratios (aHRs) for 2-year all-cause mortality for the three healthcare barriers while controlling for several demographic, clinical, and psychosocial characteristics. The mean age of study participants (n = 2008) was 62 years, 33% were women, and 77% were non-Hispanic white. One third of patients reported a financial barrier, 17% lacked a usual source of care, and 12% had a transportation barrier. Five percent (n = 100) died within 2 years after hospital discharge. Compared to patients without these barriers, those lacking a usual source of care and with barriers to transportation experienced significantly higher mortality (aHRs 1.40, 95% CI 1.30 to 1.51 and 1.46, 95% CI 1.13 to 1.89, respectively). Financial barriers were not associated with all-cause mortality (aHR 0.79, 95% CI 0.60 to 1.06). Observational study with other unmeasured potentially confounding prognostic factors. Absence of an established usual source of care and inconsistent transportation availability were associated with a higher risk for dying after an ACS. Patients with these barriers to follow-up care may benefit from more intensive follow-up and support.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "131e486e0cc968db5c2a4d9e0ba3889d",
  "timestamp": "2025-05-15T02:58:05.585613"
}