{
  "id": 7990,
  "title": "Retrospective Cohort Study of Sickle Cell Disease and Large Vessel Retinal Vascular Occlusion Risk in a National United States Database",
  "abstract": "Objective: To determine if differences exist in the risk of developing large vessel retinal vascular occlusions in patients with sickle cell states. Design: Retrospective cohort study. Participants: Patients with sickle cell disease (SCD) or trait evaluated by an ophthalmologist were compared with matched controls without SCD or sickle cell trait (SCT) also evaluated by an ophthalmologist. Methods: This study used deidentified data from a national database (2006-2024), using International Classification of Diseases 10 codes to select for retinal vascular occlusions. Propensity score matching was performed with respect to age, sex, race, ethnicity, smoking, hypertension, diabetes, dyslipidemias, and obesity, resulting in hemoglobin SS (HbSS), hemoglobin SC (HbSC), and SCT cohorts and matched control cohorts. Main Outcome Measures: Risk ratios (RRs) and 95% confidence intervals (CIs) of retinal vascular occlusion diagnosis, including central retinal artery occlusion (CRAO), branch retinal artery occlusion (BRAO), central retinal vein occlusion, branch retinal vein occlusion, and corneal dystrophy as a negative control, given SCD or SCT. Results: After propensity score matching, HbSS (n = 10 802; mean age +/- standard deviation, 38.6 +/- 20.6 years), HbSC (n = 4296, 34.3 +/- 17.8 years), and SCT (n = 15 249, 39.8 +/- 23.7 years) cohorts were compared with control cohorts (n = 10 802, 38.7 +/- 20.7 years; n = 4296, 34.6 +/- 18.0 years; n = 15 249, 39.9 +/- 23.8 years, respectively). Patients with SCD (HbSS) had higher risk of developing any retinal vascular occlusion (RR, 2.33; 95% CI, 1.82-3.00), CRAO (RR, 2.71; 95% CI, 1.65-4.47), and BRAO (RR, 4.90; 95% CI, 2.48-9.67) than matched controls. Patients with HbSC disease had higher risk (RR, 3.14; 95% CI, 1.95-5.06) of developing any retinal vascular occlusion than matched controls without SCD. Patients with SCT did not have higher risk of developing retinal vascular occlusions (RR, 1.01; 95% CI, 0.81-1.26) than matched controls. Conclusions: In a retrospective cohort study, patients with HbSS SCD have an increased risk of developing retinal vascular occlusions, and more specifically CRAO and BRAO, compared with patients without SCD. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Retina 2025;9:46-51 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "131fe1f7e19ae8f890a5aa004fd089ce",
  "timestamp": "2025-05-15T03:14:07.254966"
}