{
  "id": 6963,
  "title": "Social Integration, Socioeconomic Conditions and Type of Ill Health Preceding Disability Pension in Young Women: a Swedish Population-Based Study",
  "abstract": "Background Disability pension has increased in recent decades and is seen as a public health and socioeconomic problem in Western Europe. In the Nordic countries, the increase has been particularly steep among young women. Purpose The aim was to analyze the influence of low social integration, socioeconomic risk conditions and different measures of self-reported ill health on the risk of receiving disability pension in young women. Method The study comprised all Swedish women born in 1960 to 1979, who had been interviewed in any of the annual Swedish Surveys of Living Conditions (1990-2002). The assumed predictors were related to disability pension by Cox proportional hazard regression. The mean number of years of follow-up for the 10,936 women was 7 years (SD 3.8), and the study base was restricted to the ages 16 to 43 years of age. Results An increased risk of receiving a disability pension was found among lone women, those who had sparse contacts with others, job-seeking women, homemakers, as well as women with low education, and poor private financial situations. A tenfold increase in the risk of receiving a disability pension was found among women reporting a long-standing illness and poor self-rated health, compared to women without a long-standing illness and good self-rated health. Psychiatric diagnoses and symptoms/unspecified illness were the strongest predictors of disability pension, particularly before 30 years of age. Conclusion The study suggests that weak social relations and weak connections to working life contribute to increase the risk of disability pension in young women, also after control for socioeconomic conditions and self-reported ill health. Self-rated health was the strongest predictor, followed by long-standing illness and not having a job (job seekers and homemakers).",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13252f409189c0b319d836f4800a6be6",
  "timestamp": "2025-05-15T03:03:55.668571"
}