{
  "id": 9382,
  "title": "Adherence and persistence to urate-lowering therapies in the Irish setting",
  "abstract": "To identify adherence and persistence levels with urate-lowering therapies using the national administrative pharmacy claim database. This was a retrospective, pharmacy claims-based analysis of dispensed anti-gout medications on the Irish national HSE-PCRS scheme database between January 2008 and December 2012. Adherence is defined by the medication possession ratio (MPR), and patients were considered to be adherent if the MPR a parts per thousand yen80 % (good adherers) in any given time period. Persistence was defined as continued use of therapy with no periods exceeding a refill gap of > 63 days (9 weeks). Logistic regression analysis was used to predict odd ratios (OR) and 95 % confidence interval (CI) for persistence and adherence in relation to age, gender and level of comorbidity. There was a 53 % increase in the number of patients prescribed anti-gout medications between 2008 and 2012 with an increase of 27 % in the associated ingredient cost of these medications. Allopurinol accounted for 87 % of the prescribing and febuxostat accounted for a further 9 %. In patients who started on 100 mg allopurinol, only 14.6 % were titrated to the 300 mg dose. For all those initiating urate-lowering therapies, 45.8 % of patients were persistent with treatment at 6 months decreasing to 22.6 % at 12 months. In multivariate analysis, females had poorer adherence (OR = 0.83 (0.77-0.90)), and increasing age was associated with increased adherence (OR = 4.19 (2.53-6.15)) Increasing comorbidity score was associated with increased adherence and persistence at 6 months (OR = 0.68 (0.59-0.79)). Adherence with anti-gout medications in this study cohort was relatively low. Sustained treatment for gouty arthritis is essential in the prevention of serious adverse outcomes. Significance and Innovations -Poor adherence to medications prescribed to patients for the management of chronic diseases such as gout is an ongoing problem which urgently needs to be addressed. -Some of the reasons identified for poor adherence to anti-gout medications include the risk of flare of acute gout with the initiation of urate-lowering therapy (ULT), poor response to ULT and persistence of attacks of acute gout, suboptimal dosing of allopurinol therapy and intolerance of allopurinol. -The results of this study identified adherence and persistence rates of approximately 50 % at 6 months which is in line if not lower than many of the other published studies to date which have measured adherence and persistence using pharmacy claims databases. -The results of poor adherence and persistence affect both the health of the patients with financial implications for the healthcare service.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1333a62b3138e8fe6c835f862332fe62",
  "timestamp": "2025-05-15T03:28:17.576997"
}