{
  "id": 2620,
  "title": "Data system for assessing probability of failure in SME reorganization",
  "abstract": "Purpose - The purpose of this paper is to develop a data system to assess failure probability in small to medium-sized enterprise (SME) reorganization. Design/methodology/approach - The data system is based on information from 83 reorganized Finnish SMEs. Information is divided into four types: pre-filing non-financial, pre-filing financial, reorganization submission, and reorganization plan information. Partial least squares (PLS) analysis is used in data mining to factorize information for each type of information. Logistic regression analysis is applied to assess failure probability. Findings - Useful data system can be developed on the basis of pre-filing non-financial information to support reorganization decision. Pre-filing financial information only marginally improves quality of information. Submission and reorganization plan information improve quality in terms of fit but do not significantly improve classification accuracy. Research limitations/implications - The sample is small and should be expanded in further studies. The system is developed for Finnish reorganizing firms. It can be generalized to any similar reorganization process. Practical implications - The data system is useful for managers, lending specialists, investors, reorganization lawyers, and judges. It warns a SME about reorganization failure before filing petition (passive use). It is also useful in developing successful reorganization plans (active use). Originality/value - This paper builds an extensive data system for assessing reorganization failure risk. It makes use of many variables that have not been analyzed in reorganization studies earlier. It deals with SMEs that is rare in reorganization studies. The paper utilizes PLS in assessing failure probability. It includes new analytical results on PLS.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13380617e1fade2b5c7a8d9a654e69d1",
  "timestamp": "2025-05-15T02:17:32.082145"
}