{
  "id": 5057,
  "title": "Assessing the impact of financial development, eco-innovations on sustainable development: insights from industrial economies of E7",
  "abstract": "Despite the global emphasis on sustainable development, existing research often overlooks how financial development, geopolitical stability, eco-innovations, and natural resource management interact to shape sustainable outcomes in emerging economies, especially the E7. This study addresses this gap by examining these factors' complex impacts on sustainable development in the E7, where economic growth frequently conflicts with environmental and social goals. By integrating financial and geopolitical dimensions with ecological innovation and resource use, this study offers novel insights into sustainable development in rapidly industrializing economies. This study investigates the impact of financial development (FD), geopolitical risk (GPR), eco-innovations (EI), natural resources (NRR), and economic growth (GDP) on sustainable development (SD) in E7 countries. Using CIPS unit root tests, the cross-sectional autoregressive distributed lag (CS-ARDL) model, and momentum quantile regression (MMQR), results confirm FD and EI positively impact SD in both the short and long term, aligning with SDG 8 (Decent Work and Economic Growth) and SDG 9 (Industry, Innovation, and Infrastructure). GPR, however, hinders SD, underscoring SDG 16 (Peace, Justice, and Strong Institutions). NRR management reveals a mixed impact on SDG 12 (Responsible Consumption and Production). This study highlights the importance of eco-innovation and geopolitical stability in advancing economic, ecological, and social goals for sustainable development.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "134821b680bdade9720a47916b4f1843",
  "timestamp": "2025-05-15T02:43:40.282325"
}