{
  "id": 2442,
  "title": "Analysis for Customer Lifetime Value Categorization with RFM Model",
  "abstract": "The same treatment of all customers will cause customers who are not so valuable will be value destroyer rather than a value creator. Giving discounts and promos to all customers has not provided benefits to a company in retaining customers. These two things are currently being experienced by LWC Company so that changes are needed in evaluating the strategy taken to keep the relationship with customers, especially potential customers, by forming customer portfolios. Customers portfolios can be analyzed from customer transactions. With customer transactions data, the company can find out which potential customers and the customers who do give less value for the company. The way to analyze customer transaction data is by clustering customers with Fuzzy C-means algorithm by using RFM model. Forming the number of clusters is validated by PCI model and ranking is done by multiplying AHP weight to find the life value of the customer so that it can be known which customer group gives high value to the company. The result of this research is that the customers of LWC Company categorized as superstar customer, typical customer and dormant customer. Based on the portfolio, LWC Company can carry out strategy in managing their customer according to the type of the portfolio. (C) 2019 The Authors. Published by Elsevier B.V.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13494005a4a5dd270f52d4f23f4eac4f",
  "timestamp": "2025-05-15T01:07:02.953407"
}