{
  "id": 4182,
  "title": "Energy productivity and financial inclusion: evidence from non-parametric novel panel methods",
  "abstract": "In the recent times, a severe drop in the environmental quality has been reported due the increase usage of energy for industrial and household purposes. Such environmental degradation is the cause of climate change and global warming. The competition for achieving higher economic growth in emerging economies further promote the use of traditional fossil fuel consumption, where the scholars and policy-makers addressed the importance of energy productivity. This study aims to examine the factors affecting energy productivity in emerging seven economies over the period 2004-2020. Accordingly, this study considers the role financial inclusion, economic growth, globalization, human capital, and composite risk index on energy productivity. Using the second-generation unit root technique, that accommodate the persistent issues of slope heterogeneity and cross-section dependence, that variables are stationary. Also, the long-run cointegration connection exist between these variables. Due to the asymmetrical data distribution, this study uses the unique method of moment quantile regression (MMQR). The results reveal that financial inclusion, economic growth, globalization, human capital, and composite risk are the significant factors of energy productivity in all the quantile (Q(0.25), Q(0.50), Q(0.75), and Q(0.90)). This study also analyzes the robustness of the model vial Granger causality test. The results verified the robustness by indicating the unidirectional as well as bidirectional causal association between the study variables. This study concludes that policies should consider improved financial inclusion, globalization, and human capital by reducing composite risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13499483183c3c9dcbc45b4bd24dd011",
  "timestamp": "2025-05-15T02:34:13.407681"
}