{
  "id": 8717,
  "title": "Centers for Medicare & Medicaid Services Hierarchical Condition Category score as a predictor of readmission and reoperation following elective inpatient spine surgery",
  "abstract": "OBJECTIVE A universal, objective predictor of postoperative resource utilization following inpatient spine surgery has not been clearly established. The Centers for Medicare & Medicaid Services (CMS) Hierarchical Condition Category (HCC) risk adjustment model, based on a formula using patient demographics and coded diagnoses, is currently used to prospectively estimate financial risk in Medicare Advantage patients; however, the value of this score as a clinical tool is currently unknown. The authors present an analysis evaluating the utility of the CMS HCC score as a universal predictive tool for patients undergoing inpatient spine surgery. METHODS A total of 1966 consecutive patients (551 with lumbar laminectomy [LL] alone, 592 with lumbar laminectomy and fusion [LF], and 823 with anterior cervical discectomy and fusion [ACDF]) undergoing inpatient spine surgery at a single institution from January 2014 to May 2018 were included in this retrospective outcomes study. Perioperative outcome measures included procedure time, 30-day readmission, reoperation, hospital length of stay (LOS), opioid utilization measured by morphine milligram equivalents (MMEs), and cost of inpatient hospitalization (in US dollars). Published CMS algorithms were incorporated into the electronic health records and used to calculate HCC scores for all patients. Patients were stratified into HCC score quartiles. Linear regression was performed on LOS, procedure time, inpatient opioid consumption, discharge opioid prescriptions, and cost to identify predictors of HCC quartiles when controlling for procedure type. One-way ANOVA and Pearson's chi-square analysis were used to compare perioperative outcomes stratified by HCC score. RESULTS Across all procedures, the HCC score demonstrated significant association with 30-day readmission (OR 1.45, 95% CI 1.11-1.91, p = 0.007). The average BMI, median American Society of Anesthesiologists score, and 30-day readmission rate were similar across procedures (LL: 30.6 kg/m(2), 2, 3.6%; LF: 30.6 kg/m(2), 2, 4.6%; ACDF: 30.2 kg/m(2), 2, 3.9%; p = 0.265, 0.061, and 0.713, respectively). LOS (p < 0.0001), duration of procedure (p < 0.0001), discharge MME (p = 0.031), total cost (p < 0.001), daily MME (p < 0.001), reoperation (p < 0.001), and 30-day readmission rate (p < 0.001) were significantly different between HCC quartiles. CONCLUSIONS The HCC score may hold value as an objective, automated predictor of postoperative resource utilization and outcomes, including readmission and reoperation. This may have value as a universal, reproducible tool to target clinical interventions for higher-risk patients.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1355ba0613682173f07eacf888f14147",
  "timestamp": "2025-05-15T03:21:56.563477"
}