{
  "id": 7985,
  "title": "Association of Primary Open-Angle Glaucoma with Diabetic Retinopathy among Patients with Type 1 and Type 2 Diabetes A Large Global Database Study",
  "abstract": "Purpose: To assess the correlation between primary open-angle glaucoma (POAG) and the risk of developing diabetic retinopathy (DR) in patients with type 1 diabetes mellitus (T1DM) and type 2 diabetes mellitus (T2DM). Design: A retrospective cohort study leveraging the global patient database of TriNetX Research Network. Participants: The study included 44 359 patients with diabetes mellitus (DM) with POAG and 4 393 300 patients with DM without any glaucoma >= 18 years of age. Propensity score matching harmonized the cohorts to 39 680 patients each, covering diagnoses from January 1, 2005, to January 1, 2023. Methods: We analyzed data using specific International Classification of Diseases, 10th th Revision (ICD-10) codes for DM and glaucoma. We matched the cohorts using propensity score matching, adjusting for age, sex, race/ethnicity, blood markers, relevant medical history, and ophthalmic service use. Main Outcome Measures: The primary outcome was the first-time occurrence of DR, including non- proliferative DR (NPDR) and proliferative DR (PDR), in patients with DM with and without glaucoma at 1-, 5-, and 10-year intervals from their individual index dates. Results: At 10 years, patients with T1DM with POAG exhibited a heightened risk for any DR (adjusted risk ratios [RRs], 4.12; 95% confidence interval [CI], 3.05-5.57, P <0.0001) and PDR (RR, 7.02; 95% CI, 3.62-13.61, P < 0.0001). Patients with T2DM and POAG also faced an increased 10-year risk for any DR (RR, 2.47; 95% CI, 2.28-2.68, P < 0.0001) and PDR (RR, 3.82; 95% CI, 3.09-4.70, P < 0.0001). The combined association of POAG on DR risk in those with T1DM and T2DM at 10 years was found to be significantly higher among patients with POAG (5.45%) compared with those without glaucoma (2.12%) (adjusted hazard ratio [aHR], 2.33; 95% CI, 2.14-2.53). The cumulative incidence of DR was significantly higher in the POAG group compared with non- glaucoma counterparts after a decade (log-rank P < 0.001). Conclusions: Our findings underscore a substantial association between POAG and DR development in both T1DM and T2DM patients, emphasizing the need for vigilant screening and comprehensive management in glaucomatous patients with DM to mitigate the risk of DR. Future research should delve into elucidating the causal mechanisms driving these observed associations. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2024;131:827-835 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13586a0a1da7b47a48b19aab018e3e00",
  "timestamp": "2025-05-15T03:14:07.229980"
}