{
  "id": 4854,
  "title": "The hidden financial catastrophe of chronic kidney disease under universal coverage and Thai Peritoneal Dialysis First Policy",
  "abstract": "ObjectiveUniversal health coverage can decrease the magnitude of the individual patient's financial burden of chronic kidney disease (CKD), but the residual financial hardship from the patients' perspective has not been well-studied in low and middle-income countries (LMICs). This study aimed to evaluate the residual financial burden in patients with CKD stage 3 to dialysis in the PD First Policy under Universal Coverage Scheme (UCS) in Thailand. MethodsThis multicenter nationwide cross-sectional study in Thailand enrolled 1,224 patients with pre-dialysis CKD, hemodialysis (HD), and peritoneal dialysis (PD) covered by UCS and other health schemes for employees and civil servants. We interviewed patients to estimate the proportion with catastrophic health expenditure (CHE) and medical impoverishment. The risk factors associated with CHE were analyzed by multivariable logistic regression. ResultsUnder UCS, the total out-of-pocket expenditure in HD was over two times higher than PD and nearly six times higher than CKD stages 3-4. HD suffered significantly more CHE and medical impoverishment than PD and pre-dialysis CKD [CHE: 8.5, 9.3, 19.5, 50.0% (p < 0.001) and medical impoverishment: 8.0, 3.1, 11.5, 31.6% (p < 0.001) for CKD Stages 3-4, Stage 5, PD, and HD, respectively]. In the poorest quintile of UCS, medical impoverishment was present in all HD and two-thirds of PD patients. Travel cost was the main driver of CHE in HD. In UCS, the adjusted risk of CHE increased in PD and HD (OR: 3.5 and 16.3, respectively) compared to CKD stage 3. ConclusionsDespite universal coverage, the residual financial burden remained high in patients with kidney failure. CHE was considerably lower in PD than HD, although the rates remained alarmingly high in the poor. The PD First' program could serve as a model for other LMICs. However, strategies to minimize financial distress should be further developed, especially for the poor.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1367967957ac0987caa6f96d34005c54",
  "timestamp": "2025-05-15T02:41:32.842975"
}