{
  "id": 3093,
  "title": "Monitoring the Modern Experience of Financial Risk Management in Russia Based on Corporate Social Responsibility for Sustainable Development",
  "abstract": "Goal: To perform monitoring of the modern experience of CSR (corporate social responsibility) manifestation in Russia and to differentiate and quantitatively measure the contribution of the support of SDGs (Sustainable Development Goals) and responsible HRM (human resources management) to managing businesses' financial risks. For this, a sample of the 11 largest companies of one sphere-the extracting industry-which are included in the ranking of Global 2000 Forbes for 2020 are used. Based on the sample, the authors determine the level of the financial risks of Russian companies in the 2020-2021 period and the impact of CSR (in terms of its distinguished indicators) on it. The authors model and measure the contribution of CSR (in terms of its distinguished directions) to the reduction in the financial risks of Russian companies in 2020 and assess the perspective of the decrease in the financial risks of Russian companies for the 2022-2024 period based on CSR. The novelty of this paper lies in the development of a proprietary classification of the directions of CSR by the criterion of contribution to financial risk management. According to the proprietary classification, the following aspects are distinguished: (1) support of SDGs and (2) responsible HRM. The uniqueness and originality of this paper are due to the fact that for the first time the authors perform quantitative measuring of the contribution of CSR (in terms of the distinguished directions-each in isolation) to managing businesses' financial risks in developing countries based on the example of Russia.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "137919748db8d56aada8e6a0e3277ea5",
  "timestamp": "2025-05-15T02:22:25.155742"
}