{
  "id": 9392,
  "title": "Trends in Unmet Need for Physician and Preventive Services in the United States, 1998-2017",
  "abstract": "Importance Improvements in insurance coverage and access to care have resulted from the Affordable Care Act (ACA). However, a focus on short-term pre- to post-ACA changes may distract attention from longer-term trends in unmet health needs, and the problems that persist. Objective To identify changes from 1998 to 2017 in unmet need for physician services among insured and uninsured adults aged 18 to 64 years in the United States. Design, Setting, and Participants Survey study using 20 years of data, from January 1, 1998, to December 31, 2017, from the Centers for Disease Control and Prevention Behavioral Risk Factor Surveillance System to identify trends in unmet need for physician and preventive services. Main Outcomes and Measures The proportion of persons unable to see a physician when needed owing to cost (in the past year), having no routine checkup for those in whom a routine checkup was likely indicated (within 2 years), or failing to receive clinically indicated preventive services (in the recommended timeframe), overall and among subgroups defined by the presence of chronic illnesses and by self-reported health status. We estimated changes over time using logistic regression controlling for age, sex, race, Census region, employment status, and income. Results Among the adults aged 18 to 64 years in 1998 (n = 117 & x202f;392) and in 2017 (n = 282 & x202f;378) who responded to the Centers for Disease Control and Prevention Behavioral Risk Factors Surveillance System (mean age was 39.2 [95% CI, 39.0-39.3]; 50.3% were female; 65.9% were white), uninsurance decreased by 2.1 (95% CI, 1.6-2.5) percentage points (from 16.9% to 14.8%). However, the adjusted proportion unable to see a physician owing to cost increased by 2.7 (95% CI, 2.2-3.8) percentage points overall (from 11.4% to 15.7%, unadjusted); by 5.9 (95% CI, 4.1-7.8) percentage points among the uninsured (32.9% to 39.6%, unadjusted) and 3.6 (95% CI, 3.2-4.0) percentage points among the insured (from 7.1% to 11.5%, unadjusted). The adjusted proportion of persons with chronic medical conditions who were unable to see a physician because of cost also increased for most conditions. For example, an increase in the inability to see a physician because of cost for patients with cardiovascular disease was 5.9% (95% CI, 1.7%-10.1%), for patients with elevated cholesterol was 3.5% (95% CI, 2.5%-4.5%), and for patients with binge drinking was 3.1% (95% CI, 2.3%-3.3%). The adjusted proportion of chronically ill adults receiving checkups did not change. While the adjusted share of people receiving guideline-recommended cholesterol tests (16.8% [95% CI, 16.1%-17.4%]) and flu shots (13.2% [95% CI, 12.7%-13.8%]) increased, the proportion of women receiving mammograms decreased (-6.7% [95% CI, -7.8 to -5.5]). Conclusions and Relevance Despite coverage gains since 1998, most measures of unmet need for physician services have shown no improvement, and financial access to physician services has decreased. Question Has unmet need for physician services shifted for US adults between 1998 and 2017? Findings Using data from US adults aged 18 to 64 years in 1998 (n = 117 & x202f;392) and in 2017 (n = 282 & x202f;378) who responded to the Centers for Disease Control and Prevention Behavioral Risk Factors Surveillance System, this study found that from 1998 to 2017 the inability to see a physician because of cost increased 2.7 percentage points owing to worsening access to care among the insured. In contrast, the proportion of chronically ill adults receiving checkups did not change; results for receiving guideline-recommended preventive services were mixed. Meaning Many US adults face substantial and increasing barriers in access to care, despite a modest improvement in insurance coverage in the past 20 years. This survey study identifies changes in unmet need for physician services among insured and uninsured adults aged 18 to 64 years in the United States from the 1998 and 2017 Behavioral Risk Factor Surveillance System surveys.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1383930c97f9f1a83ebade70a074329a",
  "timestamp": "2025-05-15T03:28:17.606710"
}