{
  "id": 7417,
  "title": "Objectively Measured Total and Occupational Sedentary Time in Three Work Settings",
  "abstract": "Background Sedentary behaviour increases the risk for morbidity. Our primary aim is to determine the proportion and factors associated with objectively measured total and occupational sedentary time in three work settings. Secondary aim is to study the proportion of physical activity and prolonged sedentary bouts. Methods Data were obtained using ActiGraph accelerometers from employees of: 1) a financial service provider (n = 49 men, 31 women), 2) two research institutes (n = 30 men, 57 women), and 3) a construction company (n = 38 men). Total (over the whole day) and occupational sedentary time, physical activity and prolonged sedentary bouts (lasting >= 30 minutes) were calculated by work setting. Linear regression analyses were performed to examine general, health and work-related factors associated with sedentary time. Results The employees of the financial service provider and the research institutes spent 76-80% of their occupational time in sedentary behaviour, 18-20% in light intensity physical activity and 3-5% in moderate-to-vigorous intensity physical activity. Occupational time in prolonged sedentary bouts was 27-30%. Total time was less sedentary (64-70%), and had more light intensity physical activity (26-33%). The employees of the construction company spent 44% of their occupational time in sedentary behaviour, 49% in light, and 7% in moderate intensity physical activity, and spent 7% in sedentary bouts. Total time spent in sedentary behavior was 56%, 40% in light, and 4% in moderate intensity physical behaviour, and 12% in sedentary bouts. For women, low to intermediate education was the only factor that was negatively associated with occupational sedentary time. Conclusions Sedentary behaviour is high among white-collar employees, especially in highly educated women. A relatively small proportion of sedentary time was accrued in sedentary bouts. It is recommended that worksite health promotion efforts should focus on reducing sedentary behaviour through improving light intensity physical activity.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13b93d25405fb294482eaa3a30bd416d",
  "timestamp": "2025-05-15T03:08:37.739617"
}