{
  "id": 8368,
  "title": "Prevalence and Risk Factors of Diabetic Retinopathy in Migrant Indians in an Urbanized Society in Asia The Singapore Indian Eye Study",
  "abstract": "Purpose: To describe the prevalence of and risk factors for diabetic retinopathy (DR) in Indian persons living in a newly urbanized society in Asia. Design: Population-based study. Participants: Ethnic Indians aged >= 40 years living in Singapore. Methods: The Singapore Indian Eye Study was conducted between 2007 and 2009. All participants underwent an extensive ophthalmic examination, including retinal photographs obtained after pupil dilation. These images were graded for the presence and severity of DR using the modified Airlie House classification system. Diabetes was defined as hemoglobin A1c level of >= 6.5%, use of diabetic medication, or a physician diagnosis of diabetes. Risk factors were measured using questionnaires, clinical assessments, or laboratory tests. Main Outcome Measures: Any DR, diabetic macular edema (DME), or vision-threatening DR (VTDR). Results: Among the 3400 participants, the age-standardized prevalence was 33.6% (95% confidence interval [CI], 31.4-35.8) for diabetes and 10.5% (95% CI, 9.3-11.8) for DR. Among those with diabetes only, the age-standardized prevalence was 30.4% (95% CI, 26.5-34.8) for any DR, 7.2% (95% CI, 5.3-9.7) for DME, and 7.1% (95% CI, 5.4-9.5) for VTDR. In multivariate analysis, independent risk factors for any DR were younger age (odds ratio [OR], 0.98; 95% CI, 0.96-1.00, per year increase), longer diabetes duration (OR, 1.09; 95% CI, 1.07-1.11 per year increase), higher hemoglobin A1c (OR, 1.23; 95% CI, 1.13-1.34 per percent increase), higher systolic blood pressure (OR, 1.01; 95% CI, 1.00-1.02 per 1-mmHg increase), lower diastolic blood pressure (OR, 0.97; 95% CI, 0.96-0.99 per 1-mmHg increase), history of previous stroke (OR, 2.16; 95% CI, 1.12-4.16), and insulin treatment (OR, 2.99; 95% CI, 1.84-4.87). Similar independent risk factors, except for blood pressure, were found for VTDR. Additionally, persons with lower income and living in smaller houses were associated with VTDR. Conclusions: One in 3 migrant Indians living in newly urbanized Asian societies have diabetes and 1 in 10 has DR. This is similar to rates reported in Western populations and significantly higher than those reported in India. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2012;119:2119-2124 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13bc85f699509676e7062193498fccd7",
  "timestamp": "2025-05-15T03:18:19.508137"
}