{
  "id": 4229,
  "title": "Modeling the Conditional Heteroscedasticity and Leverage Effect in the Chinese Stock Markets",
  "abstract": "The Chinese stock market has experienced an astonishing growth and unprecedented development since its inception in the early 1990s, emerged to be the world's second-largest by market value by the end of 2009. The Chinese stock market is also one of the most volatile markets, which has been called by many observers a casino. In the recent years there are several far-reaching events that have reshaped the Chinese stock markets. The most notable events include the dot-com bubble in 2000, China's non-tradable shares reform in 2005 and the global financial crisis in 2008. It is noted that the dot-com bubble has caused the Chinese stock markets a sharp oscillation since 2000. With a short-lived bull, the Chinese stock markets experienced a nearly five years long bear market until June 2005 when the reform of non-tradable shares was implemented, which increased the liquidity and brought the markets back to a long-term bull run. Since the US sub-prime mortgage crisis the Chinese stock markets have shown extreme instability and severe volatility, which has become the major concern to the policy-makers and investors. Many existing studies have revealed that the financial time series data exhibit linear dependence in volatility, which indicates the presence of heteroskedasticity, implying the existence of volatility clustering. Although direct generalizations from the univariate GARCH models are straightforward, their applications are limited by practical issues associated with cumbersome computation and strong restrictions on parameters to guarantee positive definiteness of variance matrixes. This study intends to examine the presence of heteroskedasticity and the leverage effect in the two Chinese stock markets, and to capture the dynamics of conditional correlation between returns of China's stock markets and those of the U. S. in a bivariate VC-MGARCH framework. The results show that that the leverage effect is significant in both Shanghai and Shenzhen markets during the sample period in 2000-2008, and the conditional correlation between mainland China's and the U. S. stock markets is quite low and highly volatile. The results indicate that that uncertainty derived from time-varying relationship between Shanghai and the U. S. stock markets is more significant than that between Shenzhen and the U. S. stock markets. In addition, the Chinese stock markets are found to be highly regimes persistent, thereby reducing potential benefits induced by actively trading. These findings have important implication for investors seeking opportunity of portfolio diversification.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13be17994c387b8879d9b483d347ac95",
  "timestamp": "2025-05-15T01:24:51.516129"
}