{
  "id": 2753,
  "title": "Behavioral risk profiling: Measuring loss aversion of individual investors",
  "abstract": "Loss aversion has been shown to be a key driver of people's investment decisions. Encouraged by regulators, financial institutions are seeking ways to integrate this behavioral factor into client risk classifications. A critical obstacle is the lack of a valid measurement method for loss aversion that can be straightforwardly incorporated into existing processes. This paper reports on two large-scale implementations of such a method within the riskprofiling application of an established financial institution. We elicit loss aversion for 1,040 employees and 3,740 clients, observing distributions that align with existing findings. Importantly, our results demonstrate that loss aversion is largely independent of the risk-return preferences commonly used for investor classification. Furthermore, the correlations we observe between these two preferences and individuals' background characteristics align with previous research: loss aversion is strongly correlated with education-higher educated individuals exhibit greater loss aversion-whereas risk aversion is related to gender, age, and financial status-women, older individuals, and those less financially secure are more risk averse. These findings support the conjecture that risk and loss aversion are complementary in capturing investor intent.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13cf709429697432b2696ab63a2add96",
  "timestamp": "2025-05-15T02:18:37.213450"
}