{
  "id": 4346,
  "title": "Enterprise risk assessment model based on graph attention networks",
  "abstract": "Enterprise risk assessment not only provides a crucial reference for enterprises' strategic and business decisions, but also forms a fundamental basis for the financing decisions of banks and other financial institutions. Furthermore, as a critical node within the industrial chain, the enterprise's risk may directly affect the stability of the entire industrial chain, highlighting the significance of researching enterprise risk assessment. Existing enterprise risk assessment methods need to be revised to account for the risk transmission between enterprises across different types of relationships. Consequently, it leads to the need for more utilization of industrial chain structure and interaction information between enterprises. To address this problem, an enterprise risk assessment model, which is based on attention mechanism and graph network, is proposed. Firstly, weights of associated enterprises under a particular relationship are focused on. Then, weights of different relationships are introduced. After that, feature aggregation is conducted. Finally, features are put into the classification network to determine the risk category of the target enterprise, and enterprise risk assessment is accomplished. Experiments using dataset in integrated circuit industrial chain are conducted to verify this method, and the result shows that the method can effectively assess enterprise risk.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13d9815a1566c94b3fbb8955dce13df8",
  "timestamp": "2025-05-15T02:36:05.231540"
}