{
  "id": 3760,
  "title": "Unraveling Investor Behavior: The Role of Hyperbolic Discounting in Panic Selling Behavior on the Global COVID-19 Financial Crisis",
  "abstract": "In financial markets, irrational behaviors such as hyperbolic discounting and panic selling are prevalent. However, their widespread empirical associations remain unexplored. Numerous behavioral theories discuss how cognitive biases exacerbate panic selling through the lens of immediate loss aversion, a phenomenon in which individuals exhibit impulsive decision-making tendencies due to an intense fear of financial loss during market upheaval. Despite the theoretical elucidation, empirical investigations of these dynamics are lacking. Using a robust dataset comprising 121,293 active investors sourced from a collaborative effort between Hiroshima University and Rakuten Securities Inc., this study used mean comparison tests and probit regression to analyze hyperbolic discounting's role in panic selling behavior on the global COVID-19 financial crisis. The findings reveal that hyperbolic discounting plays a central role in triggering investors' impulsive panic selling behavior, which is driven primarily by fear of potential losses. Other factors that influence panic selling behavior include age, male gender, low education level, financial literacy, household income, household assets, risk aversion, and overconfidence in financial knowledge. Our study explicates the need to address cognitive biases in financial decision making during market crises through strategies such as targeted financial education, regulatory interventions against market manipulation, and the provision of professional advice to investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13eaebd8fdda3849237c2d6c678c3c36",
  "timestamp": "2025-05-15T02:29:28.095080"
}