{
  "id": 8873,
  "title": "Life Course Adversity and Prior Miscarriage in a Pregnancy Cohort",
  "abstract": "Background: Prior studies indicate associations between preconception adversities and risk of miscarriage, but few have considered type (e.g., financial, substance use, abuse) or timing (e.g., childhood, adulthood) of adversities. We examined relationships between life course adversities in multiple domains and probability of miscarriage. Methods: Data came from women with at least one previous pregnancy in the Pregnancy Outcomes and Community Health (1998-2004) study (n = 2,106). Life course adversities in domains of abuse/witnessing violence, loss of someone close, economic hardship, and substance abuse were assessed via questionnaire and categorized as occurring during childhood only, adulthood only, both childhood and adulthood, or neither. We also calculated a cumulative adversity score. We used logistic regression models to estimate associations between life course adversity measures and the probability of miscarriage, and examined effect modification by race/ethnicity and maternal education. All models were adjusted for maternal age, race/ethnicity, education, and marital status. Results: The odds of miscarriage were higher among women experiencing legal adversities during both childhood and adulthood (odds ratio [OR], 1.9; 95% confidence interval [CI], 1.3-2.8) compared with women not experiencing legal adversities, and higher among women experiencing substance use adversities in childhood only (OR, 1.4; 95% CI, 1.1-1.7) compared with women not experiencing substance use adversities. Each additional adversity was marginally significantly associated with a 10% increase in odds of preterm birth (OR, 1.1; 95% CI, 1.0-1.1). Among women with only one prior miscarriage, no adversity measures were associated with miscarriage. Conclusions: Exposure to adversity in certain domains and across the life course modestly increased the odds of miscarriage. (C) 2018 Jacobs Institute of Women's Health. Published by Elsevier Inc.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13ead6a2cf314e90e59a9a672eb57477",
  "timestamp": "2025-05-15T03:23:27.761190"
}