{
  "id": 7358,
  "title": "Work-Related Musculoskeletal Disorders among Dentists in the United Arab Emirates: A Cross-Sectional Study",
  "abstract": "Background and Objectives: A dental environment possesses a serious ergonomic health issue on the dental team members which in turn contributes to the development of work-related musculoskeletal disorders (WMSDs). The present research is aimed at evaluating the frequency of musculoskeletal disorders and their associated sociodemographic and work environment risk factors among dentists in the United Arab Emirates. Material and Methods: In this cross-sectional study, a pretested and validated questionnaire was sent via email as well as on different social media platforms to a total of 497 dentists. A total of 179 dentists completed the study survey, with a total response rate of 36%. A binary logistic regression model was conducted to identify significant risk factors associated with WMSDs. Results: Dentists in the United Arab Emirates experience a high prevalence of work-related musculoskeletal disorders (90.4%) which were associated with high levels of stress in the work environment. Furthermore, dentists in the private sector worked more clinical hours per day (p = 0.000) and had more financial stress (p = 0.007) as compared to those in the governmental sector. Gender (p = 0.007), age (p = 0.01), monthly income (p = 0.073), work experience (p = 0.037), number of patients treated per day (p = 0.049), and the use of an ergonomic dental chair (p = 0.005) were all factors associated with a greater number of affected body regions by WMSDs. Multivariate binary logistic regression for the number of regions affected by WMSDs revealed that not using an ergonomic dental chair (OR 2.70, 95% CI, 1.14-6.36) and high stress in the work environment (OR 1.31, 95% CI 1.02 to1.67) were associated with more body regions being affected by WMSDs. Conclusions: This study highlights the high prevalence rate of WMSDs among dentists in the UAE. Future research should be directed towards reducing stress in the work environment, increasing awareness regarding the importance of an ergonomic dental chair, and reducing gaps between private and governmental practices.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13ed8a2d8987a61a401eb936f57288a3",
  "timestamp": "2025-05-15T03:07:32.009579"
}