{
  "id": 7844,
  "title": "Public Concerns and Mental Health Changes Related to the COVID-19 Pandemic Lockdown in Saudi Arabia",
  "abstract": "Background: Public measures to confine the spread of the novel coronavirus disease 2019 (COVID-19) infection involves partial or full lockdown by some countries including Saudi Arabia. Social isolation, and financial insecurity are potential risk factors for mental changes. This study aimed to address public concerns, and assess mental health changes, and the factors associated with mental health burden in response to the COVID-19 outbreak in Saudi Arabia after the full lockdown is widely employed. Methods: This cross-sectional study was conducted between 30th of April, and 10th of May, 2020 by posting an online survey on social media platforms (WhatsApp, and Twitter) to collect data on participants' demographics, concerns and worries related to the COVID-19 pandemic, and mental health changes using a validated Arabic version of the self-rated Hospital Anxiety and Depression Scale (HADS). Results: A total of 1,921 responded to the questionnaire. Of them, 1,429 (74.5%) were <= 45 years old, and 967 (50.3%) were males. Reported public concerns included disturbed lifestyle, getting self or family member infected, loss job or part of income, difficult access to routine health care, and 55.8% reported negative impact on their mental health. Hospital anxiety and depression scale revealed high rates of depression [717 (37.3%)], and anxiety [508 (26.4%)]. Binary logistic regression revealed that female gender, working for the private sector, smokers, and people with chronic diseases were at increased risk of mental illnesses (p < 0.05). Conclusions: This study addressed serious public concerns, and substantially high rates of depression and anxiety related to the COVID-19 pandemic, and lockdown.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13ee2d8af8489be5fccd515b488c5fa4",
  "timestamp": "2025-05-15T03:12:36.526987"
}