{
  "id": 4593,
  "title": "Harms to children from the financial effects of others' drinking",
  "abstract": "Background: Many children live with parents who drink and experience little impact, but risky or heavy drinking by caregivers can result in a range of harms to children. Alcohol-related financial harms which directly impact children's needs in general populations have been seldom studied. Objective: The study aims to identify the prevalence and correlates of financial harms from others' drinking affecting children's needs in nine lower- and middle-income (LMICs) and high-income countries (HICs). Methods: Participants ( n = 7,669) from Brazil, Chile, Ireland, Lao PDR, Nigeria, Sri Lanka, Thailand, USA and Viet Nam were aged 18-64 years and living with children. Logistic regression and meta-analyses explored differences in financial harm affecting children among LMICs and HICs, adjusting for gender, education, rurality and drinking pattern. Results: In around one-tenth to a third of households in the nine countries, children lived with people who drank riskily. Less than 1% to 8% of respondents reported that their children's needs had not been met because of financial harm from others' drinking. Women reported significantly greater harm to children due to the financial effects of others' drinking than men in the USA, Nigeria and Viet Nam. When the participant reported drinking riskily, and particularly when families included someone who drank heavily, increased odds of financial harm from others' drinking affecting children were identified . Conclusion: That children's needs were not met due to financial harm from others' drinking was reported by three percent ( < 1 to 8%) of caregivers across the nine countries, representing a problem for large numbers of children, particularly in the low and middle-income countries studied. When a person's drinking was reported to be heavy or harmful within the family, the risk that children's needs were affected by the financial impacts of others' drinking was significantly greater.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "13f5b799d4ae74d0dcac4b8b06109aca",
  "timestamp": "2025-05-15T02:38:56.369982"
}