{
  "id": 8123,
  "title": "BARRIERS TO CHOLESTEROL TESTING IN A RURAL-COMMUNITY",
  "abstract": "Background. The purpose of this study was to investigate the factors that determine whether residents in a rural community have their cholesterol tested. Methods. A population-based survey was conducted in 1987 as part of a community-oriented primary care project that sought to define and address the causes of and burden caused by increased cardiovascular disease in an economically depressed agricultural region of New York. All of the residents living in two towns in the region who were over 16 years of age and who lived in their homes year-round were surveyed. Demographic information was obtained from the participants, as well as information about previous cholesterol testing and their cardiovascular-risk knowledge and behaviors. The serum cholesterol of each participant was measured. Results. Of the 557 households contacted, 508 (91%) households participated. A total of 1063 persons over 16 years of age were surveyed, and 973 (92%) were screened for cholesterol. Overall, 24% reported prior cholesterol testing. Logistic regression analysis identified several independent factors that were associated with a reduced likelihood of ever having had a cholesterol test. These factors included: (1) age under 45 years, (2) having less than 12 years of education, (3) having an income of less than $10,000, (4) not having health insurance, (5) not having visited a physician within the previous year, and (6) practicing three or more high-risk cardiovascular behaviors. The participants' cardiovascular knowledge made no independent contribution to having had their cholesterol levels tested. Conclusions. Many of the factors that prevent cholesterol testing are socially determined. The results of this study suggest that financial and social barriers are two of the major obstacles to residents of rural communities having their cholesterol levels tested.",
  "year": 1991,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1409e0a02b36f59771220c5602693464",
  "timestamp": "2025-05-15T03:15:38.354548"
}