{
  "id": 1747,
  "title": "Prediction of bank credit worthiness through credit risk analysis: an explainable machine learning study",
  "abstract": "The control of credit risk is an important topic in the development of supply chain finance. Financial service providers should distinguish between low- and high-quality customers to predict credit risk accurately. Proper management of credit risk exposure contributes to the long-term viability and profitability of banks, systemic stability, and efficient capital allocation in the economy. Moreover, it benefits the development of supply chain finance. Supply chain finance offers convenient loan transactions that benefit all participants, including the buyer, supplier, and bank. However, poor credit risk management in supply chain finance may cause losses for finance providers and hamper the development of supply chain finance. Machine learning algorithms have significantly improved the accuracy of credit risk prediction systems in supply chain finance. However, their lack of interpretability or transparency makes decision-makers skeptical. Therefore, this study aims to improve AI transparency by ranking the importance of features influencing the decisions made by the system. This study identifies two effective algorithms, Random Forest and Gradient Boosting models, for credit risk detection. The factors that influenced the decision of the models to make them transparent are explicitly illustrated. This study also contributes to the literature on explainable credit risk detection for supply chain finance and provides practical implications for financial institutions to inform decision making.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1429a902ad5b10adbc24aaf0bc30ca05",
  "timestamp": "2025-05-15T02:06:52.720707"
}