{
  "id": 5658,
  "title": "Spatial disparities in impoverishing effects of out-of-pocket health payments in Malawi",
  "abstract": "Background: Out-of-pocket health payments as a means of financing health services are a cause of concern among households in low and middle-income countries. They prevent households from accessing health care services, can disrupt households' living standards by reducing consumption of other basic needs and push households into poverty. Previous studies have reported geographical variations in impoverishing effects of out-of-pocket health payments. Yet, we know relatively little about spatial effects on impoverishing effects of health payments. Objective: This paper assesses the factors associated with impoverishing effects of health payments and quantifies the role of districts spatial effects on impoverishment in Malawi. Methods: The paper uses a cross sectional integrated household survey data collected from April 2016 to April 2017 among 12447 households in Malawi. Impoverishing effect of out-of-pocket health payments was calculated as the difference between poverty head count ratio before and after subtracting health payments from total household consumption expenditures. We assessed the factors associated with impoverishment and quantified the role of spatial effects using a spatial multilevel model. Results: About 1.6% and 1.2% of the Malawian population were pushed below the national and international poverty line of US$1.90 respectively due health payments. We found significant spatial variations in impoverishment across districts with higher spatial residual effects clustering in central region districts. Higher socio-economic status (AOR=0.34, 95% CI=0.22-0.52) decreased the risk of impoverishment whereas hospitalizations (AOR=3.63, 95% CI 2.54-5.15), chronic illness (AOR=1.56, 95% CI=1.10-1.22), residency in rural area (AOR=2.03, 95% CI=1.07-4.26) increased the risk of impoverishment. Conclusions: Our study suggests the need to plan financial protection programs according to district specific needs and target the poor, residents of rural areas and those with chronic illnesses. Policy makers need to pay attention to the importance of spatial and neighborhood effects when designing financial protection programs and policies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1434b5d6efa98f520a2f9441d93645da",
  "timestamp": "2025-05-15T02:49:50.399058"
}