{
  "id": 4945,
  "title": "Sex differences in the effects of stressful life events on changes in smoking status",
  "abstract": "Aims Stressful life events known to be associated with substance use were examined to determine if there were sex-specific responses to stress resulting in changes in smoking status. Participants and measurements A community-based sample of ever smokers from the Americans' Changing Lives study (n = 1512, 45% female based on sample weights) was used to examine the interactive effects of sex and stressful life events on the likelihood of two outcomes; relapse among former smokers and failure to quit among current smokers. Logistic regression procedures were used to calculate odds ratios. Factors known to be associated with smoking status (e.g. depression, self-esteem, social support) were assessed as control variables. Findings In the sample of former smokers (n= 729) interpersonal loss events were associated with continued abstinence, whereas change of residence and adverse financial events were associated with increased occurrence of relapse. Women were more likely than men to relapse in response to a financial event. In the sample of current smokers (n = 783), financial events were associated with continued smoking, whereas health events were associated with increased likelihood of quitting. Women were more likely than men to continue smoking in the presence of an adverse financial event and less likely than men to quit in response to an adverse health event. Conclusions Overall, stressful life events appear to have a greater deleterious effect on continued abstinence and the ability to quit smoking for women when compared to men. In particular, health and financial events are important risk factors for women and tobacco use.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1434ef21b813a354fac5d88d8275dabc",
  "timestamp": "2025-05-15T02:42:36.196696"
}