{
  "id": 7186,
  "title": "Discovering new value in intellectual property",
  "abstract": "Intellectual property? Five years ago, that phrase wasn't even in the vocabularies of many CEOs, let alone a part of their business strategies. Indeed, many chief executives still regard patents, trademarks, copyrights, and other forms of intellectual property as legal matters best left to the corporate attorneys. But the burgeoning knowledge economy has given rise to a new type of CEO and a new type of business competition-one in which intellectual assets, not physical ones, have become the principal sources of shareholder wealth and competitive advantage. And therein lies one of the next great corporate challenges: figuring out how to unlock the hidden power of patents. In this article, authors Kevin Rivette and David Kline describe how the strategic management and use of patents can enhance a company's commercial success in three broad ways: by establishing a proprietary market advantage, by improving financial performance, and by enhancing overall competitiveness. They present real-world examples of effective and ineffective patent management strategies-for example, comparing Dell's aggressive patenting of its direct-sales business model with Wat-Mart's looser protection of its unique business systems. They describe common but effective patenting techniques such as clustering and bracketing, both designed to block out or hamper competitors in the market. For both traditional and new-economy businesses, such as Amazon.com and Priceline.com, leveraging patents properly can produce benefits such as reduced corporate risk, the ability to anticipate and react to market shifts, and, ultimately, increased shareholder value and profits.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "143ef39c420d5a8a2225b2f29600742e",
  "timestamp": "2025-05-15T03:06:01.223659"
}