{
  "id": 960,
  "title": "Machine learning and credit ratings prediction in the age of fourth industrial revolution",
  "abstract": "The fourth industrial revolution has resulted in unprecedented innovations and improvements for the financial sector. In this paper, we employ the machine learning techniquesa subset of artificial intelligencein order to predict the credit ratings for the banks in GCC. The quarterly dataset of the macro and bank specific variables was used for a period that spanned between the years 2010 to 2018, with an out of sample prediction, for three years. Our findings suggest that arbitrary forests demonstrate the highest precision, based on the F1 score, specificity, and the accuracy scores. This precision remained robust for all the classes of the ratings, ranging from the highest credit quality to the default mode as well. Moreover, our findings also revealed that the Artificial Neural Networks are ranked second for the overall predictions that have been made. However, for the speculative and default grades, our findings suggest that the Classification and Regression Trees (CART) are significantly relevant, and although their precision is less than the random forests, the difference is not significant. Therefore, we propose that, for the stressed banks, both random forests and the CART should be employed, for a better and more informed risk assessment. These findings have important implications, especially when it comes to analyzing the credit risk of the banks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "144a6416662cb0ee8934406009afe42c",
  "timestamp": "2025-05-15T01:56:49.762195"
}