{
  "id": 9384,
  "title": "Impact of Publicly Sponsored Interventions on Musculoskeletal Injury Claims in Nursing Homes",
  "abstract": "Background The rate of lost-time sprains and strains in private nursing homes is over three times the national average, and for back injuries, almost four times the national average. The Ohio Bureau of Workers' Compensation (BWC) has sponsored interventions that were preferentially promoted to nursing homes in 2000-2001, including training, consultation, and grants up to $40,000 for equipment purchases. Methods This study evaluated the impact of BWC interventions on back injury claim rates using BWC data on claims, interventions, and employer payroll for all Ohio nursing homes during 1995-2004 using Poisson regression. A subset of nursing homes was analyzed with more detailed data that allowed estimation of the impact of staffing levels and resident acuity on claim rates. Costs of interventions were compared to the associated savings in claim costs. Results A $500 equipment purchase per nursing home worker was associated with a 21% reduction in back injury rate. Assuming an equipment lift of 10 years, this translates to an estimated $768 reduction in claim costs per worker a present value of $495 with a 5% discount rate applied. Results for training courses were equivocal. Only those receiving below-median hours had a significant 19% reduction in claim rates. Injury rates did not generally decline with consultation independent of equipment purchases, although possible confounding, misclassification, and bias due to non-random management participation clouds interpretation. In. nursing homes with available data, resident acuity was modestly associated with back injury risk, and the injury rate increased with resident-to-staff ratio (acting through three terms: RR = 1.50 for each additional resident per staff member;for the ratio alone, RR = 1.32, 95% CI = 1.18-1.48). In these NHs, an expenditure of $908 per resident care worker (equivalent to $500 per employee in the other model) was also associated with a 21% reduction in injury rate. However with a resident-to-staff ratio greater than 2.0, the same expenditure was associated with a $1,643 reduction in back claim costs over 10 years per employee, a present value of $1,062 with 5% discount rate. Conclusions Expenditures for ergonomic equipment in nursing homes by the Ohio BWC were associated with fewer worker injuries and reductions in claim costs that were similar in magnitude to expenditures. Un-estimated benefits and costs also need to be considered in assessing full health and financial impacts. Am. J. Ind. Med. 52:683-697, 2009. (C) 2009 Wiley-Liss, Inc.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1458bb79776d6e90c100f8bd132b29b8",
  "timestamp": "2025-05-15T03:28:17.578998"
}