{
  "id": 630,
  "title": "Psychosocial, hemostatic, and inflammatory correlates of delayed poststress blood pressure recovery",
  "abstract": "Objective: Delayed poststress cardiovascular recovery has been associated with cardiovascular disease risk. This study assessed relationships between systolic blood pressure (BP) recovery, psychosocial risk factors, and delayed recovery of inflammatory and hemostatic variables. Method: Data were analyzed from 228 middle-aged men and women from the Whitehall Psychobiology study who performed color/word and mirror-tracing tasks. Systolic BP recovery was assessed as the difference between baseline and levels recorded 40 to 45 minutes poststress. Associations were analyzed with socioeconomic markers (grade of employment, education, income), psychosocial factors (social isolation, hostility, mental health, financial strain), and recovery of heart rate, heart rate variability, von Willebrand factor, factor VIII clotting activity, plasma fibrinogen, and plasma viscosity. Results: Systolic BP was on average 6.19 +/- 9.6 mm Hg higher on recovery than baseline. Delayed BP recovery was associated with lower grade of employment, lower education and lower income independently of age, gender, and systolic BP stress reactivity. Delayed BP recovery was related to social isolation and poor mental health independently of age, gender, socioeconomic position, and task reactivity. Delayed systolic BP recovery was also associated with delayed recovery in diastolic BP, heart rate, factor VIII, and plasma viscosity but not delayed heart rate variability recovery, independently of age, gender, body mass, and task reactivity. Conclusion: Socioeconomic and psychosocial risk factors for cardiovascular disease are related to delays in poststress recovery. Delayed systolic BP recovery may be a marker for prolonged responses in hemostatic variables that have a direct influence on cardiovascular disease pathogenesis.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "146d06ce37046baf60c7ea27a5db0bfc",
  "timestamp": "2025-05-15T01:40:51.093087"
}