{
  "id": 8376,
  "title": "Leverage-value nexus in Italian small-medium enterprises: further evidence using dose-response function",
  "abstract": "Purpose The study introduces a new approach to leverage-value relationship. Besides applying the classical regression models, the study deals with leverage as a continuous treatment variable implemented on the firm's value using the dose-response function (DFR). Design/methodology/approach After proper model calibration and splitting the treatment (leverage) into ten doses, a response function is generated, which enables the realization of the dose level at which the firm's value is maximized. Furthermore, the study tests the pecking order theory (POT) and the trade-off theory (TOT) using the threshold model to see whether firms are under or over-indebted. The analysis is carried out on panel data from small-medium enterprises (SMEs), providing more valuable insights than large and mature companies. Findings The study used two leverage measures: total liabilities ratio and bank debt ratio. Value is measured by the market capitalization and Tobin's Q. In general, the study finds a positive relationship between leverage and value; POT is not strongly supported, firms are below their optimal leverage and there is a certain leverage dose that would maximize firms' value. Practical implications Since the threshold model and DRF show that SMEs are under-indebted, firms could benefit from extra leverage doses without affecting the firm's risk profile, especially in a low-interest rate regime, and the potential increase in public-private expenditure after Italy obtained the European Recovery Funds. Originality/value The study contributes to new knowledge and understanding of financial leverage from new methodological perspectives, offering valuable insights from SMEs using novel approaches.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "147ee51cea00386a8b15055133b5166c",
  "timestamp": "2025-05-15T03:18:19.545003"
}