{
  "id": 4517,
  "title": "A copula-based scenario tree generation algorithm for multiperiod portfolio selection problems",
  "abstract": "Global financial investors have been confronted in recent years with an increasing frequency of market shocks and returns' outliers, until the unprecedented surge of financial risk observed in 2008. From a statistical viewpoint, those market dynamics have shown not only asymmetric returns and fat tails but also a time-varying tail dependence, stimulating the formulation of portfolio selection models based on such assumptions. The concept of tail dependence on upper or lower tails, roughly speaking, focuses on the risk that tail events may occur jointly in different markets. This notion can be given a rigorous probabilistic definition, and it turns out that a distinction between upper and lower tails is relevant in portfolio management. In this paper, relying on a discrete modeling framework, we present a scenario generation algorithm able to capture this time-varying asymmetric tail dependence, and evaluate resulting optimal investment policies based on 4-stages 1-month planning horizons. The scenario tree aims at approximating a stochastic process combining an ARMA-GARCH model and a dynamic Student-t-Clayton copula. From a methodological viewpoint, scenario trees are generated from this model by stage-wisely sampling and clustering and to improve tail fitting with original data, the scenarios' nodal probabilities are calibrated on the returns' lower tails for a set of equity indices. The resulting scenario trees are then applied to solve a multiperiod portfolio selection problem. We present a set of empirical results to validate the adopted statistical approach and the optimal portfolio strategies able to capture asymmetric tail returns.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1483570a9d7e9d3e1b88929eba87a426",
  "timestamp": "2025-05-15T02:38:20.277299"
}