{
  "id": 4113,
  "title": "Livelihood Impacts of Forest Carbon Protection in the Context of Redd plus in Cross River State, Southeast Nigeria",
  "abstract": "The rate of landcover change linked to deforestation and forest degradation in tropical environments has continued to surge despite a series of forest governance policy instruments over the years. These informed the launch of one of the most important international policies called Reducing Emission from Deforestation and Forest Degradation Plus (REDD+) to combat forest destruction. REDD+ assumes that communities will have increased assets to natural capital which will enhance their livelihood portfolio and mitigate the effects of climate variability and change across biomes. The aim of this study is to ascertain the livelihoods impacts of forest carbon protection within the context of REDD+ in Cross River State, Nigeria. Six forest communities were chosen across three agroecological zones of the State. Anchored on the Sustainable Livelihood Framework, a set of questionnaires were administered to randomly picked households. The results indicate that more than half of the respondents aligned with financial payment and more natural resources as the perceived benefits of carbon protection. More so, a multinomial logistic regression showed that income was the main factor that influenced respondent's support for forest carbon protection. Analysis of income trends from the 'big seven' non-timber forest resources in the region showed increase in Gnetum africanum, Bushmeat, Irvingia gabonensis, Garcinia kola, while carpolobia spp., Randia and rattan cane revealed declining income since inception of REDD+. The recorded increase in household income was attributed to a ban in logging. It is recommended that the forest communities should be more heavily involved in the subsequent phases of the project implementation to avoid carbon leakages.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "148b2b75d8748284f1ee0f43da8f1fcc",
  "timestamp": "2025-05-15T01:23:58.065021"
}