{
  "id": 3758,
  "title": "Managerial equity incentives portfolio and the moral hazard of technology investment",
  "abstract": "Modern literature emphasises the enterprise innovation theory of balancing explorative and exploitative activities to control the moral hazards of technology investment. Many studies overlook the noisy perspective of innovation and offer various instruments for more or less innovation. We attempt to diverge the debate and unfold the sensitivity of managerial equity incentive schemes on the subject of the quality of innovation. Investment in patents and R&D is applied to account for quantity and quality innovation, respectively. Fixed-effects and logit regression modelling are used for basic estimations and a two-step system GMM is applied to control the endogeneity. The estimations validate that stock appreciation incentives are more sensitive to the quantity of innovation, whereas, stock options and restricted equity rights have a strong impact on the quality of innovation. Subsample analysis revealed that the explanatory power of our predictions is highly pronounced in large and young firms. Innovative firms are suggested to design the managerial equity incentive portfolio as per their technological choices. Firms should consider the sensitivity of equity incentive schemes to control effort ex-ante, especially to attain technology leadership and optimal corporate value in the long run.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1496aa6d703f080cdb1ffe5f436760e0",
  "timestamp": "2025-05-15T01:20:36.000250"
}