{
  "id": 6948,
  "title": "The prevalence risk of anxiety and its associated factors among university students in Malaysia: a national cross-sectional study",
  "abstract": "BackgroundAnxiety disorder is one of the most common mental health problems worldwide, including Malaysia, and this issue has gained concern and attention from many, including experts and authorities globally. While average levels of stress and worry may help to motivate students to perform well in their studies, excessive feelings will increase their level of anxiety.MethodsA cross-sectional study was conducted at selected government and private universities throughout Malaysia. A total of 1851 students participated in this study. The students were asked to complete self-administered questionnaires, including socio-demographic, academic, and psychosocial characteristics. The Generalized Anxiety Disorder-7 (GAD-7) questionnaire was used to measure the prevalence risk of anxiety among the students. Chi-square analysis was conducted to find the relationship between the variables and anxiety, and multivariate logistic regression analysis was used to identify the predictors.ResultsThe response rate was 97.90%, where 1821 out of 1860 students participated in the study. The prevalence risk of anxiety in this study was recorded at 29%. The data revealed that academic year, financial support for the study, alcohol consumption, poor sleep quality, body mass index (BMI), having a good friend in the university, having doubt regarding the future, actively involved in the society, and having problems with other students and lecturer(s) were significantly associated with risk of anxiety; with the academic year as the primary predictor.ConclusionsThe findings highlight the current prevalence risk of anxiety among university students in Malaysia. The outcome of this study can serve as the evident baseline data and help with the development of specific interventions in addressing and managing the issue appropriately.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "14d1b949cec483aba63153c4d92a4e9f",
  "timestamp": "2025-05-15T03:03:13.512642"
}