{
  "id": 6672,
  "title": "The Value of Patient-Reported Outcomes to Predict Symptom Burden and Health-Related Quality of Life After Chemoradiation for Cervical Cancer: A Prospective Study",
  "abstract": "Purpose: Patients with cervical cancer undergoing chemoradiation have high symptom burden. We performed an analysis of prospectively collected data on patient-reported outcomes to determine characteristics predictive of poor treatment experience. Methods and Materials: Between 2021 and 2023, we prospectively collected data on patient-reported outcomes from patients with cervical cancer undergoing definitive chemoradiation. The European Organization for Research and Treatment of Cancer (EORTC)-Quality of Life Question-Core 30 and the EORTC-Quality of Life Question-Cervical Cancer module were completed at baseline (BL) and at the end of treatment (EOT). Poor treatment experience was defined as EOT poor health-related quality of life (HRQOL), low physical function, or significant overall symptom burden. Predictive factors analyzed included demographic, clinical, and disease-specific factors and BL financial toxicity, depression, social function, and emotional function. Receiver operating characteristic analysis provided appropriate predictive cutoff values. Univariable and multivariable (MVA) linear regression analyses were performed. Results: Forty-nine patients completed BL and EOT questionnaires. Median age was 43 years (range, 18-85 years). Most patients (59%) had stage III disease. BL financial toxicity >= 66.7, depression >= 66.7, social function <= 50, and emotional function <= 58 on the EORTC linear transformed scale of 0 to 100 were significant predictors for poor treatment experience (p <= .04) based on receiver operating characteristic analysis. On MVA, poor BL social function was associated with reduced EOT HRQOL (beta, -9.3; 95% CI, -16.1 to -2.6; p < .008), decreased physical function (beta, -24.4; 95% CI, -36.3 to -12.6; p < .001), and high symptom burden (beta, 26.9; 95% CI, 17.5-36.3; p < .001). Earlier disease stage predicted decreased symptom burden (beta, -6.7; 95% CI, -13.1 to -0.3; p = .039). BL financial toxicity was a significant predictor in univariable analysis (p = .001-.044) and showed a significant interaction term on MVA (p = .024-.041) for all 3 domains of poor treatment experience. Demographic and treatment-related factors were not predictive. Conclusions: Patients with cervical cancer with poor BL social function or high financial toxicity were at risk for increased symptom burden and poor HRQOL. Screening for these factors provides an opportunity for early intervention to improve treatment experience.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "14d2151f17e113e014b8c29dd253968e",
  "timestamp": "2025-05-15T03:00:35.336433"
}