{
  "id": 3752,
  "title": "The impact of Serbian tourists' risk perception on their travel intentions during the COVID-19 pandemic",
  "abstract": "The purpose of this study is to examine the impact of Serbian tourists' risk perception on their intentions to travel during the COVID-19 pandemic with the control of socio-demographic characteristics. This research was conducted in the period from 18 May until 24 May 2020, on a sample of 348 respondents, through an online questionnaire. The principal component analysis identified five categories of the perceived risk affecting travel intentions during the COVID-19 pandemic: the health risk, the psychological risk, the financial risk, the destination risk and the travel risk. Logistic regression was used to examine the way in which risk perception affects the intentions and destinations of travel during the COVID-19 pandemic. The research findings indicate that the risk perception (health, psychological, financial and destination risks) among Serbian tourists negatively affects their travel intentions during the COVID-19 pandemic. In terms of travel destinations, the results indicate that the travel risk negatively affects travel abroad, while the health risk, being on the verge of significance, proved to be a predictor of travel abroad during the COVID-19 pandemic. Furthermore, the variable of monthly income of the respondents was singled out as a significant predictor of travel abroad during the pandemic. Finally, the implications, limitations and recommendations for future research are presented in the paper.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "14d822b33736b0d119f18ab59d7c97a6",
  "timestamp": "2025-05-15T02:29:28.081949"
}