{
  "id": 8353,
  "title": "The association between hospital type and mortality and length of stay - A study of 16.9 million hospitalized Medicare beneficiaries",
  "abstract": "OBJECTIVES. TO examine the association between hospital type and mortality and length of stay using hospitalized Medicare beneficiaries for a 10-year period. METHODS. The retrospective cohort study included 16.9 million hospitalized Medicare beneficiaries less than or equal to 65 years of age admitted for 10 common medical conditions and 10 common surgical procedures from 1984 to 1993. A total of 5,127 acute-care hospitals in the United States were grouped into 6 mutually exclusive hospital types based on teaching status and financial structure (for-profit [FP], not-for-profit [NFP], osteopathic [OSTEO], public [PUB], teaching not-for-profit [TNFP], and teaching public [TPUB]) as reported in the 1988 American Hospital Association database. Logistic and linear regression methods were used to examine risk-adjusted 30-day and 6-month mortality and length of stay. RESULTS. During the 10-year study period, 10.6 million patients were admitted with 1 of the 10 selected medical conditions, and 6.3 million patients were hospitalized for 1 of the 10 selected surgical procedures. Patients at TNFP hospitals had significantly lower risk-adjusted 30-day mortality rates than patients at other hospital types when all diagnoses or procedures were combined (combined diagnoses: RRTNFP = 1.00 [reference], RRTPUB = 1.40, RROSTEO = 1.14, RRPUB = 1.07, RRFP = 1.03, RRNFP = 1.02; combined procedures: RRTNFP = 1.00 [reference], RROSTEO = 1.36, RRTPUB = 1.30, RRPUB = 1.16, RRFP = 1.13, RRNFP = 1.08). The results were mostly consistent when diagnoses and procedures were examined separately. After adjustment for patient characteristics, patients at other hospital types had 10% to 20% shorter lengths of stay (LOS) than patients at TNFP hospitals for most diagnoses and procedures studied. CONCLUSION. AS measured by the risk-adjusted 30-day mortality, TNFP hospitals had an overall better performance than other hospital types. However, patients at TNFP hospitals had relatively longer LOS than patients at other hospital types, perhaps reflecting the medical education and research activities found at teaching institutions. Future research should examine the empirical evidence to help elucidate the adequate LOS for a given condition or procedure while maintaining the quality of care.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "14fe2d21590f60abcd1f65106f7def14",
  "timestamp": "2025-05-15T03:17:49.194900"
}