{
  "id": 7981,
  "title": "Delay of transfer from the intensive care unit: a prospective observational analysis on economic effects of delayed in-house transfer",
  "abstract": "Background Intensive care unit (ICU) capacity is a scant and precious resource in hospitals. Therefore, an optimal occupancy rate as well as detailed occupation planning is of great importance. Most literature deals with admission to the ICU, while only few discuss discharge from the ICU. Specifically, a delay of transfer from the ICU can cause a shortness of beds, jeopardize urgent patient treatment and lead to a decrease in treatment quality as well as economic downsides. This study examined the incidence, costs and reasons for delayed discharge from the ICU and analyzed the influence of the department the patient was admitted to. Methods Over the course of 12 months, the discharges of all 1643 patients of two surgical intensive care units of a large academic medical center were analyzed. Delay in minutes and reasons were recorded and translated into financial figures. A univariate logistic regression model was developed to evaluate the impact of length of stay at the ICU, age, gender, subspecialty and specific ICU on the delay of transfer. In a next step, significant factors of the univariate logistic regression were incorporated into a multivariate regression model. Results In 326 out of 1312 patients ready for discharge (24.8%), the transfer to the floor was delayed. Time of delay for all patients added up to a total of 265,691 min in 1 year. The application of the internal cost allocation, in which 1 min corresponds to 0.75 Euro cents, led to costs of 199,268 Euros (similar to$240,000) for the study period. In 91.7% of the cases, the reason for the delay was the lack of an available or appropriate bed on the regular ward. Multivariate regression analysis revealed that the type of department the patient is admitted to poses a significantly influencing factor for delayed discharge from the ICU. Conclusion Delay in discharge from the ICU is a common problem of economic relevance. The main reason is a lack of appropriate floor beds. Patients from certain specific departments are at a higher risk to be discharged with delay. A solution to this problem lies in the focus on the downstream units. A proper use of the scarce resources is to be pursued because of ethical as well as economic reasons in an increasingly aging population.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "150757bd57eceaa3c25b00dadfea8e54",
  "timestamp": "2025-05-15T03:14:07.190425"
}