{
  "id": 644,
  "title": "STUDY OF THE CLASSIFICATION ACCURACY MEASURES FOR PREDICTING CORPORATE BANKRUPTCY TAKING INTO ACCOUNT CHANGES IN THE ECONOMIC ENVIRONMENT",
  "abstract": "Many types of methods for predicting corporate bankruptcy have been formulated by business theory and practice. Among them, an extensive group is composed of classification methods, which can divide companies into two groups: bankrupt and financially sound companies. The aim of the paper is to present the outcomes of the comparative analysis of classification accuracy for selected kinds of corporate bankruptcy prediction methods. While building the models, both the financial ratios of companies and the variables which reflect changes in the economic environment were taken into account. The analysis is based on data concerning companies operating in the industrial processing sector in Poland. The following four types of bankruptcy prediction methods were employed: linear discriminant analysis, logistic regression, classification tree and neural network. In order to assess the classification accuracy of a model for a training set and test set, three measures were used: sensitivity, specificity and overall accuracy. The results of the conducted empirical studies confirm the hypothesis that changes in the economic environment of companies affect their financial situation and risk of bankruptcy. The indicators of economic growth, the labour market, inflation and the economic situation were useful in bankruptcy prediction of companies operating in the industrial processing sector in Poland.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15221199889f7e6b45dc4e3085432c4b",
  "timestamp": "2025-05-15T01:53:24.880478"
}