{
  "id": 8011,
  "title": "Air Pollution Increases Risk of Occurrence of Intracerebral Haemorrhage but Not of Subarachnoid Haemorrhage: Time-Series Cross-Sectional Study",
  "abstract": "(1) Background: Haemorrhagic strokes (HS), including intracerebral (ICH) and subarachnoid haemorrhages (SAH), account for approximately 10-15% of strokes worldwide but are associated with worse functional outcomes and higher rates of mortality, and financial burden than ischemic stroke. There is evidence that confirmed poor air quality may increase the incidence of haemorrhagic strokes. The aim of our study was to evaluate the association between individual ambient air pollutants and the risk of haemorrhagic stroke in an urban environment without high levels of air pollution. (2) Methods: A time-series cross-sectional study design was used. A daily air pollution concentration (Agency of Regional Air Quality Monitoring in the Gdansk Metropolitan Area) and incidence of haemorrhagic strokes (National Health Fund) were obtained and covered the time period from 1 January 2014 to 31 December 2018. A generalised additive model with Poisson regression was used to estimate the associations between 24-h mean concentrations of SO2, NO, NO2, NOx, CO, PM10, PM2.5, and O3 and a daily number of haemorrhagic strokes. (3) Results: The single-day lag model results showed that NO2, NO and NOx exposure was associated with increased risk of ICH (88% events) with RR of 1.059 (95% CI: 1.015-1.105 for lag0), 1.033 (95% CI: 1.007-1.060 for lag0) and 1.031 (95% CI: 1.005-1.056 for lag0), but not for SAH (12% events). Exposure to CO was related to a substantial and statistically significant increase in incidence for 1.031 (95% CI: 1.002-1.061 for lag0) but not for SAH. Higher SO2, PM10, PM2.5, and O3 exposures were not significantly related to both ISC and SAH. (4) Conclusions: In this time-series cross-sectional study, we found strong evidence that supports the hypothesis that transient elevations in ambient NO2, NO and CO are associated with a higher relative risk of intracerebral but not subarachnoid haemorrhage.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1526d295c7c86ba203309ccf3c691299",
  "timestamp": "2025-05-15T03:14:07.343791"
}