{
  "id": 8865,
  "title": "Multilevel Correlates of Immunosuppressive Nonadherence in Kidney Transplant Patients: The Multicenter ADHERE BRAZIL Study",
  "abstract": "Background. Immunosuppressive nonadherence is a risk factor for worse outcomes after kidney transplantation (KT). Brazil, having the world's largest public, fully covered transplantation system and the second-highest KT volume worldwide, provides a unique setting for studying multilevel correlates of nonadherence (patient, healthcare provider, transplant center, and healthcare system levels) independent of patients' financial burden. Methods. By applying a multistage sampling approach, we included 1105 patients from 20 KT centers. Nonadherence to immunosuppressives (implementation phase) was defined as any deviation in taking or timing adherence and dose reduction assessed by the Basel Assessment of Adherence to Immunosuppressive Medications Scale. Based on Bronfenbrenner's ecological model, we assessed multilevel factors using established instruments and measures specifically developed for this study and analyzed their independent contribution to nonadherence by performing sequential logistic regression analysis. Results. The nonadherence prevalence rate was 39.7%. The following factors were independently associated with nonadherence: Patient level-having a stable partner (odds ratio [OR]: 0.75; confidence interval [CI]: 0.58-0.97), nonadherence to appointments (OR: 2.98; CI: 2.03-4.39), and nonadherence to physical activity recommendations (OR: 1.84; CI: 1.38-2.46); and transplant center level-satisfaction with the waiting room structure (OR: 0.54; CI: 0.42-0.71), consultation >30 minutes (OR: 1.60; CI: 1.19-2.14), adequacy of the consultation frequency (OR: 0.62; CI: 0.43-0.90), and centers with >500 beds (OR: 0.58; CI: 0.46-0.73). Conclusions. As the first multicenter study assessing multilevel correlates of nonadherence in KT, our findings point to the need for multilevel interventions beyond the patient level, targeting transplant center practice patterns as an approach to tackle nonadherence.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1528492c653872141ad7175b71f75e32",
  "timestamp": "2025-05-15T03:23:27.752394"
}