{
  "id": 6832,
  "title": "Barriers and Drivers of Public Preventive Behavioral Responses to COVID-19 Outbreak: Evidence from Iran",
  "abstract": "Background: When an epidemic outspreads, the society engagement seems essential to make sure of the population's preparedness for taking individual precautions. Objectives: The primary objective of this study was to examine public's preventive behavioral responses to protective behaviors during the COVID-19 pandemic to provide a description of conceptual frameworks for deeper understanding of these behaviors. Methods: A self-administrated questionnaire was used in this online survey through social networks during March 19th to 26th, 2020 (n = 2550). A Likert scoring scale was employed to investigate barriers and drivers affecting the participants' preventive behaviors. Using personal protective equipment and good hand hygiene practices were identified as person-based measures. Social distancing and the restriction of social and economic activities during the past two months were determined as community-based measures. Univariate logistic regression and multiple - logistic regression were used to identify and assess influencing factors. Results: The study results indicated that 2426 (95.1%) of the participants intended to restrict their social and economic activities, and 1968 (72.2%), 1637 (64.2%), and 2492 (97.7%) persons intended to observe social distancing, use personal protective equipment, and have good hand hygiene, respectively. The most important barriers for preventive behaviors were the lack of risk perception, economic and financial barriers, lack of access, and cultural barriers, respectively. The perceived benefit was among the most significant driver. Intention for person-based measures was less affected by demographic and economic characteristics in comparison with community-based measures. Conclusions: Considering the substantial impact of preventive behaviors on managing COVID-19 epidemic, this study findings have remarkable implications for governments to manage future communications as well as interventions during this ongoing outbreak and subsequent national risk events.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "153613d8a2bec47ad6e5319edb6cf341",
  "timestamp": "2025-05-15T03:02:07.468485"
}