{
  "id": 6823,
  "title": "Assessing the Performance of Vietnam's Banks in the Era of Free Trade Agreements",
  "abstract": "The performance of banks is a great barometer of the sustainability of the economy, particularly for emerging economies. In the expansion of its economy, over the last decade, Vietnam has entered a series of free trade agreements, such as the European Union-Vietnam Free Trade Agreement (EVFTA) in 2020. In that context, this study assesses the performance of Vietnam's banks in the period of 2020-2021 and explores the relationship between performance and various demographic and environmental variables. This study utilizes data envelopment analysis with two disposability concepts where desirable outputs (e.g., return on equity) are maximized while undesirable outputs (e.g., non-performing loan ratio) are minimized. Subsequently, Tobit and bootstrap truncated regression analyses are conducted for the testing of two hypotheses: (1) EVFTA's commitments, including the updating of the Fintech system, may be positively associated with bank's performance, and (2) Locations of banks, encumbered by heterogeneous levels of urban concentration and real estate development in different regions, may be associated with the banks' performance. The findings are twofold: (1) While EVFTA can contribute to Vietnamese banks' financial profit performance through foreign trading and hedging activities, it may harm banks' financial health performance due to Fintech-originated bad debts and a lack of relevant regulations; and (2) Banks in southern Vietnam outperform those in northern Vietnam in managing their credit risk by better controlling of bad debts, which result primarily from the volatility of the real estate market and from better positive externalities, in terms of economic, cultural, and political conditions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1537898c78cc5268e5e163fd28bd380c",
  "timestamp": "2025-05-15T03:02:07.440587"
}