{
  "id": 3288,
  "title": "Neural networks for estimating Macro Asset Pricing model in football clubs",
  "abstract": "The recent crisis caused by COVID-19 directly affected consumption habits and the stability sof financial markets. In particular, the football industry has been hit hard by this pandemic and therefore has more volatile stock prices. Given this new scenario, further research is needed to accurately estimate the value of the shares of football clubs. In this paper, we estimate an asset pricing model in football clubs with different compositions of risk nature using non-linear techniques of artificial neural networks. Usually, asset pricing models have been estimated with linear methods such as ordinary least squares. Our results show a precision higher than 90% for all the estimated models, which far exceeds those shown by linear methods in the previous literature. We find that the residual represents about 40% of the variance of the price-dividend ratio. Long-term risks follow in importance, and above all, the habit component and its behaviour in the face of changes. The importance of the residual component exists due to a low correlation between the asset price and consumer behaviour, but to a much lesser extent than that shown in previous studies. The estimation carried out with artificial neural networks, both the Deep Learning methods and especially the Quantum Neural Network, opens up new possibilities to estimate more efficiently the pricing of financial assets in the football industry.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1541a07612c8320db44f10a27139a295",
  "timestamp": "2025-05-15T02:24:39.685899"
}