{
  "id": 7870,
  "title": "Resources as a Protective Factor for Negative Outcomes of Frailty in Elderly People",
  "abstract": "Background: Although frailty is often conceptualized in terms of deficits, the level of frailty can be perceived as a complex interplay between deficits and resources. Objective: We studied whether resources such as educational level, financial situation, and living-alone status moderate the negative effects of deficits on two potentially adverse consequences of frailty: self-perceived health and receiving professional care. Methods: Logistic regression analysis was performed with data from a cross-sectional survey, designed by the public health service in the south of the Netherlands. The questionnaire was completed by a representative sample of people aged 70 and over (n = 5,559). Interaction effects between deficits (multimorbidity, difficulty performing ADLs, psychological distress, loneliness) and resources (educational level, financial situation, living-alone status) were studied in relation to self-perceived health and receiving professional care. Results: We found that in males the effect of difficulty in performing ADLs on self-perceived health was modified by educational level (p < 0.05, indicating that difficulty in performing ADLs is more strongly related to moderate/bad self-perceived health for those with higher education). In females, the effect of psychological distress on self-perceived health was modified by educational level (p < 0.05, indicating that suffering from psychological distress is more strongly related to moderate/bad self-perceived health for those with higher education) and the effect of difficulty in performing ADLs on receiving professional care was modified by living-alone status (p < 0.05, indicating that difficulty in performing ADLs was more strongly related to receiving professional care for those women who lived alone). Conclusions: Resources moderate the impact of personal deficits on self-perceived health and receiving professional care. Some frail people seem to be more vulnerable as they lack resources such as a high level of education. This should be taken into account in deciding when elderly people are at risk of negative outcomes of frailty and is therefore important for health professionals and policy-makers. Copyright (C) 2012 S. Karger AG, Basel",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "154c1cff1ce83a3ec746787bf227c6c2",
  "timestamp": "2025-05-15T03:13:04.875066"
}