{
  "id": 4247,
  "title": "Mandatory IFRS Adoption and the Usefulness of Accounting Information in Predicting Future Earnings and Cash Flows",
  "abstract": "SynopsisThe research problemWe investigated three questions: (1) Has the usefulness of accounting information in predicting future earnings and cash flows out-of-sample (OOS) changed after the mandatory IFRS adoption? (2) If there is a change in this type of usefulness, is it universal or conditional on institutional characteristics of the adopting countries, such as legal enforcement, securities regulation, and the differences between their domestic accounting standards (DAS) and IFRS? (3) If there is a change in this type of usefulness, does it have an economic significance in terms of improved investment performance?Motivation or theoretical reasoningThe IASB indicates in its conceptual framework that the objective of financial reporting is to provide information to help existing and potential stakeholders assess the amount, timing, and uncertainty of future net cash inflows to an entity. Therefore, examining whether IFRS achieve this objective using the OOS prediction tests needed in investment practice is critical in evaluating the benefit of the switch from DAS to IFRS. Equally important is to shed light on the debate, in an IFRS setting, about the usefulness of earnings and accruals relative to cash flows in future cash flow prediction.The test hypothesesWith respect to our first research question, we expected that mandatory IFRS adoption improves national accruals-based accounting systems and strengthens the reporting of cash flows. With respect to our second research question, we expected the level of improvement in the predictive ability of accounting information to vary with national institutions such as legal enforcement, securities regulation, and differences between DAS and IFRS. With respect to our third research question, we expected the enhanced predictive ability of accounting information to translate into improved economic significance of forecasts under IFRS.Target populationWe employed a sample of 1,197 firms from 12 European Union (EU) countries, Australia, and South Africa that mandatorily adopted IFRS in 2005.Adopted methodologyWe developed OOS earnings and cash flow forecasts and tested the statistical significance of the changes in OOS prediction performance using a bootstrapping approach. We also evaluated whether the change in the predictive ability of accounting information following IFRS adoption translated into improved economic significance in terms of portfolio investment performance based on the OOS forecasts.AnalysesOur analyses focused on comparisons of OOS prediction performance between the pre- and post-IFRS periods, while controlling for economy-wide conditions unrelated to IFRS adoption by constructing a constant matched benchmark sample using non-IFRS firms that have only used DAS. In addition, we analyzed the effect of IFRS adoption on OOS prediction performance conditional on national institutions in both univariate tests and multivariate regression analyses. Finally, we performed portfolio analyses based on the OOS forecasts to evaluate the economic significance of the effect of IFRS adoption.FindingsWe found that the earnings and cash flow forecast accuracy improved after adoption, and the effect persisted after controlling for firm characteristics and institutional characteristics. Total accruals generally remained (became) useful in the prediction of earnings (cash flows) after adoption regardless of national institutions. Earnings did (did not) better inform about future cash flows than cash flows alone under weak (strong) enforcement/regulation and high (low) DAS differences from IFRS. Stock portfolios based on the OOS forecasts generated higher hedge returns after adoption, with exceptions in low-legal-enforcement countries, corroborating the improved forecast accuracy. Overall, our findings suggest that mandatory IFRS adoption comes with an improved accruals-based accounting system and reporting of cash flows.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "154fc4fbaf911a75fd2d1e105c6b5c4c",
  "timestamp": "2025-05-15T01:25:23.223224"
}