{
  "id": 7294,
  "title": "From inequalities to vulnerability paradoxes: juxtaposing older adults' heat mortality risk and heat experiences",
  "abstract": "BackgroundIncreasing temperatures across the globe, including in Europe, pose one of the biggest threats to human health and wellbeing. Different kinds of inequalities, determined by age, sex/gender, isolation, socio-economic status, occupation, living in the city, and health situation, create vulnerability factors influencing people's heat-related mortality risk and their daily experiences during summer.MethodsOur study uses an interdisciplinary approach to research how intersecting inequalities generate vulnerabilities to heat stress among older adults (65+) in two European cities: Warsaw and Madrid. We combine three methodological approaches juxtaposing quantitative and qualitative data: (1) epidemiological analysis that uses daily mortality data in Warsaw and Madrid coupled with meteorological station temperature data from HadISD; (2) the OLS regression based on the survey conducted in Warsaw and Madrid in 2022; and (3) the focus group interviews conducted in Warsaw in 2021.ResultsOur data confirms that good health and financial situation protect people both from mortality risk and negative heat experiences. Interestingly, both air conditioning (A/C) usage and being physically active increase the negative heat experiences people reported. Finally, we identified two vulnerability paradoxes understood as situations when a person or a group might be more at risk but not experience or perceive negative impacts of heat. These paradoxes affect the oldest adults (80+) and older people living alone in both cities.ConclusionsStudies on vulnerability and adaptation need to incorporate both large scale top-down data sets and bottom-up, localized data based on individual experience. Combining various methods and disciplinary approaches enables identification of inequality factors and vulnerability paradoxes that remain unnoticed or underestimated while increasing people's vulnerability to heat stress.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "154f250f6664bc2978491500184d2f50",
  "timestamp": "2025-05-15T03:07:02.661931"
}