{
  "id": 4606,
  "title": "Association between family financial decline due to COVID-19 and generalized anxiety disorder among Korean adolescents",
  "abstract": "Background: COVID-19 has had a worldwide economic impact. A decline in family financial level can adversely affect adolescents' mental health. This study examined the association between perceived family financial decline due to COVID-19 and generalized anxiety disorder (GAD) among South Korean adolescents. Methods: Data from 54,948 middle and high school students from the 2020 Korea Youth Risk Behavior Survey were collected in this cross-sectional study. The effect of the perceived family financial decline due to COVID-19 related to GAD was analyzed using binary and multinomial logistic regression. Results: The relationship between perceived family financial decline due to COVID-19 and GAD was linear with increasing odds ratios and confidence intervals (the possibility of GAD, no financial decline: OR 1.00, mild: OR 1.11, CI 1.05-1.17, moderate: OR 1.30, CI 1.22-1.39, severe: OR 1.48, CI 1.34-1.63). Girls, low-income class, and living with family were vulnerable to GAD. GAD levels of mild, moderate, and severe were most likely to occur in each case of mild, moderate, and severe financial decline, respectively. Limitations: As this is a cross-sectional study, causality is unknown. Because this study data was self-reported by adolescents, they may have been overestimated or underestimated. Conclusion: GAD in adolescents is closely related to perceived decreased family finances due to COVID-19. The dose-response of GAD according to financial decline became gradually severe. Anxious adolescents were afraid of uncertain and adverse outcomes affecting them or their families. Therefore, there is a vital need to care for financially affected adolescents.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1552028a3e9ea542f46df8a8bf113d3c",
  "timestamp": "2025-05-15T02:38:56.439276"
}