{
  "id": 4144,
  "title": "The Impact of Timing and Prioritization on the Cost-Effectiveness of Birth Cohort Testing and Treatment for Hepatitis C Virus in the United States",
  "abstract": "Recent United States guidelines recommend one-time birth cohort testing for hepatitis C infection in persons born between 1945 and 1965; this represents a major public health policy undertaking. The purpose of this study was to assess the role of treatment timing and prioritization on predicted cost-effectiveness. The MONARCH hepatitis C lifetime simulation model was used in conjunction with a testing and treatment decision tree to estimate the cost-effectiveness of birth cohort versus risk-based testing incorporating information on age, fibrosis stage and treatment timing. The study used a 19451965 birth cohort and included disease progression, testing and treatment-related parameters. Scenario analysis was used to evaluate the impact of hepatitis C virus (HCV) prevalence, treatment eligibility, age, fibrosis stage and timing of treatment initiation on total costs, quality-adjusted life years (QALYs), HCV-related complications and cost-effectiveness. The cost-effectiveness of birth cohort versus risk-based testing was $28,602. Assuming 91% of the population is tested, at least 278,000 people need to be treated for birth cohort testing to maintain cost-effectiveness. Prioritizing treatment toward those with more advanced fibrosis is associated with a decrease in total cost of $7.5 billion and 59,035 fewer HCV-related complications. Total QALYs and complications avoided are maximized when treatment initiation occurs as soon as possible after testing. Conclusion: This study confirms that birth cohort testing is, on average, cost-effective. However, this remains true only when enough tested and HCV-positive subjects are treated to generate sufficient cost offsets and QALY gains. Given the practical and financial challenges associated with implementing birth cohort testing, the greatest return on investment is obtained when eligible patients are treated immediately and those with more advanced disease are prioritized.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15651fcdb35a5ec579dab3ce7c3d4d5b",
  "timestamp": "2025-05-15T02:33:42.077191"
}