{
  "id": 852,
  "title": "Decomposing socioeconomic inequality in blood pressure and blood glucose testing: evidence from four districts in Kerala, India",
  "abstract": "Background Non-Communicable Diseases (NCDs) constitute a significant danger to the nation's public health system, both in terms of morbidity and mortality, as well as the financial burden they inflict. Kerala is undergoing an epidemiologic transition, which has significantly impacted the state's morbidity and mortality figures. For decades, the state has been putting in place myriad programs to reduce the burden of NCDs across population groups. Socioeconomic inequalities in NCD testing have been documented in India, although they are understudied in Kerala. The study aimed to estimate and characterize districtwise socioeconomic inequality in Blood Pressure (BP) and Blood Glucose (BG) testing. Methods A cross-sectional household survey was conducted between July-October 2019 in Kasaragod, Alappuzha, Kollam and Thiruvananthapuram districts of Kerala, India. A total of 6383 participants aged 30 years and above were interviewed using multistage random sampling. Descriptive statistics were derived district-wise. We computed ratios, differences, equiplots, and Erreygers concentration indices for each district to measure socioeconomic inequality in BP and BG testing. Erreygers decomposition techniques were used to estimate the relative contribution of covariates to socioeconomic inequality. Results There was a significant concentration of BP and BG testing favouring wealthier quintiles in Alappuzha, Kollam, and Thiruvananthapuram districts. The inequality in BP and BG testing was highest in Thiruvananthapuram (0.087 and 0.110), followed by Kollam (0.077 and 0.090), Alappuzha (0.083 and 0.073) and Kasaragod (0.026 and 0.056). Decomposition analysis revealed that wealth quintile and education contributed substantially to socioeconomic inequality in BP and BG testing in all four districts. It was also found that family history of NCDs significantly contributed to observed socioeconomic inequality in BP testing (29, 11, 16, and 27% in Kasaragod, Alappuzha, Kollam, and Thiruvananthapuram, respectively). Similarly, in BG testing, family history of NCDs substantially contributed to observed socioeconomic inequality, explaining 16-17% in Kasaragod, Alappuzha, Kollam, and Thiruvananthapuram respectively of the total inequality. Conclusion While the magnitude of socioeconomic inequality in NCD risk factor testing did not appear to be very high in four Kerala districts, although levels were statistically significant in three of them. Greater exploration is needed on how education and caste contribute to these inequalities and their relationship to NCD risk factors such as family history. From such analyses, we may be able to identify entry points to mitigate inequalities in testing access, as well as burden.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15870e1adff79a455752b3190e41d4c3",
  "timestamp": "2025-05-15T01:43:20.674693"
}