{
  "id": 6218,
  "title": "Social Frailty Index: Development and validation of an index of social attributes predictive of mortality in older adults",
  "abstract": "While social characteristics are well-known predictors of mortality, prediction models rely almost exclusively on demographics, medical comorbidities, and function. Lacking an efficient way to summarize the prognostic impact of social factor, many studies exclude social factors altogether. Our objective was to develop and validate a summary measure of social risk and determine its ability to risk-stratify beyond traditional risk models. We examined participants in the Health and Retirement Study, a longitudinal, survey of US older adults. We developed the model from a comprehensive inventory of 183 social characteristics using least absolute shrinkage and selection operator, a penal-ized regression approach. Then, we assessed the predictive capacity of the model and its ability to improve on traditional prediction models. We studied 8,250 adults aged >= 65 y. Within 4 y of the baseline interview, 22% had died. Drawn from 183 possible predictors, the Social Frailty Index included age, gender, and eight social predictors: neighborhood cleanliness, perceived control over financial situation, meeting with children less than yearly, not working for pay, active with children, volunteering, feeling isolated, and being treated with less courtesy or respect. In the validation cohort, predicted and observed mortality were strongly correlated. Additionally, the Social Frailty Index meaningfully risk-stratified participants beyond the Charlson score (medical comorbidity index) and the Lee Index (comorbidity and function model). The Social Frailty Index includes age, gender, and eight social characteristics and accurately risk-stratifies older adults. The model improves upon commonly used risk prediction tools and has application in clinical, population health, and research settings.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "159b2fbb0398db92080db118ee017e28",
  "timestamp": "2025-05-15T02:56:10.570118"
}