{
  "id": 7805,
  "title": "Predicting survival and morbidity-free survival to very old age",
  "abstract": "As life expectancy continually increases, it is imperative to identify determinants of survival to the extreme end of the lifespan and more importantly to identify factors that increase the chance of survival free of major morbidities. As such, the current study assessed 45 common disease factors as predictors of survival and morbidity-free survival to age 85 years. Within the Rotterdam Study, a population-based cohort, we evaluated morbidity-free participants who were able to attain age 85 within the study duration (n = 2,008). Risk factors were assessed at baseline (1990-1993), and mortality and morbidities were then collected continuously until mortality or the occurrence of their 85th birthday (average time of 7.9 years). Risk factors included demographic and lifestyle variables, health and morbidity indicators and physiological makers. Major morbidities examined included dementia, cancer, cerebrovascular accident, heart failure and myocardial infarction. Logistic regression analyses demonstrated that many of the variables were independently predictive for survival and for morbidity-free ageing to 85 years. These included being female, absence of left ventricular abnormalities, stable body weight, unimpaired instrumental activities of daily living, lower C-RP levels and higher levels of femoral neck bone mineral density and albumin. Relative to non-survival, predictors were stronger for morbidity-free survival than for total survival or survival with morbidity. This suggests that lifespan and healthy survival to older age can be relatively well predicted. Understanding predictors of a long and healthy lifespan is vital for developing primary and secondary preventions to help improve the quality of life of older adults and for reducing the financial burden of the rapidly escalating ageing population.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15a2907ddb2d4480bf6ad5ede0e5789f",
  "timestamp": "2025-05-15T03:12:11.698202"
}