{
  "id": 6369,
  "title": "Association between Financial Barriers to Healthcare Access and Mental Health Outcomes in Tennessee",
  "abstract": "ObjectivesA large number of people cannot afford healthcare services in the United States. Researchers have studied the impact of lack of affordability of health care on the outcomes of various physical conditions. Mental health disorders have emerged as a major public health challenge during the past decade. The lack of affordability of health care also may contribute to the burden of mental health. This research focuses on the association between financial barriers to health care and mental health outcomes in the US state of Tennessee.MethodsWe used cross-sectional data contained in the 2019 US Behavioral Risk Factor Surveillance System (BRFSS). We extracted data for the state of Tennessee, which included 6242 adults aged 18 years or older. Multinomial regression analyses were conducted to test the association between not being able to see a doctor with the number of mentally unhealthy days during the past month. We coded the outcome as a three-level variable, >= 20 past-month mentally unhealthy days, 1 to 20 past-month mentally unhealthy days, and 0 past-month mentally unhealthy days. The covariates examined included self-reported alcohol use, self-reported marijuana use, and other demographic variables.ResultsOverall, 11.0% of participants reported >= 20 past-month mentally unhealthy days and 24.0% reported 1 to 20 past-month mentally unhealthy days. More than 13% of study participants reported they could not see a doctor because of the cost in the past 12 months. The inability to see a doctor because of the cost of care was associated with a higher risk of >= 20 past-month mentally unhealthy days (relative risk ratio 3.18; 95% confidence interval 2.57-3.92, P < 0.001) and 1 to 19 past-month mentally unhealthy days (relative risk ratio 1.94; 95% confidence interval 1.63-2.32, P < 0.001).ConclusionsStatistically significant associations were observed between the inability to see a doctor when needed because of cost and increased days of poorer mental health outcomes. This research has potential policy implications in the postcoronavirus disease 2019 era with healthcare transformation and significant financial impact.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15ac97bf911ca6db87ac44c3e63f6d3a",
  "timestamp": "2025-05-15T02:57:38.684183"
}