{
  "id": 9353,
  "title": "Association of Demographic and Early-Life Socioeconomic Factors by Birth Cohort With Dementia Incidence Among US Adults Born Between 1893 and 1949",
  "abstract": "Question Are dementia incidence trends by birth cohort associated with early-life environment? Findings In this cohort study of 4277 participants in the Adult Changes in Thought study who were born between 1893 and 1949 and were followed up for up to 20 years (1994-2015), the age- and sex-adjusted dementia incidence was lower among those born during the Great Depression (1929-1939) and the period during World War II and postwar (1940-1949) compared with those born in the period before the Great Depression (1921-1928). The association between birth cohort and dementia incidence remained when accounting for early-life socioeconomic environment, educational level, and late-life vascular risk factors. Meaning The study's findings indicate that dementia incidence is lower for individuals born after the mid-1920s compared with those born earlier, and this lower incidence is not associated with early-life environment as measured in this study. This cohort study examines the association of demographic characteristics and early-life sociodemographic factors by birth cohort with the incidence of dementia among US participants in the Adult Changes in Thought study who were born between 1893 and 1949 and followed up from 1994 to 2015. Importance Early-life factors may be important for later dementia risk. The association between a more advantaged early-life environment, as reflected through an individual's height and socioeconomic status indicators, and decreases in dementia incidence by birth cohort is unknown. Objectives To examine the association of birth cohort and early-life environment with dementia incidence among participants in the Adult Changes in Thought study from 1994 to 2015. Design, Setting, and Participants This prospective cohort study included 4277 participants from the Adult Changes in Thought study, an ongoing longitudinal population-based study of incident dementia in a random sample of adults 65 years and older who were born between 1893 and 1949 and are members of Kaiser Permanente Washington in the Seattle region. Participants in the present analysis were followed up from 1994 to 2015. At enrollment, all participants were dementia-free and completed a baseline evaluation. Subsequent study visits were held every 2 years until a diagnosis of dementia, death, or withdrawal from the study. Participants were categorized by birth period (defined by historically meaningful events) into 5 cohorts: pre-World War I (1893-1913), World War I and Spanish influenza (1914-1920), pre-Great Depression (1921-1928), Great Depression (1929-1939), and World War II and postwar (1940-1949). Participants' height, educational level, childhood financial stability, and childhood household density were examined as indicators of early-life environment, and later-life vascular risk factors for dementia were assessed. Cox proportional hazards regression models, adjusted for competing survival risk, were used to analyze data. Data were analyzed from June 1, 2018, to April 29, 2020. Main Outcomes and Measures Participants completed the Cognitive Abilities Screening Instrument every 2 years to assess global cognition. Those with scores indicative of cognitive impairment completed an evaluation for dementia, with dementia diagnoses determined during consensus conferences using criteria from the Diagnostic and Statistical Manual of Mental Disorders, 4th edition. Results Among 4277 participants, the mean (SD) age was 74.5 (6.4) years, and 2519 participants (58.9%) were women. The median follow-up was 8 years (interquartile range, 4-12 years), with 730 participants developing dementia over 24378 person-years. The age-specific dementia incidence was lower for those born in 1929 and later compared with those born earlier. Compared with participants born in the pre-Great Depression years (1921-1928), the age- and sex-adjusted hazard ratio was 0.67 (95% CI, 0.53-0.85) for those born in the Great Depression period (1929-1939) and 0.62 (95% CI, 0.29-1.31) for those born in the World War II and postwar period (1940-1949). Although indicators of a more advantaged early-life environment and higher educational level (college or higher) were associated with a lower incidence of dementia, these variables did not explain the association between birth cohort and dementia incidence, which remained when vascular risk factors were included and were similar by sex. Conclusions and Relevance Age-specific dementia incidence was lower in participants born after the mid-1920s compared with those born earlier. In this population, the decrease in dementia incidence may reflect societal-level changes or individual differences over the life course rather than early-life environment, as reflected through recalled childhood socioeconomic status and measured height, educational level, and later-life vascular risk.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15af84861a53568f731844589d24f8d1",
  "timestamp": "2025-05-15T03:27:53.403022"
}