{
  "id": 9445,
  "title": "Association of Tuberculosis With Household Catastrophic Expenditure in South India",
  "abstract": "Question What are the costs incurred by patients with tuberculosis (TB) throughout the treatment period in a resource-poor country such as India, where diagnostic testing and TB treatment are provided free of charge? Findings In this cross-sectional study of 455 individuals with TB, despite the implementation of free diagnostic and treatment services under a national TB control program, 31% of TB-affected households still experienced catastrophic costs. Meaning These findings underscore the importance of addressing the socioeconomic consequences of TB. This cross-sectional study examines the types of costs and the occurrence of catastrophic costs associated with the diagnosis and treatment of tuberculosis in India. Importance The high household costs associated with tuberculosis (TB) diagnosis and treatment can create barriers to access and adherence, highlighting the urgency of achieving the World Health Organization's End TB Strategy target that no TB-affected households should face catastrophic costs by 2020. Objective To estimate the occurrence of catastrophic costs associated with TB diagnosis and treatment and to identify socioeconomic indicators associated with catastrophic costs in a setting where TB control strategies have been implemented effectively. Design, Setting, and Participants In this cross-sectional study, 455 patients with TB in the Chennai metropolitan area of South India who were treated under the TB control program between February 2017 and March 2018 were interviewed. Patients were interviewed by trained field investigators at 3 time points: at the initiation of treatment, at the end of the intensive phase of treatment, and at the end of the continuation phase of treatment. A precoded interview schedule was used to collect information on demographic, socioeconomic, and clinical characteristics and direct medical, direct nonmedical, and indirect costs. Data analysis was performed from August 2018 to November 2019. Main Outcomes and Measures Direct, indirect, and total costs to patients with TB. Catastrophic costs associated with TB were defined as costs exceeding 20% of the household's annual income. A binary response model was used to determine the factors that were significantly associated with catastrophic costs. Results Of 455 patients with TB interviewed, 205 (53%) were aged 19 to 45 years (mean [SD] age, 38.4 [16.0] years), 128 (33%) were female, 72 (19%) were illiterate, 126 (33%) were employed, and 186 (48%) had a single earning member in the family (percentages are based on the 384 patients who were interviewed through the end of the continuation phase of treatment). Sixty-one percent of patients (234 patients) had pulmonary smear positive TB. The proportion of patients with catastrophic costs was 31%. Indirect costs contributed more toward catastrophic cost than did direct costs. Multivariate logistic regression analysis found that unemployment (adjusted odds ratio, 0.2; 95% CI, 0.1-0.5; P < .001) and higher annual household income (Rs 1-200& x202f;000, adjusted odds ratio, 0.4; 95% CI, 0.2-0.7; P = .004; Rs >200& x202f;000, adjusted odds ratio, 0.2; 95% CI, 0.1-0.5; P < .001) were associated with a decreased likelihood of experiencing catastrophic costs. Conclusions and Relevance Despite the implementation of free diagnostic and treatment services under a national TB control program, TB-affected households had a high risk of catastrophic costs and further impoverishment. There is an urgent demand to provide additional financial protection for patients with TB.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15b5d0aff5a00b44e75a6826f5a27075",
  "timestamp": "2025-05-15T03:28:46.354417"
}