{
  "id": 6925,
  "title": "The market timing skills of hedge funds during the financial crisis",
  "abstract": "Purpose -The purpose of this paper is to gain a better understanding of the market timing skills displayed by hedge fund managers during the 2007-08 financial crisis. Design/methodology/approach-The performance of a market timer can be measured through the 1966 Treynor and Mazuy model, provided the regression alpha is properly adjusted by using the cost of an option-based replicating portfolio, as shown by Hubner. The paper adapts this approach to the case of multi-factor models with positive, negative or neutral betas. This new approach is applied on a sample of hedge funds whose managers are likely to exhibit market timing skills. This concentrates on funds that post weekly returns, and analyzes three hedge funds strategies in particular: long-short equity, managed futures, and funds of hedge funds. The paper analyzes a particular period during which the managers of these funds are likely to magnify their presumed skills, namely around the financial and banking crisis of 2008. Findings-Some funds adopt a positive convexity as a response to the US market index, while others have a concave sensitivity to the returns of an emerging market index. Thus, the paper identifies positive, mixed and negative market timers. A number of signs indicate that only positive market timers manage to acquire options below their cost, and deliver economic significant performance, even in the midst of the financial crisis. Negative market timers, by contrast, behave as if they were forced to sell options without getting the associated premium. This behaviour is interpreted as a possible result of re sales, leading them to liquidate positions under the pressure of redemption orders, and inducing negative performance adjusted for market timing. Originality/value -The paper suggests that the convexity in returns that is generally associated with market timing can be attributed to three sources: timing skills, exposure to nonlinear risk factors, or liquidity pressures. It manages to identify the impact of the latter two effects in the context of hedge funds.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15e1c28b5c842eb583bc7381b435c718",
  "timestamp": "2025-05-15T03:03:13.427167"
}