{
  "id": 3748,
  "title": "Behavioral biases of cryptocurrency investors: a prospect theory model to explain cryptocurrency returns",
  "abstract": "PurposeThe study aims to test prospect theory (PT) predictions in the cryptocurrency (CC) market. It proposes a new asset pricing model that explores the potential of prospect theory value (PTV) as a significant predictor of CC returns.Design/methodology/approachThe study comprehensively analyses a large sample set of 1,629 CCs, representing more than 95% of the CC market. The study uses a portfolio analysis approach, employing univariate and bivariate sorting techniques with equal-weighted and value-weighted portfolios. The study also employs ordinary least squares (OLS) regression, panel data methods and quantile regression (QR) to estimate the models.FindingsThis study demonstrates an average inverse relationship between PTV and CC returns. However, this relationship exhibits asymmetry across different quantiles, indicating that investor reactions vary based on market conditions. Moreover, PTV provides more robust predictions for smaller CCs characterized by high volatility and illiquidity. Notably, the findings highlight the dominant role of the probability weighting (PW) component in PT for predicting CC behaviors, suggesting a preference for lottery-like characteristics among CC investors.Originality/valueThe study is one of the early studies on CC price dynamics from the PT perspective. The study is the first to apply a QR approach to analyze the cross-section of CCs using a PT-based asset pricing model. The results shed light on CC investors' decision-making processes and risk perception, offering valuable insights to regulators, policymakers and market participants. From a practical perspective, a trading strategy centered around the PTV effect can be implemented.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15ec488910a5bb701d5ddf41179875e0",
  "timestamp": "2025-05-15T01:20:35.951894"
}