{
  "id": 8700,
  "title": "The importance of adjusting for enterococcus species when assessing the burden of vancomycin resistance: a cohort study including over 1000 cases of enterococcal bloodstream infections",
  "abstract": "Background: Infections caused by vancomycin-resistant enterococci (VRE) are on the rise worldwide. Few studies have tried to estimate the mortality burden as well as the financial burden of those infections and found that VRE are associated with increased mortality and higher hospital costs. However, it is unclear whether these worse outcomes are attributable to vancomycin resistance only or whether the enterococcal species (Enterococcus faecium or Enterococcus faecalis) play an important role. We therefore aimed to determine the burden of enterococci infections attributable to vancomycin resistance and pathogen species (E. faecium and E. faecalis) in cases of bloodstream infection (BSI). Methods: We conducted a retrospective cohort study on patients with BSI caused by Enterococcus faecium or Enterococcus faecalis between 2008 and 2015 in three tertiary care hospitals. Data was collected on true hospital costs (in Euro), length of stay (LOS), basic demographic parameters, and underlying diseases including the results of the Charlson comorbidity index (CCI). We used univariate and multivariable regression analyses to compare risk factors for in-hospital mortality and length of stay (i) between vancomycin-susceptible E. faecium- (VSEm) and vancomycin-susceptible E. faecalis- (VSEf) cases and (ii) between vancomycin-susceptible E. faecium- (VSEm) and vancomycin-resistant E. faecium-cases (VREm). We calculated total hospital costs for VSEm, VSEf and VREm. Results: Overall, we identified 1160 consecutive cases of BSI caused by enterococci: 596 (51.4%) cases of E. faecium BSI and 564 (48.6%) cases of E. faecalis BSI. 103 cases of E. faecium BSI (17.3%) and 1 case of E. faecalis BSI (0.2%) were infected by vancomycin-resistant isolates. Multivariable analyses revealed (i) that in addition to different underlying diseases E. faecium was an independent risk factor for in-hospital mortality and prolonged hospital stay and (ii) that vancomycin-resistance did not further increase the risk for the described outcomes among E. faecium-isolates. However, the overall hospital costs were significantly higher in VREm-BSI cases as compared to VSEm- and VSEf-BSI cases (80,465 (sic) vs. 51,365 (sic) vs. 31,122 (sic) p<0.001). Conclusion: Our data indicates that in-hospital mortality and infection-attributed hospital stay in enterococci BSI might rather be influenced by Enterococcus species and underlying diseases than by vancomycin resistance. Therefore, future studies should consider adjusting for Enterococcus species in addition to vancomycin resistance in order to provide a conservative estimate for the burden of VRE infections.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15f37ed189967561989c0068fda89929",
  "timestamp": "2025-05-15T03:21:24.720039"
}