{
  "id": 6415,
  "title": "Comparative health systems analysis of differences in the catastrophic health expenditure associated with non-communicable vs communicable diseases among adults in six countries",
  "abstract": "The growing burden of non-communicable diseases (NCDs) in low- and middle-income countries may have implications for health system performance in the area of financial risk protection, as measured by catastrophic health expenditure (CHE). We compare NCD CHE to the CHE cases caused by communicable diseases (CDs) across health systems to examine whether: (1) disease burden and CHE are linked, (2) NCD CHE disproportionately affects wealthier households and (3) whether the drivers of NCD CHE differ from the drivers of CD CHE. We used the Study on Global Aging and Adult Health survey, which captured nationally representative samples of 44 089 adults in China, Ghana, India, Mexico, Russia and South Africa. Using two-part regression and random forests, we estimated out-of-pocket spending and CHE by disease area. We compare the NCD share of CHE to the NCD share of disability-adjusted life years (DALYs) or years of life lost to disability and death. We tested for differences between NCDs and CDs in the out-of-pocket costs per visit and the number of visits occurring before spending crosses the CHE threshold. NCD CHE increased with the NCD share of DALYs except in South Africa, where NCDs caused more than 50% of CHE cases but only 30% of DALYs. A larger share of households incurred CHE due to NCDs in the lowest than the highest wealth quintile. NCD CHE cases were more likely to be caused by five or more health care visits relative to communicable disease CHE cases in Ghana (P = 0.003), India (P = 0.004) and China (P = 0.093). Health system attributes play a key mediating factor in how disease burden translates into CHE by disease. Health systems must target the specific characteristics of CHE by disease area to bolster financial risk protection as the epidemiological transition proceeds.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15f47fadd5afe49ac899a71bad7987f9",
  "timestamp": "2025-05-15T02:58:05.576950"
}