{
  "id": 8492,
  "title": "ECONOMIC IMPACT OF A PERITONEAL DIALYSIS CONTINUOUS QUALITY IMPROVEMENT PROGRAM IN COLOMBIA",
  "abstract": "Background: There is little information regarding the financial burden of peritonitis and the economic impact of continuous quality improvement (CQI) programs in peritoneal dialysis (PD) patients. The objectives of this study were to measure the costs of peritonitis, and determine the net savings of a PD CQI program in Colombia. Methods: The Renal Therapy Services (RTS) network in Colombia, along with Coomeva EPS, provided healthcare resource utilization data for PD patients with and without peritonitis between January 2012 and December 2013. Propensity score matching and regression analysis were performed to estimate the incremental cost of peritonitis. Patient months at risk, episodes of peritonitis pre- and post-CQI, and costs of CQI were obtained. Annual net savings of the CQI program were estimated based on the number of peritonitis events prevented. Results: The incremental cost of a peritonitis episode was $250. In an 8-year period, peritonitis decreased from 1,837 episodes per 38,596 patient-months in 2006 to 841 episodes per 50,910 patient-months in 2014. Overall, the CQI program prevented an estimated 10,409 episodes of peritonitis. The cost of implementing the CQI program was $147,000 in the first year and $119,000 annually thereafter. Using a five percent discount rate, the net present value of the program was $1,346,431, with an average annual net savings of $207,027. The return on investment (i.e. total savings-program cost/program cost) of CQI was 169%. Conclusion: Continuous quality improvement initiatives designed to reduce rates of peritonitis have a strong potential to generate cost savings.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "15f50feea6e0271dcb0185449cf67f02",
  "timestamp": "2025-05-15T03:19:21.344115"
}