{
  "id": 3847,
  "title": "Green bonds and clean energy stocks: Safe havens against global uncertainties? A wavelet quantile-based examination",
  "abstract": "The renewable energy sector has seen rapid investment growth over the last decade, with Green Bonds (GB) and Clean Energy Stocks (CLE) emerging as critical components of sustainable finance. Using daily data from 2013 to 2023, this study investigates the diverse roles of GB and CLE as potential safe havens under Geopolitical Risks (GEO) and Economic Policy Uncertainty (ECU). Applying an advanced Wavelet Quantile Regression (WQR) approach, we assess their effectiveness across different time horizons and risk conditions. The findings reveal that GB consistently offer stronger protection against economic risks, particularly in the short to midterm, while CLE are more effective in shielding against geopolitical risks. Over longer periods, GB maintain their safe haven status, while CLE's protective capabilities diminish. The results also highlight that GB and CLE behave differently across quantiles, with GB showing stability across extreme market conditions, making it a more reliable hedge overall. This study offers valuable policy insights for key stakeholders. Policymakers are encouraged to integrate GB and CLE into sustainable finance strategies, investors can mitigate risk by blending these assets, and portfolio managers should adjust allocations dynamically based on evolving market conditions. The results underscore the importance of green assets as hedges in times of global uncertainty, contributing to the growing literature on sustainable finance.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1608117fee835f274d2548783e37c9e1",
  "timestamp": "2025-05-15T01:21:41.261228"
}