{
  "id": 4045,
  "title": "Insolvency: profile and behavior in Brazil",
  "abstract": "Purpose: To investigate the profile of scientific production and the behavior of the formation structures of social networks of academic research published on the subject of insolvency in the brazilian academic field from the perspective of scientific journals indexed in SPELL. Methodology: Bibliometric and sociometric investigation techniques were used in 95 identified articles. Results: Provision for growth of the insolvency theme. Contabilidade Vista & Revista, RAUSP Management Journal, Revista Contempor & acirc;nea de Contabilidade were the most prominent journals. Val & eacute;ria Gama Fully Bressan, Romualdo Douglas Colauto, Laura Edith Taboada Pinheiro and Adriano Rodrigues stood out as the most fruitful, relevant and tactical authors. UFMG, USP, UFPB, UFRJ and UnB were among the TOP 5 most prolific, important and strategic institutions. The most frequently seen words in the keywords were: insolvency, risk, forecast, model, analysis, accounting, credit, indicators, financial, financial, data, bankruptcy, company, capital and index. Regarding the social networks of the keywords, those that obtained the highest degree were: insolvency, insolvency prediction, financial institutions, insolvency risk, risk, forecast models, logistic regression, bankruptcy, panel data, credit unions, system pearls, bankruptcy forecast, profitability, credit risk, data mining, logit, database balancing, financial indicators, discriminant analysis, return, accounting indicators, default, selection of accounting variables, credit, profitability and working capital. With regard to the actors' networks, that is, researchers and their respective institutions, both had low density. Contributions of the Study: It concludes by manifesting the state of the art of the insolvency theme, making it emerge and contribute to the contemporaneity of the referenced subject, through bibliometric indicators, and, as well, the collaboration structures of the networks of actors who are responsible for creating knowledge, publish them, disseminate them and socialize them, focusing on the originality of the theme of insolvency, and its subsequent relevance for brazilian academic literature.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1608ba5450e67853fdeee1a75930b413",
  "timestamp": "2025-05-15T02:32:27.598694"
}