{
  "id": 9276,
  "title": "An Intelligent Market Capitalization Predictive System Using Deep Learning",
  "abstract": "Business forecast is a biggest factor which generally affects the economical condition of any Financial Industry. If the forecast model is not a better one then it can cause liquidation and spoil the trust of customers in the market. Early predictions based on social media clients' opinion plays a major role in order to reduce risk on business and keep the trust of customer. According to the survey done by Fintech's world topic analysis is treated as one of the vital factor used for the determination of client's trends and for forecast analysis. Here we have performed a comparative analysis upon the social media data provide by Twitter in order to get an idea about the perception and understanding of clients' requirements across the world. For the experimentation purpose we have used Tweeter data for tweet analysis, for stock price we have yahoo finance data and for number of stocks we have used morning star data set. For the processing of Tweets given by the clients we have built an automated system using Deep Learning. Here the problem is divided in to 2 parts. In first part Text classification is done using Tensorflow and Keras, Latent Dirichlet allocation (LDA), Natural Language Toolkit (NLTK-NLP).In this part using topic analysis the past tweet history is analyzed. In second part we are predicting forecastto identify multiple key business factors using Long Short term Memory (LSTM) using python/Rto. The actual aim of the system is to discover the effect of 3 fundamental parameters like security breaches, innovation, and stock exchange which are present in tweet given by the customers. Here the analysis is done on the last ten years tweets given by the clients for prediction of upcoming seven-day as well as monthly Market Cap. The actual intention of the work done here is to uncover the major diversity among two banks and bridge up the 3 gaps data breach, innovation and stock exchange in the available models. The latest information obtained in the system offers advantages to both Bank and customers to forecast Market value for the unbeaten estimation. We have obtained a prediction accuracy of 70.74% and 54.55% for monthly prediction and for weekly prediction we have obtained accuracy of 83.44% and 76.06% for Bank A and Bank B.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16137aaee4c4eabee4901594a7b62349",
  "timestamp": "2025-05-15T03:27:24.952725"
}