{
  "id": 125,
  "title": "Multi-perspective option price forecasting combining parametric and non-parametric pricing models with a new dynamic ensemble framework",
  "abstract": "This article introduces a dynamic ensemble framework that integrates parametric and non-parametric pricing models. Within this framework, we propose a time-varying parametric pricing model optimized using artificial intelligence algorithms. Additionally, we construct a non-parametric pricing model using a 2-dimensional convolutional neural network (2D-CNN) to capture the interactions among options, enhancing the existing nonparametric pricing model. Validation using China's SSE 50 ETF options trading data reveals several key findings: Firstly, the dynamic integration method proposed in this study not only improves prediction accuracy but also enhances stability. Secondly, previous parametric pricing models do not effectively utilize their pricing performance, while our proposed time-varying parametric pricing model significantly enhances accuracy. Lastly, the 2D-CNN model, which considers interactions among options trades, proves to be reasonable and effective, outperforming common non-parametric pricing models. The dynamic ensemble framework proposed in this study effectively combines the strengths of both parametric and non-parametric pricing models. This research serves as an important reference for risk managers, institutional investors, and other stakeholders. Furthermore, it provides valuable research ideas for future scholars in the field.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16362b3b1fa8aad5e96c005689978d2e",
  "timestamp": "2025-05-15T01:28:35.355771"
}