{
  "id": 7893,
  "title": "The 2008 financial crisis: Changes in social capital and its association with psychological wellbeing in the United Kingdom - A panel study",
  "abstract": "The global financial crisis of 2008 was described by the IMF as the worst recession since the Great Depression. This historic event provided the backdrop to this United Kingdom (UK) longitudinal study of changes in associations between social capital and psychological wellbeing. Past longitudinal studies have reported that the presence of social capital may buffer against adverse mental health outcomes. This study adds to existing literature by employing data from the British Household Panel Survey and tracking the same individuals (N = 11,743) pre- and immediately post-crisis (years 2007-09). With longitudinal, multilevel logistic regression modelling, we aimed to compare the buffering effects of individual-level social capital (generalised trust and social participation) against worse psychological wellbeing (GHQ-12) during and immediately after the 2008 financial crisis. After comparing the same individuals over time, results showed that stocks of social capital (generalised trust) were significantly depleted across the UK during the crisis, from 40% trusting others in 2007 to 32% in 2008. Despite this drop, the buffering effect of trust against worse psychological wellbeing was pronounced in 2008; those not trusting had an increased risk of worse psychological wellbeing in 2008 compared with the previous year in fully adjusted models (OR = 1.49, 95% CI (1.34-1.65). Levels of active participation increased across the timeframe of this study but were not associated with psychological health. From our empirical evidence, decision makers should be made aware of how events such as the crisis (and the measures taken to counter its effects) could negatively impact on a Nation's trust levels. Furthermore, past research implies that the positive effects of trust on psychological wellbeing evident in this study may only be short-term; therefore, decision makers should also prioritise policies that restore trust levels to improve the psychological wellbeing of the population. (C) 2016 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "164100a193a37716b1929594ad3fd753",
  "timestamp": "2025-05-15T03:13:04.945018"
}