{
  "id": 6295,
  "title": "Factors related to excessive out-of-pocket expenditures among the ultra-poor after discontinuity of PBF: a cross-sectional study in Burkina Faso",
  "abstract": "Background Measuring progress towards financial risk protection for the poorest is essential within the framework of Universal Health Coverage. The study assessed the level of out-of-pocket expenditure and factors associated with excessive out-of-pocket expenditure among the ultra-poor who had been targeted and exempted within the context of the performance-based financing intervention in Burkina Faso. Ultra-poor were selected based on a community-based approach and provided with an exemption card allowing them to access healthcare services free of charge. Methods We performed a descriptive analysis of the level of out-of-pocket expenditure on formal healthcare services using data from a cross-sectional study conducted in Diebougou district. Multivariate logistic regression was performed to investigate the factors related to excessive out-of-pocket expenditure among the ultra-poor. The analysis was restricted to individuals who reported formal health service utilisation for an illness-episode within the last six months. Excessive spending was defined as having expenditure greater than or equal to two times the median out-of-pocket expenditure. Results Exemption card ownership was reported by 83.64% of the respondents. With an average of FCFA 23051.62 (USD 39.18), the ultra-poor had to supplement a significant amount of out-of-pocket expenditure to receive formal healthcare services at public health facilities which were supposed to be free. The probability of incurring excessive out-of-pocket expenditure was negatively associated with being female (beta = - 2.072, p = 0.00, ME = - 0.324; p = 0.000) and having an exemption card (beta = - 1.787, p = 0.025; ME = - 0.279, p = 0.014). Conclusions User fee exemptions are associated with reduced out-of-pocket expenditure for the ultra-poor. Our results demonstrate the importance of free care and better implementation of existing exemption policies. The ultra-poor's elevated risk due to multi-morbidities and severity of illness need to be considered when allocating resources to better address existing inequalities and improve financial risk protection.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "164219d2dae7df17e0cd485fcdc8740a",
  "timestamp": "2025-05-15T02:56:37.503586"
}