{
  "id": 9207,
  "title": "Participation of Patients With Limited English Proficiency in Gynecologic Oncology Clinical Trials",
  "abstract": "Background: Significant disparities exist in recruitment of minorities to clinical trials, with much of the prior literature focused on race/ethnicity only. Limited English proficiency (LEP) is a known barrier in healthcare that may also drive disparities in trial enrollment. We sought to determine participation rates in gynecologic oncology trials among patients with LEP and to explore barriers to their participation. Methods: In a retrospective cohort study, electronic health record data from >2,700 patients treated over 2 years at one academic gynecologic oncology practice were abstracted and the primary exposure of having LEP was identified. The primary outcome was enrollment in a clinical trial. Demographic, financial, clinical, and healthcare access-related covariates were also abstracted and considered as potential confounders in a multivariable logistic regression model. Age, race, ethnicity, and insurance status were further examined for evidence of effect modification. In addition, a survey was administered to all gynecologic oncology research staff and gynecologic oncology providers (n=25) to assess barriers to research participation among patients with LEP. Results: Clinical trial enrollment was 7.5% among fluent English speakers and 2.2% among patients with LEP (risk ratio, 0.29; 95% CI, 0.11-0.78; P=.007), and remained significantly lower in patients with LEP after adjusting for the identified confounders of Hispanic ethnicity and insurance payer (odds ratio, 0.34; 95% CI, 0.12-0.97; P=.043). There was a trend toward race and LEP interaction: Asian patients were equally likely to participate in research regardless of language fluency, whereas White and Black patients with LEP were less likely to participate than non-LEP patients in both groups (P=.07). Providers reported that the most significant barriers to enrollment of patients with LEP in research were unavailability of translated consent forms and increased time needed to enroll patients. Conclusions: Patients with LEP were 3.4 times less likely to participate in gynecologic oncology trials than fluent English speakers. De-aggregation of race, ethnicity, and language proficiency yielded important information about enrollment disparities. These findings offer avenues for future interventions to correct disparities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1644752637900382d28dd4fdb02bfc10",
  "timestamp": "2025-05-15T03:26:26.050100"
}