{
  "id": 1731,
  "title": "The pricing of industry specialisation by auditors in New Zealand",
  "abstract": "A number of research papers present evidence of fee premiums paid to specialist auditors. In this paper, we explore for listed and unlisted New Zealand firms not only the question of whether such premiums exist, but perhaps more importantly why they exist. We find evidence of fee premiums for auditor specialisation defined at the city level but not at the national level. We extend testing to examine the issue of self-selection of auditors by clients; we examine several different industry classification schemes and a number of different specialisation measures; and we consider the issue of portfolio specialists. We find from these additional tests that self-selection does not account for the existence of specialisation premiums; various alternative classification schemes all result in premiums at the city level; and portfolio specialists also earn fee premiums when portfolio specialisation is measured at the city level. We find that these specialist premiums apply most consistently to larger client firms and to low-risk firms. We consider various explanations and conclude that this result is consistent with non-specialist auditors providing discounts to attract desirable clients. Desirable clients - those that are large or low risk - are not able to negotiate fees as successfully with auditors who have differentiated themselves via industry specialisation.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1647785bc3f9ec9def6a4db183a15629",
  "timestamp": "2025-05-15T00:58:50.719811"
}