{
  "id": 8374,
  "title": "Clinical and Economic Burden of Early Urinary Tract Infection in Kidney Transplant Recipients",
  "abstract": "Introduction: Urinary tract infections (UTIs) are the most prevalent bacterial infections among kidney transplant recipients, having implications for graft function, hospitalization and adds substantially to cost of posttransplant management. Materials and Methods: We retrospectively analyzed the electronic records of 600 kidney transplantation recipients that were performed at the Department of Nephrology of IQRAA Hospital and Research Centre, Calicut, between May 2016 and November 2022. The frequencies, characteristics, and cost analysis of bacterial UTI in the first 6-month posttransplantation were evaluated. Results: Of the 600 kidney transplant recipients, there were 159 episodes of culture-positive UTI in 117 patients. Multivariate regression analysis revealed that diabetic patients and female gender had 1.72 and 2.8 times, respectively, higher odds of developing UTI. Propensity-matched analysis showed that the graft outcomes at 6 and 12 months in patients with UTI were comparable among those without UTI. Direct and indirect cost analysis of each episode of UTI showed that the median direct cost incurred due to UTI alone was calculated as Rs. 21,814 (interquartile range [IQR]: 13,777-35,685) for hospitalized patients and Rs. 4355 (IQR: 1191-6056) for outpatients. The cost was significantly higher in hospitalized patients compared to outpatients (P = 0.001). There was a median increase of 17.4% and 3.4% among hospitalized and outpatients who suffered UTI posttransplant. Conclusion: Diabetes and female gender are independent risk factors for early posttransplant UTI. UTI adds a substantial financial burden to transplant care. The occurrence of UTI does not affect graft function at 6 and 12 months.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1649e95f5744172be3c5565d06ffae16",
  "timestamp": "2025-05-15T03:18:19.542992"
}