{
  "id": 6024,
  "title": "Understanding health risk perception: insights from an eight-country panel study during the COVID-19 pandemic",
  "abstract": "AimThe COVID-19 pandemic highlighted the importance of individuals' risk perceptions and their impact on behaviour. Adequate risk perceptions help individuals adopt necessary precautions.Subject and methodsWe conducted a longitudinal panel study analysing data across eight European countries from the European COVID Survey (ECOS). We used two generalised linear models with ordered logistic regression to analyse panel data comprising 82,052 observations from 11 waves of ECOS. Our aim was to investigate self-reported risk perception related to COVID-19 and its association with socioeconomic factors, health indicators, personal experiences with COVID-19 and trust in risk communication. We examined perceived susceptibility to SAR-CoV-2 infection and perceived risk to one's own health from COVID-19, interpreting these as dimensions of risk perception in accordance with the health belief model.ResultsWomen perceived higher susceptibility to SARS-CoV-2 infection than men. Regardless of gender, perceived susceptibility increased with age, peaking in the 35-44 age group before declining. In contrast, perceived risk to health consistently rose with age. Individuals who did not experience financial difficulties during the pandemic perceived lower health risk than those who did experience such difficulties. Moreover, individuals with higher education levels perceived greater susceptibility than those with lower levels. Other influencing factors included SARS-CoV-2 vaccination status, trust in information, attention to COVID-19 news and pandemic phase.ConclusionSeveral socio-economic factors were associated with risk perceptions. Unvaccinated individuals, people with lower education levels and individuals with less trust in institutional information were more likely to underestimate their susceptibility to SARS-CoV-2 infection and their health risk due to COVID-19.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1649706bc73f79424cdf11dd8454ae78",
  "timestamp": "2025-05-15T02:54:03.354885"
}