{
  "id": 1605,
  "title": "Random forest models reveal academic and financial factors outweigh demographics in predicting completion of a year-round veterinary program",
  "abstract": "OBJECTIVE The purpose of this study was to develop random forest classifier models (a type of supervised machine learning al- gorithm) that could (1) predict students who will or will not complete the DVM degree requirements and (2) identify the top predictors for academic success and completion of the DVM degree. METHODS The study utilized Ross University School of Veterinary Medicine student records from 2013 to 2022. Twenty-four variables encompassing demographic (eg, age, race), academic (eg, grade point average), and financial aid (eg, outstanding balances) data were assessed in 11 cross-validated random forest machine learning models. One model was built assessing all years of data and 10 individual models were developed for each enrollment year to compare how the top predictors of success varied among the years. RESULTS Consistently, only academic and financial factors were identified as being features of importance (predictors) in all models. Demographic factors such as race were not important for predicting student success. All models performed very well to excellently based on multiple performance metrics including accuracy, ranging from 96.1% to 99%, and the areas under the receiver operating characteristic curves, ranging from 98.1% to 99.9%. CONCLUSIONS The random forest algorithm is a powerful machine learning prediction model that performs well with veterinary student academic records and is customizable such that variables important to each veterinary school's student population can be assessed. CLINICAL RELEVANCE Identifying predictors of success as well as at-risk students is essential for providing targeted curricular interventions to increase retention and achieve timely completion of a DVM degree.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1660aba2fe599ba37abe0a3173a21644",
  "timestamp": "2025-05-15T02:05:08.276288"
}