{
  "id": 9181,
  "title": "Financial and Clinical Ramifications of Introducing a Novel Pediatric Enhanced Recovery After Surgery Pathway for Pediatric Complex Hip Reconstructive Surgery",
  "abstract": "Background: Enhanced recovery after surgery pathways confer significant perioperative benefits to patients and are currently well described for adult patients undergoing a variety of surgical procedures. Robust data to support enhanced recovery pathway use in children are relatively lacking in the medical literature, though clinical benefits are reported in targeted pediatric surgical populations. Surgery for complex hip pathology in the adolescent patient is painful, often requiring prolonged courses of opioid analgesia. Postoperative opioid-related side effects may lead to prolonged recovery periods and suboptimal postoperative physical function. Excessive opioid use in the perioperative period is also a major risk factor for the development of opioid misuse in adolescents. Perioperative opioid reduction strategies in this vulnerable population will help to mitigate this risk. METHODS: A total of 85 adolescents undergoing complex hip reconstructive surgery were enrolled into an enhanced recovery after surgery pathway (October 2015 to December 2018) and were compared with 110 patients undergoing similar procedures in previous years (March 2010 to September 2015). The primary outcome was total perioperative opioid consumption. Secondary outcomes included hospital length of stay, postoperative nausea, intraoperative blood loss, and other perioperative outcomes. Total cost of care and specific charge sectors were also assessed. Segmented regression was used to assess the effects of pathway implementation on outcomes, adjusting for potential confounders, including the preimplementation trend over time. RESULTS: Before pathway implementation, there was a significant downward trend over time in average perioperative opioid consumption (-0.10 mg total morphine equivalents/90 days; 95% confidence interval [CI], -0.20 to 0.00) and several secondary perioperative outcomes. However, there was no evidence that pathway implementation by itself significantly altered the prepathway trend in perioperative opioid consumption (ie, the preceding trend continued). For postanesthesia care unit time, the downward trend leveled off significantly (pre: -5.25 min/90 d; 95% CI, -6.13 to -4.36; post: 1.04 min/90 d; 95% CI, -0.47 to 2.56; Change: 6.29; 95% CI, 4.53-8.06). Clinical, laboratory, pharmacy, operating room, and total charges were significantly associated with pathway implementation. There was no evidence that pathway implementation significantly altered the prepathway trend in other secondary outcomes. CONCLUSIONS: The impacts of our pediatric enhanced recovery pathway for adolescents undergoing complex hip reconstruction are consistent with the ongoing improvement in perioperative metrics at our institution but are difficult to distinguish from the impacts of other initiatives and evolving practice patterns in a pragmatic setting. The ERAS pathway helped codify and organize this new pattern of care, promoting multidisciplinary evidence-based care patterns and sustaining positive preexisting trends in financial and clinical metrics.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1663d13a1b5dca85bd3bba788bff0dc4",
  "timestamp": "2025-05-15T03:26:25.964759"
}