{
  "id": 3980,
  "title": "Contributions of intellectual capital investment to the economic growth: Evidence from P. R. China, USA, UK, France and Germany",
  "abstract": "While the coming of the Knowledge Economy Age, intellectual capital is becoming to play more and more important roles in economy growth. This paper examines how important the intellectual capital investment is in economic growth in five different nations. We design a group of indicators to estimate the volume of intellectual capital investment of a nation, which include the expenditures in education, science and technology, R&D, culture, sanitation, communication and so on. We collect the data of intellectual capital investment, fixed capital investment and GDP of China, USA, UK, France, and Germany in last 15 years. By correlation analysis, ADF test, cointegration test, Granger causality analysis, and regression analysis to intellectual capital investment, fixed capital investment and economic growth, the results show: (1) distinct positive correlation exists between intellectual capital investment, fixed capital investment and economic growth; (2) the contributions of intellectual capital investment to the economic growth are different in different nations. Intellectual capital investment becomes the most important power in the economy growth in most developed countries. But in China the main factor to drive the economic growth is still the fixed capital investment. This implies that the investment portfolio of intellectual and fixed capitals in China should be properly arranged in the future so as to keep the high speed of economic growth.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16735c02127275191f2c50d211e0b211",
  "timestamp": "2025-05-15T01:22:39.421499"
}