{
  "id": 9464,
  "title": "Environmental protection and biosecurity program at the National Institute of Psychiatry Ramon de la Fuente",
  "abstract": "Since the beginning, mankind has been subjected to various natural disasters such as floods, hurricanes, earthquakes, droughts and wildfires. Therefore, societies have to organize themselves in order to cope with nature, provide support to each other and to protect the most vulnerable individuals and their properties. Depending on their social organization, some countries have developed their response strategies in the field of civil protection faster than others. After September 19(th), 1985, when an earthquake of Richter magnitude of 8.1 affected Mexico City, the Mexican government decided to establish the guidelines of the National Civil Protection System (SINAPROC). After a few years, the Environmental Protection and Ecological Equilibrium Low was published. This environmental protection regulation is specific and is directed to minimize the negative impact over the environment that could be generated through industrial activities, as well as from research centers, hospitals, and others institutions. To ensure full compliance with the Mexican regulations, in 1998 the Instituto Nacional de Psiquiatria Roman de la Fuente (INPRF) initiated the Environmental and Civil Protection Program (ECPP). The aim of this program is to meet the legal and operational requirements applicable to an institution which has biomedical research, administration and hospitalization areas. In addition, the ECPP is in charge of giving workers training and generating specific strategies for environmental management in all activities that take place at the Institute. By establishing compliance guidelines to meet the government regulations on environmental and civil protection, the INPRF would develop strategies for minimizing risks, as well as staff training to enhance the use of institutional resources and reduce the response time to deal with emergencies. Objective Since its foundation, the environmental and civil protection program at the INPRF has had two basic objectives: 1. to attend the legal and operative requirements in a third level institution conformed by hospitalization, teaching, research and administrative areas, and 2. to offer continuous training to the internal population of a hospital in order to minimize work risks, to make an optimum use of the institutional resources and to reduce the response time of the workers in emergency situations. To develop and implement such an environmental and civil protection program, the following areas have been considered: Biohazardous wastes, saving electricity, use and optimization of drinking water, control of air emissions from stationary combustion equipment, radiation safety and emergency response procedures. The purpose of this work is to show the results achieved by ECPP after nine years since its inception. Results Biohazardous wastes (BW), by definition, are those materials generated during medical care which contain biological agents that may cause adverse effects to hut-non health and the environment. BW are generated frequently in biomedical research areas, clinical laboratories and hospitals. In order to minimize risks and prevent accidents, INPRF implemented since 1997 an operating procedure for handling biohazardous wastes in all generating areas. Some of those strategies are directed to training medical personnel (physicians, nurses and clinical laboratory technicians) about the identification and classification of biohazardous wastes. Moreover, we have designed and distributed different kinds of written ads in order to help people to recognize and separate wastes correctly. Besides the latter actions, the INPRF hired a registered and certificated company which provides the proper recollection, treatment and final disposal of biological wastes, according to current legal ordinances. As a result of those strategies in the handling of biohazardous wastes in the Institution, the amount of wastes and their disposal costs have gradually decreased. Through staff training, personnel have learned to do a proper segregation of wastes, reducing the quantities of BW and therefore reducing risks. Energy saving. As a way to optimize the institutional resources, as well as reducing costs and creating awareness among the people, the INPRF's Energy Saving program was implemented in 2003. Since 2003, when ECPP began implementing the saving strategies, accumulated energy consumption per year had a 9.6% reduction between 2004 and 2005. Use of potable water. In the search for strategies to optimize the use of potable water that is received through the municipal network, in 2003 the INPRF-ECPP implemented measures aimed not only at reducing the per capita consumption of potable water but also to give it a proper use on the institution areas. As a result of these saving measures, there was a gradual decrease in the use of drinking water. So, from the 170 liters/person-day used in 2003, during 2006 only 98 liters/person-day were used. Radiological safety. Due to the adverse effects to human health that could result from exposure to radioactive materials, an institution that uses this kind of material in its basic biomedical research area must implement the necessary actions to minimize the risk of contamination for users and work areas. For that reason, the INPRF began the Radiological Safety Program, which had as its main objectives to minimize the risks and to prevent accidents involving radioactive materials based on regulation compliance. As a result of these strategies, the maximum value of the total dose accumulated per year of ionizing radiation received by 1 personnel exposed who has carried out research in this institution in recent years has been of 3.14 mSv. Therefore, it had not exceeded the annual limit dose of ionizing radiation allowed for the total body by the Comision Nocional de Seguridad Nuclear y Salvaquardas (CNSNS) of 50 mSv = 5rem. To date, there has been no accidents or contamination with radioactive materials or wastes in the INPRF. Emergency simulations. Considering the need of being prepared for emergencies and to comply with the regulation that establishes the compulsory conducting simulations in INPRF, the Internal Committee for Civil Protection (ICPC) conducts periodic training of employees on risk prevention, through courses and simulations of situations of earthquake, attempt of fire, handling of hazardous substances spills and first aid. As a result of the earthquake simulations that have been carried out at the INPRF, the time of evacuation of workers, hospitalized patients and floating population from buildings has gradually reduced. An additional advantage of conducting emergency simulations has been the early defection of systematic security features that need to be repaired or installed. Emissions to air. In recent years, increasingly strict regulation and monitoring of gaseous emissions generated by stationary and mobile sources in Mexico City has been established. In order to comply with the current regulations, it became necessary to develop a program of annual preventive and corrective maintenance of combustion equipment that is used to provide hot water, and to make periodic analysis of gaseous emissions. Among the parameters that have to be reported are: temperature of combustion gases, monoxide and dioxide carbon content, sulfur dioxide, nitrogen dioxide percentages and generated soot. As a result of this program, the need of equipment that operates with cleaner technology was identified. Therefore, this change favored compliance with the maximum permissible limits for emissions of gaseous pollutants, besides a reduction of costs. Discussion In terms of environmental protection, it was found that through compliance with government regulations on environmental and civil protection, development of strategies for preventing risks, and staff training, it is possible to reduce the amounts of waste and pollution being released into the environment. Also that emphasizing awareness on the use of resources such as electricity and potable water results in a progressive responsible management and optimization by users. Finally, it was found that the investment of financial resources to implement and monitor a system of environmental and civil protection and training staff results directly in the protection of property and the environment, minimizing risks and preventing accidents.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1674a3f016547ae4d281c0d70bc63ae4",
  "timestamp": "2025-05-15T03:29:10.363675"
}