{
  "id": 4103,
  "title": "Innovation capabilities in food and beverages and technology-based innovation projects",
  "abstract": "Purpose - The aim of this paper is to establish the differences between the food and beverages (F&B) and technology-based industries with regards to the relation between previously identified success factors and innovation project performance. Design/methodology/approach - These differences are established on the basis of logistic regression analysis, using 38 innovation projects (18 F&B and 20 technology-based). Findings - Newness of the innovation project to the company, communication capabilities and market potential have a more negative impact on innovation project performance in the F&B than the tech-based industry. Especially functional upstream capabilities increase the likelihood of success in F&B, when compared to tech-based innovation projects. Practical implications - While functional upstream capabilities are important for success of F&B innovation projects, there is still room for improvement in order to deal effectively with newness of the innovation project to the company. Internalization of resources from the network and a balanced radical/incremental innovation project portfolio contribute to additional enhancement of functional capabilities of the F&B companies, improving their capacity to deal with newness. Through a larger focus on co-innovation with retail, F&B companies can improve their intra- and inter-firm communication capabilities to attain more consumer-oriented integration of R&D and marketing activities, improving the market potential of their innovations. Originality/value - This paper demonstrates that the previously identified critical success factors for innovation projects differ in impact and importance for F&B innovation project performance when compared to innovation projects in the technology-based industry.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1679b3c207e1129fce25b39663c2eec9",
  "timestamp": "2025-05-15T01:23:58.034718"
}