{
  "id": 7899,
  "title": "Perioperative Blood Transfusions Are Associated with a Higher Incidence of Thromboembolic Events After TKA: An Analysis of 333,463 TKAs",
  "abstract": "Background Given the morbidity, mortality, and financial burden associated with venous thromboembolism (VTE) after TKA, orthopaedic providers continually seek to identify risk factors associated with this devastating complication. The association between perioperative transfusion status and VTE risk has not been thoroughly explored, with previous studies evaluating this relationship being limited in both generalizability and power. Questions/purposes Therefore, we sought to determine whether perioperative transfusions were associated with an increased risk of (1) pulmonary embolism (PE) or (2) deep vein thrombosis (DVT) after primary TKA in a large, multi-institutional sample. Methods The American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) database was implemented for our analysis. The definitions of complications, such as DVT and PE, and risk adjustment validation is monitored by the central ACS NSQIP office to ensure participating hospitals are adhering to the same guidelines to log patients. Additionally, both preoperative and intraoperative/72 hour postoperative transfusion status is included for all patients. Therefore, ACS NSQIP was determined to be the most appropriate database for our analysis. All patients who underwent primary TKA between 2011 and 2018 were identified using Current Procedural Terminology code 27447. Primary TKAs designated as non-elective were excluded, thereby providing a cohort composed solely of patients undergoing unilateral primary elective TKA for further analysis. The final analysis included 333,463 patients undergoing TKA (mean age 67 +/- 9 years, 62% female). Preoperative transfusions were received by < 0.01% (48 of 333,463) of the patients, while 4% (14,590 of 333,463) received a transfusion within the interim between the start of surgery up to 72 hours postoperatively. All missing values were imputed through multiple imputation by chained equation to avoid variable availability-based selection and the subsequent listwise deletion-associated bias in the estimate of parameters. A multivariable logistic regression analysis was conducted using variables identified in a univariate model to calculate adjusted odds ratios and 95% confidence intervals for risk factors associated with symptomatic DVT and/or PE. For variables that maintained significance in the multivariable model, an additional model without confounders was used to generate fully adjusted ORs and 95% CIs. A propensity score matched comparison between recipients versus nonrecipients (1:1) of transfusion (preoperative and intraoperative/72 hours postoperative) was then conducted to evaluate the independent association between DVT/PE development and patients' transfusion status. Significance was determined at a p value < 0.05. Results Adjusted multivariable regression analysis accounting for patient age, sex, race, BMI, American Society of Anesthesiologists (ASA) class and baseline comorbidities demonstrated the absence of an association between preoperative (OR 1.75 [95% CI 0.24 to 12.7]; p = 0.58) or intraoperative/72 hours postoperative (OR 1.12 [95% CI 0.93 to 1.35]; p = 0.23) transfusions and higher odds of developing PE. Similar findings were demonstrated after propensity score matching. Although multivariable regression demonstrated the absence of an association between preoperative transfusion and the odds of developing DVT within the 30-day postoperative period (OR 1.85 [95% CI 0.43 to 8.05]; p = 0. 41), intraoperative/postoperative transfusion was associated with higher odds of DVT development (OR 3.68 [95% CI 1.14 to 1. 53]; p < 0.001) relative to transfusion naive patients. However, this significance was lost after propensity score matching. Conclusion After controlling for various potential confounding variables such as ASA Class, age, anesthesia type, and BMI, the receipt of an intra- or postoperative transfusion was found to be associated with an increased risk of DVT. Our findings should encourage orthopaedic providers to strictly adhere to blood management protocols, further tighten transfusion eligibility, and adjust surgical approach and implant type to reduce the incidence of transfusion among patients with other DVT risk factors. Additionally, our findings should encourage a multidisciplinary approach to VTE prophylaxis and prevention, as well as to blood transfusion guideline adherence, among all providers of the care team.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "167f4bcdd1d5efe2750a5ec9ad65d65e",
  "timestamp": "2025-05-15T03:13:04.958594"
}