{
  "id": 8735,
  "title": "Property investor decisions using income and rental ratio signals",
  "abstract": "Purpose This paper, a case study, aims to consider whether the income ratio and rental ratio tracks the formation of residential housing price spikes and their collapse. The ratios are measuring the risk associated with house price stability. They may signal whether a real estate investor should consider purchasing real property, continue holding it or consider selling it. The Federal Reserve Bank of Dallas (Dallas Fed) calculates and publishes income ratios for Organization for Economic Cooperation and Development countries to measure irrational exuberance, which is a measure of housing price risk for a given country's housing market. The USA is a member of the organization. The income ratio idea is being repurposed to act as a buy/sell signal for real estate investors. Design/methodology/approach The income ratio calculated by the Dallas Fed and this case study's ratio were date-stamped and graphed to determine whether the 2006-2008 housing bubble and burst could be visually detected. An ordinary least squares regression with the data transformed into logs and a regression with structural data breaks for the years 1990 through 2019 were modeled using the independent variables income ratio, rent ratio and the University of Michigan Consumer Sentiment Index. The descriptive statistics show a gradual increase in the ratios prior to exposure to an unexpected, exogenous financial shock, which took several months to grow and collapse. The regression analysis with breaks indicates that the income ratio can predict changes in housing prices using a lead of 2 months. Findings The gradual increases in the ratios with predetermine limits set by the real estate investor may trigger a sell decision when a specified rate is reached for the ratios even when housing prices are still rising. The independent variables were significant, but the rent ratio had the correct sign only with the regression with time breaks model was used. The housing spike using the Dallas Fed's income ratio and this study's income ratio indicated that the housing boom and collapse occurred rapidly. The boom does not appear to be a continuous housing price increase followed by a sudden price drop when ratio analysis is used. The income ratio is significant through time, but the rental ratio and Consumer Sentiment Index are insignificant for multiple-time breaks. Research limitations/implications Investors should consider the relative prices of residential housing in a neighborhood when purchasing a property coupled with income and rental ratio trends that are taking place in the local market. High relative income ratios may signal that when an unexpected adverse event occurs the housing market may enter a state of crisis. The relative housing prices to income ratio indicates there is rising housing price stability risk. Aggregate data for the country are used, whereas real estate prices are also significantly impacted by local conditions. Practical implications Ratio trends might enable real estate investors and homeowners to determine when to sell real estate investments prior to a price collapse and preserve wealth, which would otherwise result in the loss of equity. Higher exuberance ratios should result in an increase in the discount rate, which results in lower valuations as measured by the formula net operating income dividend by the discount rate. It can also signal when to start reinvesting in real estate, because real estate prices are rising, and the ratios are relative low compared to income. Social implications The graphical descriptive depictions seem to suggest that government intervention into the housing market while a spike is forming may not be possible due to the speed with which a spike forms and collapses. Expected income declines would cause the income ratios to change and signal that housing prices will start declining. Both the income and rental ratios in the US housing market have continued to increase since 2008. Originality/value A consumer sentiment variable was added to the analysis. Prior researchers have suggested adding a consumer sentiment explanatory variable to the model. The results generated for this variable were counterintuitive. The Federal Housing Finance Agency (FHFA) price index results signaled a change during a different year than when the S&P/Case-Shiller Home Price Index is used. Many prior studies used the FHFA price index. They emphasized regulatory issues associated with changing exuberance ratio levels. This case study applies these ideas to measure relative increases in risk, which should impact the discount rate used to estimate the intrinsic value of a residential property.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16824753431b5cbf0263ac091cf496d7",
  "timestamp": "2025-05-15T03:21:56.617007"
}