{
  "id": 5154,
  "title": "Analysing the Determinants of Insolvency and Developing the Rating System for Russian Insurance Companies",
  "abstract": "In this study, we analyzed the determinants of insolvency for Russian insurance companies (ICs). The relevance of the paper is underpinned by strong interest of investors to emerging insurance industry due to their strong growth, which, in turn, comes with elevated risk. Thus, identification of key drivers of ICs insolvency risk becomes the critical task. Literature review indicated that there are only a few studies at this topic. Logistic regression was chosen as the modeling method. The dataset included 161 Russian ICs over the period 2013-2019. The key financial drivers of credit risks of Russian ICs were profitability, liquidity of assets and premium collection discipline. Among non-financial factors efficiency of strategic management, management of sales channels and credit quality of reinsurers were significant. Macroeconomic variables such as insurance penetration and inflation are also important drivers of ICs creditworthiness. The model had good predictive and discriminative power (accuracy ratio of 0.9 and KS statistics of 0.6). We also compared these drivers with those in advanced markets and analyzed similarities and differences. Lastly, we developed the rating system consisting of 17 rating grades and estimated probability of default for each grade. Results of statistical tests confirmed the correctness of calibration of the rating system, stability of the population and good distribution of observations within the rating scale. The results of the study can be utilized by researchers exploring ICs risks in other emerging markets. The rating system can be used by financial institutions, rating agencies or regulators to assess and monitor of credit quality of ICs in Russia. (C) 2021 The Authors. Published by Elsevier B. V.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "168bd4943c7243d29e3c33bf21976947",
  "timestamp": "2025-05-15T02:44:43.981886"
}