{
  "id": 377,
  "title": "Primal-dual linear Monte Carlo algorithm for multiple stoppingan application to flexible caps",
  "abstract": "In this paper we consider the valuation of Bermudan callable derivatives with multiple exercise rights. We present in this context a new primal-dual linear Monte Carlo algorithm that allows for efficient simulation of the lower and upper price bounds without using nested simulations (hence the terminology). The algorithm is essentially an extension of the primal-dual Monte Carlo algorithm for standard Bermudan options proposed by Schoenmakers et al. [SIAM J. Finance Math., 2013, 4, 86-116] to the case of multiple exercise rights. In particular, the algorithm constructs upwardly a system of dual martingales to be plugged into the dual representation of Schoenmakers. At each level, the respective martingale is constructed via a backward regression procedure starting at the last exercise date. The thus constructed martingales are finally used to compute an upper price bound. The algorithm also provides approximate continuation functions that may be used to construct a price lower bound. The algorithm is applied to the pricing of flexible caps in a Hull and White model setup. The simple model choice allows for comparison of the computed price bounds with the exact price obtained by means of a trinomial tree implementation. As a result, we obtain tight price bounds for the considered application. Moreover, the algorithm is generically designed for multi-dimensional problems and is tractable to implement.",
  "year": 2013,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16a9076389b71fdb30fcf5f7a557c3e0",
  "timestamp": "2025-05-15T01:31:13.190418"
}