{
  "id": 4349,
  "title": "Free-standing companies in the oil sector in Romania and Poland before 1948: Typologies and competencies",
  "abstract": "The concept of the 'free-standing' company was first introduced by Wilkins to define a company set up in one country for the purpose of doing business outside that country.(1) Such companies had only tiny headquarters in their country of origin and developed all their activities abroad, usually in one country of destination. Early researchers such as Stopford considered that such firms represented portfolio investment, but the existence of corporate control from their headquarters in the home country led to their subsequent classification as foreign direct investment (FDI).(2) This article presents new findings on free-standing firms, which extends the current debates and opens up new avenues for research. Wilkins' initial research on free-standing companies concentrated on the history of British-headquartered firms and concluded that free-standing companies represented 'the typical form of British FDI before 1914'.(3) These firms, however, emerged as not only British, but with origins in other European countries as well. Research on such non-British free-standing firms remains limited. This article attempts to bridge this gap by discussing two case studies of different nationalities: the British Phoenix Oil & Transport Co. (PO&T) and the French Credit General des Petroles (CGP), thereby facilitating inter-country understanding. By way of background, free-standing companies were widely used before 1914 and were particularly dominant in the exploitation of natural resources such as oil and mining, agriculture and public utilities.(4) According to the dominant theme of the literature, the period prior to 1914 was the heyday for free-standing firms, while they lost importance after the First World War. Their 'disappearance' is often attributed to a change in industrial composition: over time new sectors evolved, demanding different organisational arrangements.(5) Here again the present research shows that the inter-war oil sector of two of the east-central European countries, Romania and Poland, witnessed a large number of free-standing companies of British, French and Dutch origin. Both PO&T and CGP were established in 1920 to acquire existing oil free-standing companies affected by the First World War and to evolve into vertically integrated multinationals. Far from disappearing from the market, these companies became important participants on the inter-war east-central European oil market.(6) This evolution is consistent with the general trend described by other business historians, according to whom some of the largest oil companies only achieved full vertical integration in the late nineteenth century and early decades of the twentieth century.(7) British Petroleum and Royal Dutch, for example, started as groups of free-standing companies and grew over time into some of the largest integrated oil multinationals.(8) This article focuses on similar developments involving oil free-standing companies that operated in inter-war east-central Europe. Using two case studies, the article explores key issues surrounding the causes, strengths and typologies of free-standing firms. It compares and contrasts their experiences and tries to determine to what extent such free-standing 'institutional channels for available capital' were viable and successful.(9) The article shows that, in the long run, PO&T and CGP met with varying degrees of success. The history of PO&T illustrates a case of continuity, Longevity and endurance which challenges the more critical literature on free-standing companies. On the contrary, CGP faced financial problems in the 1930s and struggled to pay back its debts. The article also asks how PO&T, supposedly a 'lean governance' structure, managed to survive external shocks and recession and gain 'an eminent position among the leading producers, refiners and marketers of the world'.(10) In addition, the article addresses further questions regarding the evolution of PO&T and CGP as business organisations, the transformation of their ownership, financial and managerial structures that appeared to promote stability and thus contradict the 'high drop-out rate' suggested by earlier research.",
  "year": 2000,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16acf2123adcc491ef65ade36283e9a3",
  "timestamp": "2025-05-15T01:26:26.209898"
}