{
  "id": 3861,
  "title": "Evaluating the Policy Implications of Renewable Portfolio Standards on Grid Reliability in the United States: An Instrumental Variable Quantile Analysis",
  "abstract": "This paper investigates the influence of Renewable Portfolio Standards (RPSs) on the reliability of grids while considering key indicators, including the System Average Interruption Duration Index (SAIDI), System Average Interruption Frequency Index (SAIFI), and Customer Average Interruption Duration Index (CAIDI), both without and with the inclusion of Major Event Days (MEDs). The study adopted the instrumental variable quantile regression (IVQR) method for estimation purposes. The first-stage 2SLS results confirm the robustness and validity of the instruments used, including the Democrats' Participation Rate, Real Average Household Income, and Renewable Energy Capacity, which show strong relevance and satisfy the conditions of homogeneity. Our findings demonstrated that the adoption of RPS policies has significantly decreased the interruption of power in all of the considered quantiles. The impact is more potent in states facing more severe reliability challenges. The results proved the important role of the policies of RPSs in improving the stability of grids in the context of states having relatively poor reliability. In summary, the obtained findings demonstrate significant insights related to the policies of renewable energy in the resilience of infrastructure. Finally, the findings suggest that the government authorities should promote the RPS as a tool for enhancing the performance of grids in different states.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16b954540641e7cf5d63fe046cf57890",
  "timestamp": "2025-05-15T01:21:41.335162"
}