{
  "id": 3677,
  "title": "Determinants of Earning Management: The Case of Moroccan Companies",
  "abstract": "- In the current financial landscape, earning management is a complex issue that raises questions about the credibility of financial data and the efficacy of corporate governance. This paper, through the use of logistic regression, analyzes the determinants of earning management within Moroccan companies. The findings underscore the pivotal role of corporate governance, revealing that well-governed companies are less susceptible to manipulation. Companies burdened with debt are more inclined to manipulate their financial data, and company size demonstrates a positive correlation with an increased likelihood of manipulation. Conversely, financially successful companies display a reduced susceptibility to earning management. These results carry significant practical implications for financial analysts, corporate governance professionals, and regulators, emphasizing the urgent need to reinforce governance, monitor debt management, and implement control mechanisms to mitigate the risk of earning management. They also stress the importance of increased vigilance on the part of regulators to maintain transparency in financial markets. Finally, this study calls for future research to refine an understanding of this intricate phenomenon and aid in preventing earning management within Moroccan companies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16bea41919bb61179b941bdb48169476",
  "timestamp": "2025-05-15T02:29:00.077637"
}