{
  "id": 4073,
  "title": "Bibliometric Analysis of Fuzzy Logic Research in International Scientific Databases",
  "abstract": "The purpose of this study is to explore the Web of Science Database (WOS) and review the significant contributions to the research of Fuzzy Logic or Fuzzy Sets theory from the beginning to the present. This study analyzes the most eminent authors, institutions, countries, and journals in Fuzzy Logic research by applying science mapping methods and bibliometric measures. Also, we paid attention to link strength and h-index to represent the visibility, influence, and link between the representative authors. Moreover, we added descriptive statistics to highlight strong linearity and a connection between fuzzy publications and Fuzzy Logic research. Also, we applied regression analyses and prevision functions to predict the evolution of the Fuzzy Logic topic. The results showed a significant increase in the number of papers published annually in a portfolio of internationally representative journals. This leads us to the idea that Fuzzy Logic research is now a transdisciplinary topic that continually develops. Therefore, it can be found in more and more related areas such as artificial intelligence, IoT, medicine, economics, or the environment. Most of the results are consistent with other bibliometric studies. Still, some results are different, results related to the current cited works that show a polarization in the Asia area and the top journals that is continuously changing depending on the number of papers and the quotations of scientific personalities that publish. We used the VOS Viewer software to map the main trends in the field. The results indicate that the use of concepts has long exceeded traditional boundaries.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16c469a5eed69e4fc27c54da86c3f833",
  "timestamp": "2025-05-15T01:23:27.377772"
}