{
  "id": 8093,
  "title": "Acceptance of an implantable data security chip to facilitate a cashless society",
  "abstract": "As the monetary system evolves new and more efficient means of payment become possible via the Internet, microchip store value cards and telecommunications. With the improved convenience and sophistication comes a greater potential for fraud and loss of privacy on a magnitude not previously possible. A logical extension of the control environment surrounding means of exchange is a permanent verification mark, which would allow unique identification and storage of personal and financial information. Chip implantation complete with global positioning satellites is a possible alternative with their increasing storage capacity, diminishing size and remote access. Successful human implantation of chips has occurred with no signs of rejection or infection. A model has been developed to test the acceptance of this new technology. The underpinnings of the model are two well researched and tested acceptance models being the Theory of Reasoned Action (TRA), Fishbein and Azjen [5], and the Technological Acceptance Model (TAM), Davis [3]. Both elements of the TAM have been adopted, those being the perception of usefulness and the perception of ease of use. The subjective norm component of the TRA is also included on the basis that the permanent and personal nature of the verification mark makes the influences of those who are important to the accountant an important explanatory variable. A perception of risk is also included as it is seen as important in such a significant and personal decision. Professionals have been surveyed to determine whether they would accept such technology into their personal lives despite changes to the risk profile including changed privacy issues. The regression analysis revealed that the developed acceptance model was more useful in predicting the acceptance of a verification mark than the previous TAM. The R Square of the developed model was 0.650 whereas the R Square of the TAM was a far less impressive 0.284.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16cdae9c1efe1bb35b5a09d476c41c52",
  "timestamp": "2025-05-15T03:15:09.385562"
}