{
  "id": 6015,
  "title": "Predictors of suicidal ideation among at risk cocaine-using African American women",
  "abstract": "The focus of this study was to identify factors that differentiate women drug abusers who had experienced suicidal ideation from those who did not. Face-to-face interviews were conducted with 221 cocaine-using women in Atlanta, GA, 88 (39.8%) of whom reported thinking about committing suicide at least once during the 90 days prior to interview and 13 3 (60.2%) of whom did not. Multivariate logistic regression was used to identify predictors of suicidal ideation, and post hoc goodness-of-fit tests were conducted to assess the robustness of final models derived. Model I excluded all psychosocial functioning measures and Model 2 included these items. Both models showed that suicidal ideation was more common among women who were unemployed, had been abused sexually, engaged in sexual relations to cope with stresses, or had less helpful relatives. In addition, Model I revealed a heightened risk for women experiencing financial problems and those who had a previous mental health diagnosis, whereas Model 2 showed an elevated risk among women who experienced anxiety and those who had lower levels of self-esteem. These findings suggest the need for prevention and intervention program's that target at-risk women, and for such programs to include an emphasis on suicidal ideation in addition to focusing on risk factors that are addressed more commonly.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16db67560a02a72a32fa97e26978805e",
  "timestamp": "2025-05-15T02:54:03.314297"
}