{
  "id": 4652,
  "title": "Intellectual capital and financial performance of South African development community's general insurance companies",
  "abstract": "The effect of intellectual capital on financial performance was investigated in this paper for the period 2008 to 2019. A total of 696 observations were generated from data collected from 56 general insurance companies in 12 years. The Value Added Intelligent Coefficient Model was used and data was analysed using both static (two stage least square, fixed and random effect) and dynamic panel regression analysis (two step system generalised method of moments). The findings showed a significant and direct relationship between lagged return on assets, intellectual capital and financial performance of insurers in the South African Development Community. Out of the components of intellectual capital, human capital and structural capital are significantly and directly related with return on assets while capital employed is inversely and insignificantly related with return on assets. The control variables-underwriting risk, insurer size and leverage are all inversely and significantly affecting return on assets. Thus, a U-shape relationship exists between intellectual capital and financial performance in general insurance companies in the South African Development Community. Thus, the policy makers-cum-insurers' managers should maximise their intellectual capital as this creates competitive advantage that leads to financial performance drive and wealth generation. The Model used in this study is an important model decision-makers can use to assimilate intellectual capital in their decision-making procedures. This will inadvertently permit insurers to scale themselves according to the intellectual capital efficiencies and advance in strategies that will boost their company's financial performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16e18acdad532ec661aa44eaa9e188c3",
  "timestamp": "2025-05-15T02:39:27.021354"
}