{
  "id": 5861,
  "title": "Associations of decision making abilities with blood pressure values in older adults",
  "abstract": "Objectives: Decision making, key to successful aging, has implications for financial success, physical health, and well being. While poor decision making has been linked with increased risk of mortality, age-related cognitive decline, and dementia, less is known regarding its associations with chronic disease indicators. We investigated the associations of decision making with blood pressure (BP) values [i.e., SBP, mean arterial pressure (MAP), and pulse pressure (PP), separately] in a community-based cohort study of aging. Methods: Participants were 908 nondemented older adults (age similar to 81 years; 75% women) from the Rush Memory and Aging Project. Decision making was measured using questions designed to simulate materials used in financial and healthcare settings in the real world and yielded a total score and domain-specific health and financial decision making scores. Two seated and one standing BP measurement were taken with all three contributing to average SBP, MAP that is, [SBP + (2 x DBP)]/3, and PP, that is, SBP - DBP. Participants were queried about hypertension status and antihypertension medications were visually inspected and coded. Participants also underwent medical history and cognitive assessments. Results: In separate multivariable linear regression models, total decision making scores were inversely associated with SBP, MAP, and PP after adjusting for age, sex, education, antihypertension medication use, diabetes, and cumulative cardiovascular disease burden (Pvalues = 0.03). Decision making remained associated with these BP values after additional adjustment for global cognition. Conclusion: Poorer decision making is associated with higher BP values in nondemented older adults.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "16e89a80fd641ef6fd015f19e7be99dc",
  "timestamp": "2025-05-15T02:51:58.726766"
}