{
  "id": 1219,
  "title": "Design of enterprise financial performance prediction model based on artificial intelligence algorithm",
  "abstract": "With the rapid and sustainable development of China's economy, enterprises are faced with the dual challenges of structural and cyclical factors, and the uncertainty of business operations and the intensity of competition are getting higher and higher. Therefore, stakeholders will pay close attention to the company's financial status. Based on this background, forecasting and evaluating the company's financial performance has important research value and significance for realizing the sustainable development of the company. BP neural network can automatically learn historical experience from data samples, and automatically estimate the function that can best describe the law of sample data. Therefore, this paper first analyzes the basic principles of BP neural network and artificial intelligence technology, and then evaluates its benefits, anti-risk ability, development ability and turnover ability, and designs the financial performance prediction and evaluation model from the above four perspectives to evaluate the 12 of the index system. Two secondary indicators are used as the input vector, and the comprehensive performance score is used as the output vector to create the BP neural network model. Finally, using the data of four companies as test samples, model training and simulation verification are carried out on the comprehensive performance of the sample companies, and the comprehensive performance of the sample companies is analyzed and explained according to the comparison of the prediction results. The results show that the prediction and evaluation method of enterprise financial performance based on BP neural network is feasible. In this paper, the artificial intelligence algorithm is introduced into the design of the financial prediction model of enterprise performance and efficiency by studying the artificial intelligence algorithm, so as to effectively assist the enterprise management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "170141e5b0086e461f4cf36021180089",
  "timestamp": "2025-05-15T02:00:30.478831"
}