{
  "id": 9094,
  "title": "COVID-19 vaccination acceptance among Syrian population: a nationwide cross-sectional study",
  "abstract": "Background Severe Acute Respiratory Syndrome Coronavirus 2 continues to spread globally and in the absence of an effective treatment, the vaccine remains the best hope for controlling this disease. In this study, we seek to find out the extent to which people in Syria accept the Corona vaccine and what are the factors that affect their decision. Methods This cross-sectional study was conducted in Syria during the period from January 3 to March 17, 2021. A structured self-administered questionnaire was distributed in two phases: The first phase included distributing the questionnaire as a Google Form on social media platforms. In the second phase, a paper version of the questionnaire was handed to patients, their companions, and workers in public hospitals. SPSS v.25 and R v.4.1.1 were used to analyze the data. Pearson Chi-square test and Logistic Regression were used to study the associations between categorical groups. Results Of 7531 respondents, 3505 (46.5%) were males and 4026 (53.5%) were females. 3124 (41.5%) were 18-24 years old. Healthcare workers were participants' main sources of information (50.9%), followed by Social Media users (46.3%). 2790 (37%) of the participant are willing to be vaccinated, and 2334 (31%) were uncertain about it. Fear of possible side effects was the main reason for the reluctance to take the vaccine 1615 (62.4%), followed by mistrust of the vaccine formula 1522 (58.8%). 2218 (29.5%) participants think COVID-19 poses a major risk to them personally. Vaccination intention was significantly associated with gender, residence, financial status, educational level, and geographic origin. Conclusion This study showed very negatively important results. The study participants Vaccination acceptance rate is almost the lowest when compared to its peers. A Lot of efforts should be made to correct misinformation about the vaccine and answer all questions about it, especially with a health system that has been ravaged by war for 10 years.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1712190345a1bd767be00311d8e83008",
  "timestamp": "2025-05-15T03:25:27.757557"
}