{
  "id": 8513,
  "title": "Predictors of self-care behaviour trajectories in patients with chronic obstructive pulmonary disease: A latent class growth analysis",
  "abstract": "Aims and ObjectivesTo explore the trajectories of self-care behaviours in patients with chronic obstructive pulmonary disease based on the latent class growth model and investigate the predictors of each trajectory based on the capability opportunity motivation and behaviour model. BackgroundStudies on self-care behaviours of patients with chronic obstructive pulmonary disease are mainly cross-sectional surveys. However, little is known about longitudinal trends of self-care behaviours changes among those population. DesignThis was a prospective observational research performed according to STROBE Checklist. MethodsOne hundred and nineteen patients with chronic obstructive pulmonary disease were followed up at baseline, 3 and 6 months. Data collection included the scores of self-care behaviours, specific demographic and clinical characteristics, and scores for the predictors. A latent class growth model was used to explore the self-care behaviours trajectories. Multiple logistic regression analysis was conducted to identify predictors of self-care behaviours trajectories. ResultsThree trajectories in the self-care behaviours of patients with chronic obstructive pulmonary disease were found: a persistently negative trajectory, a maintenance trajectory after a slight increase and an active trajectory with a slow upward improvement in self-care behaviours. Medical insurance and access to medical resources were the predictors of self-care behaviours. ConclusionThe patients with poor medical resources and medical insurance are at high risk for the poor self-care behaviours and the negative trajectory. Thus, dynamic and individualised intervention should be continuously provided to ensure patients acquire adequate medical resources to comprehensively improve self-care behaviours. Relevance to Clinical PracticePeople with better self-care trajectory may be patients who receive more medical resources or have less financial burden, which will help with the early identification of high-risk patients with a negative self-care trajectory. Intervention guided by Behaviour Change Wheel Theory should be conducted dynamically for patients for patients with different trajectories. Patient or Public ContributionThank the patients and their families for their cooperation in data collecting in this study.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "17264f9218980ee85f9dc33960ec13a5",
  "timestamp": "2025-05-15T03:19:51.961707"
}