{
  "id": 2596,
  "title": "Self-Reported Risk Factors for Financial Distress and Attitudes Regarding Cost Discussions in Cancer Care: A Single-Institution Cross-Sectional Pilot Study of Breast Reconstruction Recipients",
  "abstract": "Background: High treatment costs associated with breast cancer are a substantial burden to patients and society. Despite mounting awareness, patient perspectives about the value of cost discussions in breast reconstruction and risk factors for financial distress are unknown. Methods: The authors performed a single-institution, cross-sectional survey of all women who underwent breast reconstruction following mastectomy or lumpectomy for breast cancer or risk reduction. Questions were derived from previously published survey items, and the authors leveraged regression analysis to identify patient-level risk factors for major financial distress. Results: A total of 647 of 2293 patients returned the survey questionnaires (28.2 percent response rate). From the 647 respondents, 399 (62 percent) underwent breast reconstruction, and of these, 140 (35 percent) reported that total treatment expenses were higher than expected. One hundred twenty-nine breast reconstruction patients (32 percent) paid over $5000 in out-of-pocket costs. Two hundred eighty-four (71 percent) felt that surgeons should explain the estimated out-of-pocket costs when choosing a type of breast reconstruction and 205 (51 percent) believed that a financial consultation should be scheduled with every new cancer diagnosis. However, only 52 patients (13 percent) reported having had cost discussions with the treatment team. The incidence of major financial distress was n = 70 (18 percent), and following regression analysis, higher credit score and annual income were associated with a 66 percent and 69 percent risk reduction, respectively. Conclusions: Recipients of breast reconstruction demonstrate unanticipated and unplanned financial strain related to out-of-pocket expenses and believe that cost-consciousness should impact treatment decisions. Lower income and credit score are associated with financial distress. Cost discussions may optimize decision-making in preference sensitive conditions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1734c536ce62dca5496365776f37736e",
  "timestamp": "2025-05-15T02:17:01.784807"
}