{
  "id": 5598,
  "title": "Nutritional Status among Elderly: A Community-Based Cross-Sectional Study",
  "abstract": "Background: Malnutrition in the elderly is a significant public health problem and has serious implications on the overall health of the elderly. There are very few community-based studies on malnutrition among the elderly, especially in India. Objectives: The objective was to find out the prevalence of malnutrition and its associated risk factors among the elderly in urbanized villages of Delhi. Methods: A cross-sectional study was conducted during November 2015 to April 2017 in two urbanized villages of East Delhi among 353 elderly (>60 years) individuals. A semi-structured interview schedule was used to record the sociodemographic and relevant personal details of the elderly. To determine the prevalence of malnutrition, Mini Nutritional Assessment scale was used. Statistical analysis included simple descriptive analysis and tests of significance such as Chi-square test. Multivariable logistic regression was used to identify the predictors of malnutrition. Results: The prevalence of possible malnutrition was found to be 49.3%. On bivariate analysis, age, gender, education status, marital and residential status, per capita income, financial dependency, and family size were found to be associated with malnutrition (P < 0.05). Age >70 years, being tenant, and financial dependency were observed to be significant predictors of possible malnutrition in multiple logistic regression. Conclusion: Malnutrition needs to be identified at an early stage using appropriate tools so that proper interventions can be directed to those who need it to ensure healthy aging. Social and economic parameters are linked with the occurrence of malnutrition among the elderly and must be considered in the development of preventive strategies.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1735f48c78a0c4ec2e6ad67145d4c722",
  "timestamp": "2025-05-15T02:49:21.727810"
}