{
  "id": 4982,
  "title": "ASSESSMENT OF THE LEVEL OF ECONOMIC SECURITY OF INNOVATIVE ENTERPRISES: ECONOMIC AND LEGAL ASPECT",
  "abstract": "Ukraine's desire to integrate into the international economic space poses significant obstacles to innovative enterprises due to the destabilizing impact of globalization. Among the most important are financial, economic and political instability, risks of insolvency and reduced financial stability, which leads to the inability to meet external and internal challenges and ensure the optimal level of economic security. Under such conditions, the need to effectively counteract the destabilizing factors and ensure high rates of efficiency and profitability, which can be achieved through innovation and improvement of financial relations. Innovative activity, despite its high cost and significant level of risk, is one of the priorities of the enterprise. The activities of innovative enterprises attract the attention of economic agents, so ensuring the proper level of their economic security is no less important. Given that there is still no single unified and legally established method of calculating the level of economic security of enterprises, it is important to find the most acceptable and rational methods of calculating the level of security of enterprises, as well as developing a legal mechanism for their consolidation, which is the focus of scientists and practitioners for a long time. However, the problem has not yet been resolved. The article examines the main approaches to assessing the level of economic security of innovative enterprises and identifies the importance of the factor of innovation and legal regulation of financial relations with other economic agents. The main indicators of economic security of the enterprise are systematized and their classification into macroeconomic, financial, foreign economic, investment, scientific and technological, as well as production is performed. The method of assessment the level of economic security of an innovative enterprise using the Solow model is substantiated and proposed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "173921b085a92b1954adeda49f0a18d3",
  "timestamp": "2025-05-15T02:43:06.752733"
}