{
  "id": 1509,
  "title": "RETRACTED: Financial Transaction Risk Identification Method Based on Boosting-SVM Algorithm (Retracted Article)",
  "abstract": "The development of the network economy has brought a great impact on the society. In the process of online transactions, if the transaction risks are not prevented and improved in time, it will directly affect the normal development of the social economy. Therefore, it is necessary to synchronize transaction subjects and objects, and at the same time control transaction risks, and promote the rapid development of e-commerce, which is an important problem to be solved urgently in current online transactions. This paper first summarizes the characteristics and risk performance of new transactions and identifies and controls them according to their characteristics and different risk characteristics. The cybercriminal industry uses illegal means to seek benefits in online transactions. The continuous improvement of big data technology and data mining technology makes it possible to identify transaction risks in the consumption process. In particular, the research and identification of black industries can not only ensure the normal operation of merchants and reduce the loss of economic interests of merchants but also make the transaction experience of natural users smoother. Based on the existing consumption data, this paper adopts the Boosting-SVM model to identify natural users and black-produced users in the transaction process. The results show that the model achieves good recognition results. The overall prediction accuracy of the model is over 95%, the identification accuracy rate of high-risk transactions is over 98%, and other indicators are also over 96%. Compared with other risk identification, the overall accuracy of the algorithm is increased by 1%, and the risk identification accuracy is increased by more than 8%. Generally speaking, the method in this paper provides technical support to related industries to a certain extent.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "174e25daaae5c3c1aa883139f7f2737d",
  "timestamp": "2025-05-15T02:03:39.854940"
}