{
  "id": 8783,
  "title": "Term structure of interest rates and the expectation hypothesis: The euro area",
  "abstract": "This paper investigates the informational content of the yield curve in the European market using data on the Italian term structures. According to the expectation hypothesis theory (EHT) the current forward rate equals the future short rate plus a constant risk premium that is time invariant but maturity dependent. This theory has been widely tested in the empirical literature providing various findings according to the country where it has been applied and to the segment of the yield curve examined or the period under study. The standard approach to test the EHT uses the regression techniques assuming data on spot rates and their first differences to be stationary. Recently an increasing number of studies evidenced the non stationarity of interest rates time series and some tests of the EHT are formulated using term spread and forward-spot spread which are stationary. A new strand of literature suggests to investigate the EHT using a restricted VAR framework. In this paper, following [Jondeau, E., Ricart, R., 1999. The expectations hypothesis of the term structure: tests on us, german, french and uk euro-rates. Journal of International Money and Finance 18, 725-750, Ghazali, N.A. Low, S.W., 2002. The expectations hypothesis in emerging financial markets: the case of malaysia. Applied Economics 34, 1147-1156 and Seo, B., 2003. Non linear mean reversion in the term structure of interest rates. Journal of Economic Dynamics and Control 27, 2243-2265], we test if the expectation hypothesis holds using cointegration and error correction analysis. For the period under study results suggest that the long and short term interest rates are cointegrated and therefore subject to a long equilibrium path, providing evidence that the EHT holds for the Italian and the European market. (C) 2006 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "176f8e80d2bd13cdfa9f14ceac455dcb",
  "timestamp": "2025-05-15T03:22:26.039338"
}