{
  "id": 8242,
  "title": "Assessing the financial impacts of significant wildfires on US capital markets: sectoral analysis",
  "abstract": "This study investigates the impact of significant wildfires from 2019 to 2022 on nine sectors within the US capital markets, utilizing a dataset encompassing 161 wildfires. Employing a combination of parametric and nonparametric tests, alongside regression analysis, the research scrutinizes how capital markets in distinct sectors respond to wildfire events, revealing nuanced effects. In sectors directly impacted, the insurance industry displays sensitivity to fire costs, with explicit country or event mentions correlating with sustained returns. Conversely, the real estate sector experiences diminished returns during prolonged wildfires, while the forestry and timber industry exhibits heightened sensitivity to fire costs, especially when ignited by lightning. Within indirect impact sectors, the health industry shows vulnerability to fire-related fatalities, with subsequent negative correlations with country mentions. In the food industry, fire costs contribute positively to returns, while duration and size yield negative effects. The transportation industry witnesses a gradual decline in returns, escalating with the number of fire days or associated costs. In resilience and mitigation sectors, utilities demonstrate recovery post-wildfires, contrasting with consistent declines in the energy sector. Among interconnected sectors, the travel and tourism industry sees increased returns tied to the number of victims, with events caused by human actions having a more pronounced impact. This research underscores the significance of tailored risk assessment and mitigation strategies, offering valuable insights for investors and policymakers navigating the intricate relationship between environmental events and financial markets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "177a7e8f394eada9b13cd33c1d7dfc09",
  "timestamp": "2025-05-15T03:16:48.986616"
}