{
  "id": 8153,
  "title": "CKD Surveillance Using Administrative Data: Impact on the Health Care System",
  "abstract": "The US Renal Data System Coordinating Center identifies patients with chronic kidney disease (CKD) in administrative data sets and determines the overall size of the population with a diagnosis of CKD, with such major comorbid conditions as diabetes and congestive heart failure, and associated expenditures. A 2-year observation period is used to define individuals with at least 1 International Classification of Diseases, Ninth Revision, Clinical Modification diagnosis code from inpatient claims or at least 2 from outpatient claims or physician and supplier service claims for kidney disease and comorbid conditions. This method is applied to the 5% general Medicare data and extrapolated to the general Medicare population. In the Medicare and dually enrolled Medicare/Medicaid populations, 8% to 10% have CKD or end-stage renal disease, and these groups account for 27% to 35% of expenditures. Hospitalization rates for all patients with cardiovascular disease, congestive heart failure, infection, and pneumonia are greatest for dialysis patients and patients with CKD compared with patients without CKD. Regarding detection in groups at high risk of CKD, approximately 1 in 5 patients with diabetes, only 1 in 50 patients with hypertension, and 1 in 4 patients with diabetes and hypertension had at least 1 microalbuminuria test in a year. CKD is a major pubic health issue with large financial implications. Continued surveillance and detection programs are needed to address the burden of disease, level of comorbidity, and access to care. Long-term trend analyses are needed to determine whether morbidity and mortality rates change based on greater detection and treatment efforts.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1794167f655807d80c587dbe70d73255",
  "timestamp": "2025-05-15T03:15:38.467380"
}