{
  "id": 3331,
  "title": "Findings from the Polish InsurTech market as a roadmap for regulators",
  "abstract": "The dynamic development of modern technologies has changed the rules of the game in the financial market, including the insurance sector. While introducing digital business models may bring certain advantages for insurers, there is a widespread expectation of consumers to manage their financial affairs anytime and anywhere. This article sets out by demonstrating recent phenomena on the insurance market arising from its digitalisation, i. e., automation, personalisation, insurance on-demand, machine learning & artificial intelligence, Big Data, concluding distance contracts; along with the threats to consumer safety they pose a cyber risk that may materialise at different stages of the digital insurance selling process. Further, to provide insights into how modern digital insurance markets work, the article presents the results of a study conducted by the authors on a representative sample of 2,136 respondents from Poland. The study allows one to identify certain behaviour patterns of customers in their dealings with providers of insurance products and services as well as their approach to technological innovations introduced by the traders. Crucially, the study shows that insurance consumers have a positive attitude towards the use of modern technologies in insurance, however, their knowledge on this subject is still limited. Specifically, insurance consumers tend to be more afraid of cyber risks than any legal risks resulting from deploying new technologies in the insurance sector. In conclusion, the article maps out key regulatory challenges related to ensuring consumer protection on digital insurance markets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "17b4f777e38348fbefbae034ce66c038",
  "timestamp": "2025-05-15T02:25:13.674151"
}