{
  "id": 8566,
  "title": "The burden of very early dropout in infertility care: a nationwide population-based cohort study",
  "abstract": "Study question: What is the frequency and the associated factors of very early dropout following unsuccessful clomiphene citrate (CC)/gonadotropin treatment in the context of full coverage of treatment cost.Summary answer: Despite free treatment, almost one in four women had a very early dropout following unsuccessful CC/gonadotropin treatment, with patients below the poverty line being more likely to drop out early.What is known already: Success of infertility care is tarnished by very high dropout rates. Infertility care dropout has been considered as resulting principally from financial barriers because of the high cost of treatment. Nearly all previous work addressed dropout following IVF/ICSI. Factors associated with dropout following CC/gonadotropins may be different and also need to be investigated.Study design, size, duration: Nationwide population-based cohort study.Participants/materials, setting, methods: Using the French national health insurance and hospital databases, we included in the cohort 27 416 women aged 18-49 years unsuccessfully treated with CC/gonadotropins in 2017. The main outcome was very early dropout, defined as discontinuation of all infertility treatment after unsuccessful treatment for 1-3 months. Very early treatment dropout was analysed by multivariate logistic regression.Main results and the role of chance: Among women unsuccessfully treated with CC/gonadotropins, 22% dropped out of infertility care within 3 months. In multivariate analysis, higher early dropout following unsuccessful CC/gonadotropin treatment was associated with older and younger ages (>= 35 and <25 years), being below the poverty line, being treated with CC prescribed by a general practitioner and lack of infertility tests or monitoring.Limitations, reasons for caution: This study is based on health administrative data that do not include reasons for dropout and record only a limited amount of information. It is thus not possible to analyse the reason for early dropout.Wider implications of the findings: Despite full coverage of all infertility treatment, women under the poverty line have a higher risk of very early dropout following unsuccessful CC/gonadotropin treatment. Better understanding is needed of the non-financial barriers and difficulties faced by these patients. To address disparities in infertility treatment, practitioner training could be reinforced to adapt to patients from different social and cultural backgrounds.Study funding/competing interest(s): This work was supported by the ANR StimHo project, grant ANR-17-CE36-0011-01 from the French Agence Nationale de la Recherche. The authors have no conflict of interest to declare.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "17c5136500338f25bc26ada46aa25000",
  "timestamp": "2025-05-15T03:20:22.144829"
}