{
  "id": 3961,
  "title": "Insiders' characteristics and market timing capabilities: buying and selling evidence",
  "abstract": "Purpose - This paper aims to study individual managers' market timing capabilities while trading (either buying or selling) stock from their portfolios, as well as the impact of gender, seniority and trading frequency on their market timing performance. Design/methodology/approach - This study uses a relative transaction price approach introduced by Dittmar and Field (2015) on 837 aggregated trades made by managers from their portfolios between 2010 and 2015. These were taken from publicly disclosed information through the Portuguese regulator. Furthermore, this study uses a median regression-based method to infer the authors' conclusions. Findings - The authors find that insiders buy (sell) at a relatively lower (higher) price when compared to other traders. This evidence shows that insiders have market timing capabilities. Moreover, this paper shows that contrarily to gender, both seniority and frequency help explain market timing performance and that insiders' trades made over-the-counter (OTC) generally overperform the ones made on the open market (OM). Finally, this study finds a significant crisis-related influence on insiders' market timing performance. Originality/value - This study contributes to the literature by studying insider trading at the portfolio level, by analyzing the impact of personal characteristics of insiders (including gender, tenure and eagerness), focusing both on studying the buying and selling behavior across both OMs and OTC and analyzing firsthand the impact of a macroeconomic shift on insider trading performance.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "17d9a65a055a2cdfb72f5378292e9d16",
  "timestamp": "2025-05-15T01:22:39.356038"
}