{
  "id": 2825,
  "title": "SEAMS: A surrogate-assisted evolutionary algorithm with metric-based dynamic strategy for expensive multi-objective optimization",
  "abstract": "In real-world scenarios where resources for evaluating expensive optimization problems are limited and the reliability of trained models is hard to assess, the quality of the non-dominated front formed by algorithms tends to below. This paper proposes a metric-based surrogate-assisted evolutionary algorithm for multi-objective expensive optimization, incorporating a novel model management strategy that integrates a regeneration mechanism. This approach aims to achieve a well-balanced convergence and diversity, facilitating the attainment of high-quality non-dominated fronts to address expensive multi-objective optimization problems. The model management strategy, based on metrics, comprehensively evaluates the reliability of the classification model and selects appropriate strategies for offspring selection. Moreover, through significance analysis of the population, the regeneration mechanism identifies high-quality dimensions for regenerating offspring. The algorithm maximizes the utilization of the classification model to guide the generation and selection of offspring in the population. Experiments on DTLZ, MaF, WFG, and the high-dimensional portfolio optimization problem demonstrate that the proposed algorithm outperforms nine state-of-the-art surrogate-assisted evolutionary algorithms, highlighting its superior performance across various scenarios.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "17fab5bea05c82374ac2690a0319e390",
  "timestamp": "2025-05-15T01:10:49.568934"
}