{
  "id": 8317,
  "title": "Location, location, location!*: a quality-adjusted rent index for the Oslo office market",
  "abstract": "Purpose Commonly used rent indices are based on average developments or expert opinions. Such indices often suffer from compositional biases or low data coverage. The purpose of this paper is to overcome these challenges using the authors' approach. Design/methodology/approach The authors construct a quality-adjusted rent index for the office market in Oslo using detailed data from 14,171 rental contracts. Findings The authors show that compositional biases can have a large impact on rental price developments. By adding building-fixed effects to a standard hedonic regression model, the authors show that the explanatory power increases considerably. Furthermore, indices excluding location-specific information, or which include less granular location controls than at the building level, portray quite a different picture of rent developments than indices that do take this into account. The authors also exploit information on contract signature date and find that a more timely detection of turning points can be achieved by using the signature date instead of the more typically used start date of the lease. Research limitations/implications The study is confined to Norwegian data, and an avenue for future research would be to explore if similar results are obtained for other countries. A weakness with the paper is that authors' do not observe quality changes over time, such as renovation. Controlling for time-varying and unit-specific attributes in hedonic models for the commercial real estate (CRE) market would be useful to purge indices further for compositional effects and unobserved heterogeneity. While the authors do control for building-fixed effects, there are additional variations within a building (floor, view, sunlight, etc.) that the authors do not capture. Studies that could control for this would certainly be welcome, both in order to estimate the value of such amenities and to see how it affects estimated rent developments. Another promising avenue for future research is to link data on rental contracts in the CRE market with firm-specific information in order to explore how firm profitability and liquidity may affect rental contracts. Practical implications The authors show that the hedonic index yields a sharper fall in rents after the global financial crisis and more muted developments in the period between 2013 and 2015 than the average rent index. The results show that rents have followed their estimated equilibrium closely and have re-adjusted quickly in periods of deviation. From a financial stability perspective, the risk of a sharp fall in rents is reduced because rents often are in line with their fundamentals. Social implications The authors find that a more timely detection of turning points can be achieved by using information on the signature date. This is an important finding. The financial system is heavily exposed toward CRE, and timely detection of turning points is critical for policymakers. Originality/value The financial system is heavily exposed toward the commercial real estate market and timely detection of turning points is of major importance to policymakers. Finally, the authors use our quality-adjusted rent index as the dependent variable in an error correction model. The authors find that employment and stock of offices are important explanatory variables. Moreover, the results show that rents have followed their estimated equilibrium path.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1806bf9043b18abb429b5798be0e403e",
  "timestamp": "2025-05-15T03:17:49.064324"
}