{
  "id": 7203,
  "title": "The Effect of Internal Control Information Disclosure on Earnings Management",
  "abstract": "Internal control information disclosure is an indicator that the company have an effetive and efficien operational. The measurement of internal control information disclosure use an index from the company disclosure. This study demonstrates that the information must disclosed by the companies like internal environment, risk evalution, control activities, internal control over financial reporting, internal supervision, compliance of corporate governance, and internal assessment, these information must disclosed by the companies to ensure disclosure of internal control information have a high quality. This study examines the effect of internal control information disclosure on earnings management in Indonesia. The sample used on this study is all of the companies listed on the stock exchanges of Indonesia during period 2015-2016 with 673 samples. Based on the results of the regression model, there is a negative coefficient between internal control information disclosure and earnings management. The higher quality of internal control information disclosure, the lower of earnings management applied by the company. This study contributes to the internal control literature by extending the evidence for internal control information disclosure and examining the impact of disclosure on earnings management.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18080c820518ee4eb48656a83543a757",
  "timestamp": "2025-05-15T03:06:01.294955"
}