{
  "id": 1987,
  "title": "Financial Self-Organizing Map of Croatian small-sized enterprises",
  "abstract": "For many years, the relevant analyses have indicated problems in the functioning of the Croatian small-sized enterprises sector. It has been marked by recession, changes in legislation, financing problems, poor cash flow, dependence on large and state-owned companies and the low rate of survival. At the same time, the small-sized enterprises sector has been referred to as a generator of economic development, because of its size, innovation and adaptability. The uncertainties of the business future are forcing small enterprises to adopt ad hoc decisions, which are based on unstructured information. The most common aims are to reduce the current tax base, increase current liquidity and find financing sources. The aims are not associated with future obligations or the core business development. Decisions are rarely based on financial analysis, which requires a high-quality accounting information system, financial information about other enterprises, and methods that will generate usable and transparent information about several aspects of the business. Entrepreneurs, macro analysts, bankers and investors need analytical systems that generate simple, understandable and usable information, based on a number of relevant financial ratios. The construction of such analytical systems is the subject of this work. Current global and domestic researches use unsupervised methods of data mining because they provide aggregated information in predicting financial distress and bankruptcy, fraud detection, credit risk assessment, measurement and comparison of financial performance. Data mining methods have advantage over traditional statistical methods for their classification and prediction capabilities, as well as the ability to work with non-linear relationships between features. Based on a sample of 2,200 financial statements, which entities submitted in 2011 and 2012, self-organizing model created was built that successfully identify the current state of the small-sized enterprise sector. In total, 3 clusters have been identified, whose sustainability is proven by clustering quality indexes.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "180f7fcc7e8baed308a5ef0f7434ecb2",
  "timestamp": "2025-05-15T02:09:48.377769"
}