{
  "id": 1534,
  "title": "Spatial Spillovers of Financial Risk and Their Dynamic Evolution: Evidence from Listed Financial Institutions in China",
  "abstract": "This paper investigates the multidimensional spatial effects of risk spillovers among Chinese financial institutions and the dynamic evolution of financial risk contagion in the tail risk correlation network over different time periods. We first measure risk spillovers from financial submarkets to the stock market, identifying five periods using structural breakpoint tests. Then, we construct a spatial error financial network panel model by combining complex network and spatial econometric theory to explore the spatial spillover variability. Finally, we calculate the Bonacich centrality of nodes in the tail risk network and analyze the dynamic evolution of the financial impact path during the different time periods. The results show that the multidimensional spatial spillovers of financial risk among financial institutions are obvious and time varying. The spatial spillovers of financial institutions are positively correlated with the turnover rate and negatively correlated with the exchange rate, interest rate and return volatility. Financial institutions of the same type in the tail risk network display intraindustry risk clustering, and the systemically important institutions identified based on Bonacich centrality differ significantly across time. Moreover, when risk spillovers increase, external shocks' destructive power and speed of transmission to the network rise.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "184ff7630243301e7eecae6d47535929",
  "timestamp": "2025-05-15T02:04:20.072621"
}