{
  "id": 3924,
  "title": "Thematic reviews of patient safety incidents as a tool for systems thinking: a quality improvement report",
  "abstract": "Ensuring organisations learn from patient safety incidents is a key aim for healthcare organisations. The role that human factors and systems thinking can have to enable organisations learn from incidents is well acknowledged. A systems approach can help organisations focus less on individual fallibility and more on setting up resilient and safe systems. Investigation of incidents has previously been rooted in reductionist methodologies, for example, seeking to find the 'root cause' to individual incidents. While healthcare has embraced, in some contexts, the option for system-based methodologies-for example, SEIPS and Accimaps-these methodologies and frameworks still operate from a single incident perspective. It has long been acknowledged that healthcare organisations should focus on near misses and low harms with the same emphasis as incidents resulting in high harm. However, logistically, investigating all incidents in the same way is difficult. This paper puts forward an argument for themed reviews of patient safety incidents and provides an illustrative template for theming incidents using a human factors classification tool. This allows groups of incidents relating to the same portfolio, for example, medication errors, falls, pressure ulcer, diagnostic error, to be analysed at the same time and result in recommendations based on a larger sample size of incidents and based on a systems approach. This paper will present extracts of the themed review template trialled and argues that thematic reviews, in this context, allowed for a better understanding of the system of safety around the mismanagement of the deteriorating patient.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "185323ca6e9303e674354ce22e9574f6",
  "timestamp": "2025-05-15T01:22:11.918152"
}