{
  "id": 5736,
  "title": "Building investor trust in the P2P lending platform with a focus on Chinese P2P lending platforms",
  "abstract": "Despite the rapid development of peer-to-peer (P2P) lending in the world, massive Chinese P2P platforms have failed due to moral risk and liquidity risk, which decreased investors' confidence in P2P lending. A major question facing the future growth and development of P2P platforms is how to best build investors' trust. This study was based on the elaboration likelihood model and examines how to persuade investors to develop initial trust in P2P platform. The empirical analysis data were collected from 70 Chinese P2P platforms. The multiple linear regression results support central route variables: the financial and credit status of P2P platforms are key elements in building the trust of investors and impacting their decisions. The subordinate route variables including social capital, risk management, and operating duration provide the necessary support to increase the number of platform investors. The relationship between the average interest rate and number of investors is not linear but exhibits an inverted U-shaped curve. The disclosure of information by the borrowers does not significantly affect the number of platform investors. These findings are an important complement to existing research and will facilitate future development efforts for P2P lending and the rational investments of investors.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1855b95ffddb06f1dae32570167f0307",
  "timestamp": "2025-05-15T02:50:53.901598"
}