{
  "id": 561,
  "title": "Exploring the weather-yield nexus with artificial neural networks",
  "abstract": "CONTEXT: Weather is a pivotal factor for crop production as it is highly volatile and can hardly be controlled by farm management practices. Since there is a tendency towards increased weather extremes in the future, understanding weather-related yield factors becomes increasingly important not only for yield prediction, but also for the design of insurance products. Although insurance products mitigate financial losses for farmers, they suffer from considerable basis risk, i.e., a discrepancy between losses and the indemnity payment. OBJECTIVE: The objective of this paper was to explore the potential of machine learning for estimating the relationship between crop yield and weather conditions at the farm level and to use it as a tool for reducing basis risk in index insurance applications. METHODS: An artificial neural network was set up and calibrated to a rich set of farm-level yield data in Germany, covering the period from 2003 to 2018. A nonlinear regression model, which uses rainfall, temperature, and soil moisture as explanatory variables for yield deviations, served as a benchmark. RESULTS AND CONCLUSIONS: The empirical application revealed that compared with traditional estimation approaches, the gain in forecasting precision by using machine learning techniques was substantial. Moreover, the use of regionalized models and disaggregated high-resolution weather data improved the performance of artificial neural networks. A considerable part of yield variability at the farm level, however, could not be captured by statistical methods which solely use big weather data.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1859d9a3efa8257e8cc0ae8019f77f18",
  "timestamp": "2025-05-15T01:52:12.339542"
}