{
  "id": 8890,
  "title": "Self-reported hepatitis A and B vaccination coverage among men who have sex with men (MSM), associated factors and vaccination recommendations in 43 countries of the WHO European Region: results from the European MSM Internet Survey, EMIS-2017",
  "abstract": "Background: Hepatitis A and B vaccinations are recommended for men who have sex with men (MSM), given their increased risk of infection. However, data on vaccination programmes are scarce. Aim: To use information on vaccination recommendations and vaccine uptake among MSM in the WHO European Region to guide prevention. Methods: From a large pan-European MSM Internet Survey (EMIS-2017), we analysed data on self-reported hepatitis A and B vaccination status by age, education, financial coping, settlement size, outness (disclosure of sexual behaviour), migration history and diagnosis with hepatitis C or HIV, using multivariable logistic regression. Additionally, we collected information on national hepatitis A and B vaccination recommendations. Results: We present data of 113,884 MSM, median age 36 years (IQR: 27-47). Vaccination for hepatitis A and B was recommended and free for MSM in 7 and 18 of 43 countries, respectively. Of all respondents, 48% (n = 50,966) reported ever being vaccinated against hepatitis A, and 53% (n = 56,889) against hepatitis B. Odds for being vaccinated against hepatitis A increased with outness ('out to (almost) all' aOR:1.78, 95% CI:1.72-1.85 vs 'out to none') and were higher in countries where vaccination was recommended and free for MSM (aOR:2.22, 95% CI:1.29-3.82 vs 'no recommendation'). Results for hepatitis B were similar (outness: aOR: 1.81, 95% CI:1.75-1.88 and MSM-specific vaccination recommendation: aOR:2.44, 95% CI: 1.54-3.85). Conclusion: Large proportions of MSM in Europe remain vulnerable to hepatitis A and B, despite available vaccination. Implementation of MSM-specific vaccination recommendations and greater efforts to improve the societal climate for MSM are needed to address gaps in vaccine coverage.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18853153ec15e22e08ebfce6592bef4a",
  "timestamp": "2025-05-15T03:23:27.839723"
}