{
  "id": 1993,
  "title": "The prevalence of depression among students in higher education institution: a repeated cross-sectional study",
  "abstract": "Purpose Undergraduate students are known to be a high-risk group for mental health problems. The purpose of this paper is to constitute a repeated cross-sectional study on the trend of depression over the years and factors associated with depression among undergraduates. Design/methodology/approach Cross-sectional data from five surveys between 2013 and 2020 (N = 1,578) among the undergraduates of Universiti Tunku Abdul Rahman, a private university in Kampar Malaysia, were combined. The Depression Anxiety and Stress Scale-21 was used to screen for depression. Cochran's Armitage test was used to detect trend in depression. Logistic regression, random forest regression and extra gradient boosting regression were used to identify risk factors and classification. Findings The prevalence of depressive symptoms was found to be between 26.4% and 36.8% between the years with an average of 29.9%. There was no significant time trend in the prevalence. The risk of depressive symptoms was higher among female students, those who were dependent on family for financial support and those who were stressed. Practical implications Periodical screening for depression is warranted for the identification of students at risk for depression. Professional cognitive-behavioral therapies, peer support and consulting services should be made available to the students in need. Originality/value Depression among students had been studied widely, but the trend over years remains unexplored, especially in developing countries.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1887c52daa67d6e05a88fb434dc8ee04",
  "timestamp": "2025-05-15T02:09:48.403934"
}