{
  "id": 4105,
  "title": "Economic and non-economic drivers of tourism: bidirectional causality of tourism and environment for South Asian economies",
  "abstract": "This study explores the relationship between economic growth, tourism, and the environment in South Asian economies. It finds that factors such as GDP, human capital, globalization, and financial risk are interconnected and have long-term associations in these countries. The study employs various methodologies and tests to analyze the data. The author employs novel panel methodologies such as the method of moment of quantile regression analysis, slope heterogeneity, cross-section dependence test, and Westerlund cointegration. Additionally, a causality test along with the latest unit-root test is used. The results reveal important findings. As GDP expands, its impact on international tourism diminishes at higher quantiles, suggesting a decreasing effect. However, GDP still contributes positively to tourism across all quantiles. Human capital has a stronger effect on attracting tourists at lower quantiles, while globalization has varying impacts depending on the level of globalization in a country. Financial risk has a greater negative impact on tourism in larger economies compared to smaller ones. The study also examines the relationship between CO2 emissions and the variables under investigation. It finds that the effect of GDP on emissions decreases at higher quantiles, indicating a smaller contribution. Human capital has a larger effect on reducing emissions at lower quantiles, while the impact of globalization is more significant at higher quantiles. Moreover, an increase in financial risk leads to a decrease in emissions, particularly at lower quantiles. Based on these findings, the study suggests policy recommendations for South Asian economies. These include promoting sustainable tourism practices, investing in human capital development, encouraging responsible globalization, mitigating financial risks, and aligning tourism strategies with sustainable development goals.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "188c99d05bf91d408c34fcac24d70abc",
  "timestamp": "2025-05-15T02:33:03.547449"
}