{
  "id": 2855,
  "title": "INSTITUTES OF FINANCIAL SOCIALIZATION OF RUSSIAN STUDENTS",
  "abstract": "The paper examines the factors influencing the financial socialization of Russian students. It provides an overview of research on the impact of family institutions (parental household), financial independence, and the maturity of financial behavior on the financial socialization of young people. We analyze the relationships between basic socio-demographic characteristics of Russian students (gender, age, marital status), their behavioral characteristics (risk preference, propensity for offense or unethical behavior, prodigality, credulity), and socio-economic characteristics (level of financial status, financial independence, financial maturity). The empirical part of the study is based on the data of the author's survey of 1291 students from 17 Russian universities, processed by methods of statistical, correlation, and econometric analysis. To assess the level of financial well-being, we develop an original methodology where the financial situation shows the availability of goods and services that are unaffordable to most members of this group. Likewise, financial maturity is the students' proficiency in financial instruments poorly mastered by the majority of other respondents. The survey revealed a significant financial dependence of Russian students on their parents and their low level of financial maturity. We found an increased level of credulity and a low level of propensity for offense or unethical behavior; established positive correlation between the risk preference and the propensity for offense or unethical behavior, between the level of credulity and prodigality. We established that as financial dependence on parents gradually decreases, young people make more mature financial decisions, and their growing risk preference is replaced by a shift to more prudent financial practices. In groups where young people provide for themselves, their assessments of their financial situation rise sharply from a certain point, and the level of prodigality decreases. The constructed model of ordered logit regression showed a significant positive effect of age, marital and employment status, risk preference and level of financial maturity, as well as a significant negative effect of prodigality and credulity on financial independence of Russian students. The research results are applicable for the further development of theoretical and methodological approaches to the study of effective financial behavior of young people and the management of student financial socialization processes.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "188ee1079b8fe87f1678575ed4372f99",
  "timestamp": "2025-05-15T02:19:46.755750"
}