{
  "id": 6604,
  "title": "Trust in Healthcare during COVID-19 in Europe: vulnerable groups trust the least",
  "abstract": "Aim We examined predictors of trust in the healthcare system during the COVID-19 pandemic in 27 European countries. Subjects and methods We used population-based data drawn from the Living, working and COVID-19 survey (N = 21,884, 52% female, ages 18 to 92 years) covering 27 European countries dated June and July 2020. Multilevel linear regression, linear regression, and regression-tree analyses were conducted. Results We found that most participants tended to trust the healthcare system, although a substantial part could still be classified as distrusting (approx. 21%). Multiple variables, including being middle-aged or of older age, being female, lower levels of education, unemployment, worse general health status, having income difficulties, having unmet needs for healthcare, no healthcare contact during the COVID-19 pandemic, higher mental distress, and loneliness, were significantly associated with lower levels of trust. Among these variables mental distress, income difficulties, and unmet needs for healthcare emerged as especially important and, across European regions and countries, consistent predictors for lower trust in the healthcare system during the COVID-19 pandemic. Conclusions Medically vulnerable subgroups, such as individuals with unmet healthcare needs, higher levels of mental distress, and older age, as well as people living in socially and economically vulnerable situations, such as higher levels of loneliness and financial difficulties, were the least trusting of the healthcare system during the COVID-19 pandemic. As these vulnerable subgroups are also at highest risk for contracting COVID-19 and experiencing negative COVID-19-related outcomes, more targeted prevention and intervention efforts should be implemented in these groups.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18965f640755c0eb4765a6f21cbe12cc",
  "timestamp": "2025-05-15T02:59:37.090382"
}