{
  "id": 498,
  "title": "Pedagogic and assessment innovative practices in higher education: the use of portfolio in economics",
  "abstract": "PurposeThe purpose of this paper is to describe this new evaluation experience with portfolio in economics, not only from the teacher's point of view but from the student perspective, and all the learning from its implementation; to provide ideas of evaluation practices in virtual and face-to-face modality in international business education; to motivate the rethinking of assessment practices in higher education to combine the best of each modality in the future.Design/methodology/approachThe present work is a case study based on a qualitative description of the implementation of a portfolio as an assessment practice, supported by a reflection questionnaire with students' perceptions and some elements of metacognition. The first section summarizes the literature used as a theoretical framework of this work. The second section describes the portfolio implementation by analyzing teachers and students reflections with a qualitative approach. The third section presents the findings. The fourth section is a discussion of findings, practical implications, limitations and future research directions. Finally, the conclusions of the work are shared.FindingsBecause the portfolio has had overwhelming results to assess what students have learned during the pandemic, it has become the learning and assessment tool after the pandemic, as it transforms the classes experience by shifting the focus from traditional examinations to more comprehensive, personalized and reflective ones. It also empowers students to take ownership of their learning, develop essential skills and cultivate a deeper understanding. Among other benefits, the portfolio means the creation of a safe and supportive environment for honest reflection, the development and design of strategic directions to improve learning and lead students toward metacognitive autonomy. Reflection pieces, a critical component of the portfolio, are a vital tool in the proactive learning process, as through reflection students learn to examine their own performance and discuss strategies to enhance their success in future work.Research limitations/implicationsThis work began as an educational experience per se, not for research purposes, which caused it to be systematized and reconstructed in a descriptive way, not to measure quantitative results. In this way, the present work describes that the portfolio helps to achieve better results on students' learning than traditional examinations but, as another limitation, it does not measure them nor the process. One more limitation of this work is that it was written in a postpandemic context but was implemented during the pandemic; therefore, the circumstances of writing are not the same as those of implementation, and this could also entail a certain margin of decontextualization. At the same time, this is an experience that is still in process and continually being adapted to this changed and changing educational postpandemic context.Practical implicationsOne of the main implications of the portfolio experience, transferable to all educational contexts, is that it transforms the final exam into a metacognitive one, letting students be aware of their own process of learning and results - objectives and competences - acquired. In this way, it lets teachers witness a part of the learning process that is not so evident in the traditional assessment practices - focused on some aspect of the learning - as it makes visible the way in which students receive, process and apply content, that is to say, how they make it their own. Social implicationsThe portfolio promotes reflective learning and metacognition, vital skills that benefit students beyond the classroom. This can have a positive impact on societal attitudes toward education and the quality of learning. Of the students, 82% felt the portfolio creation was helpful in their personal and professional lives, suggesting a broader societal impact. The paper's findings contribute to the body of knowledge about the effectiveness of portfolio-based assessment in higher education, especially in the worldwide transition from online education to postpandemic education. This could guide future studies in similar educational contexts or with different pedagogical innovative tools.Originality/valueIn light of the 2020 pandemic lockdown, this work delves into the pressing need for educators to adapt and modify their teaching approaches. The relevance of this study is accentuated by the worldwide transition from online education to postpandemic education. This paper bridges the gap between theory and practice because the research can be applied to the educational practice of any international business education context, as well as lay the foundations for future research in the field that contributes to increasing evidence of the effectiveness of the use of the portfolio to achieve significant and deep learning in higher education.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18b38fe51627bed3c8727297b9574f13",
  "timestamp": "2025-05-15T00:36:26.691129"
}