{
  "id": 3341,
  "title": "AC 2011-1041: USING PEN-BASED TABLET PC TECHNOLOGY TO IMPROVE INSTRUCTION IN ENGINEERING ECONOMICS",
  "abstract": "A Center for Applied Research and Technology, (CART), Inc. worked with the School of Engineering Technology and Computer Science (SET) at a small College to implement a more active learning environment for teaching a junior-level engineering economics course (ENGR 315). Using a pen-based Tablet PC coupled with the CART CMS, a Moodle (R)-based course management service and interactive software, our instructional approach was modified to convert the traditional lecture-based ENGR 315 course to a more student-centered live learning environment. This method is now being planned for introductory mathematics and advanced computer science courses. Results show that the use of pen-based Tablet PC's coupled with live capture of the lecture posted on the CART CMS have resulted in better student retention and improved attention during the course. There is evidence of improved student performance in faculty evaluations. Using the Tablet PC instead of whiteboards, overheads, and blackboards allowed the ENGR 315 instructor to: (1) face students naturally and continually while solving equations; (2) produce cash flow diagrams more precisely and efficiently; (3) eliminate interruptions and distractions caused by physical transitions between whiteboard and projector screen; (4) quickly introduce color during live presentations that further improve understanding of concepts and classroom discussions; (5) facilitate student note taking through CART CMS posts that improve organization and elaboration; (6) accommodate student review for tests and quizzes; (7) provide students with a ready-made, savable, printable, portfolio useful for Fundamentals of Engineering (FE) review and exam preparation, and (8) work more high-quality problem examples due to these increased course delivery efficiencies.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18baccb4ed139139a45926b82eb3457a",
  "timestamp": "2025-05-15T01:16:22.057519"
}