{
  "id": 6394,
  "title": "Incidence of venous thromboembolism in patients undergoing surgical treatment for malignancy by type of neoplasm: An analysis of ACS-NSQIP data from 2005 to 2010",
  "abstract": "Introduction. This study investigates the incidence, relative risk, and adjusted odds ratio of venous thromboembolism (VTE) among patients with malignant neoplasms compared with those with benign neoplasms, as well as the incidence of outpatient VTE diagnosis. Methods. We performed a retrospective cohort study of patients in the ACS-NSQIP database from 2005 to 2010 with a postoperative diagnosis of neoplasm. The incidence of 30-day VTE, post-VTE death, the incidence of postdischarge VTE diagnosis, and the relative risk of postoperative VTE was calculated by cancer site. Logistic regression was used to calculate an independent odds ratio for each neoplasm site, adjusting for age, gender, body mass index, and operative time. Results. Of 208,200 patients, 159,752 had a malignant diagnosis of the sites of interest and 48,448 had benign/carcinoma in situ neoplasms. The incidence, relative risk, and odds ratio of 30-day VTE varied substantially by site of malignancy. The absolute incidence of outpatient VTE diagnosis varied by site and percent of VTE diagnosed as an outpatient was found to increase over time. Conclusion. Recommendations for VTE prophylaxis and duration of VTE prophylaxis for patients undergoing operations may benefit from tailoring to the specific type of malignancy. The increasing percentage of VTE events diagnosed as an outpatient may impact hospitals substantially as financial penalties for readmission are enacted. (Surgery 2012;152:186-92.)",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18c71772e5ab9e128e508178d80841ee",
  "timestamp": "2025-05-15T02:57:38.779104"
}