{
  "id": 8893,
  "title": "Inequities in home care use among older Canadian adults: Are they corrected by public funding?",
  "abstract": "BackgroundAlthough care use should parallel needs, enabling and predisposing circumstances including the socio-demographic inequities of socioeconomic status (SES), gender, or isolation often intervene to diminish care. We examine whether availability of state-funded medical and support services at home can rebalance these individual and social inequities, and do this by identifying if and how intersecting social identities predict homecare use among older Canadian adults. MethodsUsing the Canadian Longitudinal Study on Aging (CLSA) of 30,097 community-dwelling adults aged 45 to 85, we performed recursive partitioning regression tree analysis using Chi-Squared automatic interaction detection (CHAID). Combinations of individual and social characteristics including sociodemographic, family-related, physical and psychological measures and contextual indicators of material and social deprivation were explored as possible predictors of formal and informal care use. ResultsDiminished function i.e. increased need, indicated by Activities of Daily Living, was most strongly aligned with formal care use while age, living arrangement, having no partner, depression, self-rated health and chronic medical conditions playing a lesser role in the pathway to use. Notably, sex/gender, were not determinants. Characteristics aligned with informal care were first-need, then country of birth and years since immigration. Both 'trees' showed high validity with low risk of misclassification (4.6% and 10.8% for formal and informal care, respectively). ConclusionsAlthough often considered marginalised, women, immigrants, or those of lower SES utilised formal care equitably. Formal care was also differentially available to those without the financial or human resources to receive informal care. Need, primarily medical but also arising from living arrangement, rather than SES or gender predicted formal care, indicating that universal government-funded services may rebalance social and individual inequities in formal care use.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18db4df6f9b139e7b330b35ca1bed337",
  "timestamp": "2025-05-15T03:23:27.852698"
}