{
  "id": 132,
  "title": "Revisiting Mobile Payment Risk-Reduction Strategies: A Cross-Country Analysis",
  "abstract": "Mobile payment risk has become a critical cybersecurity factor in the cashless society. The outbreak of COVID-19 helped proliferate mobile payments that also bring significant risks to users. Using AI methods, this study analyzed six dimensions of mobile payment risks (financial, privacy, performance, psychology, time, and security) in a survey of 748 respondents from three countries (UK, Taiwan, and Mozambique). The decision tree method was employed to identify and analyze critical perceived risks. The ANOVA test provided insights on the perceived risks between countries. The ANOVA test showed that UK users were concerned about financial and time risks; those in Mozambique were concerned about performance, psychological, and security risks; and those in Taiwan were concerned about privacy risks. The results revealed that decision trees outperformed other methods (such as neural networks, logistic regression, support vector machine (SVM), random forest, and Na & iuml;ve Bayes models). Performance risk (Taiwan and Mozambique) and security risk (UK) are the most significant factors. Cultural differences influence mobile payment risk perception in different countries. The risk-reduction strategies were also matched to the critical factors by the decision tree. This showed that simplification and risk-sharing strategies were the major tactics in all three countries. The clarification strategy works for Taiwan and Mozambique, which focuses on the benefits of using mobile payments. The results suggest that enterprises should improve and simplify the mobile payment process and collaborate with the third parties to reduce and share cybersecurity risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18dbf2518bc3fd495bf435ef331708fa",
  "timestamp": "2025-05-15T01:47:14.071040"
}