{
  "id": 7635,
  "title": "Perceptions of the Health System and Public Trust in Government in Low- and Middle-Income Countries: Evidence from the World Health Surveys",
  "abstract": "In low- and middle-income countries, health care systems are an important means by which individuals interact with their government. As such, aspects of health systems in these countries may be associated with public trust in government. Greater trust in government may in turn improve governance and government effectiveness. We identify health system and non health system factors hypothesized to be associated with trust in government and fit several multilevel regression models to cross-national data from 51,300 respondents in thirty-eight low- and middle-income countries participating in the World Health Surveys. We find that health system performance factors are associated with trust in government while controlling for a range of non health system covariates. Taken together, higher technical quality of health services, more responsive service delivery, fair treatment, better health outcomes, and financial risk protection accounted for a 13 percentage point increase in the probability of having trust in government. Health system performance and good governance may be more interrelated than previously thought. This finding is particularly important for low-income and fragile states, where health systems and governments tend to be weakest. Future research efforts should focus on determining the causal mechanisms that,underlie the observed associations between health system performance and trust in government.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18db1898e10c99f2d031929283497cb9",
  "timestamp": "2025-05-15T03:10:33.025445"
}