{
  "id": 6066,
  "title": "Early-life socioeconomic circumstances and the comorbidity of depression and overweight in adolescence and young adulthood: A prospective study",
  "abstract": "Depression and overweight both often emerge early in life and have been found to be associated, but few studies examine depression-overweight comorbidity and its social patterning early in the life course. Drawing on data from 4,948 participants of the Avon Longitudinal Study of Parents and Children (ALSPAC) birth cohort from the UK (2,798 female, 2,150 male), we investigated how different aspects of early-life socioeconomic circumstances are associated with depression-overweight comorbidity from adolescence to young adulthood exploring any differences by age and sex. We estimated how parental education, social class and financial difficulties reported in pregnancy were associated with depression and overweight, and their comorbidity at approximately the ages 17 and 24 in males and females. The results from multinomial logistic regression models showed that all three socioeconomic markers were associated with depression-overweight comorbidity and results were similar across age. Lower parental education (relative risk ratio (RRR) and 95% confidence interval (CI) of low education v high education: 3.61 (2.30-5.67) in females and 1.54 (1.14-2.07) in males) and social class (class IV/V v class I: 5.67 (2.48-12.94) in females and 3.11 (0.70-13.91) in males) had strong associations with comorbidity at age 17 relative to having neither depression or overweight. Financial difficulties were also a risk factor in females, with less clear results in males. These findings highlight how early socioeconomic circumstances are linked with the accumulation of mental and physical health problems already in adolescence, which has implications for lifelong health inequalities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18ec9229a29aead9a6ac701db40bdbd4",
  "timestamp": "2025-05-15T02:54:38.733874"
}