{
  "id": 2175,
  "title": "Improving Data Loss Prevention Using Classification",
  "abstract": "The financial institutions provide the resources to protect their sensitive data and information by trying to prevent unauthorized leakage. They approve policies and realize technical restrictions to block the loss and revelation of sensitive data and information by external attackers as well as careless insiders. One example of Data Loss Prevention (DLP) restrictions consists of endpoint protection solutions to block data transmissions to USB storage devices. Nevertheless, financial institutions approve exceptions to these policies, based on the business need for the specific user, in order to be able to fulfill their job-related tasks. But from these exceptions derive the following questions: How an approval for an exception can create impact over the risk of data leakage for the financial institution? What is the particular risk for according an individual user a confident exception? This paper introduces a new concept to risk depending on exception management, which will provide the financial institution to assign exceptions derived from on basic DLP. Initially, the paper presents an approach for evaluating and classification users based on their access to sensitive data and information, and afterward, a standard of rights is decided for assigning exceptions to derive from the classification of users, which allows specific approvers to prepare knowledgeable decisions concerning exception requests.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "18f27f9e8f2ccf41d868cdcae38839c4",
  "timestamp": "2025-05-15T02:12:17.367091"
}