{
  "id": 1276,
  "title": "Financial Warning of Manufacturing Listed Companies Based on Text Mining",
  "abstract": "The audit report, as disclosed in the annual reports of listed companies, represents a critical source of textual data for assessing enterprise risk and conducting financial analysis. Descriptions of key audit matters in the audit report offer detailed explanations and insights. This study aims to develop predictive models for assessing the financial distress status of Chinese manufacturing listed companies, enhancing early warning accuracy through the integration of financial indicators and textual data. Utilizing data from 2016 to 2022, which includes Z-Score, F-Score, and descriptions of key audit matters from the financial reports of manufacturing listed companies, we introduce text mining techniques such as TF-IDF, Word2Vec, Doc2Vec, and LDA to extract crucial information. Subsequently, the extracted textual features are dimensionally reduced via PCA and Truncated SVD techniques. We construct multiple deep learning models, including Multilayer Perceptron (MLP), Convolutional Neural Network (CNN), Recurrent Neural Network (RNN), and Long Short-Term Memory (LSTM), using ACC and AUC-ROC as evaluation metrics. The findings indicate that deep learning models incorporating textual data surpass those relying solely on traditional financial indicators in predicting financial distress, achieving an AUC value of 0.9028, marking an improvement of 0.0483. This study not only furnishes a new perspective on financial distress prediction research but also provides effective tools for investors and regulatory agencies to identify potential financial crises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "192f57f17d55c528ea32c581798248a0",
  "timestamp": "2025-05-15T02:01:11.828194"
}