{
  "id": 2856,
  "title": "Pricing weather risk: How precipitation affects stock prices and returns in Tunisia?",
  "abstract": "PurposeThe present study examines the impact of precipitation on the Tunisian stock market, considering its vulnerability to droughts and the potential for rainfall-driven returns.Design/methodology/approachUsing daily data from 2020 to 2023, our research employs ordinary least squares, quantile regression, Shannon transfer entropy and neural networks (NNs) to analyze the relationship between precipitation and Tunisian stock market indices, including sector-specific indices (financial, banks, insurance, financial services and industrials).FindingsQuantile regression analysis highlights heterogeneous responses across sectors and market conditions, emphasizing the importance of considering bullish and bearish periods. Most indices show a positive relationship with precipitation during bullish periods (higher quantiles) and a negative or insignificant relationship during bearish periods. Transfer entropy confirms a unidirectional information flow from precipitation to stock returns, especially within the financial and financial services sectors, indicating predictive value. We find that only the seasonal component of rainfall exhibits a more pronounced influence, particularly on the financial and sub-financial sectors.Research limitations/implicationsThese findings highlight the importance of incorporating both rainfall and its seasonal variations in financial analyses and risk management strategies within the Tunisian context.Originality/valueIt is novel to examine the impact of precipitation's seasonal effect on the stock exchange.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19348bad0f6b6a2ff88d7cff6867c712",
  "timestamp": "2025-05-15T02:19:46.756747"
}