{
  "id": 7880,
  "title": "Social vulnerability, mental health and correlates of frailty in older outpatients living alone in the community in Italy",
  "abstract": "Objective: To determine the main social, functional and clinical characteristics of community-dwelling older outpatients living alone and to find correlates of frailty in this population. Method: Cross-sectional survey of 302 community-dwelling outpatients aged 65+ (median age 82 years) consecutively referred to a geriatric medicine clinic in Italy from June to November 2009. Participants underwent a comprehensive geriatric assessment including frailty status evaluated by means of the study of osteoporotic fractures (SOF) criteria. Student's t-test and the chi-squared test were used to compare subjects 'living alone' and 'not living alone' as well as 'frail' and 'not frail' subjects among the participants living alone. Multiple logistic regression analyses were performed to find independent correlates of frailty among participants living alone. Results: Participants 'living alone' were 124 (41%). Compared to subjects 'not living alone' (n = 178), they were older, received less assistance from informal and formal caregivers, had poorer living and financial conditions, a better cognitive status and functional self-sufficiency but a worse emotional status. One-third of them (n = 41) were frail. Among frail elders (n = 116), subjects living alone also showed a higher prevalence of unexpected new diagnoses of dementia than those not living alone. Independent correlates of frailty among participants living alone were: having experienced a severe acute disease in the past year (odds ratio [OR] 303.9; 95% confidence interval [CI] 13-7091; p 0.001), dependence in the bathing BADL ability (OR 62.74; 95% CI 12.17-323.32; p 0.001), depression (OR 10.43; 95% CI 2.31-47.13; p = 0.002) and incontinence (OR 3.98; 95% CI 1.01-15.66; p = 0.048). Conclusion: In older outpatients living alone, including those who were frail, we found a lower availability of personal assistance, significantly more social and financial vulnerability and a higher risk of depression. In frail elders there was also a higher prevalence of underdiagnosed dementia. In order to better recognise frail subjects in this specific population, four independent correlates of frailty were identified.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1943973fc5353f24c078eab27921a22d",
  "timestamp": "2025-05-15T03:13:04.906100"
}