{
  "id": 3736,
  "title": "What are we worried about? Midlife married couples' financial concerns about their retirement",
  "abstract": "ObjectiveThis study explored how marital financial collaboration and approval along with financial constructs predicted midlife couples' reports of retirement financial concerns.BackgroundRetirement is an expected time of life that many couples plan for in advance. Despite knowing that years of life without regular income are anticipated, many people experience financial strain in retirement, which can impact their marital happiness.MethodData for this study came from a sample of 324 midlife (Mage = 44 years) couples that participated in the Flourishing Families study. We examined predictors of financial worries for retirement using dyadic probit regression models.ResultsResults suggested that both husbands and wives worried about having insufficient income and heavy debt in retirement, and that husbands had particular concerns about excess spending. Findings from predictive models suggested that husbands and wives both reported that better financial collaboration, husbands' approval of partners' financial behaviors, better physical health, and to some degree higher income, higher education, and having retirement savings, were protective against financial worries for retirement. In contrast, wives' reports of having retirement benefits and working more hours per week were risk factors.ConclusionMarital financial collaboration and approval of partner financial responsibility by both members of dyads may have lifelong benefits, including as couples prepare for retirement.ImplicationsEfforts to provide greater access to retirement savings plans may also support couples from various social and economic backgrounds. Findings suggest that marital happiness in retirement could be increased as spouses work together in financial aspects of their lives.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "195a129b5e766efa4801311902ffc5af",
  "timestamp": "2025-05-15T02:29:28.027123"
}