{
  "id": 6926,
  "title": "Unmet needs for social support and diabetes-related distress among people living with type 2 diabetes in Thai Binh, Vietnam: a cross-sectional study",
  "abstract": "Background Diabetes-related distress (DRD) refers to negative emotional and affective experiences from daily demands of living with diabetes. People who received social support seem less likely to experience DRD. The prevalence of T2D in Vietnam is rapidly increasing. Yet, DRD and its association with social support have not been investigated. This study investigates DRD and how it is associated with unmet needs for social support in people with T2D in Thai Binh Province, Vietnam. Methods A total of 806 people, age >= 40 years, treated for T2D at primary hospitals in Thai Binh Province, Vietnam, completed a questionnaire-based cross-sectional survey. DRD was self-reported, based on the Problem Areas In Diabetes scale 5 (PAID5). We assessed 6 types of unmet needs for social support from family/friends/community including: (i) Transport and company when visiting health facilities; (ii) Reminders to take medication; (iii) Purchase and preparation of food; (iv) Reminders to engage in physical exercise; (v) Emotional support; and (vi) Financial support. Multivariable logistic regression was used to model DRD as an outcome of each type of unmet need for social support, and as an outcome of the number of unmet needs for social support, adjusted for three sets of covariates. Results In this study, 50.0% of people with T2D experienced DRD. Odds for DRD were higher among those who had any unmet need for social support. After adjustment for household economic status, only unmet needs for emotional and financial support were associated with higher odds ratios of DRD (OR = 2.59, CI95%: 1.19-5.63 and OR = 1.63, CI95%: 1.10-2.40, respectively). People who had >= 2 type of unmet need were not a higher risk of experiencing DRD as compared to those with no unmet need. Conclusions Half of the people with T2D experienced DRD. The results suggest that having enough finances may decrease most needs for social support with the exception of emotional support. Thus, social support to financial and emotional of diabetes aspects may contribute to prevent or reverse DRD.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1964e0c2d7fa18f89459b9ce73f9f78d",
  "timestamp": "2025-05-15T03:03:13.434836"
}