{
  "id": 7191,
  "title": "Robust Portfolio Optimization Based on Semi-Parametric ARMA-TGARCH-EVT Model with Mixed Copula Using WCVaR",
  "abstract": "Portfolio returns generally follow multivariate distribution, whose effectiveness depends not only on the correct estimation of marginal distributions, but also on the accurate capture of the interdependent structure among them. To effectively estimate the marginal distribution and improve the accuracy, we present a hybrid ARMA-TGARCH-EVT model, which considers the leverage effect, thick tail and heteroscedasticity of the financial asset return series. This model utilizes the extreme value theory to process the tail data and uses the kernel regression estimation to process the intermediate data to make the marginal distribution smooth, natural and regular. Furthermore, a novel semi-parametric ARMA-TGARCH-EVT- Copula portfolio model is proposed to achieve the robustness of minimizing worst-case conditional value-at-risk (WCVaR). In the model, a mixed copula set is presented by t-copula and Archimedean copula to cover the wide joint dependence among logarithmic daily returns. To verify the effectiveness and practicality of our proposed model, a static numerical example and a dynamic portfolio based on the historical index data of two stock crash periods are given. The results show that the new model is superior in terms of daily average logarithmic return, cumulative logarithmic return and sharp ratio.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "196edec2690211338751c574d23d746c",
  "timestamp": "2025-05-15T03:06:01.250442"
}