{
  "id": 5318,
  "title": "Macroeconomic-Energy-Related Uncertainty and Economic Complexity as Drivers of Renewable Energy Investment",
  "abstract": "The United Kingdom (U.K.) has set ambitious climate goals, aiming for a net-zero target in carbon emissions by 2050 and planning to leverage green energy technologies and innovation. This study explores the key factors influencing investments in renewable energy within the United Kingdom. Specifically, the study applies the recently constructed interest rate uncertainty measure alongside economic complexity, energy security risk, financial development and load capacity factor as new determinants of renewable energy investment. Innovative econometric methods, including the bivariate quantile-on-quantile regression (QQR) technique and the nonparametric Granger causality in quantiles (NGCinQ) methods were employed. The study's findings reveal that interest rate uncertainty depresses investment in renewable energy in the lower to median quantiles. Economic complexity negatively affects renewable energy investment across all quantiles, while energy security risks stimulate renewable energy investment in the U.K. The impact of financial development and load capacity are positive across all quantiles, reflecting the well-developed financial system, as well as the efficiency of renewable energy projects and their appeal to investors in the U.K. The results of the NGCinQ provide strong evidence of a hump-shaped pattern of causality across a broad range of quantiles. The findings are supported by the robustness tests. The findings highlight the importance of the new determinants in leveraging green energy innovation and technology.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19798847494a137ff37d07965ed3763f",
  "timestamp": "2025-05-15T02:46:44.851135"
}