{
  "id": 7015,
  "title": "Mental health selection and income support dynamics: multiple spell discrete-time survival analyses of welfare receipt",
  "abstract": "Background The higher occurrence of common psychiatric disorders among welfare recipients has been attributed to health selection, social causation and underlying vulnerability. The aims of this study were to test for the selection effects of mental health problems on entry and re-entry to working-age welfare payments in respect to single parenthood, unemployment and disability. Methods Nationally representative longitudinal data were drawn from the Household Income and Labour Dynamics in Australia survey. Multiple spell discrete-time survival analyses were conducted using multinomial logistic regression models to test if pre-existing mental health problems predicted transitions to welfare. Analyses were stratified by sex and multivariate adjusted for mental health problems, father's occupation, socioeconomic position, marital status, employment history, smoking status and alcohol consumption, physical function and financial hardship. All covariates were modelled as either lagged effects or when a respondent was first observed to be at risk of income support. Results Mental health problems were associated with increased risk of entry and re-entry to disability, unemployment and single parenting payments for women, and disability and unemployment payments for men. These associations were attenuated but remained significant after adjusting for contemporaneous risk factors. Conclusions Although we do not control for reciprocal causation, our findings are consistent with a health selection hypothesis and indicate that mental illness may be a contributing factor to later receipt of different types of welfare payments. We argue that mental health warrants consideration in the design and targeting of social and economic policies.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19801a1bf9ba9cd2d068163240aa5a96",
  "timestamp": "2025-05-15T03:04:22.965201"
}