{
  "id": 2570,
  "title": "Systematic Financial Risk Identification and Dynamic Evolution Based on Deep Learning",
  "abstract": "A perfect financial market is the physical manifestation of a developed country, and the rational transfer and distribution of capital resources can significantly improve the real economy's operational efficiency. In the era of sharing economy, the traditional linear systematic financial risk early warning model based on the Internet can no longer meet the early warning and identification of nonlinear systematic financial risk brought on by the embeddedness of the Internet network. The improved loss function is used to optimize the model to identify and monitor systemic financial risks in this paper. DL is used to identify systemic financial risks, a classification model based on DNN is built, and the improved loss function is used to optimize the model to identify and monitor systemic financial risks. The experimental results show that this model can achieve a recall rate of 93.2 percent and an accuracy rate of 95.4 percent. The results of the experiments show that the DL-based identification model is both effective and practical. The use of DL not only improves identification and analysis methods in the field of financial risk management, but it also encourages empirical research to shift from linear to nonlinear, from a focus on parameter salience to a focus on model structure and dynamic characteristics, while also better capturing tail risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1981dfee0768aa946d0a240b90de4439",
  "timestamp": "2025-05-15T02:17:01.607864"
}