{
  "id": 6660,
  "title": "Concomitant Trajectories of Internalising, Externalising, and Peer Problems Across Childhood: a Person-centered Approach",
  "abstract": "This study investigated trajectories of concomitant internalising, externalising, and peer problems, and associated risk factors for group-membership, using a person-centered approach to better understand heterogeneity in subgroups identified. A cohort of 7,507 children in Ireland was followed from infancy to late childhood (50.3%, males; 84.9% Irish). The parent-version of the Strengths and Difficulties Questionnaire was used when children were 3, 5, 7 and 9 years of age. Information on antecedent risk factors was collected when children were 9 months. Group-based multi-trajectory modelling and multinomial logistic regression were used. Six subgroups of children with distinct profiles were identified, evidencing both homotypic and heterotypic comorbidity. No support of a 'pure' internalising, externalising or peer problems group was found in any identified trajectory group. Difficulties in one problem domain indicated the presence of difficulty in another problem domain for all children in elevated groups. Risk factors associated with group-membership were complex, with only three common factors across elevated groups: prenatal exposure to smoking, maternal education, and maternal stress. Specific risk factors for group-membership included low birth weight, sex, maternal age, maternal depression, family composition, social class, medical card status and quality of attachment. Despite some overlap in predictors, the combination of predictors specific to each group would suggest tailored programming. For children with the most acute problems, programming targets should include families with boys, born with low birth weight, exposed to smoking prenatally, with mothers who have lower levels of education, postnatal depression, increased stress and fewer financial resources.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "198ca0b0f9b33f55b8c81905c91c2490",
  "timestamp": "2025-05-15T03:00:05.097394"
}