{
  "id": 7434,
  "title": "Effect of a Male-Targeted Digital Decision Support Application Aimed at Increasing Linkage to HIV Care Among Men: Findings from the HITS Cluster Randomized Clinical Trial in Rural South Africa",
  "abstract": "Linkage to HIV care remains suboptimal among men. We investigated the effectiveness of a male-targeted HIV-specific decision support app, Empowering People through Informed Choices for HIV (EPIC-HIV), on increasing linkage to HIV care among men in rural South Africa. Home-Based Intervention to Test and Start (HITS) was a multi-component cluster-randomized controlled trial conducted among 45 communities in uMkhanyakude, KwaZulu-Natal. The development of EPIC-HIV was guided by self-determination theory and human-computer interaction design to increase intrinsic motivation to seek HIV testing and care among men. EPIC-HIV was offered in two stages: EPIC-HIV 1 at the time of home-based HIV counseling and testing (HBHCT), and EPIC-HIV 2 at 1 month after a positive HIV diagnosis if not linked to care. Sixteen communities were randomly assigned to the arms to receive EPIC-HIV, and 29 communities to the arms without EPIC-HIV. Among all eligible men, we compared linkage to care (initiation or resumption of antiretroviral therapy after > 3 months of care interruption) at local clinics within 1 year of a home visit, ascertained from individual clinical records. Intention-to-treat analysis was performed using modified Poisson regression with adjustment for receiving another intervention (i.e., financial incentives) and clustering at the community level. We also conducted a satisfaction survey for EPIC-HIV 2. A total of 13,894 men were eligible (i.e., aged >= 15 years and resident in the 45 communities). The mean age was 34.6 (+/- 16.8) years, and 65% were married or in an informal union. Overall, 20.7% received HBHCT, resulting in 122 HIV-positive and 6 discordant tests. Among these, 54 men linked to care within 1 year after HBHCT. Additionally, of the 13,765 eligible participants who did not receive HBHCT or received HIV-negative results, 301 men linked to care within 1 year. Overall, only 13 men received EPIC-HIV 2. The proportion of linkage to care did not differ between the arms randomized to EPIC-HIV and those without EPIC-HIV (adjusted risk ratio = 1.05; 95% CI:0.86-1.29). All 13 men who used EPIC-HIV 2 reported the app was acceptable, user-friendly, and useful for getting information on HIV testing and treatment. The reach was low, although the acceptability and usability of the app were very high among those who engaged with it. Enhanced digital support applications could form part of interventions to increase knowledge of HIV treatment among men. Clinical Trial Number: ClinicalTrials.gov # NCT03757104.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "198fb8651511ae0244d3038b1688caf5",
  "timestamp": "2025-05-15T03:08:37.837173"
}