{
  "id": 3241,
  "title": "The impact of COVID-19 on financial structure and performance of Islamic banks: a comparative study with conventional banks in the GCC countries",
  "abstract": "Purpose The aim of this paper has twofold: (1) to explain and compare the financial evolution of Islamic and conventional banking sector in the Gulf Cooperative Council (GCC) countries before and during the COVID-19 pandemic and (2) to explore the key success factors that might affect Islamic and conventional banks performance before and mainly during COVID-19 pandemic period. Design/methodology/approach Orbis Bank Focus database and annual financial reports are used to collect financial information of Islamic and conventional banks in GCC countries over four years: 2017, 2018, 2019 and 2020. Descriptive statistics, T-test, multiple regression, and 2SLS and GMM models are employed to analyze the financial structure and performance of Islamic and conventional banks before and during the COVID-19 pandemic period. Findings Results of this study reveal that (1) there is a significant difference between Islamic banks and conventional banks during the crisis of COVID-19, where the conventional banks have presented a higher level of financial performance and financial liquidity than their Islamic counterparts, (2) conventional banks have revealed higher capacity to manage their financial risk during the crisis period, and (3) a high level of non-performing loan, high inflation rate and high percentage of non-important cost have a negative impact on the financial performance of Islamic banks mainly during the pandemic period of COVID-19. However, the result indicates that a high level of liquidity risk increased the performance of Islamic banks but this impact falls sharply during the pandemic period. Originality/value This study provides information that supports investors, regulators and executive managers in GCC countries. A well-structured balance sheet would improve the financial performance and risk management of the banking sector in GCC countries, especially in times of crisis and pandemics.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "199f47d5aca42d764e699e31fe9ac0c4",
  "timestamp": "2025-05-15T02:24:05.186477"
}