{
  "id": 4118,
  "title": "Differences Between the Local and Migrant Populations in Healthcare Service Use and Direct Cost of Tuberculosis Treatment - Shanghai Municipality, China, 2020-2021",
  "abstract": "Background: Tuberculosis (TB) disproportionately impacts socially vulnerable populations, including migrants. This study aimed to investigate the utilization of TB care services and the financial burden on TB patients during 2020-2021 in Shanghai and to examine differences between local and migrant patients. Methods: A retrospective survey was conducted in three districts of Shanghai among drug-sensitive TB patients who initiated treatment on or after January 24, 2020, and had completed treatment by the time of the interview in 2021. The study used a designed sampling ratio of 1 & ratio;1 for both local and migrant populations, and examined the use of outpatient and inpatient care, as well as the direct costs of treatment. Descriptive analyses and statistical tests were utilized to assess differences in patient characteristics between locals and migrants, with and without a residence permit. Logistic regression was used to examine the impact of migrant status on service usage and financial burden, after adjusting for demographic and socioeconomic factors. Results: The study included a total of 196 TB patients, comprising 88 locals and 108 migrants. No significant differences in the average number of outpatient visits were observed between migrant and local patients. Migrants with a residence permit (RP) had the highest hospitalization rate (92.86%), followed by migrants without an RP (86.84%), and then local patients (79.55%). The median out-of-pocket (OOP) payment for the entire treatment course, including medical and non-medical costs, was 15,845 yuan for migrants without an RP, with descending amounts for migrants with an RP, and then local patients (P<0.001). The proportion of patients incurring OOP payments exceeding 20% of their annual household income was also highest among migrants without an RP (57.14%). Regression analysis indicated that migrants without an RP faced the highest financial risk during TB treatment. Even migrants with an RP showed significantly higher financial risk compared to local patients (P<0.05). Conclusions: During 2020-2021, the utilization of TB care in Shanghai was high among both local and migrant TB patients. Nevertheless, significant financial burdens were more pronounced among migrant patients without RP.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19a126b067eb79d7d3b6eee84078714c",
  "timestamp": "2025-05-15T02:33:42.001093"
}