{
  "id": 8654,
  "title": "Better with age: financial reporting quality in family firms",
  "abstract": "Purpose - The purpose of this paper is to contribute to the literature on financial reporting quality (FRQ) within family firms (FFs), assessing whether longevity can determine a different propensity to earning management (EM) behaviors. Design/methodology/approach - The sample, composed by Italian and Brazilian listed family (and non-family) firms, is segregated into old and young. For each subsample, unsigned discretionary accruals are calculated, using two different EM models. A linear regression model is then proposed, together with some robustness tests, to confirm the research hypothesis. Findings - The outcome is that, within FFs, the entrenchment effect seems to be diminishing with the company's age, up to become lower than the alignment effect. With some caveat, research also demonstrates that old FFs are more propense to supply higher FRQ than any other subsample group. Research limitations/implications - The authors demonstrated that, in terms of EM decision process, FFs become virtuous just with time. More research is needed to evaluate the impact of the share and management control separately and to analyze different generation segmentation. Practical implications - This paper could help non-family stakeholders, as it shows that different company types (family vs non-family), at a different stage of the life-cycle (young vs old) have a different attitude toward FRQ. On the other hand, family owners could exploit the longevity as a value driver. Originality/value - This paper suggests that agency theory and socio-emotional theory are complementary in explaining the family control role in earnings management decisions. The study also contributes to the debate of FF homogeneity and on risk behavior in FFs, often portrayed as having a patient capital.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19b72d4f88d53aaa57dd31c2808773d4",
  "timestamp": "2025-05-15T03:20:55.990315"
}