{
  "id": 6067,
  "title": "The bidirectional relationship of tax aggressiveness and CSR: Evidence from Indonesia",
  "abstract": "This study aims to examine the simultaneous relationship between tax aggressiveness and CSR of non-financial companies in Indonesia. This study also aims to examine the moderating role of risk management in this relationship. This paper is an empirical work using a sample of Indonesian publicly listed companies that comprises 328 firm-years (2013-2020). The data was then processed using simultaneity test and 2sls regression. This paper finds that there is a simultaneous relationship between tax aggressiveness and CSR. Tax aggressiveness has a negative significant effect on CSR. Also, CSR has a significant negative effect on tax aggressiveness. Risk management strengthens the effect of tax aggressiveness on CSR and strengthens the effect of CSR on tax aggressiveness. This paper contributes to the current tax aggressiveness and CSR literature by examining the probable bidirectional relationship between the two. Existing studies have examined the one-direction relationship only, whether CSR to tax aggressiveness or tax aggressiveness to CSR. This is the first study examining the role of risk management in moderating the relationship between CSR and tax aggressiveness. This study is useful for corporate management in making CSR and tax aggressiveness strategy. Government can make a regulation that mandates the companies to do risk management activities and disclose their risk management policies and implementation. Shareholders can rely on companies' disclosures regarding CSR activities because this study supports that firms with higher CSR disclosure have low-level tax aggressiveness.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19ba83db0b27b6a3182c2c92a72863b9",
  "timestamp": "2025-05-15T02:54:38.735377"
}