{
  "id": 6537,
  "title": "Clustering analysis to identify distinct spectral components of encephalogram burst suppression in critically ill patients",
  "abstract": "Millions of patients are admitted each year to intensive care units (ICUs) in the United States. A significant fraction of ICU survivors develop life-long cognitive impairment, incurring tremendous financial and societal costs. Delirium, a state of impaired awareness, attention and cognition that frequently develops during ICU care, is a major risk factor for post-ICU cognitive impairment. Recent studies suggest that patients experiencing electroencephalogram (EEG) burst suppression have higher rates of mortality and are more likely to develop delirium than patients who do not experience burst suppression. Burst suppression is typically associated with coma and deep levels of anesthesia or hypothermia, and is defined clinically as an alternating pattern of high-amplitude burst periods interrupted by sustained low-amplitude suppression periods. Here we describe a clustering method to analyze EEG spectra during burst and suppression periods. We used this method to identify a set of distinct spectral patterns in the EEG during burst and suppression periods in critically ill patients. These patterns correlate with level of patient sedation, quantified in terms of sedative infusion rates and clinical sedation scores. This analysis suggests that EEG burst suppression in critically ill patients may not be a single state, but instead may reflect a plurality of states whose specific dynamics relate to a patient's underlying brain function.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19bcaa11e22bc4532519c0ab547408ae",
  "timestamp": "2025-05-15T02:59:07.519430"
}