{
  "id": 7361,
  "title": "Impact of the COVID-19 Pandemic on Patients With Alcohol Use Disorder and Associated Risk Factors for Relapse",
  "abstract": "Background: The impact of the ongoing COVID-19 pandemic on vulnerable groups like patients suffering from substance use disorders is expected to be tremendous, and corresponding concerns were raised early on by many experts around the world. Psychosocial distress, financial insecurities and physiological problems associated with the COVID-19 crisis could be especially challenging for this group of patients. Methods: In the current study data was collected from a clinical sample of patients with alcohol use disorder (AUD; N = 127) during the initial stage of the pandemic. The impact of various COVID-19 related factors (physiological, psychosocial, economic and others) on patients' personal life was evaluated. Alcohol consumption, craving, and potential posttraumatic stress disorder (PTSD) symptoms were assessed using different scales and their associations were analyzed. Furthermore, differences regarding these variables between comparably sized groups of patients who remained abstinent (N = 37), relapsed (N = 41), or reported unaltered drinking behavior (consuming subgroup, N = 49) were investigated. The impact of sociodemographic and COVID-19 factors on relapse (in comparison to abstinence) was evaluated using binary logistic regression analysis. Results: Our results confirmed the expected positive associations between alcohol consumption, craving, and PTSD symptoms, respectively, among patients with AUD. Furthermore, group differences indicate significantly lower levels on all three scales for abstinent patients. Although generally low PTSD scores were observed, 8% of our participants were found to be at risk of PTSD. Results of a binary logistic regression analysis indicated the presence of psychosocial COVID-19 factors (e.g., isolation, anxiety, and depression) as well as living alone as two major risk factors for relapse. Discussion: Our findings based on actual patient data support the anticipated negative consequences of the pandemic on persons with AUD. Crucially, our results regarding relapse emphasized psychosocial COVID-19 factors and isolation as especially challenging circumstances for persons with AUD, whereas economic and physiological health aspects seemed of minor impact on relapse. Our results reflect the initial stage of the pandemic, whereas long-term developments should be closely monitored.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19bcf42b0242bc9c34701e86c63d3349",
  "timestamp": "2025-05-15T03:07:32.015441"
}