{
  "id": 4776,
  "title": "Socio-demographic risk factors of mobility dysfunction and limitations in physical functioning disability among the elderly in Iran: A nationwide cross sectional survey",
  "abstract": "Objective: To examine self-reported mobility and limitation in physical functioning among the elderly and associated socio-demographic risk factors. Methods: The population-based cross-sectional study was conducted from January 2012 to January 2013 and comprised subjects from five provinces of Iran. The variables were measured using a questionnaire. Self-reported mobility disability and physical functioning disability were defined as having no problems in daily activities and physical tasks. Logistic regression was used to calculate the odds ratio for association of socio-demographic risk factors and outcomes. Results: Of the 1325 subjects, 636(48%) were men. The overall mean age was 69.14+/-7.37 years. Prevalence of mobility disability and limitation in physical functioning was 401(63%) and 553(87%) in men, and 524(76%) and 641(93%) in women. There was a significant association between mobility disability and family composition and satisfaction with financial situation and housing tenure in both genders (p< 0.05 each). Physical functioning had a significant relationship with family composition, and satisfaction with financial situations and housing tenure in men and women and population density in men and marital status in women (p< 0.05 each). Conclusion: The elderly had a high risk of disability. Social factors had more association with mobility disability and limitation in physical functioning and required specific social support.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19cd1e6b3a6f56e04f76f50313cd2fea",
  "timestamp": "2025-05-15T02:41:00.793363"
}