{
  "id": 5823,
  "title": "Measuring business impacts on the sustainability of European-listed firms",
  "abstract": "The Environmental, Social, and Governance (ESG) themes assume a central position in the foundation of business strategies and risk management for both private managers and financial institutions. Measuring the sustainability commitment of listed companies is required by regulators and Monetary Authorities and plays a pivotal role in the selection process for asset management companies. ESG ratings are used to assess the company's commitment to sustainability. This paper explores how a firm business, measured by balance sheet data, influences the ESG rating. In particular, we focus on Europe, which countries first paved the way for the sustainable transformation of the economy through various policies and initiatives. We employ a Machine Learning approach to discern the non-linear relationships between ESG ratings and corporate data aiming to identify the prime factors influencing the ESG ratings. We can assess potential country or business sector-based discrepancies by selecting a sample containing firms listed on the major European indices (AEX, BEL, CAC, DAX, FTSE, FTSE-MIB, IBEX, OMX). We find that the firm size, measured by total assets, and the carbon intensity are the variables that most influence the ESG rating in countries where the economic sectors rely mainly on the business cycle and economic conditions. For companies operating in the technology, financials, and industrial sectors, the main ESG driver is the asset turnover ratio, which is a measure of the efficiency with which a company generates revenues, and the EBIT to revenue, which is a measure of the operating margin asset turnover and the Earnings Before Interest and Taxes (EBIT) to revenue ratio. We discover diverse factors affecting ESG ratings across various European countries, highlighting the impact of each nation's policy on ESG commitment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19d4706796b0c9a290a2ffa5a318b69c",
  "timestamp": "2025-05-15T02:51:58.529883"
}