{
  "id": 6791,
  "title": "Clinical-genomic determinants of immune checkpoint blockade response in head and neck squamous cell carcinoma",
  "abstract": "BACKGROUND. Recurrent and/or metastatic (R/M) head and neck squamous cell carcinoma (HNSCC) is generally an incurable disease, with patients experiencing median survival of under 10 months and significant morbidity. While immune checkpoint blockade (ICB) drugs are effective in approximately 20% of patients, the remaining experience limited clinical benefit and are exposed to potential adverse effects and financial costs. Clinically approved biomarkers, such as tumor mutational burden (TMB), have a modest predictive value in HNSCC. METHODS. We analyzed clinical and genomic features, generated using whole-exome sequencing, in 133 ICB-treated patients with R/M HNSCC, of whom 69 had virus-associated and 64 had non-virus-associated tumors. RESULTS. Hierarchical clustering of genomic data revealed 6 molecular subtypes characterized by a wide range of objective response rates and survival after ICB therapy. The prognostic importance of these 6 subtypes was validated in an external cohort. A random forest-based predictive model, using several clinical and genomic features, predicted progression-free survival (PFS), overall survival (OS), and response with greater accuracy than did a model based on TMB alone. Recursive partitioning analysis identified 3 features (systemic inflammatory response index, TMB, and smoking signature) that classified patients into risk groups with accurate discrimination of PFS and OS. CONCLUSION. These findings shed light on the immunogenomic characteristics of HNSCC tumors that drive differential responses to ICB and identify a clinical-genomic classifier that outperformed the current clinically approved biomarker of TMB. This validated predictive tool may help with clinical risk stratification in patients with R/M HNSCC for whom ICB is being considered. FUNDING. Fundacion Alfonso Martin Escudero, NIH R01 DE027738, US Department of Defense CA210784, The Geoffrey Beene Cancer Research Center, The MSKCC Population Science Research Program, the Jayme Flowers Fund, the Sebastian Nativo Fund, and the NIH/NCI Cancer Center Support Grant P30 CA008748.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "19d8d4e2b7f0075ed2642f20bac0b103",
  "timestamp": "2025-05-15T03:01:31.455515"
}