{
  "id": 4246,
  "title": "Impacts of COVID-19 on global stock sectors: Evidence from time-varying connectedness and asymmetric nexus analysis",
  "abstract": "In this paper, we analyze the impact of the COVID-19 crisis on global stock sectors from two perspectives. First, to measure the effect of the COVID-19 on the volatility connectedness among global stock sectors in the time-frequency domain, we combine the time-varying connectedness and frequency connectedness method and focus on the total, directional, and net connectedness. The empirical results indicate a dramatic rise in the total connectedness among the global stock sectors following the outbreak of COVID-19. However, the high level of the total connectedness lasted only about two months, representing that the impact of COVID-19 is significant but not durable. Furthermore, we observe that the directional and net connectedness changes of different stock sectors during the COVID-19 pandemic are heterogeneous, and the diverse possible driving factors. In addition, the transmission of spillovers among sectors is driven mainly by the highfrequency component (short-term spillovers) during the full sample time. However, the effects of the COVID-19 outbreak also persisted in the long term. Second, we explore how the changing COVID-19 pandemic intensity (represented by the daily new COVID-19 confirmed cases and the daily new COVID-19 death cases worldwide) affect the daily returns of the global stock sectors by using the Quantile-on-Quantile Regression (QQR) methodology of Sim and Zhou (2015). The results indicate the different characteristics in responses of the stock sectors to the pandemic intensity. Specifically, most sectors are severely impacted by the COVID-19. In contrast, some sectors (Necessary Consume and Medical & Health) that are least affected by the COVID-19 pandemic (especially in the milder stage of the COVID-19 pandemic) are those that are related to the provision of goods and services which can be considered as necessities and substitutes. These results also hold after several robustness checks. Our findings may help understand the sectoral dynamics in the global stock market and provide significant implications for portfolio managers, investors, and government agencies in times of highly stressful events like the COVID19 crisis.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a0ee71730a4e45c13b75b1b0dd0971c",
  "timestamp": "2025-05-15T01:25:23.221498"
}