{
  "id": 8388,
  "title": "Adding Insult to Injury: Discontinuous Insurance Following Spine Trauma",
  "abstract": "Background: Spine trauma patients may represent a group for whom insurance fails to provide protection from catastrophic medical expenses, resulting in the transfer of financial burden onto individual families and public payers. This study compares the rate of insurance discontinuation for patients who underwent surgery for traumatic spine injury with and without spinal cord injury with the rate for matched control subjects. Methods: We used the MarketScan database to perform a retrospective cohort study of privately insured spine trauma patients who underwent surgery from 2006 to 2010. Kaplan-Meier survival analysis was used to assess the time to insurance discontinuation. Cox proportional-hazards regression was used to determine hazard ratios for insurance discontinuation among spine trauma patients compared with the matched control population. Results: The median duration of existing insurance coverage was 20.2 months for those with traumatic spinal cord injury, 25.6 months for those with traumatic spine injury without spinal cord injury, and 48.0 months for the matched control cohort (log-rank p < 0.0001). After controlling for multiple covariates, the hazard ratios for discontinuation of insurance were 2.02 (95% CI [confidence interval], 1.83 to 2.23) and 2.78 (95% CI, 2.31 to 3.35) for the trauma patients without and with spinal cord injury, respectively, compared with matched controls. Conclusions: Rates of insurance discontinuation are significantly higher for trauma patients with severe spine injury compared with the uninjured population, indicating that patients with disabling injuries are at increased risk for loss of insurance coverage.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a26dfa148f9ecf3c21e04a24ba7ccf5",
  "timestamp": "2025-05-15T03:18:19.576339"
}