{
  "id": 7012,
  "title": "Risk factors for death in children with severe hand, foot, and mouth disease in Hunan, China",
  "abstract": "Background: In recent years, outbreaks of hand, foot, and mouth disease (HFMD) have increased throughout East and Southeast Asia, especially in mainland China. The disease now presents as an increasingly serious public health threat in China.Methods: A case-control study was designed to examine risk factors associated with death from severe HFMD. A total of 553 severe HFMD cases were collected from the National Surveillance System.Results: Multifactorial logistic regression was used to analyse independent associations between potential influence factors and death from severe HFMD. We found that the migrants were more likely to die from severe HFMD than the resident population (OR=3.07, 95%CI: 1.39-8.32). Additionally, the children whose first visit was to a village-level clinic had a high risk of death from severe HFMD. Patients with EV71 infection or symptoms of convulsion, dyspnoea, cyanosis, coolness of extremities, and vomiting had an increased risk of death from severe HFMD. While breastfeeding children, having a confirmed diagnosis at the first visit to the hospital and with symptom of hyperarousal were identified as protective factors for death from severe HFMD.Conclusions: To reduce the mortality from severe HFMD, doctors and health care providers need to pay attention to the patients with EV71 infection or with symptoms of convulsion, dyspnoea, cyanosis, coolness of extremities, and vomiting. Health administration departments should pay more attention to the rational allocation of health resources. Furthermore, they should increase financial support and manpower in village-level health institutions.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a2a95eedf128f1003b84dbcc2c0621d",
  "timestamp": "2025-05-15T03:03:55.874417"
}