{
  "id": 4328,
  "title": "Evaluation of Seepage, Internal Erosion, and Remedial Alternatives for East Branch Dam, Elk County, Pennsylvania",
  "abstract": "East Branch Dam is a Pittsburgh District U. S. Army Corps of Engineers (COE) dam that nearly failed in 1957, several years after construction. The dam is a zoned embankment that is 56 m (184 ft) high and 526 m (1,725 ft) long. Its primary purpose is flood control. Following the observation of muddy water flowing from a rock drain at the downstream toe of the dam, soon after construction, emergency drilling through the embankment exposed a void that demanded lowering the pool and subsequent grouting. Localized grouting was accomplished to treat the void but did not involve a comprehensive repair of the dam. The 1957 near failure of East Branch Dam represents an excellent case history that provides dam designers and operators today insight into the mechanisms of internal erosion within an embankment dam, and it underscores the need to quickly take all necessary actions to protect the public. Since the 1957 emergency, the project has performed satisfactorily and has been closely monitored with a network of piezometers, weirs, and alignment-settlement pins. Even though evidence of further internal erosion has not reappeared, the fundamental conditions that caused the original problem were not corrected by the 1957 emergency repairs. Recently, the dam was evaluated under the COE Screening Portfolio Risk Assessment (SPRA) program. In light of the 1957 incident, conditions of active seepage, and high phreatic pressures within the embankment, the SPRA program assigned East Branch a Dam Safety Action Classification (DSAC) rating of II, generally indicating that failure could begin during normal operations or be initiated as the consequence of an event. A potential failure mode analysis (PFMA) was conducted in 2008 by the U. S. Bureau of Reclamation (USBR) as requested and participated in by the Pittsburgh District. The PMFA identified the potential for re-initiation of internal erosion at or near the cavity repair as the highest risk failure mode and a primary threat to public safety. Given these findings, the Pittsburgh District implemented a set of non-structural interim risk reduction measures (IRRM) in February 2008, including lowering of the pool to reduce risk of failure by an estimated 60 percent. The interim measures will allow the dam to operate safely until the COE determines the appropriate long-term remedy to address the structural deficiencies of East Branch Dam. In 2009, a joint COE-USBR PFMA was undertaken using procedures from both agencies. Current dam safety efforts involve reassessing potential failure modes, preparing a Dam Safety Modification Report, evaluating various remedial alternatives, and recommending a long-range repair plan for East Branch Dam. This paper examines the history of the dam, investigations performed, potential failure modes examined, and the range of remedial alternatives being considered.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a2c75aed0d663e046ac2c1ebbd6e817",
  "timestamp": "2025-05-15T01:25:50.604198"
}