{
  "id": 4410,
  "title": "Hospital costs associated with surgical site infections in general and vascular surgery patients",
  "abstract": "Background. Although much has been written about excess cost and duration of stay (DOS) associated with surgical site infections (SSIs) after cardiothoracic surgery, less has been reported after vascular and general surgery. We used data from the National Surgical Quality Improvement Program (NSQIP) to estimate the total cost and DOS associated with SSIs in patients undergoing general and vascular surgery. Methods. Using standard NSQIP practices, data were collected on patients undergoing general and vascular surgery at a single academic center between 2007 and 2009 and were merged with fully loaded operating costs obtained from the hospital accounting database. Logistic regression was used to determine which patient and preoperative variables influenced the occurrence of SSIs. After adjusting for patient characteristics, costs and DOS were fit to linear regression models to determine the effect of SSIs. Results. Of the 2,250 general and vascular surgery patients sampled, SSIs were observed in 186 inpatients. Predisposing factors of SSIs were male sex, insulin-dependent diabetes, steroid use, wound classification, and operative time (P < .05). After adjusting for those characteristics, the total excess cost and DOS attributable to SSIs were $10,497 (P < .0001) and 4.3 days (P < .0001), respectively. Conclusion. SSIs complicating general and vascular surgical procedures share many risk factors with SSIs after cardiothoracic surgery. Although the excess costs and DOS associated with SSIs after general and vascular surgery are somewhat less, they still represent substantial financial and opportunity costs to hospitals and suggest, along with the implications for patient care, a continuing need for cost-effective quality improvement and programs of infection prevention. (Surgery 2011;150:934-42.)",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a2e6697bfcd0fa5cf78c11978337a08",
  "timestamp": "2025-05-15T02:36:38.571630"
}