{
  "id": 4200,
  "title": "Surgeon Scientists Are Disproportionately Affected by Declining NIH Funding Rates",
  "abstract": "BACKGROUND: Obtaining National Institutes of Health (NIH) funding over the last 10 years has become increasingly difficult due to a decrease in the number of research grants funded and an increase in the number of NIH applications. STUDY DESIGN: National Institutes of Health funding amounts and success rates were compared for all disciplines using data from NIH, Federation of American Societies for Experimental Biology (FASEB), and Blue Ridge Medical Institute. Next, all NIH grants (2006 to 2016) with surgeons as principal investigators were identified using the National Institutes of Health Research Portfolio Online Reporting Tools Expenditures and Results (NIH RePORTER), and a grant impact score was calculated for each grant based on the publication's impact factor per funding amount. Linear regression and one-way ANOVA were used for analysis. RESULTS: The number of NIH grant applications has increased by 18.7% (p = 0.0009), while the numbers of funded grants (p < 0.0001) and R01s (p < 0.0001) across the NIH have decreased by 6.7% and 17.0%, respectively. The mean success rate of funded grants with surgeons as principal investigators (16.4%) has been significantly lower than the mean NIH funding rate (19.2%) (p = 0.011). Despite receiving only 831 R01s during this time period, surgeon scientists were highly productive, with an average grant impact score of 4.9 per $100,000, which increased over the last 10 years (0.15 +/- 0.05/year, p = 0.02). Additionally, the rate of conversion of surgeon scientist-mentored K awards to R01s from 2007 to 2012 was 46%. CONCLUSIONS: Despite declining funding over the last 10 years, surgeon scientists have demonstrated increasing productivity as measured by impactful publications and higher success rates in converting early investigator awards to R01s. (C) 2018 by the American College of Surgeons. Published by Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a44b883f6debf7803129ff93dd47a2a",
  "timestamp": "2025-05-15T01:24:51.417824"
}