{
  "id": 1809,
  "title": "Gaussian process regression modeling of wind turbines lightning incidence with LLS information",
  "abstract": "This paper presents a machine learning (ML) approach to wind turbine (WT) lightning incidence analysis in complex terrain, based on the information obtained from a lightning location system (LLS). A particular ML model of the WTs lightning incidence is developed, using Bayesian statistical learning and Gaussian process regression, and trained on the actual LLS data. The model is developed around a known proposition that the lightning strike frequency data are emanating from a Poisson stochastic process. It further makes use of an attractive radius concept of lightning attachment, employs a sophisticated analysis of the WT effective height-which leverages terrain elevation data-and introduces spatial autocorrelation of lightning strikes. It provides a probabilistic risk assessment of WT lightning damage, along with a statistical measures of the associated monetized financial losses. Proposed ML model benefits from the Bayesian ability to quantify uncertainty of model parameters, and employ hierarchical model structure that informs model parameters through the mutual higher-level hyperpriors. Proposed model enables both investors and insurance companies to asses risks associated with lightning incidence to WTs, considering historical LLS data and future wind farm installation locations. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a4da68891cf723ff5300c83077df542",
  "timestamp": "2025-05-15T02:07:25.786285"
}