{
  "id": 32,
  "title": "Advanced Supply Chain Management Using Adaptive Serial Cascaded Autoencoder with LSTM and Multi-Layered Perceptron Framework",
  "abstract": "Supply chain management is essential for businesses to handle uncertainties, maintain efficiency, and stay competitive. Financial risks can arise from various internal and external sources, impacting different supply chain stages. Companies that effectively manage these risks gain a deeper understanding of their procurement activities and implement strategies to mitigate financial threats. This paper explores financial risk assessment in supply chain management using advanced deep learning techniques on big data. The Adaptive Serial Cascaded Autoencoder (ASCA), combined with Long Short-Term Memory (LSTM) and Multi-Layered Perceptron (MLP), is used to evaluate financial risks. A data transformation process is used to clean and prepare financial data for analysis. Additionally, Sandpiper Galactic Swarm Optimization (SGSO) is employed to optimize the deep learning model's performance. The SGSO-ASCALSMLP-based financial risk prediction model demonstrated superior accuracy compared to traditional methods. It outperformed GRU (gated recurrent unit)-ASCALSMLP by 3.03%, MLP-ASCALSMLP by 7.22%, AE-LSTM-ASCALSMLP by 10.7%, and AE-LSTM-MLP-ASCALSMLP by 10.9% based on F1-score performance. The SGSO-ASCALSMLP model is highly efficient in predicting financial risks, outperforming conventional prediction techniques and heuristic algorithms, making it a promising approach for enhancing financial risk management in supply chain networks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a4d4c4439125a8d87a63db3e5455b14",
  "timestamp": "2025-05-15T01:33:11.277421"
}