{
  "id": 5781,
  "title": "Consumer expertise matters in price negotiation An empirical analysis of the determinants of mortgage loan prices in Spain prior to the financial crisis",
  "abstract": "Purpose - The main purpose of this paper is to study the effect of consumer expertise on mortgage loan prices. We argue that consumer expertise should affect price due to two reasons: (1) loan mortgage prices in non-price-regulated settings are usually the result of a bank-customer negotiation process; and (2) a mortgage loan is a complex product. Design/methodology/approach - Data on mortgage loan prices were used for a sample of 1,055 households for 2005 (Bank of Spain Survey of Household Finances, EFF-2005). Findings - The regression results indicate that consumer expertise-related metrics are highly significant as predictors of mortgage loan prices. Findings also indicate that cost-related variables and a measure of risk with low discrimination power (i.e. having a permanent employment contract, which accounts for 70 per cent of contracts in Spain) affect price. Surprisingly, more sophisticated measures of credit risk do not have such a significant impact on mortgage prices. Research limitations/implications - Empirical results refer to the credit conditions prior to the financial crisis and could shed some light on the factors that led to it. Practical implications -Findings seem to indicate that, in the period under study, bank managers prioritized capturing new business in the short-term against normative prescriptions, which suggest that price should be credit-risk adjusted (financial literature) and long-term consumer potential adjusted (marketing literature). The post-2008 difficult economic situation of Spanish banks (linked to an excessive portfolio of mortgage loans granted at very low prices) shows that these strategies were wrong. Originality/value - An uncommon perspective was adopted. The importance of consumer expertise-related variables on price has been underemphasized by prior research. The effect of consumer expertise is assessed by using a large and comprehensive database.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a59b4743462e14fe0c5294cec3ff516",
  "timestamp": "2025-05-15T02:51:30.022966"
}