{
  "id": 8154,
  "title": "Description of inter-institutional referrals after admission for labor and delivery: a prospective population based cohort study in rural Maharashtra, India",
  "abstract": "Background: In 2008, the Indian government introduced financial assistance to encourage health facility deliveries. Facility births have increased, but maternal and neonatal morbidity and mortality have not decreased raising questions about the quality of care provided in facilities and access to a quality referral system. We evaluated the potential role of inter-institutional transfers of women admitted for labor and delivery on adverse maternal and neonatal outcomes in an ongoing prospective, population-based Maternal and Newborn Health Registry in Central India. Methods: Pregnant women from 20 rural Primary Health Centers near Nagpur, Maharashtra were followed throughout pregnancy and to day 42 post-partum. Inter-institutional referral was defined as transfer of a woman from a first or second level facility where she was admitted for labor and delivery to facility providing higher level of care, after admission to the day of delivery. Maternal mortality, stillbirth, early and late neonatal mortality were compared in mothers who were and were not referred. Factors associated with inter-institutional referral were analyzed using multivariable models with generalized estimating equations, adjusted for clustering at the level of the Primary Health Center. Results: Between June 2009 and June 2013, 3236 (9.4%) of 34,319 women had inter-institutional referral. Factors associated with referrals were maternal age (adjusted Relative Risk or aRR 1.1; 1.0-1.2); moderate or severe anemia (aRR 1.2; 1.2-1.4), gestational age <37 weeks (aRR 1.16; 1.05-1.27), multiple gestation (aRR 1.6; 1.2-2.1), absent fetal heart rate (aRR 1.7; 1.3-2.2), primigravida (aRR 1.4; 1.3, 1.6), primigravida with any pregnancy related maternal condition such as obstructed or prolonged labor; major antepartum or post-partum hemorrhage, hypertension or preeclampsia and breech, transverse or oblique lie (aRR 4.7; 3.8, 5.8), multigravida with any pregnancy related conditions (aRR 4.2; 3.4-5.2). Stillbirths, early neonatal, late neonatal and early infant deaths occurred in 7.3% referred mothers vs. 3.7% of not referred. Conclusions: Almost 10% of the women had an inter-institutional referral and still birth or neonatal deaths were doubled in referred women. Conditions associated with referral were often known before onset of labor and delivery. Improvements in maternal and neonatal outcomes will likely require pregnant women with conditions associated with referral to be directly admitted at facilities equipped to care for complicated pregnancies and at risk neonates, as well as prompt detection and transfer those who develop at risk conditions during labor and delivery.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a5b8a5dcf4d479006de694de338b358",
  "timestamp": "2025-05-15T03:15:38.470993"
}