{
  "id": 6124,
  "title": "Extinction risk and threats to plants and fungi",
  "abstract": "Societal Impact Statement There is increasing awareness that plants and fungi, as natural solutions, can play an important role in tackling ongoing global environmental challenges. We illustrate how understanding current and projected threats to plants and fungi is necessary to manage and mitigate risks, while building awareness of gaps and bias in current assessment coverage is essential to adequately prioritize conservation efforts. We highlight the state of the art in conservation science and point to current methods of assessment and future studies needed to mitigate species extinction. SummaryPlant and fungal biodiversity underpin life on earth and merit careful stewardship in an increasingly uncertain environment. However, gaps and biases in documented extinction risks to plant and fungal species impede effective management. Formal extinction risk assessments help avoid extinctions, through engagement, financial, or legal mechanisms, but most plant and fungal species lack assessments. Available global assessments cover c. 30% of plant species (ThreatSearch). Red List coverage overrepresents woody perennials and useful plants, but underrepresents single-country endemics. Fungal assessments overrepresent well-known species and are too few to infer global status or trends. Proportions of assessed vascular plant species considered threatened vary between global assessment datasets: 37% (ThreatSearch), and 44% (International Union for Conservation of Nature Red List of Threatened Species). Our predictions, correcting for several quantifiable biases, suggest that 39% of all vascular plant species are threatened with extinction. However, other biases remain unquantified, and may affect our estimate. Preliminary trend data show plants moving toward extinction. Quantitative estimates based on plant extinction risk assessments may understate likely biodiversity loss: they do not fully capture the impacts of climate change, slow-acting threats, or clustering of extinction risk, which could amplify loss of evolutionary potential. The importance of extinction risk estimation to support existing and emerging conservation initiatives is likely to grow as threats to biodiversity intensify. This necessitates urgent and strategic expansion of efforts toward comprehensive and ongoing assessment of plant and fungal extinction risk.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a642cd886b8a3398b0703d6f7403cb4",
  "timestamp": "2025-05-15T02:55:12.850954"
}