{
  "id": 4142,
  "title": "Renewable Energy Consumption in the Context of Economic Development, CO2 Emissions and Implications for Public Administration: The Case of Visegrad Group Countries",
  "abstract": "Renewable energy consumption has gained growing importance in the world energy consumption portfolio over recent years. One of the reasons is the increasingly negative development of climate change. The research carried out in this paper aims to discern whether the examined economic indicator (GDP per capita) and the environmental indicator (CO2 emissions per capita) affect the renewable energy consumption in the region of the Visegrad Group (V4 - Czech Republic, Hungary, Poland, and Slovak Republic) countries, and to draw implications for public administration in the given issue. The fixed effects panel regression model was used to verify the mentioned relationships between variables from 19902020. The results show that the level of the share of renewable energy consumption on the total energy consumption in the region of the V4 countries can be affected by the GDP per capita (positive relationship validated) and the CO2 emissions per capita (negative relationship validated). These results are mostly in line with the findings of other researchers conducted on different samples of countries, although some differences can be noted, especially regarding the direction of the relationship. The implications of the research results are presented on three levels: practical implications for the business sector, emphasis placed on political implications for public administration, and theoretical implications that lay the foundation for further research. The main limitation of the research results comes from the sample used in V4 countries and, thus, from the limited possibilities of generalizing the results. The direction of further research in the addressed issue will include a larger number of countries in the research and the use of various quantitative and qualitative research methods.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a66a042a6a6ca845d23ebb36f9665a6",
  "timestamp": "2025-05-15T01:24:25.316680"
}