{
  "id": 6965,
  "title": "Nutritional status and its associated factors among the geriatric population in outpatient clinics of a tertiary care hospital in Karachi, Pakistan",
  "abstract": "Context:Elderly malnourishment remains a largely unexplored area, despite having a significant effect on the level of mortality and morbidity. This study aims to explore the level of malnourishment and identify those at risk of malnourishment among the elderly population presenting to a teaching hospital in Karachi.Aims:To assess nutritional status and its associated factors among the elderly population.Settings and Design:This study was conducted in outpatient clinics of family medicine at a teaching hospital and its outreach primary care centres from December 2020 to December 2021. The study design was cross-sectional.Materials and Methods:The prevalence of malnourishment and at risk of malnourishment with its associated factors were assessed using the Mini-Nutritional Assessment (MNA) scale as a screening tool among the elderly population (65 years and above) presenting to the family medicine OPDs of a teaching hospital.Statistical Analysis:Data were analysed using the Statistical Package for the Social Sciences (SPSS) version 21.Results:A total of 191 patients were recruited into the study, and the majority of them were males (66.5%). Median age and body mass index (BMI) of participants were 70 (IQR = 74-65) years and 24 (IQR = 27-21) kg/m2, respectively. The median MNA scores were 23.5 (IQR = 20.5-26). A total of 92 (48.2%) participants were found to have a normal nutritional status, 81 (42.4%) were found to be at a risk of malnourishment, and 18 (9.4%) were malnourished. On the multivariable regression model, BMI and ability to manage finances were significantly associated with malnourishment.Conclusion:This study shows an alarmingly high rate of the elderly population at risk of developing malnourishment, and financial independence and increasing BMI were associated with a decreased risk of malnourishment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a6a06cf77a54086e75928721243d65f",
  "timestamp": "2025-05-15T03:03:55.672889"
}