{
  "id": 2453,
  "title": "MARKOWITZ'S MODEL ON AN EXTENDED SET OF INVESTMENT OPPORTUNITIES",
  "abstract": "Purpose: construction of a Markowitz model with the use of utility function, values of which are determined not by two, but by three arguments, which describe an extended set of investment opportunities. Discussion: When Markowitz built his model, he considered only two characteristics of securities - profitability and risk. This imposed certain limitations on the conclusions that result from the modeling of the optimal portfolio. The graph of the front of effective portfolios allows you to understand the relationship between the expected return and risk. The higher the expectations of the investor, the higher the risk. This understanding of this relationship depends on the point of minimum risk that remains unknown. Obviously, a refinement of the model is required. So, in constructing his version of the model, Sharpe used not only the characteristics of securities, but also the characteristics of the market in the form of a market index. This changed the process of the model construction. Instead of the observed values of the return on assets, their regression equations were used. Risk was divided into two components: systematic and the diversified. The term portfolio beta appeared. But the meaning of the front of effective portfolios remains the same. A new variable in the diagonal model of Sharp has a passive role, but its introduction has shown the possibility of applying new principles of building a portfolio of securities based on econometric modeling. This engendered econometrical models of new type, which could be useful in the process of formation of the securities portfolio. Results: under the assumption that there is a hypothesis of alternative expectations, a model of binary choice was used to describe the dependence of the asset's profitability on the average yield of the market. An analysis based on the portfolio model of securities showed that the minimum risk is reached at the point of a set of effective portfolios corresponding to the market opportunities.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a6a5ff5085b775219e393e30315083c",
  "timestamp": "2025-05-15T01:07:02.983532"
}