{
  "id": 8455,
  "title": "Forest landowner demand for prescribed fire as an ecological management tool in Pennsylvania, USA",
  "abstract": "Prescribed burning is important for the ecological health of fire-dependent forests, however, there is little eco-nomic research examining landowner preferences for living with fire in the age of the Anthropocene. To un-derstand the value of reintroducing fire on the landscape we assessed forest owner willingness to pay (WTP) for various prescribed fire programs in Pennsylvania, where natural fire occurs infrequently. Survey responses were collected from 243 forest owners using Likert scales and choice experiment questions resulting in a 44% response rate. Most respondents were classified as having limited experience with prescribed fire, but many also had low risk perceptions about prescribed fire and high trust in prescribed fire implementors. A majority (66%) elected to enroll in at least one of 16 proposed burn programs and almost a quarter of landowners were willing to pay up to $200 per acre. Using mixed logistic regression methods, mean WTP was estimated to range from $11 to $19 per acre, but varied significantly under different program alternatives. Respondents overall preferred programs that helped maintain ecosystem health and biodiversity, and offered cost-share, reduced liability, and access to burn bosses. Demographic characteristics were also important predictors of enrollment (i.e., income level, age, and involvement in assistance programs). We conclude that forest owners in Pennsylvania see prescribed fire as potentially helping them meet priority management objectives and supporting cultural values about forest stewardship. Technical and financial assistance for forest owners will be important for expanding the use of prescribed fire in Pennsylvania.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a7379fa059b779704d66df37073aeab",
  "timestamp": "2025-05-15T03:18:51.713874"
}