{
  "id": 8413,
  "title": "The Rising Rate of Rural Hospital Closures",
  "abstract": "PurposeSince 2010, the rate of rural hospital closures has increased significantly. This study is a preliminary look at recent closures and a formative step in research to understand the causes and the impact on rural communities. MethodsThe 2009 financial performance and market characteristics of rural hospitals that closed from 2010 through 2014 were compared to rural hospitals that remained open during the same period, stratified by critical access hospitals (CAHs) and other rural hospitals (ORHs). Differences were tested using Pearson's chi-square (categorical variables) and Wilcoxon rank test of medians. The relationships between negative operating margin and (1) market factors and (2) utilization/staffing factors were explored using logistic regression. FindingsIn 2009, CAHs that subsequently closed from 2010 through 2014 had, in general, lower levels of profitability, liquidity, equity, patient volume, and staffing. In addition, ORHs that closed had smaller market shares and operated in markets with smaller populations compared to ORHs that remained open. Odds of unprofitability were associated with both market and utilization factors. Although half of the closed hospitals ceased providing health services altogether, the remainder have since converted to an alternative health care delivery model. ConclusionsFinancial and market characteristics appear to be associated with closure of rural hospitals from 2010 through 2014, suggesting that it is possible to identify hospitals at risk of closure. As closure rates show no sign of abating, it is important to study the drivers of distress in rural hospitals, as well as the potential for alternative health care delivery models.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a7a861a483537238b04542d462f4bfd",
  "timestamp": "2025-05-15T03:18:51.513040"
}