{
  "id": 8820,
  "title": "Symptoms and risk factors for long COVID in Tunisian population",
  "abstract": "BackgroundThe COVID-19 pandemic has presented various challenges, one of which is the discovery that after the acute episode, around 30% of patients experience persistent symptoms or develop new ones, now known as long COVID. This new disease has significant social and financial impacts. The objective is to determine the prevalence of long COVID in the Tunisian population and identify its predictive factors.MethodsThis was a cross-sectional study conducted among Tunisians who were infected with COVID-19 between March 2020 and February 2022. An online self-administered questionnaire was distributed through social media, radio, and television channels over the course of one month (February 2022). Long COVID was defined as the persistence of existing symptoms or the development of new symptoms within three months after onset, lasting for at least two months, and with no differential diagnosis. We performed univariate and multivariate analyses using binary stepwise logistic regression with a significance level set at 5%.ResultsA total of 1911 patients participated in our study, and the prevalence of long COVID was 46.5%. The two most frequent categories were general and neurological post-COVID syndrome, with a prevalence of 36.7% each. The most commonly observed symptoms were fatigue (63.7%) and memory problems (49.1%). In the multivariate analysis, the predictive factors for long COVID were female gender and age of 60 years or older, while complete anti-COVID vaccination was found to be a protective factor.ConclusionsOur study found that complete vaccination was a protective factor against long COVID, while female gender and age of 60 years or older were identified as the main risk factors. These findings are consistent with studies conducted on other ethnic groups. However, many aspects of long COVID remain unclear, including its underlying mechanisms, the identification of which could guide the development of potential effective treatments.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a8612460e9ec4c266e72e71915b3d5e",
  "timestamp": "2025-05-15T03:22:57.861835"
}