{
  "id": 5242,
  "title": "A Generalized Entropy Approach to Portfolio Selection under a Hidden Markov Model",
  "abstract": "This paper develops a dynamic portfolio selection model incorporating economic uncertainty for business cycles. It is assumed that the financial market at each point in time is defined by a hidden Markov model, which is characterized by the overall equity market returns and volatility. The risk associated with investment decisions is measured by the exponential Renyi entropy criterion, which summarizes the uncertainty in portfolio returns. Assuming asset returns are projected by a regime-switching regression model on the two market risk factors, we develop an entropy-based dynamic portfolio selection model constrained with the wealth surplus being greater than or equal to the shortfall over a target and the probability of shortfall being less than or equal to a specified level. In the empirical analysis, we use the select sector ETFs to test the asset pricing model and examine the portfolio performance. Weekly financial data from 31 December 1998 to 30 December 2018 is employed for the estimation of the hidden Markov model including the asset return parameters, while the out-of-sample period from 3 January 2019 to 30 April 2022 is used for portfolio performance testing. It is found that, under both the empirical Sharpe and return to entropy ratios, the dynamic portfolio under the proposed strategy is much improved in contrast with mean variance models.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a8d69e8a317a69c87e799b77d6b1e88",
  "timestamp": "2025-05-15T02:45:47.421558"
}