{
  "id": 6679,
  "title": "Endoscopist-Directed Sedation Rarely Fails: Implications for the Value of Anesthesia Assistance for Routine GI Endoscopy",
  "abstract": "OBJECTIVES: Use of anesthesia-assisted (AA) sedation for routine gastrointestinal (GI) endoscopy has increased markedly. Clinical uncertainty about which patients are most likely to benefit from AA sedation contributes to this increased use. We aimed to estimate the prevalence of failed endoscopist-directed sedation and to identify patients at elevated risk of failing standard sedation. STUDY DESIGN: Retrospective longitudinal study of national Veterans Health Administration (VA) data of all patients who underwent esophagogastroduodenoscopy and/or colonoscopy in 2009-2013. METHODS: Using multivariable logistic regression, we sought to identify patient and procedural risk factors for failed sedation. Failed sedation cases were identified electronically and validated by chart review. RESULTS: Of 302,247 standard sedation procedures performed at VA facilities offering AA sedation, we identified 313 cases of failed sedation (prevalence, 0.10%). None of the factors found to be associated with increased risk of failed sedation (eg, high-dose opioid use, younger age) had an odds ratio greater than 3. Even among the highest-risk patients (top decile), the prevalence of failed sedation was only 0.29%. CONCLUSIONS: Failed sedation among patients undergoing routine outpatient GI endoscopy with standard sedation is very rare, even among patients at highest risk. This suggests that concerns regarding failed sedation due to commonly cited factors such as chronic opioid use and obesity do not justify forgoing standard sedation in favor of AA sedation in most patients. It also suggests that use of AA sedation is generally unnecessary. Reinstatement of endoscopistdirected sedation, rather than AA sedation, as the default sedation standard is warranted to reduce low-value care and prevent undue financial burdens on patients.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a976b2939abc85daa1bea9c32b4bf5d",
  "timestamp": "2025-05-15T03:00:35.381932"
}