{
  "id": 2615,
  "title": "Female CEOs and Core Earnings Quality: New Evidence on the Ethics Versus Risk-Aversion Puzzle",
  "abstract": "The question of whether females tend to act more ethically or risk-averse compared to males is an interesting ethical puzzle. Using a large sample of US firms over the 1992-2014 period, we investigate the effect that the gender of a chief executive officer (CEO) has on earnings management using classification shifting. We find that the pre-Sarbanes-Oxley (SOX) Act period was characterized by high levels of classification shifting by both female and male CEOs, but the magnitude of such practices is, surprisingly, significantly higher in firms with female CEOs than in those with male CEOs. By contrast, our results suggest that following the passage of the punitive SOX Act, classification shifting by female CEOs declined significantly, whilst it remained pervasive in firms with male CEOs. This suggests that the observable differences in financial reporting behavior between male and female CEOs seem to be because female CEOs are more risk-averse, but not necessarily more ethically sensitive than their male counterparts are. The central tenets of our findings remain unchanged after several additional checks, including controlling for alternative earnings management techniques, corporate governance mechanisms, CEO and chief financial officer characteristics and propensity score-matching.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1a9adfdb5cc4cfe6b163a70ba1c767f1",
  "timestamp": "2025-05-15T02:17:32.056736"
}