{
  "id": 5705,
  "title": "Catastrophic Health Care Expenditure Following Brachial Plexus Injury",
  "abstract": "Purpose Brachial plexus injuries (BPIs) are devastating to patients not only functionally but also financially. Like patients experiencing other traumatic injuries and unexpected medical events, patients with BPIs are at risk of catastrophic health expenditure (CHE) in which out-of-pocket health spending exceeds 40% of postsubsistence income (income remaining after food and housing expenses). The individual financial strain after BPIs has not been previously quantified. The purpose of this study was to assess the proportion of patients with BPIs who experience risk of CHE after reconstructive surgery. Methods Administrative databases were used from 8 states to identify patients who underwent surgery for BPIs. Demographics including age, sex, race, and insurance payer type were obtained. Inpatient billing records were used to determine the total surgical and inpatient facility costs within 90 days after the initial surgery. Due to data constraints, further analysis was only conducted for privately-insured patients. The proportion of patients with BPIs at risk of CHE was recorded. Predictors of CHE risk were determined from a multivariable regression analysis. Results Among 681 privately-insured patients undergoing surgery for BPIs, nearly one-third (216 [32%]) were at risk of CHE. Black race and patients aged between 25 and 39 years were significant risk factors associated with CHE. Sex and the number of comorbidities were not associated with risk of CHE. Conclusions Nearly one-third of privately-insured patients met the threshold for being at risk of CHE after BPI surgery.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1aaf04d865d1c408e3d033f7fcb9ea0c",
  "timestamp": "2025-05-15T02:50:21.350881"
}