{
  "id": 1737,
  "title": "Financial risk assessment of imbalanced data based on nonlinear causal time-series network",
  "abstract": "Financial risk assessment holds great significance in the modern economic system, offering crucial decision-making support for enterprises and regulatory agencies. However, capturing the complex interactions between market entities poses a considerable challenge. Additionally, when data is imbalanced, traditional methods tend to favor majority classes while overlooking minority class samples, leading to reduced accuracy in risk assessment. To address these challenges, we redefine the problem as market entity risk assessment based on a Nonlinear Causal Time-series Network (NCTN). NCTN is constructed from both financial and time-series data to represent market entity attributes and the implicit relationships between entities. Based on this network, we propose a risk assessment model for directed, imbalanced graphs, called the Graph Neural Network with Symmetrical Multi-field Feature Aggregation Encoder and Imbalanced Graph Node Classifier (SIGNN). SIGNN achieves multi-level risk assessment by aggregating symmetric multi-field node features and generating hybrid minority-class graph nodes. Experimental results on the Compfinancial, Amazon-photo, and ogbn-arxiv datasets demonstrate that SIGNN outperforms stateof-the-art baseline methods, achieving a macro-F1 score that surpasses the next best by 4.45 %, 0.88 %, and 3.95 %, respectively, and a G-mean score that exceeds the next best by 1.99 %, 1.02 %, and 0.76 %, respectively. The findings of this paper provide practical insights for financial risk assessment and contribute to the prevention of major risks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ab26e1b7d281c1e18dfc61bdb8cdeda",
  "timestamp": "2025-05-15T02:06:52.694251"
}