{
  "id": 2206,
  "title": "Enhancement of transparency and accuracy of credit scoring models through genetic fuzzy classifier",
  "abstract": "Credit risk evaluation systems play an important role in the financial decision-making by enabling faster credit decisions, reducing the cost of credit analysis and diminishing possible risks. Credit scoring is the most commonly used technique for evaluating the creditworthiness of the credit applicants. The credit models built with this technique should satisfy two important criteria, namely accuracy, which measures the capability of predicting the behaviour of the customers, and transparency, which reflects the ability of the model to describe the input-output relation in an understandable way. In our paper, two credit scoring models are proposed using two types of fuzzy systems, namely Takagi-Sugeno (TS) and Mamdani types. The accuracy and transparency of these two models have been optimised. The TS fuzzy credit scoring model is generated using subtractive clustering method while the Mamdani fuzzy system is extracted using fuzzy C-means clustering algorithm. The accuracy and transparency of the two resulting fuzzy credit scoring models are optimised using two multi-objective evolutionary techniques. The potential of the proposed modelling approaches for enhancing the transparency of the credit scoring models while maintaining the classification accuracy is illustrated using two benchmark real world data sets. The TS fuzzy system is found to be highly accurate and computationally efficient while the Mamdani fuzzy system is highly transparent, intuitive and humanly understandable.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ab82f76d17832eb03f630bfb7d9f4a2",
  "timestamp": "2025-05-15T02:12:17.466767"
}