{
  "id": 9147,
  "title": "Physical injuries and burns among refugees in Lebanon: implications for programs and policies",
  "abstract": "Background Refugees are prone to higher risks of injury due to often austere living conditions, social and economic disadvantages, and limited access to health care services in host countries. This study aims to systematically quantify the prevalence of physical injuries and burns among the refugee community in Western Lebanon and to examine injury characteristics, risk factors, and outcomes. Methods We conducted a cluster-based population survey across 21 camps in the Beqaa region of Lebanon from February to April 2019. A modified version of the 'Surgeons Overseas Assessment of Surgical Need (SOSAS)' tool (Version 3.0) was administered to the head of the refugee households and documented all injuries sustained by family members over the last 12 months. Descriptive and univariate regression analyses were performed to understand the association between variables. Results 750 heads of households were surveyed. 112 (14.9%) households sustained injuries in the past 12 months, 39 of which (34.9%) reported disabling injuries that affected their work and daily living. Injuries primarily occurred inside the tent (29.9%). Burns were sustained by at least one household member in 136 (18.1%) households in total. The majority (63.7%) of burns affected children under 5 years and were mainly due to boiling liquid (50%). Significantly more burns were reported in households where caregivers cannot lock children outside the kitchen while cooking (25.6% vs 14.9%, p-value = 0.001). Similarly, households with unemployed heads had significantly more reported burns (19.7% vs. 13.3%, p value = 0.05). Nearly 16.1% of the injured refugees were unable to seek health care due to the lack of health insurance coverage and financial liability. Conclusions Refugees severely suffer from injuries and burns, causing substantial human and economic repercussions on the affected individuals, their families, and the host healthcare system. Resources should be allocated toward designing safe camps as well as implementing educational awareness campaigns specifically focusing on teaching about heating and cooking safety practices.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ac069e074b7573de7726919af00c1c7",
  "timestamp": "2025-05-15T03:25:54.653931"
}