{
  "id": 8141,
  "title": "Applications of Industry 4.0 Technologies in Warehouse Management: A Systematic Literature Review",
  "abstract": "Background: Recent literature indicates that warehouse management costs account for a significant portion of overall logistics costs in companies. Warehousing requires the classification, controlling and management of inventory as well as processing of related information. Therefore, adopting efficient and reasonable warehouse management measures to achieve effective management and control of materials is a key means to flexibly adjusting the supply and demand of storage materials and reduce operating costs. There remains a gap in the understanding of benefits and barriers to the full adoption of Industry 4.0 technologies and decision support systems (DSSs) in warehouse management. Methods: This work applies a systematic literature review methodology of recent implementation case studies to analyze documented barriers and benefits of Industry 4.0 technology adoption in warehouse management. For analysis, benefits and barriers are ranked in order of importance using Pareto analysis based on their frequency of occurrence. Results: Improved process efficiency, the availability of real-time data, added competitive advantage and the ability to integrate business activities digitally are the top four most important benefits of implementing Industry 4.0 technologies and decision support systems in warehouse management. The prominent barriers to implementation are high life cycle cost, challenging physical environment/layout, inadequate supporting resource constraints, increased security risk and high energy consumption. Conclusions: Barriers to implementing Industry 4.0 technologies are interrelated in nature and prevent businesses from realizing the full benefit of implemented Industry 4.0 technologies. Adequate financial support, new knowledge and skills are required to be able to ensure the successful implementation of Industry 4.0 in warehousing management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ac56f350dfb8771d5c0f4fb66bc8056",
  "timestamp": "2025-05-15T03:15:38.414884"
}