{
  "id": 4143,
  "title": "Doing good in the right place: city residents' evaluations of professional football teams' local (vs. distant) corporate social responsibility activities",
  "abstract": "Research question: If recipients of corporate social responsibility (CSR) campaigns perceive them to be motivated by philanthropic (vs. profit) reasons, CSR increases important outcome variables. This study looks at moderators of this relationship in the context of professional football teams based on attribution and egocentrism theory: one CSR-specific factor (i.e. the geographical focus of CSR) and one organization-specific factor (i.e. the division in which the teams are playing).Research methods: The study applied a between-participant design, manipulating both the geographical focus of the initiative (local vs. distant CSR initiative) and the professional football teams that carried out the CSR initiative (first-division vs. third-division team). Both teams were located in Munich, where 444 city residents participated in the study. Regression-based moderation analyses were used to test the hypotheses.Results and findings: Perceived philanthropic motivation for CSR has a more positive effect on outcome variables - including the team's CSR perception, attitudes toward the team, and behavioral intentions - for the first-division team than for the third-division team, and this interaction effect is present (absent) in first-division team's distant (local) CSR activities. The relationship between perceived philanthropic motivation and outcome variables is unaffected by the proximity of the social cause supported by the third-division team.Implications: Professional football teams are encouraged to actively manage their portfolio of CSR activities to increase CSR outcomes as perceived by city residents. Higher-division (vs. lower-division) teams should make sure that CSR is perceived to be motivated by philanthropy (as opposed to self-interest), particularly when CSR takes place at distant locations.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1acfd886558aabe773e8a3b18830d9af",
  "timestamp": "2025-05-15T01:24:25.318504"
}