{
  "id": 807,
  "title": "Estimation of soil pH using PXRF spectrometry and Vis-NIR spectroscopy for rapid environmental risk assessment of soil heavy metals",
  "abstract": "Environmental risk of heavy metals (HMs) in soil is commonly assessed by the different risk screening values of HMs under different pH based on soil environmental quality standards. To explore and establish a reliable, rapid and cost-effective method for detailed soil environmental quality survey with high-density sampling in the large-scale area is of significance for theoretical and practical research. In present study, using data from Yunnan Province, China, rapid analysis of soil HMs were conducted via portable X-ray fluorescence (PXRF) spectrometry, and that of soil pH was estimated by applying PXRF and visible nearinfrared reflectance (Vis-NIR) spectroscopy data to partial least-squares regression (PLSR) and support vector machine regression (SVMR). Then we compared soil HM contamination grades calculated by conventional laboratory analysis data with those of rapid analysis data. It was found that soil HMs (i.e., As, Pb, Cu, and Zn) were successfully estimated by PXRF with high coefficient of determination (R-2) above 0.97 (P < 0.001). SVMR with fused sensor dataset (here PXRF and Vis-NIR) provided the best predictive model for soil pH estimation (R-2 = 0.86; the ratio of performance to deviation (RPD) = 2.21; the ratio of performance to interquartile distance (RPIQ) = 3.09). The Kappa coefficient of the classification was 0.91, a very high-level consistency between the assessment of soil HM contamination grades calculated by rapid analysis data and that of conventional laboratory analysis data. Therefore, our study suggested a promising method to rapidly detect soil HM contamination under different pH intervals, which would considerably reduce the financial burden of detailed soil HM survey great sampling number in large-scale areas. (C) 2019 Published by Elsevier B.V. on behalf of Institution of Chemical Engineers.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1add8dfb8ec9026d05e26f78ef521511",
  "timestamp": "2025-05-15T01:55:08.117837"
}