{
  "id": 2262,
  "title": "Evaluating the likelihood of slope failure in ageing earthworks using Bayesian updating",
  "abstract": "Earthwork assets, including cut slopes and embankments, are essential components of the infrastructure supporting road and rail transportation networks. Asset owners must assess the stability of these slopes as they deteriorate, to prevent unwanted slope failures. Assessing the stability of individual earthworks within a portfolio using slope stability analyses can be expensive and time consuming. Hence, a Bayesian logistic regression model was developed to evaluate the probability of slope failure, using training data from published case histories of slope failures. The Bayesian model was then used to assess the probability of failure for the more specific case of clay cut slopes within a railway earthwork asset portfolio owned by Network Rail (NR) in the UK. The portfolio includes earthworks at various stages of degraded strength and with different drainage conditions. The results from models with material properties that were equivalent to those for the deteriorated strength of clays compared most closely with clay cut slope failures within the NR data set. Steeper slopes (>35(degrees)) had the highest probability of failure, regardless of slope height, and drainage condition. However, for shallower slopes, poorly drained slopes had a approximate to 20% higher probability of failure than well-drained slopes.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ae96eadb359d4acde180d10128f0ab1",
  "timestamp": "2025-05-15T01:05:04.475988"
}