{
  "id": 3277,
  "title": "Innovations in Risk Management IFRS 9 Hedge Accounting",
  "abstract": "Purpose: Many companies are now considering the International Financial Reporting Standard IFRS 9, the new and relevant accounting standard on financial instruments and hedge accounting. IFRS 9 addresses all the relevant aspects on the accounting for financial instruments, including classification and measurement, impairment of financial assets and general hedge accounting, followed by the macro hedge accounting model which will be important for risk management. Approach: This publication presents a number of important points and focuses on just one topic in IFRS 9: the hedge accounting. IFRS 9 aligns hedge accounting more closely with risk management, establishes a more principle-based approach to hedge accounting and addresses inconsistencies and weaknesses in the hedge accounting model in IAS 39. Findings: We present the benefits of the new approach compared with the older IAS 39 approach. The International Accounting Standard Board (IASB) has fundamentally reconsidered the purpose and objective of Hedge Accounting and decided that the objective of Hedge Accounting should be to reflect the effects of the modern risk management activities in the financial statements. Practical implications: As a first result, the IASB has broadened the application of Hedge Accounting for more entities to include many more modern risk management activities in the new IFRS 9. As a result of this, there is the potential for entities to significantly reduce reported profit or loss volatility through economic hedging activities and the application of the new Hedge Accounting rules. Originality: There are benefits in the two new hedge accounting models from the standard IFRS 9 compared with the IAS 39. IAS 39 was a standard for the risk management done in the last decade, now there are more complex and flexible strategies done by the companies and the accounting rules must try to reflect them as best as possible. We think IFRS 9 is on a way to make the best advantages out of the lessons lernt in the financial crisis and new risk management. Conclusion is that the standard setter IASB did a good piece of work with the new hedge accounting rules in IFRS 9, but in future there will be always a need for new rules regarding to new risk management strategies.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1aee7b84bfaf072ae854cd7abe0cef63",
  "timestamp": "2025-05-15T02:24:39.597556"
}