{
  "id": 6992,
  "title": "The relative importance of avoidance and restoration-oriented stressors for grief and depression in bereaved parents",
  "abstract": "Previous research has identified a number of individual risk factors for parental bereavement including the sex of the parent, the sex of the child, avoidance-focussed coping style and time since death. These factors emerged from research where variables were tested univariately and their relative importance is currently unknown. The current research, therefore, aims to investigate which risk factors are important, multivariately, for the outcomes of grief and depression in parents following the death of their child. Psychosocial measures were completed by 106 bereaved parents four years post-loss, recruited from death records in Scotland. The cause of the child's death included long-term illness and stillbirths as well as sudden and violent deaths. In multivariate regression analyses, depression was predicted by higher avoidance-focussed coping and higher number of restoration-oriented stressors such as relationship difficulties, problems at work and financial issues. Grief was predicted by higher avoidance, restoration stressors and level of continuing bonds. The present study adds to the knowledge about the phenomenon of parental bereavement with participants recruited directly from death records rather than through support, clinical or obituary sources. Factors previously found to be associated with outcomes when tested univariately such as sudden, violent death or sex of the parent were not significant when tested multivariately. This study highlights that different vulnerability factors exist for grief and depression in bereaved parents.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1afca4118bd691ccd275904b027c0e63",
  "timestamp": "2025-05-15T03:03:55.803085"
}