{
  "id": 3853,
  "title": "An Economic Evaluation of Targeted Reserve Requirement Ratio Reduction on Bank Ecosystem Development",
  "abstract": "In China's bank-centered financial and economic environment, bank risk attitudes have an important impact on the effective implementation of structural monetary policy, and monetary policy can have an impact on the corporate ecosystem through risk taking by banks. To make an economic assessment of the evolution of the banking ecosystem and empirically explore the correlation between targeted Reserve Requirement Ratio (RRR) cuts and banks' risk-taking levels in the context of financial supply-side structural reforms, this paper uses multiple regression analysis and a fixed-effects model to analyze the causal impact of targeted RRR reduction on the risk taking of Chinese commercial banks. In addition, it uses the mediation effect model to analyze the mechanism. Results show that targeted RRR cuts have significantly increased the level of risk taking of commercial banks. The findings are pronounced in urban commercial banks. However, the leverage ratio regulation has a restraining effect on the level of risk taking of banks. This study provides an effective economic evaluation for the benign development of the banking ecosystem under the environment of government policy supervision. Future research needs to expand the bank sample and further examine the changes in bank credit scale and credit investment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1afc97285efe2dffd277ae0391321dfd",
  "timestamp": "2025-05-15T02:30:28.777078"
}