{
  "id": 4213,
  "title": "Construction Cost Index: Political, Economic, and Financial Risk Indices Within the European Continent",
  "abstract": "The global construction industry has encountered record growth, especially following the COVID-19 pandemic period, during which the construction industry almost entirely ceased. However, the prices of building materials used by the construction sector have increased rapidly since the COVID-19 pandemic due to interruptions in the supply chain, causing increases in interest rates, inflation rates, and wage rates, as well as changes in tax rates. This has resulted in a contraction of construction activities in the euro area that warrants investigation. The purpose of this study was to empirically evaluate the impacts of political, economic, and financial risks on the cost of construction materials, which have caused a recession in the European economy. In this study, an empirical examination of the long-term equilibrium relationship between the construction cost index and various risk indices associated with politics, economics, and finance across Europe was conducted. This study also explored the construction-led growth hypothesis in the eurozone. Fully Modified Ordinary Least Squares (FMOLSs) and Dynamic Ordinary Least Squares (DOLSs) panel estimation techniques were employed here. The panel regression results were obtained using the FMOLS technique and provided statistically significant elasticity coefficients. The results revealed that the economic risk index was statistically significant at 1% with an elasticity coefficient of 0.242, whereas both the political risk index and the financial risk index had elasticity coefficients of 0.231 and 0.228 at the 10% significance level, respectively. The results of this study are robust and provide strong empirical evidence that these risk factors have negative impacts on the construction cost index within the EU area, which is in agreement with the related literature. The results of the DOLS estimation methodology were significant only at the 10% significance interval for financial and economic risk parameters, with elasticity values of 0.244 and 0.183, respectively. Moreover, the results of the Dumitrescu-Hurlin Panel Causality Test determined a significant bidirectional causal relationship between the construction cost index and the financial, economic, and political risk indices in Europe. This study ultimately validates the construction-led growth hypothesis for European nations.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b0a44663c62f448fc6cedfea3f24db8",
  "timestamp": "2025-05-15T02:34:48.857249"
}