{
  "id": 4636,
  "title": "How adoption of new pharmaceuticals can impact US health system reimbursement under alternative payment models: An economic model measuring the impact of sotagliflozin among patients with heart failure and diabetes",
  "abstract": "BACKGROUND: Heart failure (HF) is among the leading causes of death in the United States. Further, patients hospitalized because of HF with comorbid diabetes mellitus (DM) are at a significantly increased risk of death and rehospitalization. Results from the SOLOIST-WHF trial show that sotagliflozin lowered rates of readmission among hospitalized patients with HF and comorbid DM. However, it is unclear what the economic impact of the use of sotagliflozin would be on hospitals and health systems, particularly in an age where provider reimbursement is increasingly tied to value. OBJECTIVE: To quantify the 1-year financial impact on US provider health systems of adopting sotagliflozin relative to standard of care (SoC) across different alternative payment models. METHODS: This study created a 3-part decision tree model to quantify the financial impact of using sotagliflozin to treat patients hospitalized with HF in a US hospital setting. The model first estimated the clinical and economic outcomes of health systems with current SoC (no sotagliflozin) to treat US patients hospitalized for HF with comorbid DM. Then, using the results from the SOLOIST trial, the changes in clinical and economic outcomes with sotagliflozin adoption were modeled. Finally, the differences in health care utilization between sotagliflozin and SoC arms were translated to differences in health system reimbursement in the context of 3 common alternative payment models (APMs) in addition to the baseline fee-for-service (FFS) model: FFS with the Hospital Readmissions Reduction Program, the Bundled Payments for Care Improvement-Advanced program, and Accountable Care Organizations. RESULTS: A typical community hospital would have 83.4 patients per year on average with an index HF hospitalization with comorbid DM. The model predicted that sotagliflozin would reduce the probability of hospitalization, emergency department visits, and deaths by 29.3%, 38.5%, and 17.8%, respectively, compared with SoC. For hospitals not participating in APM programs, sotagliflozin resulted in a net loss of $92.94 per person ($7,754 per health system). Conversely, when accounting for provider health system participation in APMs, sotagliflozin adoption increased financial returns by $4,720 per person ($305,604 per health system) under the Hospital Readmissions Reduction Program, $1,200 per person ($100,106 per health system) for the Bundled Payments for Care Improvement-Advanced program, and $1,078 per person ($31,029 per health system) for Accountable Care Organizations. Based on the national average composition of APM reimbursement, sotagliflozin adoption resulted in a $1,576 increase in margin per patient with HF ($105,454 per health system). CONCLUSIONS: Although sotagliflozin adoption reduced health system revenue in an FFS payment model, it led to a net positive financial impact after accounting for APM bonus payments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b1a8f2cc21db74e9490aa19bccc35a0",
  "timestamp": "2025-05-15T02:39:26.982314"
}