{
  "id": 6112,
  "title": "Are interventions to increase the uptake of screening for cardiovascular disease risk factors effective? A systematic review and meta-analysis",
  "abstract": "Background: Cardiovascular disease (CVD) is the leading cause of death globally. However, many individuals are unaware of their CVD risk factors. The objective of this systematic review is to determine the effectiveness of existing intervention strategies to increase uptake of CVD risk factors screening. Methods: A systematic search was conducted through Pubmed, CINAHL, EMBASE and Cochrane Central Register of Controlled Trials. Additional articles were located through cross-checking of the references list and bibliography citations of the included studies and previous review papers. We included intervention studies with controlled or baseline comparison groups that were conducted in primary care practices or the community, targeted at adult populations (randomized controlled trials, non-randomized trials with controlled groups and pre-and post-intervention studies). The interventions were targeted either at individuals, communities, health care professionals or the health-care system. The main outcome of interest was the relative risk (RR) of screening uptake rates due to the intervention. Results: We included 21 studies in the meta-analysis. The risk of bias for randomization was low to medium in the randomized controlled trials, except for one, and high in the non-randomized trials. Two analyses were performed; optimistic (using the highest effect sizes) and pessimistic (using the lowest effect sizes). Overall, interventions were shown to increase the uptake of screening for CVD risk factors (RR 1.443; 95% CI 1.264 to 1.648 for pessimistic analysis and RR 1.680; 95% CI 1.420 to 1.988 for optimistic analysis). Effective interventions that increased screening participation included: use of physician reminders (RR ranged between 1.392; 95% CI 1.192 to 1.625, and 1.471; 95% CI 1.304 to 1. 660), use of dedicated personnel (RR ranged between 1.510; 95% CI 1.014 to 2.247, and 2.536; 95% CI 1.297 to 4.960) and provision of financial incentives for screening (RR 1.462; 95% CI 1.068 to 2.000). Meta-regression analysis showed that the effect of CVD risk factors screening uptake was not associated with study design, types of population nor types of interventions. Conclusions: Interventions using physician reminders, using dedicated personnel to deliver screening, and provision of financial incentives were found to be effective in increasing CVD risk factors screening uptake.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b286178394b6f34797a980a1795ea98",
  "timestamp": "2025-05-15T02:54:39.179178"
}