{
  "id": 4641,
  "title": "Do risk attitude and trust moderate bank managers' risk perceptions in lending to micro, small, medium enterprises?",
  "abstract": "Purpose The purpose of this research is to study the antecedents of risk perceptions of bank managers towards micro, small, medium enterprise (MSME) lending, in the situation of information asymmetry, where cognitive factors assume significance over organisational norms of lending. Design/methodology/approach This study proposed and tested a conceptual model based on the factors identified from literature review and exploratory and quantitative study. Multinomial logistic regression technique is used for quantitative analysis. Findings The research postulates that information asymmetry, risk attitude, perceived trust and organizational norms have a significant relationship with branch managers' perceived risk in lending to MSMEs. The research emphasized that the risk attitude of managers and perceived trust moderate the relationship between information asymmetry and perceived risk. The findings and discussions enrich the knowledge about the alleviators of constraints to MSME funding in developing nations despite information asymmetry. Originality/value Authors have given holistic view on the risk perception in the financial decision-making process of bank lending. The research highlights the importance of cognitive factors in decreasing the negative impact of information asymmetry on risk perception.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b2dec12ff46af1279867d88443c445d",
  "timestamp": "2025-05-15T02:39:26.993809"
}