{
  "id": 3047,
  "title": "Information asymmetry and stock returns",
  "abstract": "Purpose This study endeavours to examine the relationship between information asymmetry and expected stock returns at the National Stock Exchange (NSE) of India, with a sample of NIFTY 500 stocks for a period ranging from 1st April 2000 to 31st March 2018, by employing three different proxies of information asymmetry: number of transactions, institutional ownership and idiosyncratic volatility. Design/methodology/approach The return differential amongst information-sorted decile portfolios has been assessed to understand the effect of information risk on stock returns by employing (1) traditional measures of performance evaluation like mean, Sharpe, Treynor and information ratios, (2) regression models like the capital asset pricing (CAPM), Fama and French three-factor, Carhart's four-factor, information-augmented CAPM, information-augmented Fama and French three-factor and information-augmented Carhart's four-factor models and (3) an autoregressive distributed lag (ARDL) model. Findings The empirical evidence indicated that as information asymmetry associated with portfolio increases, returns also expand to recompense investors for bearing information risk validating the existence of a significant positive relationship between information asymmetry and expected stock returns at the NSE. Amongst the various asset pricing models employed in this study, the information-augmented Fama and French three-factor model turned out to be the best in explaining cross-sectional variations in portfolio returns. Research limitations/implications Strong information premium was observed such that high information stocks outperformed low information stocks which have strong inference for investors and portfolio managers, who all continuously look out for investment strategies that can lend hand to beat the market. Originality/value Easley and O'Hara (2004) proposed that stocks with more information asymmetry have higher expected returns. Very few studies have examined this relationship between information risk and stock returns that too restricted to the US market only, with a few on other emerging markets. No work has been conducted on the concerned issue in the Indian context. Therefore, it seems to be the first study to explore the relationship between information asymmetry and expected stock returns in the Indian securities market.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b565103ca7fff7c3e45399ba262e87b",
  "timestamp": "2025-05-15T01:13:09.828614"
}