{
  "id": 7295,
  "title": "Determinants of Out-of-pocket Health Expenditure Among Older Adults: Evidence From the Nigeria Living Standards Survey 2018-19",
  "abstract": "The study examined the determinants of out-of-pocket health expenditure among older adults in Nigeria. The data came from the Nigeria Living Standards Survey 2018-19. We employed a two-part model involving logistic regression and a generalized linear model to identify factors associated with out-of-pocket health expenditures among older adults. Analyses were performed using STATA version 14.2 software. The findings indicated that 79.49% of older adults made out-of-pocket payments for health care. The mean monthly out-of-pocket health expenditure among older adults was 3,498.14 naira (US$9.72). Having health insurance significantly reduced the risk of incurring out-of-pocket health expenditure, while larger household sizes, primary education, tertiary education, and being from a poorer household significantly increased the risk of incurring out-of-pocket health expenditure among older adults. The study concludes that a high proportion of older adults incur out-of-pocket health expenditures. This implies that older adults are not protected from the financial hardship of out-of-pocket health expenditures by the Nigerian health care system. Policymakers should target the factors that increase the likelihood of incurring out-of-pocket health expenditures in the design of health financing policies aimed at reducing OOP health expenditures for older adults. The finding that health insurance reduces the likelihood of incurring out-of-pocket health expenditures indicates that it is important to design and implement a social health protection scheme for older adults.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b57114f8a7110318c2a4b220bd43796",
  "timestamp": "2025-05-15T03:07:02.667019"
}