{
  "id": 9374,
  "title": "Impact of Unmet Social Needs, Scarcity, and Future Discounting on Adherence to Treatment in Children With Asthma: Protocol for a Prospective Cohort Study",
  "abstract": "Background: Asthma is one of the most prevalent chronic diseases of childhood and disproportionately affects children with lower socioeconomic status. Controller medications such as inhaled corticosteroids significantly reduce asthma exacerbations and improve symptoms. However, a large proportion of children still have poor asthma control, in part owing to suboptimal adherence. Financial barriers contribute to hindering adherence, as do behavioral factors related to low income. For example, unmet social needs for food, lodging, and childcare may create stress and worry in parents, negatively influencing medication adherence. These needs are also cognitively taxing and force families to focus on immediate needs, leading to scarcity and heightening future discounting; thus, there is the tendency to attribute greater value to the present than to the future in making decisions.Objective: In this project, we will investigate the relationship between unmet social needs, scarcity, and future discounting as well as their predictive power over time on medication adherence in children with asthma.Methods: This 12-month prospective observational cohort study will recruit 200 families of children aged 2 to 17 years at the Asthma Clinic of the Centre Hospitalier Universitaire Sainte-Justine, a tertiary care pediatric hospital in Montreal, Canada. The primary outcome will be adherence to controller medication, measured using the proportion of prescribed days covered during follow-up. Exploratory outcomes will include health care use. The main independent variables will be unmet social needs, scarcity, and future discounting, measured using validated instruments. These variables will be measured at recruitment as well as at 6 -and 12-month follow-ups. Covariates will include sociodemographics, disease and treatment characteristics, and parental stress. Primary analysis will compare adherence to controller medication, measured using the proportion of prescribed days covered, between families with versus those without unmet social needs during the study period using multivariate linear regression.Results: The research activities of this study began in December 2021. Participant enrollment and data collection began in August 2022 and are expected to continue until September 2024.Conclusions: This project will allow the documentation of the impact of unmet social needs, scarcity, and future discounting on adherence in children with asthma using robust metrics of adherence and validated measures of scarcity and future discounting. If the relationship between unmet social needs, behavioral factors, and adherence is supported by our findings, this will suggest the potential for novel targets for integrated social care interventions to improve adherence to controller medication and reduce risk across the life course for vulnerable children with asthma.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b622f24f8edce5a4b0f20ee506a26b2",
  "timestamp": "2025-05-15T03:28:17.550553"
}