{
  "id": 6719,
  "title": "An empirical evaluation of the performance of Nigerian pension fund managers",
  "abstract": "PurposeThis paper evaluates the risk-adjusted returns, selectivity, market timing skills and persistence of the performance of Nigerian pension funds.Design/methodology/approachAnnual return data of 23 pension funds that operated in Nigeria between 2018 and 2022 were obtained from the National Pension Commission (PenCom). Risk-adjusted return was appraised using the Treynor ratio, Sharpe ratio and Jensen alpha, while the Treynor-Mazuy and Henriksson-Merton multiple regression models were applied to decompose selective and timing skills. Performance persistence was assessed using the contingency table and rank correlation models.FindingsEvidence shows that pension funds deliver excess risk-adjusted returns and exhibit selective skills. However, the evidence does not support the presence of timing skills, and there is overwhelming evidence that good (bad) performance does not repeat.Practical implicationsAn evaluation of the investment performance of pension funds is crucial for ensuring the financial stability of retirees, maintaining economic stability and making informed investment decisions. It serves the interests of pensioners, pension fund managers, regulators and the broader economy. Our evidence that pension funds generate positive excess returns is a departure from most of the literature on managed funds. We recommend that more Nigerians should leverage the pension fund industry to grow their wealth and prepare for retirement.Originality/valueThis study, to our knowledge, is the first to appraise all the key facets of the investment performance of pension funds in the Nigerian context.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b6552b5f8f75ccf1276e74e994b7005",
  "timestamp": "2025-05-15T03:01:03.528118"
}