{
  "id": 4217,
  "title": "Does Ownership Matter: Nexus Between Entrepreneurial Orientation, Network Capability, Financial Resources Diversity and Financial Performance of HGCs",
  "abstract": "Background/Purpose This paper aims to analyse the nexus between selected growth determinants and the financial performance of high-growth companies (HGCs) in relation to their ownership. In line with principal-agent theory, we try to determine if the differences exist between managers who are also (co)owners and those managers who are not (co)owners. Also, we analysed if additional equity-based compensation, through different growth determinants, could increase HGC's financial performance.Methods The study was conducted on a sample of 119 HGCs from the Republic of Slovenia and was carried out in 2022. The empirical analysis was performed using regression analysis based on exploratory factor analysis (EFA). Analysis was performed using IBM SPSS Statistics 27 software.Results Results showed that considering the importance of organisational networking capability for HGC's financial performance, there are statistically significant differences between owner-managers and managers, implying that ownership (and equity-based compensations) could positively shape HGC's financial performance. In addition, results show that when analysing the owners-managers group of HGCs, risk-taking and organisational networking capability positively and statistically significantly impact HGC's financial performance.Conclusion Our paper highlights the importance of organisational networking capability as a growth determinant through which equity-based manager compensations can positively influence HGCs' financial performance. The study contributes to diverse literature related to HGCs and contributes to relevancy for the policymakers aiming at enabling better financial performance of HGCs.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b9a082a8c8e8c24d5824876b5d4d9a2",
  "timestamp": "2025-05-15T02:34:48.875669"
}