{
  "id": 3676,
  "title": "Typologies of Loneliness, Isolation and Living Alone Are Associated with Psychological Well-Being among Older Adults in Taipei: A Cross-Sectional Study",
  "abstract": "Background: Loneliness, isolation, and living alone are emerging as critical issues in older people's health and well-being, but the effects are not consistent. The purpose of this study was to examine the clustering of loneliness, isolation, and living alone, the risk factors and the associations with psychological well-being. Methods: The data were collected from the 2019 Taipei City Senior Citizen Condition Survey by face-to-face interviews and included a community-based sample (n = 3553). Loneliness, isolation, and living arrangement were analyzed by cluster analysis to define Loneliness-Isolation-Living-Alone clusters. Multinomial logistic regression was used to examine the factors related to Loneliness-Isolation-Living-Alone clusters, and linear regression was used to examine association of clusters with psychological well-being. Results: Five clusters of older adults were identified and named as follows: Not Lonely-Connected-Others (53.4%), Not Lonely-Isolated-Others (26.6%), Not Lonely-Alone (5.0%), Lonely-Connected (8.1%), and Lonely-Isolated-Others (6.9%). Demographics, financial satisfaction, physical function, family relationship, and social participation were related to the Loneliness-Isolation-Living-Alone clusters. Compared with the Not Lonely-Connected-Others cluster, the Lonely-Connected cluster and Lonely-Isolated-Others cluster had higher depressive symptoms and lower life satisfaction, and the Not Lonely-Isolated-Others cluster reported lower life satisfaction; the Not Lonely-Alone cluster was not different. Discussion: Loneliness and isolation are negatively associated with psychological well-being, and living arrangement is not the determinant to loneliness or isolation. Older adults are suggested to strengthen their informal social support, and the government may encourage social care and create an age friendly environment to reduce loneliness and isolation.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1b9f17beb0cfd0b373624dc4f58c6700",
  "timestamp": "2025-05-15T02:29:00.072554"
}