{
  "id": 1187,
  "title": "Building Bad Debt Forecasting Model Using CatBoost Algorithm",
  "abstract": "This paper aims to build bad debt forecasting model based on CatBoost machine learning algorithm on person's credit information!-- Query ID=Q1 Text=Please check and confirm if the authors given and family names have been correctly identified.. -->.. This study ensures that the model has the ability to exactly and flexibly forecast; simultaneously, minimize the errors to provide bad debt information accurately. Additionally, the study evaluates the productivity of the model in comparison with the current data, guarantees the equal and precise forecasting abilities when applying to the real circumstances. The investigation mainly focuses on important financial indicators which affect to bad debt forecasting problems, and applies the CatBoost machine learning algorithm into building up the bad debt forecasting model. The development of knowledge in this field considerably enlarges understanding about the strength and the possibility of machine learning algorithm application in solving problems related to credit risk management. This research supplies crucial information in terms of practical proficiency of the model when implementing in the real banking environment, and provides the true point of view about applicable abilities of algorithm. The credit scoring model improves the accuracy in assessing payment ability of customers, which supports banks in the progress of credit issue. This is definitely meaningful for the risk reduction and the optimization of credit management. The application of CatBoost model can minimize the number of non-essential transactions as well as reduce the expenditure regarding customers evaluating progress. In addition, the amount of time for lending procedure implementation can be significantly shortened, which is considered to be truly beneficial for banks. The investigation is also helpful to challenges and opportunities that the application of CatBoost machine learning brings to banking community and financial industry. Companies and organizations can utilize these knowledge in order to improve risk management progress and optimize their credit strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1baebb468dca7119427a556e56bf4ebf",
  "timestamp": "2025-05-15T01:59:56.302895"
}