{
  "id": 364,
  "title": "Valuation of an option using non-parametric methods",
  "abstract": "This paper provides a general valuation model to fairly price a European option using parametric and non-parametric methods. In particular, we show how to use the historical simulation (HS) method, a well-known non-parametric statistical method applied in the financial area, to price an option. The advantage of the HS method is that one can directly obtain the distribution of stock returns from historical market data. Thus, it not only does a good job in capturing any characteristics of the return distribution, such as clustering and fat tails, but it also eliminates the model errors created by mis-specifying the distribution of underlying assets. To solve the problem of measuring transformation in valuing options, we use the Esscher's transform to convert the physical probability measure to the forward probability measure. Taiwanese put and call options are used to illustrate the application of this method. To clearly show which model prices stock options most accurately, we compare the pricing errors from the HS method with those from the Black-Scholes (BS) model. The results show that the HS model is more accurate than the BS model, regardless for call or put options. More importantly, because there is no complex mathematical theory underlying the HS method, it can easily be applied in practice and help market participants manage complicated portfolios effectively.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1bb21936bbe4501ce7e13c3005e6daf5",
  "timestamp": "2025-05-15T01:31:13.170416"
}