{
  "id": 2440,
  "title": "Stochastic and Dynamic Interaction between Islamic Volatility Index and Volatility Indices",
  "abstract": "Integration in financial markets offers opportunities for free flow of information and capital for international investments. However, this also poses challenges for maintaining effective international portfolio diversification due to heightened market correlations. This study aims to analyze the diversifying potential of Islamic financial assets and undertake a dynamic analysis of their correlation with volatility indices. In this context, the study explores the interaction between the Dow Jones Islamic Market Developed Markets Quality and Low Volatility Index (DJIDVI) and such volatility indices including the CBOE Volatility Index (VIX), CBOE Oil Volatility Index (OVX), CBOE Gold Volatility Index (GVZ), and Euro Currency Volatility Index (EVZ). The Dynamic Correlation-Multivariate Stochastic Volatility (DC-MSV) model is employed to assess of how volatility shocks in one asset influence the volatility of others. The findings reveal that DJIDVI demonstrates the highest volatility clustering among the considered series. Moreover, DJIDVI exhibits mutual interactions with VIX and EVZ, and shocks increasing DJIDVI volatility also contribute to heightened volatility in VIX and OVX. Notably, the correlation between DJIDVI and volatility indices is influenced by global events. The study emphasizes the enhanced predictability of DJIDVI and its negative correlation with other series establishing its potential as a diversifier. The findings of this study contribute to advancing the understanding of international portfolio diversification emphasizing the importance of incorporating Islamic financial assets.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1bb52ec4cef77667e5f30142f68e6759",
  "timestamp": "2025-05-15T01:07:02.949491"
}