{
  "id": 8160,
  "title": "An Exploration of the Value of Elective Health Checks in UK Zoo-Housed Gibbons",
  "abstract": "Simple Summary The health of zoo-housed animals is of critical importance for their welfare and conservation. Since many wild species often do not show signs of illness, zoo veterinarians routinely carry out health checks in seemingly healthy individuals to identify issues requiring treatment. The benefits of these elective health checks must be balanced against the risk of injury or stress, and their financial cost. This study involved the analysis of data gathered from 74 examinations carried out at one UK zoological collection, on 33 gibbons between 2011 and 2018. More than half (n = 38) of these health checks resulted in veterinary intervention and/or a management change to the gibbon's care (referred to as an actionable outcome). Age was found to be an important and reliable determinant of health check outcome, with health checks in elderly gibbons being 13.64 times more likely to have an actionable outcome than those in non-elderly gibbons. X-ray abnormalities, such as osteoarthritis, were also 34 times more likely in this group. Zoo managers and veterinarians can use the methods and findings outlined in this paper to quantify the benefits of elective health checks in their own collections, and to inform evidence-based decision making about the frequency and intensity with which they are implemented. Elective health checks form an important part of the preventative healthcare of many zoo-housed animals. These procedures are not without risk or financial expenditure, meaning careful cost-benefit analysis is required when determining the frequency and intensity with which they are implemented. This study evaluated the value of elective health checks (n = 74) carried out on 33 gibbons at a single UK zoological collection from 2011 to 2018. Data were categorised by health check type, animal age, clinical findings and outcome. Univariable binary logistic regression and multivariable modelling were used to identify factors associated with the likelihood of actionable (clinically significant) outcomes. In total, 51.35% of all elective health checks resulted in an actionable outcome. Elderly heath checks had 13.64 times greater odds of an actionable outcome and 34 times greater odds of a significant radiographic finding, when compared to routine (non-elderly) health checks. Our findings suggest that 75% wild longevity is a suitable threshold for identifying elderly captive gibbons and increasing health check frequency. Whilst further work is needed to ascertain whether these findings can be extrapolated to other collections and/or species, this study demonstrates how the analysis of clinical data can aid in the implementation of an effective and evidence-based preventative healthcare plan.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1bbfa756205ee45cc74eba7137f4e3c4",
  "timestamp": "2025-05-15T03:15:38.490594"
}