{
  "id": 6686,
  "title": "Competition, concentration and default-risk in the Indian banking industry",
  "abstract": "Purpose The study investigates the impact of bank market competition and concentration on the bank default-risk using the data for 36 Indian scheduled commercial banks from 1999 to 2017. Design/methodology/approach The study adopts the dynamic panel generalised method of moments (GMM) and panel quantile models to obtain the results. Findings Bank market competition and concentration foster financial fragility in terms of high default-risk. This implies that concentration does not mean a lack of competition in the Indian banking market. The findings from the quantile model reveal that the stated relationships become weaker under the tails of the conditional distribution of the risk measure. Research limitations/implications The authors recommend that non-structural measures (Lerner index and H-statistic) should be preferred over the concentration measures (HHI and CR3) to characterise bank market competition in India. Based on the evidence of persistence in the bank risk variable, from the methodological perspective, dynamic panel data models are better choices for bank-level analyses compared to the conventional panel data models. Practical implications To improve the health of banks, price competition should be reduced among them. This objective should be achieved by creating new avenues to increase the banks' non-interest income parallelly with the consolidation of the market. riginality/value First, it tries to answer whether concentration implies a lack of competition for a banking system like India. Second, the quantile regression technique enables us to understand the varying nature of the impact of market competition on bank risk at different locations on the latter's conditional distribution. Earlier studies have not looked at these aspects in the Indian context.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1bf1bc0088b4cb86219e2fc7d8b5614f",
  "timestamp": "2025-05-15T03:00:35.434083"
}