{
  "id": 6711,
  "title": "Influence of form and timing of social support on parental outcomes of a child-maltreatment prevention program",
  "abstract": "This study examines how the form of social support (informal or formal) and the time frame at which it is provided (at the start or end of the program) influence parental outcomes on the Apoyo Personal y Familiar (APF) program for at-risk families showing inadequate child-rearing practices. A total of 496 parents participated, 247 parents referred by the municipal social services in the Autonomous Community of Castile and Leon (Spain), and 249 non-referred parents. Initial and final levels of use of and satisfaction with informal and formal support were used as predictors of change scores in self-rating measures of beliefs about child development, perceptions of the parental role and child-rearing practices, applying hierarchical linear regression analyses. Perceived use of and satisfaction with support explained around 22% to 49% of the change scores in the Nurturist belief as a simple view of child development. Couple agreement on educational matters. Permissive-neglectful practices and Coercion practices, after accounting for the variance due to risk status, financial situation and family structure variables. Informal support always has a positive impact irrespective of when the help is provided, whereas formal support only has a positive impact when applied at the start of the program. The adequate provision of social supports can be an efficient way to prevent child maltreatment by promoting changes in parental beliefs and practices related to at-risk parenting. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1bf75f9404b7405120b9f2b7617a79d9",
  "timestamp": "2025-05-15T03:00:35.581167"
}