{
  "id": 1678,
  "title": "The criticality of financial risk to environment sustainability in top carbon emitting countries",
  "abstract": "This research examines the linkage between financial risk and carbon emissions using a quarterly dataset spanning from 1991 to 2019 for top carbon emitting countries. To achieve the study objective, this study apply quantile-on-quantile regression (QQR), the quantile regression (QR) approach for robustness check, and the nonparametric predictive test that identifies causality in mean and variance. Empirical findings from the QQR technique disclose the following: (i) financial risk decreases carbon emissions in the USA, Russia, Germany, and Canada; (ii) in China, India, Japan, Brazil, and Indonesia, financial risk enhances carbon emissions (iii) while we find mixed reactions in the case of South Korea. The outcomes of the conventional quantile regression also confirm the QQR outcomes, while that of nonparametric causality discloses evidence of causality in majority of quantiles from financial risk to carbon emissions. Based on these empirical outcomes, policymakers in the financial risk-induced-environmental degradation regions should consider implementing policies or reforms that would keep financial systems sound, in order to prevent shocks to the environment, and its attendant multiplier impact on the environmental sustainability targets implemented to protect both the immediate and the future generations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c08fedb8a3d05b2b42151fb8dcfadac",
  "timestamp": "2025-05-15T02:06:22.420923"
}