{
  "id": 6327,
  "title": "Development, validation, and visualization of a novel nomogram to predict stroke risk in patients",
  "abstract": "BackgroundStroke is the second leading cause of death worldwide and a major cause of long-term neurological disability, imposing an enormous financial burden on families and society. This study aimed to identify the predictors in stroke patients and construct a nomogram prediction model based on these predictors. MethodsThis retrospective study included 11,435 participants aged >20 years who were selected from the NHANES 2011-2018. Randomly selected subjects (n = 8531; 75%) and the remaining subjects comprised the development and validation groups, respectively. The least absolute shrinkage and selection operator (LASSO) binomial and logistic regression models were used to select the optimal predictive variables. The stroke probability was calculated using a predictor-based nomogram. Nomogram performance was assessed by the area under the receiver operating characteristic curve (AUC) and the calibration curve with 1000 bootstrap resample validations. Decision curve analysis (DCA) was performed to evaluate the clinical utility of the nomogram. ResultsAccording to the minimum criteria of non-zero coefficients of Lasso and logistic regression screening, older age, lower education level, lower family income, hypertension, depression status, diabetes, heavy smoking, heavy drinking, trouble sleeping, congestive heart failure (CHF), coronary heart disease (CHD), angina pectoris and myocardial infarction were independently associated with a higher stroke risk. A nomogram model for stroke patient risk was established based on these predictors. The AUC (C statistic) of the nomogram was 0.843 (95% CI: 0.8186-0.8430) in the development group and 0.826 (95% CI: 0.7811, 0.8716) in the validation group. The calibration curves after 1000 bootstraps displayed a good fit between the actual and predicted probabilities in both the development and validation groups. DCA showed that the model in the development and validation groups had a net benefit when the risk thresholds were 0-0.2 and 0-0.25, respectively. DiscussionThis study effectively established a nomogram including demographic characteristics, vascular risk factors, emotional factors and lifestyle behaviors to predict stroke risk. This nomogram is helpful for screening high-risk stroke individuals and could assist physicians in making better treatment decisions to reduce stroke occurrence.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c0be62d88133cc3a331cc4f57f836a6",
  "timestamp": "2025-05-15T02:57:07.679763"
}