{
  "id": 7250,
  "title": "Factors Influencing the General Well-Being of Low-Income Korean Immigrant Elders",
  "abstract": "This study explores factors that influence the general well-being (anxiety, depression, positive well-being, self-control, vitality, and general health) of low-income Korean immigrant elders by interviewing 206 older adults living in Los Angeles County and Orange County, California. Ordinary least squares regression results reveal that lack of English proficiency and longer residence in the United States were significant predictors of higher anxiety, higher depression, lower self-control, lower vitality, and lower general health among Korean immigrant elders. Losing a spouse was a significantly negative factor in vitality. Financial problems were significantly associated with lower positive well-being. Social support was a significant factor in lower anxiety, lower depression, higher positive well-being, higher self-control, and higher vitality. Spiritual coping was significantly associated with lower anxiety, lower depression, higher positive well-being, and higher vitality. The findings of this study show that low-income Korean immigrant elders are at high risk for psychological and physical health problems influenced by difficulties with the acculturation or adjustment and socioeconomic stress of living in a new society. The study discusses essential implications for culturally competent social work practice among low-income Korean immigrant elders.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c42a213a76d63db8925cbc36277b44f",
  "timestamp": "2025-05-15T03:06:35.421822"
}