{
  "id": 5580,
  "title": "Who is at Risk of Loneliness? A Cross-sectional Recursive Partitioning Approach in a Population-based Cohort of Persons With Spinal Cord Injury",
  "abstract": "Objective: To develop a more thorough understanding of the risk factors for loneliness in persons with a physical impairment, using a population-based sample of persons with spinal cord injury (SCI), based on regression modeling and a recursive partitioning approach. Design: Cross-sectional, observational cohort. Setting: Community, Switzerland. Participants: Community-dwelling persons with spinal cord injury (N=1283) 16 years or older. Interventions: Not applicable. Main Outcome Measures: Loneliness was assessed using a modified version of the UCLA Three-Item Loneliness Scale. Results: Those with the most disadvantaged socioeconomic characteristics in terms of education, income, subjective social position, employment status, and financial hardship demonstrated the highest risk for loneliness. Of the sociodemographic characteristics, only age had an association with loneliness, whereby persons aged 31-45 had the highest propensity for experiencing loneliness. We also saw that those with higher lesion levels and less functional independence were associated with higher levels of loneliness. In conditional inference tree analysis subjective social position, financial hardship, and functional independence had the highest discriminative power, with nationality and living arrangement having a less important role. Conclusions: Our findings highlight the vulnerability of persons with SCI with unfavorable socioeconomic status to loneliness. Furthermore, our findings show that persons who are more constrained because of functional limitations may face restrictions to social participation and therefore be at a higher risk of loneliness. This population-based evidence contributes to the better targeting of services aimed at alleviating loneliness for persons with a lower socioeconomic position and those with more functional limitations in everyday life. (C) 2021 by the American Congress of Rehabilitation Medicine. Published by Elsevier Inc.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c4816e669f840286656ab9083976a99",
  "timestamp": "2025-05-15T02:49:21.638671"
}