{
  "id": 269,
  "title": "Research on financial early warning of mining listed companies based on BP neural network model",
  "abstract": "Mining industry is the basic industry of the national economy. However, in recent years, listed mining companies have suffered serious financial risks due to special reasons such as poor spot market liquidity of their products, strong policy dependence, and long investment payback periods. In the previous studies, most of the financial crisis prediction focused on the whole industry and manufacturing industry. The research on the financial risk of mining enterprises focuses more on how to adjust R&D activities, environmental performance to improve the financial performance of enterprises. There is still a lot of room for in-depth research on the systematic prevention and early warning of financial risks of listed mining companies. At the same time, in terms of research methods, many scholars used multivariate discriminant model, logistic regression model and support vector machine model. Compared with the Back-Propagation (BP) neural network model, these model methods have more or less defects. Therefore, we take mining listed companies as the research object, select the financial data of China's A-share mining listed companies in 2018, and construct the BP neural network financial early warning model, trying to provide more practical means for the financial risk early warning of mining companies. The research conclusions of this paper are as follows: (1) The BP neural network financial early warning model constructed in this paper has high prediction accuracy, which can be well used in the practice of financial early warning of mining listed companies; (2) The financial situation of China's A-share mining listed companies in 2018 is generally in a good state. The companies with good financial status can effectively control the cost and have good debt paying ability while earning income; (3) For companies with financial status that require early warning, the root cause is mainly that they do not pay attention to the risk of bad debt losses, which makes current credit sales income and accounts receivable are at high levels, and they also do not have good profitability.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c7d2d7b648376ca0ea303823d6420ca",
  "timestamp": "2025-05-15T01:49:04.528879"
}