{
  "id": 7644,
  "title": "Identifying weaknesses in national health emergency response skills and techniques with emergency responders: A cross-sectional study from China",
  "abstract": "Background: To identify the weakest skill areas perceived by participants among key skills highly demanded during emergencies and to explore factors influencing the self-rated overall skill proficiency of public health emergency responders. Methods: The participants were selected by a multistage, stratified cluster sampling method in Heilongjiang CDC to complete questionnaires that assessed their perceptions of health emergency response skills and techniques. A final sample of 1,740 staff members was obtained and analyzed. Results: The 5 top skill deficiency areas perceived by participants were field epidemiologic investigation, personal protection, effective nuclear and radioactive response as well as psychological interventio (for these two areas gain the equal score), and risk assessment. The logistic regression revealed personal protective skills as the most important factor contributing to the self-rated overall skill proficiency of public health emergency responders, followed by field epidemiologic investigation skills. Conclusions: More attention should be given to emergency response skill training and education programs. Major obstacles hindering the promotion of key skills and techniques among front-line emergency responders should be addressed urgently. Continuous efforts should be made to remove the financial, technical, and resource obstacles to improve public health emergency response capacity. (C) 2017 Association for Professionals in Infection Control and Epidemiology, Inc. Published by Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c85f45a4c3a2d0bcb80dc9305610b92",
  "timestamp": "2025-05-15T03:10:33.067379"
}