{
  "id": 9174,
  "title": "Does a local financial incentive scheme reduce inequalities in the delivery of clinical care in a socially deprived community? A longitudinal data analysis",
  "abstract": "Background: Socioeconomic deprivation is associated with inequalities in health care and outcomes. Despite concerns that the Quality and Outcomes Framework pay-for-performance scheme in the UK would exacerbate inequalities in primary care delivery, gaps closed over time. Local schemes were promoted as a means of improving clinical engagement by addressing local health priorities. We evaluated equity in achievement of target indicators and practice income for one local scheme. Methods: We undertook a longitudinal survey over four years of routinely recorded clinical data for all 83 primary care practices. Sixteen indicators were developed that covered five local clinical and public health priorities: weight management; alcohol consumption; learning disabilities; osteoporosis; and chlamydia screening. Clinical indicators were logit transformed from a percentage achievement scale and modelled allowing for clustering of repeated measures within practices. This enabled our study of target achievements over time with respect to deprivation. Practice income was also explored. Results: Higher practice deprivation was associated with poorer performance for five indicators: alcohol use registration (OR 0.97; 95 % confidence interval 0.96,0.99); recorded chlamydia test result (OR 0.97; 0.94,0.99); osteoporosis registration (OR 0.98; 0.97,0.99); registration of repeat prednisolone prescription (OR 0.98; 0.96,0.99); and prednisolone registration with record of dual energy X-ray absorptiometry (DEXA) scan/referral (OR 0.92; 0.86,0.97); practices in deprived areas performed better for one indicator (registration of osteoporotic fragility fracture (OR 1.26; 1.04,1.51). The deprivation-achievement gap widened for one indicator (registered females aged 65-74 with a fracture referred for a DEXA scan; OR 0.97; 0.95,0.99). Two other indicators indicated a similar trend over two years before being withdrawn (registration of fragility fracture and over-75 s with a fragility fracture assessed and treated for osteoporosis risk). For one indicator the deprivation-achievement gap reduced over time (repeat prednisolone prescription (OR 1.01; 1.01,1.01). Larger practices and those serving more affluent areas earned more income per patient than smaller practices and those serving more deprived areas (t = -3.99; p = 0.0001). Conclusions: Any gaps in achievement between practices were modest but mostly sustained or widened over the duration of the scheme. Given that financial rewards may not reflect the amount of work undertaken by practices serving more deprived patients, future pay-for-performance schemes also need to address fairness of rewards in relation to workload.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1c8626cc1903e868cd7bc493ec7bc795",
  "timestamp": "2025-05-15T03:26:25.926814"
}