{
  "id": 8245,
  "title": "Corporate governance and cost of equity: the moderating role of ownership concentration levels",
  "abstract": "PurposeThe study analyzes the influence of corporate governance and ownership concentration levels on the cost of equity. Further, the authors extend the literature by investigating the moderating effect of ownership concentration levels (i.e. at 5%, 10% and 20%) on the relationship between corporate governance and the cost of equity.Design/methodology/approachThe study applies several robust panel regression techniques to a sample of 114 active non-financial companies listed on the Pakistan Stock Exchange from 2011 to 2016. Corporate governance was measured through a unique index comprising 30 governance attributes. The cost of equity was measured through the capital asset pricing model. Further, the authors construct three variables for ownership concentration levels, i.e. at 5%, 10% and 20%. To address the endogeneity problem, the one-lagged variable model and GMM approaches were also applied.FindingsThe results indicate that better corporate governance reduces the cost of equity, while ownership concentration at high thresholds would increase the cost of equity. Further, the authors find that ownership concentration at the 20% threshold moderates the relationship between corporate governance and the cost of equity. Thus, the authors argue that firms can minimize the risk faced by shareholders by implementing substantive corporate governance mechanisms. In addition, effective corporate governance mechanisms at high ownership concentration levels are imperative for managing the cost of equity.Originality/valueThe study reports novel evidence that ownership concentration at a high threshold moderates the effect of corporate governance on the cost of equity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cbb3804f323726d2913cf9a25e38e22",
  "timestamp": "2025-05-15T03:16:48.994644"
}