{
  "id": 6971,
  "title": "How stress-related factors affect mental wellbeing of university students A cross-sectional study to explore the associations between stressors, perceived stress, and mental wellbeing",
  "abstract": "Background Lowered mental wellbeing of students is a growing health and societal problem. Experiencing high levels of stress for a longer period of time has been associated with an increased risk for lower mental wellbeing and mental health problems. To reduce stress and improve mental wellbeing it is important to understand how various sources of stress are related with mental wellbeing and which factors can buffer the impact of stress on mental wellbeing. Objectives Deriving from a conceptual model the aim of the study was to explore 1) the association of underlying stressors (academic pressure, family circumstances, side-activity pressure, and financial situation) with perceived stress and mental wellbeing, 2) whether perceived stress mediates the association between the sources of stress and mental wellbeing and 3) whether loneliness, self-esteem, personality and coping styles buffer or reinforce the impact of perceived stress on mental wellbeing. Method A cross-sectional survey design was used among students of an University of Applied Sciences and conducted between November 16, 2020, and January 18, 2021. Study variables were mental wellbeing, perceived stress, academic pressure, financial pressure, family pressure and side-activity pressure, coping style, self-esteem, loneliness, personality. The questionnaire was constructed using validated measures. Simple and multiple linear regression analyses were conducted to assess the association between perceived stress, sources of stress and mental wellbeing. Mediation and moderation processes were explored using Hayes PROCESS models. Results A total of 875 university students (37,2% male, 62,3% female, mean age 21,6) participated. Perceived stress had a strong negative association with mental wellbeing (unstandardized regression coefficient (b) = -.848, p < .001; r = -.667, p < .01), explaining 45% of the variance. Academic pressure (b = -8.014, p < .01), family pressure (b = -3.189, p < .01), side-activity pressure (b = -3.032, p < .01) and financial pressure (b = -2.041, p < .01) all had a negative impact on mental wellbeing. This effect was mediated by perceived stress, but a direct effect remained for academic pressure (b = -3.306, p < .01) and family pressure (b = -1.130, p < .01). Significant interaction effects between perceived stress and mental wellbeing were found for approach coping (low = -.93, p < .01; high = -.64, p < .01) and emotional stability (low = -.81, p < .01; high = -.64, p < .01). Conclusion Perceived stress has a major impact on students' mental wellbeing. Underlying stressors were mediated by perceived stress, but direct effects were also found. To protect the mental wellbeing of students, it is urgent to reduce perceived stress, suppress underlying stressors and make students more resilient through the development of found buffers, such as approach coping.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cc9575f05c4805ebb6e22ce8e10cf27",
  "timestamp": "2025-05-15T03:03:55.681894"
}