{
  "id": 9197,
  "title": "Elective THA for Indications Other Than Osteoarthritis Is Associated With Increased Cost and Resource Use: A Medicare Database Study of 135,194 Claims",
  "abstract": "Background Under Medicare's fee-for-service and bundled payment models, the basic unit of hospital payment for inpatient hospitalizations is determined by the Medicare Severity Diagnosis Related Group (MS-DRG) coding system. Primary total joint arthroplasties (hip and knee) are coded under MS-DRG code 469 for hospitalizations with a major complication or comorbidity and MS-DRG code 470 for those without a major complication or comorbidity. However, these codes do not account for the indication for surgery, which may influence the cost of care.Questions/purposes We sought to (1) quantify the differences in hospital costs associated with six of the most common diagnostic indications for THA (osteoarthritis, rheumatoid arthritis, avascular necrosis, hip dysplasia, posttraumatic arthritis, and conversion arthroplasty), (2) assess the primary drivers of cost variation using comparisons of hospital charge data for the diagnostic indications of interest, and (3) analyze the median length of stay, discharge destination, and intensive care unit use associated with these indications. Methods This study used the 2019 Medicare Provider Analysis and Review Limited Data Set. Patients undergoing primary elective THA were identified using MS-DRG codes and International Classification of Diseases, Tenth Revision, Procedure Coding System codes. Exclusion criteria included non-fee-for-service hospitalizations, nonelective procedures, patients with missing data, and THAs performed for indications other than the six indications of interest. A total of 713,535 primary THAs and TKAs were identified in the dataset. After exclusions were applied, a total of 135,194 elective THAs were available for analysis. Hospital costs were estimated using cost-to-charge ratios calculated by the Centers for Medicare and Medicaid Services. The primary benefit of using cost-to-charge ratios was that it allowed us to analyze a large national dataset and to mitigate the random cost variation resulting from unique hospitals' practices and patient populations. As an investigation into matters of health policy, we believe that assessing the surgical cost borne by the average hospital was most appropriate. To analyze estimated hospital costs, we performed a multivariable generalized linear model controlling for patient demographics (gender, age, and race), preoperative health status, and hospital characteristics (hospital setting [urban versus rural], geography, size, resident-to-bed ratio, and wage index). We assessed the principal drivers of cost variation by analyzing the median hospital charges arising from 30 different hospital revenue centers using descriptive statistics. Length of stay, intensive care use, and discharge to a nonhome location were analyzed using multivariable binomial logistic regression. Results The cost of THA for avascular necrosis was 1.050 times (95% confidence interval 1.042 to 1.069; p < 0.001), or 5% greater than, the cost of THA for osteoarthritis; the cost of hip dysplasia was 1.132 times (95% CI 1.113 to 1.152; p < 0.001), or 13% greater; the cost of posttraumatic arthritis was 1.220 times (95% CI 1.193 to 1.246; p < 0.001), or 22% greater; and the cost of conversion arthroplasty was 1.403 times (95% CI 1.386 to 1.419; p < 0.001), or 40% greater. Importantly, none of these CIs overlap, indicating a discernable hierarchy of cost associated with these diagnostic indications for surgery. Rheumatoid arthritis was not associated with an increase in cost. Medical or surgical supplies and operating room charges represented the greatest increase in charges for each of the surgical indications examined, suggesting that increased use of medical and surgical supplies and operating room resources were the primary drivers of increased cost. All of the orthopaedic conditions we investigated demonstrated increased odds that a patient would experience a prolonged length of stay and be discharged to a nonhome location compared with patients undergoing THA for osteoarthritis. Avascular necrosis, posttraumatic arthritis, and conversion arthroplasty were also associated with increased intensive care unit use. Posttraumatic arthritis and conversion arthroplasty demonstrated the largest increase in resource use among all the orthopaedic conditions analyzed. Conclusion Compared with THA for osteoarthritis, THA for avascular necrosis, hip dysplasia, posttraumatic arthritis, and conversion arthroplasty is independently associated with stepwise increases in resource use. These cost increases are predominantly driven by greater requirements for medical and surgical supplies and operating room resources. Posttraumatic arthritis and conversion arthroplasty demonstrated substantially increased costs, which can result in financial losses in the setting of fixed prospective payments. These findings underscore the inability of MS-DRG coding to adequately reflect the wide range of surgical complexity and resource use of primary THAs. Hospitals performing a high volume of THAs for indications other than osteoarthritis should budget for an anticipated increase in costs, and orthopaedic surgeons should advocate for improved MS-DRG coding to appropriately reimburse hospitals for the financial and clinical risk of these surgeries.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cd3b6f1209b72b1ed098158cdf0ee5b",
  "timestamp": "2025-05-15T03:26:26.020112"
}