{
  "id": 9364,
  "title": "Combat Ocular Trauma Visual Outcomes during Operations Iraqi and Enduring Freedom",
  "abstract": "Objective: To report the visual and anatomic outcomes as well as to predict the visual prognosis of combat ocular trauma (COT) during Operations Iraqi and Enduring Freedom. Design: Retrospective, noncomparative, interventional, consecutive case series. Participants: Five hundred twenty-three consecutive globe or adnexal combat injuries, or both, sustained by 387 United States soldiers treated at Walter Reed Army Medical Center between March 2003 and October 2006. Methods: Two hundred one ocular trauma variables were collected on each injured soldier. Best-corrected visual acuity (BCVA) was categorized using the ocular trauma score (OTS) grading system and was analyzed by comparing initial and 6-month postinjury BCVA. Main Outcome Measures: Best-corrected visual acuity, OTS, and globe, oculoplastic, neuro-ophthalmic, and associated nonocular injuries. Results: The median age was 25 7 years (range, 18-57 years), with the median baseline OTS of 70 25 (range, 12-100). The types of COT included closed-globe (n = 234; zone 1+2, n = 103; zone 3, n = 131), open-globe (n = 198; intraocular foreign body, n = 86; perforating, n = 61; penetrating, n = 32; and rupture, n = 19), oculoplastic (n = 324), and neuro-ophthalmic (n = 135) injuries. Globe trauma was present in 432 eyes, with 253 eyes used for visual acuity analysis. Comparing initial versus 6-month BCVA, 42% of eyes achieved a BCVA of 20/40 or better, whereas 32% of eyes had a BCVA of no light perception. Closed-globe injuries accounted for 65% of BCVA of 20/40 or better, whereas 75% of open-globe injuries had a BCVA of 20/200 or worse. The ocular injuries with the worst visual outcomes included choroidal hemorrhage, globe perforation or rupture, retinal detachment, submacular hemorrhage, and traumatic optic neuropathy. Additionally, COT that combined globe injury with oculoplastic or neuro-ophthalmologic injury resulted in the highest risk of final BCVA worse than 20/200 (odds ratio, 11.8; 95% confidence interval, 4.0-34.7; P<0.0005). Nonocular injuries occurred in 85% of cases and included traumatic brain injury (66%) and facial injury (58%). Extremity injuries were 44% (170 of 387 soldiers). Amputation is a subset of extremity injury with 12% (46 of 387) having sustained a severe extremity injury causing amputation. Conclusions: Combat ocular trauma has high rates of nonocular injuries with better visual outcomes in closed-globe compared with open-globe trauma. The OTS is a valid classification scheme for COT and correlates the severity of injury with the final visual acuity and prognosis. Globe combined with oculoplastic or neuro-ophthalmologic injuries have the worst visual prognosis. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2008;115:2235-2245 (C) 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cdbd3a754dd4a10ac3603973d6356ff",
  "timestamp": "2025-05-15T03:28:17.502099"
}