{
  "id": 4121,
  "title": "Does cost-inefficiency in Islamic banking matter for earnings uncertainty?",
  "abstract": "PurposeThis paper aims to investigate a fundamental research question of whether the Islamic banking business model makes corporate earnings more uncertain. This question arises because prior research shows that Islamic banks do well in loan performance but incur more operational costs than conventional banks, indicating the systemic limitation of Islamic banks in business risk management. Design/methodology/approachThe study used a sample of banks to conduct the panel regression analysis with 15 years of data for 532 banks (129 Islamic and 403 conventional) from 23 Muslim countries across the world. The authors estimate earnings uncertainty in two ways: the spread and standard deviation of the country-adjusted return over the sample period and applied the difference-in-difference approach interacting cost to income ratio with the Islamic bank dummy, checking if Islamic bank's high operational costs contribute to more earning uncertainty. FindingsIslamic banks' returns on assets are significantly more uncertain than conventional banks due to higher operational costs. Consistent with earlier evidence, the study also finds that Islamic banks generally have fewer nonperforming loans than conventional banks. The authors conclude that Islamic banks trade-off between reducing credit risk and escalating business risk. Originality/valueThis study documents that the Islamic banking model helps build a safer asset portfolio but gives rise to the uncertainty of corporate earnings. Therefore, the choice between Islamic and conventional banking models involves a trade-off between credit and business risks. It is a new finding that we add to the literature body on Islamic finance.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cede1aa38ac0d6acad9f72987d25fba",
  "timestamp": "2025-05-15T01:23:58.099836"
}