{
  "id": 522,
  "title": "Integration of CNN Models and Machine Learning Methods in Credit Score Classification: 2D Image Transformation and Feature Extraction",
  "abstract": "The problem of accurately classifying credit scores is critical for financial institutions to assess individual creditworthiness and effectively manage credit risk. Traditional methods often face limitations when processing large datasets, resulting in lower accuracy and longer processing time. To address this issue, this paper proposes a novel approach to credit score classification by integrating convolutional neural networks (CNN) with machine learning methods. First, a 1D dataset of sequential text data is transformed into 2D greyscale images to use 2D CNN models for feature extraction and classification. Six CNN architectures-DenseNet201, GoogLeNet, MobileNetV2, ResNet18, ShuffleNet, and SqueezeNet-are implemented, and the features in the last layer (1000 features) of each CNN are classified using the softmax method. To further improve the performance, the two best CNN models were selected, and a new fully connected layer (NewFC) was added. A class-based feature set [3 x 31,695] representing three credit score types (good, poor, and standard) was extracted from each model and merged into a feature set [6 x 31,695]. This combined feature set was then reclassified using KNN, LDA, Naive Bayes, and SVM algorithms. The performance of both CNN and machine learning methods was evaluated using accuracy, precision, sensitivity, specificity, and F-score metrics. To optimize classification performance and reduce computational cost, the RelieF algorithm was used to select the best 5 out of 6 features. Compared to using all 6 features, significant improvements in accuracy and efficiency were observed, demonstrating the effectiveness of the proposed method in credit score classification.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cee3c5842fdd79a04799981e1ecee5e",
  "timestamp": "2025-05-15T01:52:12.208637"
}