{
  "id": 7777,
  "title": "Sociodemographic inequities in unscheduled asthma care visits among public assistance recipients in Japan: additional risk by household composition among workers",
  "abstract": "BackgroundPublic assistance programs aim to prevent financial poverty by guaranteeing a minimum income for basic needs, including medical care. However, time poverty also matters, especially in the medical care adherence of people with chronic diseases. This study aimed to examine the association between the dual burden of working and household responsibilities, with unscheduled asthma care visits among public assistance recipients in Japan.MethodsThis retrospective cohort study included public assistance recipients from two municipalities. We obtained participants' sociodemographic data in January 2016 from the public assistance database and identified the incidence of asthma care visits. Participants' unscheduled asthma visits and the frequency of asthma visits were used as the outcome variables. Unscheduled visits were defined as visits by recipients who did not receive asthma care during the first three months of the observation period. Participants' age, sex, household composition, and work status were used as explanatory variables. Multiple Poisson regression analyses were performed to calculate the cumulative incidence ratio (IR) with a 95% confidence interval (CI) of unscheduled visits across the explanatory variables. The effect of modification on the work status by household composition was also examined.ResultsWe identified 2,386 recipients at risk of having unscheduled visits, among which 121 patients (5.1%) had unscheduled visits. The multivariable Poisson regression revealed that the working recipients had a higher incidence of unscheduled visits than the non-working recipients (IR 1.44, 95% CI 1.00-2.07). Among working recipients, the IRs of unscheduled visits were higher among recipients cohabiting with adults (IR 1.90 95% CI 1.00-3.59) and with children (IR 2.35, 95% CI 1.11-4.95) than for recipients living alone. Among non-working recipients, the IRs of unscheduled visits were lower for recipients living with family (IR 0.74, 95% CI 0.41-1.35) and those living with children (IR 0.50, 95% CI 0.20-1.23). A higher frequency in asthma visits was observed among working recipients living with family.ConclusionsWorking adults cohabiting with children are at the greatest risk of unscheduled visits among adults receiving public assistance. To support healthy lifestyles of public assistance recipients, medical care providers and policymakers should pay special attention to the potentially underserved populations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cf5bc03739e180f13e2300b2dd9cefa",
  "timestamp": "2025-05-15T03:12:11.520688"
}