{
  "id": 3990,
  "title": "Stock Index Forecasting Using an Explainable TAFT Model with Online Data-Driven Social Sentiment Index",
  "abstract": "Forecasting financial indices presents significant challenges owing to the inherent nonlinearity, noise, and disorder in financial time series data. To address these challenges, this study introduces a novel approach that integrates social sentiment analysis with advanced deep learning models. Specifically, a social sentiment index (SSI) is developed using FinBERT to analyze the sentiment scores of online article data from Investing.com. Additionally, a target-auxiliary fusion transformer (TAFT) is designed to effectively integrate SSI as an auxiliary feature with other indicators. This integration captures long-term dependencies and complex patterns in financial data more effectively than traditional time-series models. By incorporating the SSI, the model can capture the influence of social sentiment on financial markets, thus providing a more comprehensive and accurate prediction framework. Furthermore, TAFT incorporates a dynamic attention mechanism during both training and testing, thereby enhancing the explainability of the relative importance across auxiliary input features. The empirical results indicate that incorporating SSI significantly enhances the predictive accuracy of the financial forecasting model. TAFT achieved a 33.3% improvement in a mean absolute error (MAE) over the best-performing benchmark model for the S&P 500. Additionally, in a classification task, the model outperformed benchmark models with an accuracy of 0.71, a precision of 0.74, a recall of 0.64, and an F1 score of 0.63. This approach provides valuable insights for investors, analysts, and portfolio managers, demonstrating the efficacy of combining sentiment analysis with advanced time series models to improve financial decision-making.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cf66d0676cc39c35a5ca7e35fda7986",
  "timestamp": "2025-05-15T01:23:07.212327"
}