{
  "id": 6236,
  "title": "Navigating through geopolitical risk: the role of supply chain concentration",
  "abstract": "Purpose - This study aims to investigate the impact of geopolitical risk (GPR) on supply chain concentration (SCC) and the roles of operational capabilities and resources in this relationship. Design/methodology/approach - Secondary longitudinal data from multiple sources is collected and combined to test for a direct impact of GPR on SCC. We further examine the moderating effects of firms' operational capabilities and resources (i.e. firm resilience, operational slack and cash holding). Fixed-effect regression models are applied to test the hypotheses, followed by a series of robustness tests to check the consistency of the results. Findings - Consistent with the tenets of resource dependence theory, our analysis reveals a significant negative impact of GPR on SCC. Moreover, we find that this adverse effect is attenuated for firms with higher levels of resilience, more operational slack and greater cash holdings. Further analysis suggests that maintaining a diversified supply chain base during heightened GPR is associated with a firm's improved financial performance. Originality/value - This study contributes to the supply chain management (SCM) literature by integrating GPR into the supply chain risk management framework. Additionally, it demonstrates the roles of diversification and operational resources in addressing GPR-induced challenges.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1cfdac3c94c3ffa515705994175fe3ab",
  "timestamp": "2025-05-15T02:56:10.941345"
}