{
  "id": 3327,
  "title": "EMPOWERING GEO-BASED AI ALGORITHM TO AID COASTAL FLOOD RISK ANALYSIS: A REVIEW AND FRAMEWORK DEVELOPMENT",
  "abstract": "Climate change and current susceptibilities exacerbated the coastal flood loss and damage resulting in livelihoods and property damage. Urban areas in the Low to Lower-Middle Income Countries are expected to be disproportionately impacted by the disaster, given a higher share of citizens living in the Low Elevation Coastal Zone, limited financial resources, and poorly constructed disaster protection. Documentation of historical coastal floods, population, and property affected, could advance the assessment by considering those parameters in risk analysis. Besides, incorporating such geographic features e.g., mangroves as the ecological solution for alternative coastal flood protection in the prediction is also essential. Mangrove is considered fit for the LLMIC primarily situated in the tropical zone. The prediction utilizing spatial Machine Learning (ML) could aid climate-related disaster risk analysis and contribute to risk reduction and policy suggestions to improve disaster resilience. The research aims to archive recent studies on the application of geospatial science empowering Artificial Intelligence, notably ML in coastal flood risk assessment, so-called GIS-based AI. Another aim is to document population, property, and mangrove distribution across the LLMIC. Artificial Neural Networks were mostly utilized for disaster risk assessment in past research. The number of 58 historical coastal flood events and 908 expected coastal flood hotspots for 2006 to 2021 has been documented. Over 1,2 million Km(2) falls under vulnerable areas toward coastal flood in LLMIC under different settlement types where Large City (urban areas) dominates it. Mangrove distribution is mainly distributed across tropical regions mostly distributed along the Southeast Asia coast.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d031767fce7c8b0880c0039817d85c5",
  "timestamp": "2025-05-15T02:25:13.665637"
}