{
  "id": 956,
  "title": "Relating the molecular phenotype of ulcerative colitis to the clinical course",
  "abstract": "The expanding portfolio of targeted therapies for ulcerative colitis (UC) suggests that a more precise approach to defining disease activity will aid clinical decision-making. This prospective study used genome-wide microarrays to characterize gene expression in biopsies from the most inflamed colon segments from patients with UC and analyzed associations between molecular changes and short-term outcomes while on standard-of-care treatment. We analyzed 141 biopsies-128 biopsies from 112 UC patients and 13 biopsies from eight inflammatory bowel disease unclassified (IBDU) patients. Endoscopic disease was associated with expression of innate immunity transcripts, e.g. complement factor B (CFB); inflammasome genes (ZBP1 and PIM2); calprotectin (S100A8 and S100A9); and inflammation-, injury-, and innate immunity-associated pathway analysis terms. A cross-validated molecular machine learning classifier trained on the endoscopic Mayo subscore predicted the endoscopic Mayo subscore with area-under-the-curve of 0.85. A molecular calprotectin transcript score showed strong associations with fecal calprotectin and the endoscopic Mayo subscore. Logistic regression models showed that molecular features (e.g. molecular classifier and molecular calprotectin scores) improved the prediction of disease progression over conventional, clinical features alone (e.g. total Mayo score, fecal calprotectin, physician global assessment). The molecular features of UC showed strong correlations with disease activity and permitted development of machine-learning predictive disease classifiers that can be applied to expanded testing in diverse cohorts.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d1a880ff869adee2f4901a0f4f7eb0d",
  "timestamp": "2025-05-15T00:50:08.713418"
}