{
  "id": 6032,
  "title": "The impact of interaction between religion and legal environment on expense misclassification and real activities: international evidence",
  "abstract": "PurposeThere are variations in religious social norms and legal environments around the world. In this paper, we aim to examine the interaction between variations in religious social norms and legal environments on real activities manipulations and expense misclassification using a global sample of 63 countries. Our inquiry is motivated by a paucity of research on the interaction between legal environment and religion on earnings management practices in an international setting.Design/methodology/approachThis study draws on a global sample of 63 countries to examine the effect of variations in religious social norms and legal environments on the trade-off between expense misclassification and real activities earnings management practices. Firm-specific financial data come from Global Compustat. Religion data are obtained from World Values Surveys of the World Bank. We obtain legal environment scores from the International Country Risk Guide.FindingsFindings suggest that the interaction between law and religion serves as constraints on both classification shifting and real activities manipulation around the world. We find that religion strengthens the weak legal environment and the strong legal environment strengthens the weak religious environment to decrease both real activities manipulation and classification shifting when law and religion interact in an international setting. Therefore, our results contradict Zang's (2012) earnings management trade-off evidence. Again, our results contradict Malikov et al.'s (2018) evidence that mandatory International Financial Reporting Standards (IFRS) adoption is associated with increased real activities manipulation.Research limitations/implicationsThe study is limited to 63 countries limiting the generalizability of the findings.Originality/valueThis study provides novel evidence and shows that there is a link between law and religion. The interaction between law and religion decreases expense misclassification and real activities manipulation. We contribute that the interaction between religion and law benefits firms and increases shareholder value as real activities manipulation decreases. Therefore, strengthening the legal environment will complement religion, IFRS and other monitoring mechanisms put in place to mitigate unethical expense misclassification and real activities earnings manipulation around the world.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d2538d97876f6b5ab776206e761b9b2",
  "timestamp": "2025-05-15T02:54:03.396904"
}