{
  "id": 5678,
  "title": "How to Explain the Cross-Section of Equity Returns through Common Principal Components",
  "abstract": "In this paper, we propose a procedure to obtain and test multifactor models based on statistical and financial factors. A major issue in the factor literature is to select the factors included in the model, as well as the construction of the portfolios. We deal with this matter using a dimensionality reduction technique designed to work with several groups of data called Common Principal Components. A block-bootstrap methodology is developed to assess the validity of the model and the significance of the parameters involved. Data come from Reuters, correspond to nearly 1250 EU companies, and span from October 2009 to October 2019. We also compare our bootstrap-based inferential results with those obtained via classical testing proposals. Methods under assessment are time-series regression and cross-sectional regression. The main findings indicate that the multifactor model proposed improves the Capital Asset Pricing Model with regard to the adjusted-R-2 in the time-series regressions. Cross-section regression results reveal that Market and a factor related to Momentum and mean of stocks' returns have positive risk premia for the analyzed period. Finally, we also observe that tests based on block-bootstrap statistics are more conservative with the null than classical procedures.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d292e8bbb5cf6baf3fbc2b3a3b3d1dd",
  "timestamp": "2025-05-15T02:50:21.208700"
}