{
  "id": 6377,
  "title": "How Personality Traits and Professional Skepticism Affect Auditor Quality? A Quantitative Model",
  "abstract": "A qualified auditor is responsible for auditing the financial information of the corporation and providing recommendations for the managerial level to improve operations management, risk management, inside control, and other related operations. The study of the effects of personality traits and professional skepticism on audit quality has become critical but has not been fully clarified for the success of the audit system. This study investigates the hypothesis regarding how audit quality is affected by personality traits and professional skepticism using a quantitative model. The Big Five Model and Hurtt Model are adopted in the proposed research framework. A questionnaire with a total of 254 samples is collected. The data are analyzed using multiple linear regression analysis to test the hypothesis. The results of this study indicate that the moderation effect between personality traits of extroversion and professional skepticism is significantly associated with audit quality. Additionally, this finding contributes to human resource management decisions in that one should be mindful of the increase in perceived audit risk that arises from the professional and personal attributes of the auditor when recruiting individuals to serve on their audit procedures. This research provides empirical evidence of the important relationship between personality traits and professional skepticism regarding auditor quality. The outcomes from the study will reduce the operations risk faced by auditors and improve auditing performances.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d392907e362308159506c254b9e224c",
  "timestamp": "2025-05-15T02:57:38.721189"
}