{
  "id": 2975,
  "title": "Socioeconomic determinants of health, traditional risk factors and cardiovascular outcomes in Australia",
  "abstract": "Background: Cardiovascular disease burden is decreasing, but these reductions have not been distributed equally amongst socioeconomic groups. Objectives: The aim of this study was to define the relationships between different domains of socioeconomic health, traditional cardiovascular risk factors and cardiovascular events.Methods: This was a cross-sectional study of local government areas (LGAs) in Victoria, Australia. We used data from a population health survey combined with cardiovascular event data derived from hospital and government data. Four socioeconomic domains: educational attainment, financial wellbeing, remoteness, and psychosocial health, were generated from 22 variables. The primary outcome was a composite of non-STEMI, STEMI, heart failure and cardiovascular deaths per 10,000 persons. Linear regression and cluster analysis were used to assess the relationships between risk factors and events.Results: Across 79 LGAs there were 33,654 interviews conducted. All socioeconomic domains were associated with burden of traditional risk factors, including hypertension, smoking, poor diet, diabetes, and obesity. Financial wellbeing, educational attainment and remoteness were all correlated with cardiovascular events on univariate analysis. After multivariate adjustment for age and sex, financial wellbeing, psychosocial wellbeing, and remoteness were associated with cardiovascular events, while educational attainment was not. After including traditional risk factors only financial wellbeing and remoteness remained correlated with cardiovas-cular events.Conclusions: Financial wellbeing and remoteness independently be associated with cardiovascular events, while educational attainment and psychosocial wellbeing are attenuated by traditional cardiovascular risk factors. Poor socioeconomic health is clustered in certain areas, which have high cardiovascular event rates.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d4ed98959a2288f8b1edf7f2f9afbee",
  "timestamp": "2025-05-15T02:21:19.218552"
}