{
  "id": 9370,
  "title": "Investigating the Role of Race and Stressful Life Events on the Smoking Patterns of Pregnant and Postpartum Women in the United States: A Multistate Pregnancy Risk Assessment Monitoring System Phase 8 (2016-2018) Analysis",
  "abstract": "ObjectiveTo examine the smoking patterns of women who experienced stressful life events and the impact of racial disparities on the relationship between stressful life events, and prenatal/ postpartum smoking.MethodsThe study analyzed data from the Pregnancy Risk Assessment Monitoring System Phase 8 (2016-2018) survey across five states (CT, LA, MA, MO, WI). Four stressful life event categories were created using thirteen affiliated questions: financial, trauma, partner, and emotional. We assessed: 1) the association between smoking and stressful life events, 2) the impact of race on the relation between smoking and stressful life events, and 3) the long-term effects of smoking on health by assessing the association between smoking and maternal morbidity. Bivariate statistics and multivariate Poisson regression models were conducted.ResultsA total of 24,209 women from five states were included. 8.9% of respondents reported smoking during pregnancy, and 12.7% reported smoking postpartum. There was a significant association between all stressful life events and smoking. Trauma stressful life event had the strongest association with smoking during pregnancy (adjusted PR=2.01; CI: 1.79-2.27) and postpartum (adjusted PR= 1.80; CI: 1.64-1.98). Race and stressful life event interaction effects on smoking had varied significant findings, but at least one racial/ ethnic minority group (Black, Hispanic, Asian) had a higher smoking prevalence than non-Hispanic White per stressful life event category. Lastly, the prevalence of maternal morbidity was higher for smoking during pregnancy (adjusted PR= 1.28; CI: 1.19-1.38) and postpartum (adjusted PR= 1.30; CI: 1.22-1.38) compared to no smoking.Conclusions for PracticeCulturally congruent, multi-disciplinary care teams are needed to address both clinical and social needs to reduce stressful life events and smoking. Screenings for stress should be standardized with a referral system in place to provide ongoing support. What is already known? Smoking during the perinatal period is associated with adverse maternal and infant health outcomes. Psychosocial stress is associated with the prevalence of smoking during the perinatal period. Racial minorities have a higher prevalence of psychosocial stress due to longstanding systemic factors including racism.What this study adds? Most studies assessing stressful life events and smoking focus on single states or preconception and prenatal periods. This novel study is a multi-state analysis assessing both the prenatal and postpartum periods. Furthermore, this study provides an overview of the types of stress different racial groups are affected by and recommendations for effective smoking cessation, stress screening, and stress reduction methods.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d5bda5117ff2690dceb779e20eccd7c",
  "timestamp": "2025-05-15T03:28:17.530677"
}