{
  "id": 1361,
  "title": "Systemic risk among Chinese oil and petrochemical firms based on dynamic tail risk spillover networks",
  "abstract": "This study examines the dynamic network of tail risk spillovers among Chinese oil and petrochemical firms listed on the Shanghai and Shenzhen A-share markets from 2015 to 2023. Employing the single-index quantile regression technique and the tail risk spillover model, it constructs a framework to assess systemic risk transmission within the oil and petrochemical industry. A block model is utilized to explore clustering patterns of risk spillovers, focusing on the overall network structure and individual firms' roles. The findings reveal a significant systemic risk spillover effect, with the volatility of tail risk spillovers closely tied to geopolitical and financial risks. The industry predominantly exhibits characteristics of a scale-free network, transitioning to a small-world network when risk spillover intensity declines. Unlike the financial and real estate sectors, the oil and petrochemical industry's risk spillover network features pronounced modularity inversely related to spillover intensity. Oil exploration firms and petrochemical product segments are identified as primary sources and recipients of risk spillovers, reflecting a bidirectional relationship. Conversely, oil transportation firms act as intermediaries, while oil refining firms primarily display intra-segment spillovers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d711a84bb054e73a48718ededc7502b",
  "timestamp": "2025-05-15T02:01:44.896997"
}