{
  "id": 4373,
  "title": "A cross-sectional analysis of perinatal depressive symptoms among Punjabi-speaking women: are they at risk?",
  "abstract": "Background: Depression is the leading cause of disability for childbearing women. We examined three specific research questions among Punjabi-speaking women residing in the Fraser Health Authority: 1) What are the prevalence rates of prenatal depressive symptoms? 2) Do Punjabi-speaking women have a higher likelihood of reporting depressive symptoms compared to English-speaking women after controlling for age, level of education and financial worries, and 3) Given the same level of exposure to level of education and financial worries, do Punjabi-speaking women have the same likelihood of reporting depressive symptoms? Methods: Data originated from the Fraser Health Authority prenatal registration database consisting of pregnant women (n = 9684) who completed a prenatal registration form between June 2009 and August 2010; 9.1 % indicated speaking Punjabi. The Whooley Depression Screen measured depressive symptoms. Chi-square tests and logistic multiple regression were used to examine the rates of reporting depressive symptoms among Punjabi-speaking women compared to English-speaking women. Results: Punjabi-speaking women are at a higher risk for perinatal depressive symptoms. Women needing an interpreter were more likely to report prenatal depressive symptoms compared to English-speaking women. All registrants who reported financial worries had four and a half times the odds of reporting depressive symptoms. The impact of financial worries was significantly greater in the English-speaking women compared to the Punjabi-speaking women needing an interpreter. Conclusion: Using an established screening device, Punjabi-speaking women were found to be at higher risk for prenatal depressive symptoms.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d77d0e85dd9c0a39b0a00caacd0e441",
  "timestamp": "2025-05-15T02:36:38.392452"
}