{
  "id": 6179,
  "title": "Total Abdominal Colectomies With Proctectomy Are Associated With Higher 30-Day Readmission Rates in Children With Ulcerative Colitis",
  "abstract": "Background Hospital readmissions are a burden on patients and families and place financial strain on the health care system. Thirty-day readmission rates for adult patients undergoing colectomy are as high as 30%, and inflammatory bowel disease is a risk factor for readmission. We used a multicenter pediatric surgical database to determine the 30-day readmission rate for pediatric patients with ulcerative colitis (UC) undergoing total abdominal colectomy (TAC) and to identify risk factors for 30-day hospital readmission. Methods We used the National Surgical Quality Improvement Program-Pediatrics database to identify pediatric patients with UC undergoing a TAC between 2012 and 2017. We identified patient and procedural data from the index hospitalization and used logistic regression to identify risk factors for 30-day readmission rates, adjusting for confounding factors. Results We identified 489 pediatric UC TAC hospitalizations between 2012 and 2017, and 19.4% were readmitted within 30 days of surgical discharge. Patient demographics and preoperative laboratory values were not associated with risk of readmission. The TAC procedures that included a proctectomy were at a 2-fold (odds ratio = 2.4; 95% confidence interval, 1.1-5.2) higher risk of 30-day readmission than TAC alone after adjusted analysis. Conclusions Nearly 20% of annual pediatric UC hospitalizations involving a colectomy resulted in a 30-day hospital readmission. Notably, TAC procedures that included a proctectomy had significantly higher readmission rates compared to TAC alone. These results can inform risk management strategies aimed at reducing morbidity and hospital readmissions for children with UC.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d8e9f66fce74738983a206294032713",
  "timestamp": "2025-05-15T02:55:44.488992"
}