{
  "id": 9215,
  "title": "Sleep or Play Online Poker?: Gambling Behaviors and Tilt Symptoms While Sleep Deprived",
  "abstract": "Online poker has the convenience of being accessible 24/7 allowing a large proportion of players to gamble at night. Although some studies postulate a bi-directional relationship between excessive online poker playing and sleep disturbances, sleep has yet to be studied as a primary outcome variable in online poker studies. Sleep deprivation has been linked to alterations in emotional regulation, decision-making, and risk-taking behaviors. All of which are known to induce episodes of tilt. Conversely, online poker playing during regular sleep hours may interfere with sleep quality. The objectives of the present study are (a) to explore the effects of sleep deprivation on tilt symptoms and gambling behaviors and (b) to assess whether playing an online poker session shortly before bedtime (120 min) influences the player's sleep quality. Sleeping habits, tilt symptoms, and online poker behaviors of 23 regular online poker players (22 men, 1 woman) were monitored daily for 28 days using questionnaires and hand histories. Tilt and gambling behaviors during online poker sessions (n = 588) played while the player was sleep-deprived were compared to sessions played while not sleep-deprived. Different sleep variables were also compared for sessions (n = 897) played 2 h before bedtime to no sessions played before sleep. Sleep-deprived poker sessions revealed higher emotional and behavioral tilt, a higher number of hands played and unfavorable financial results than at-rest sessions. Also, emotional and behavioral tilt was higher when alcohol was consumed. Sessions played 2 h before bedtime revealed a shorter sleep onset latency than when no sessions were played before bedtime. Post-hoc mixed regression analyses revealed that emotional and behavioral tilt is associated with shorter total sleep time and shorter sleep onset latency, while cognitive tilt is associated with a decrease in sleep efficiency. This study is the first to specifically explore sleep variables with online poker players within an ecological study design. The findings shed light on the daily impacts of nighttime online gambling practices. Future studies are needed to further explore the interaction between subjective and objective sleep variables and online gambling habits as well as investigate players' motives for playing while sleep deprived.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d9b0d41e3f9cab87e2b3f1a4013b546",
  "timestamp": "2025-05-15T03:26:54.480012"
}