{
  "id": 8076,
  "title": "Rural-Urban Differences in Mortality among Mechanically Ventilated Patients in Intensive and Intermediate Care",
  "abstract": "Rationale: Intermediate care (also termed step-down or moderate care) has been proposed as a lower cost alternative to care for patients who may not clearly benefit from intensive care unit admission. Intermediate care units may be appealing to hospitals in financial crisis, including those in rural areas. Outcomes of patients receiving intermediate care are not widely described. Objectives: To examine relationships among rurality, location of care, and mortality for mechanically ventilated patients. Methods: Medicare beneficiaries aged 65 years and older who received invasive mechanical ventilation between 2010 and 2019 were included. Multivariable logistic regression was used to estimate the association between admission to a rural or an urban hospital and 30-day mortality, with separate analyses for patients in general, intermediate, and intensive care. Models were adjusted for age, sex, area deprivation index, primary diagnosis, severity of illness, year, comorbidities, and hospital volume. Results: There were 2,752,492 hospitalizations for patients receiving mechanical ventilation from 2010 to 2019, and 193,745 patients (7.0%) were in rural hospitals. The proportion of patients in rural intermediate care increased from 4.1% in 2010 to 6.3% in 2019. Patient admissions to urban hospitals remained relatively stable. Patients in rural and urban intensive care units had similar adjusted 30-day mortality, at 46.7% (adjusted absolute risk difference -0.1% [95% confidence interval, -0.7% to 0.6%]; P = 0.88). However, adjusted 30-day mortality for patients in rural intermediate care was significantly higher (36.9%) than for patients in urban intermediate care (31.3%) (adjusted absolute risk difference 5.6% [95% confidence interval, 3.7% to 7.6%]; P < 0.001). Conclusions: Hospitalization in rural intermediate care was associated with increased mortality. There is a need to better understand how intermediate care is used across hospitals and to carefully evaluate the types of patients admitted to intermediate care units.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1d9d993b00006eb4d7c4bb8b60b124a3",
  "timestamp": "2025-05-15T03:15:09.326049"
}