{
  "id": 7410,
  "title": "Assessing Patient-Reported Financial Hardship in Patients With Cancer in Routine Clinical Care",
  "abstract": "PURPOSE:Financial hardship (FH) in cancer care is a growing challenge for patients, their caregivers, and health care providers with impact on morbidity and mortality. In this study, we report on a standardized approach to describe the prevalence and predictors for FH as part of routine clinical workflow. We also report on the association of FH with survival in our cancer patient population.METHODS:This study includes patients who completed a FH screen at least once between 2018 and 2020. Demographics, disease state, and mortality data were extracted from the medical records. Multivariable logistic regression models were used to examine association of sociodemographic and disease variables with FH. By using propensity score weighting to account for differences in demographic and clinical factors between patients with and without FH, we then fit Cox proportional hazards models to examine the relationship between FH and survival.RESULTS:The study cohort included 31,154 patients. FH was reported by 14% (n = 4,250) of the patients. A significantly higher likelihood of having FH (P < .001 for all) was reported by racial/ethnic minority patients; those who were unemployed/disabled, single, or divorced; patients from disadvantaged neighborhoods; and those who were self-pay or had government insurance. Older age, being retired, and living farther from the cancer center were associated with significantly less likelihood of endorsing FH. Patients who endorsed FH had a lower survival (hazard ratio for mortality 1.46).CONCLUSION:Our study identified key groups more likely to report FH in a relatively affluent population at a large cancer center and showed an adverse association between FH and survival. Further research is needed to develop clinical care pathways for patients at high risk for worse financial and clinical outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1db93e0fa253bca505c49d745cb790b9",
  "timestamp": "2025-05-15T03:08:00.918910"
}