{
  "id": 9438,
  "title": "A study of COVID-19-related financial distress in companies in Mexico",
  "abstract": "PurposeThis paper aims to study the business-specific features associated with financial distress in enterprises during the COVID-19 pandemic.Design/methodology/approachA binary logistic regression model is used to analyze a random sample of 754 companies in Jalisco, Mexico. A modified backward elimination process is used to achieve parsimony. Model robustness is reviewed by running several model selection algorithms.FindingsLayoffs raise companies' odds of stress by 2.9 times. Being a micro business doubles companies' odds of stress while asking for government aid implies 1.9 times higher odds. A drop in annual sales in 2021 increases the odds of closing by 1.7 times. Companies led by female owners faced 1.6 times higher odds of stress, a similar increase in odds as in companies in the manufacturing and construction sectors. Finally, businesses aged five or fewer years were 1.5 times more likely to experience stress.Research limitations/implicationsGiven the study's limited geographical scope, applying the results to broader public policy and its focalization may require external validation and deeper analysis of relevant local economic mechanisms, incentives, and constraints.Practical implicationsFindings support targeting public policy in disaster relief. For instance, financial aid programs may prioritize enterprises with some features that increase their risk of experiencing stress. Results also have implications for business strategies. For example, innovation or digitalization efforts in the company will serve the business better if they target improving sales and keeping the labor force.Originality/valueThis study contributes to closing a gap in business-specific studies on COVID-19. It underlines future research avenues, particularly in emerging issues such as heterogeneity within small business classification and gender studies. ObjetivoEste art & iacute;culo estudia las caracter & iacute;sticas espec & iacute;ficas de las empresas asociadas a la presencia de dificultades financieras en el contexto de la pandemia de COVID-19.Dise & ntilde;o/metodolog & iacute;a/enfoqueSe utiliz & oacute; un modelo de regresi & oacute;n log & iacute;stica binaria para analizar una muestra aleatoria de 754 empresas en Jalisco, M & eacute;xico. Para lograr la parsimonia, se aplic & oacute; un proceso de eliminaci & oacute;n reversa modificado. La robustez del modelo fue evaluada mediante varios algoritmos de selecci & oacute;n de modelos.ResultadosLos despidos aumentan las probabilidades de estr & eacute;s para las empresas en 2.9 veces. Ser una microempresa duplica las probabilidades de estr & eacute;s, mientras que solicitar ayuda gubernamental implica 1.9 veces mayores probabilidades de estr & eacute;s. Una ca & iacute;da en las ventas anuales en 2021 aumenta en 1.7 veces las probabilidades de considerar un cierre definitivo. Las empresas con mujeres propietarias enfrentaron 1.6 veces mayores probabilidades de estr & eacute;s; se observa un aumento de estr & eacute;s similar en las empresas del sector manufacturero y de la construcci & oacute;n. Finalmente, las empresas con una antig & uuml;edad de cinco a & ntilde;os o menos tienen 1.5 veces m & aacute;s probabilidades de entrar en estr & eacute;s.Limitaciones de la investigaci & oacute;nDada la limitada cobertura geogr & aacute;fica del estudio, la aplicaci & oacute;n de los resultados a pol & iacute;ticas p & uacute;blicas, incluida su focalizaci & oacute;n, puede requerir validaci & oacute;n externa y un an & aacute;lisis m & aacute;s profundo de los mecanismos econ & oacute;micos locales relevantes, los incentivos y las restricciones.Implicaciones pr & aacute;cticasLos hallazgos respaldan la focalizaci & oacute;n de la pol & iacute;tica p & uacute;blica ante desastres. Por ejemplo, los programas de ayuda financiera deben priorizar a las empresas que exhiben algunas caracter & iacute;sticas identificadas que aumentan su riesgo de experimentar estr & eacute;s. Los resultados tambi & eacute;n tienen implicaciones para las estrategias empresariales: los esfuerzos de innovaci & oacute;n o digitalizaci & oacute;n en la empresa servir & aacute;n mejor si se enfocan en mantener o mejorar las ventas y evitar los despidos.Originalidad/valorEste estudio contribuye a cerrar una brecha en los estudios espec & iacute;ficos de empresas en el contexto de COVID-19 y subraya futuras l & iacute;neas de investigaci & oacute;n, particularmente en temas emergentes como la heterogeneidad dentro de la clasificaci & oacute;n de peque & ntilde;as empresas y estudios de g & eacute;nero. ObjetivoEste artigo estuda as caracter & iacute;sticas espec & iacute;ficas das empresas associadas ao estresse financeiro durante a pandemia de COVID-19.DesenhoUm modelo de regress & atilde;o log & iacute;stica bin & aacute;ria foi utilizado para analisar uma amostra aleat & oacute;ria de 754 empresas em Jalisco, M & eacute;xico. Para alcan & ccedil;ar a parcim & ocirc;nia, foi aplicado um processo de elimina & ccedil;& atilde;o regressiva modificado. A robustez do modelo foi revisada por meio de v & aacute;rios algoritmos de sele & ccedil;& atilde;o de modelos.Conclus & otilde;esDemiss & otilde;es aumentam as probabilidades de estresse para as empresas em 2,9 vezes. Ser uma microempresa dobra as probabilidades de estresse, enquanto solicitar ajuda governamental implica 1,9 vezes maiores probabilidades. Uma queda nas vendas anuais em 2021 aumenta em 1,7 vezes as probabilidades de fechamento. As empresas lideradas por uma propriet & aacute;ria enfrentaram 1,6 vezes maiores probabilidades de estresse; um aumento similar nas probabilidades & agrave;s empresas dos setores de manufatura e constru & ccedil;& atilde;o. Finalmente, empresas com idade de cinco anos ou menos tinham 1,5 vezes mais probabilidades de entrar em estresse.Limita & ccedil;& otilde;es da pesquisaDada a limitada abrang & ecirc;ncia geogr & aacute;fica do estudo, a aplica & ccedil;& atilde;o dos resultados a pol & iacute;ticas p & uacute;blicas, incluindo sua focaliza & ccedil;& atilde;o, pode exigir valida & ccedil;& atilde;o externa e uma an & aacute;lise mais aprofundada dos mecanismos econ & ocirc;micos locais relevantes, dos incentivos e das restri & ccedil;& otilde;es.Implica & ccedil;& otilde;es pr & aacute;ticasOs achados apoiam a orienta & ccedil;& atilde;o da pol & iacute;tica p & uacute;blica no aux & iacute;lio em desastres. Por exemplo, programas de ajuda financeira devem priorizar as empresas que apresentam algumas caracter & iacute;sticas que aumentam seu risco de experimentar estresse. Os resultados tamb & eacute;m t & ecirc;m implica & ccedil;& otilde;es para estrat & eacute;gias empresariais: esfor & ccedil;os de inova & ccedil;& atilde;o ou digitaliza & ccedil;& atilde;o na empresa servir & atilde;o melhor se focarem em melhorar as vendas e manter a for & ccedil;a de trabalho.OriginalidadeEste estudo contribui para preencher lacunas em pesquisas espec & iacute;ficas sobre empresas e COVID-19, destacando futuras linhas de investiga & ccedil;& atilde;o, como a heterogeneidade na classifica & ccedil;& atilde;o de pequenas empresas e estudos de g & ecirc;nero.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1dbc759b605d351708c34a0a8614bec4",
  "timestamp": "2025-05-15T03:28:46.313181"
}