{
  "id": 905,
  "title": "Turbulence-driven Autonomous Stock Trading using Deep Reinforcement Learning",
  "abstract": "This paper explores Deep Reinforcement Learning (DRL) algorithms for autonomous stock trading, aiming to replace stockbrokers with more efficient and profitable strategies. The study focuses on stock trading in finance, using DRL to analyze trends and exploit market fluctuations. It delves into the application of DRL techniques in stock trading, using Proximal Policy Optimization (PPO) algorithm, and, experimental results from training and testing on Dow 30 and S&P 500 datasets that reveal the effectiveness of incorporating turbulence indicators such as McClellan Oscillator (MCO) and Hindenburg principle. The incorporation of modified indicators: MCO and Hindenburg Omen, significantly influenced the trading system's performance. In comparing trading strategies, the turbulence-incorporated Proximal Policy Optimization (PPO-T) agent, initially funded with$1M exhibited consistent improvement and greater resilience, with slight portfolio value dips compared to the non-turbulence counterpart (PPO). Notably, PPO-T outperformed PPO during market turbulence, achieving portfolio value surged to 1.8 and 2.0 for DOW 30 and SP 500, respectively, surpassing the values of 1.5 and 1.9 attained by PPO. This underscores PPO-T's capacity for higher final portfolio values, emphasizing the efficacy of turbulence indicators in fortifying trading systems, especially in turbulent market conditions. The agent's performance evaluation involves tracking portfolio value changes over specified trading days.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1dd577bee0bd9e459fdbe30b609ddec1",
  "timestamp": "2025-05-15T00:49:36.289903"
}