{
  "id": 1956,
  "title": "Fragility modeling practices and their implications on risk and resilience analysis: From the structure to the network scale",
  "abstract": "Although fragility function development for structures is a mature field, it has recently thrived on new algorithms propelled by machine learning (ML) methods along with heightened emphasis on functions tailored for community- to regional-scale application. This article seeks to critically assess the implications of adopting alternative traditional and emerging fragility modeling practices within seismic risk and resilience quantification to guide future analyses that span from the structure to infrastructure network scale. For example, this article probes the similarities and differences in traditional and ML techniques for demand modeling, discusses the shift from one-parameter to multiparameter fragility models, and assesses the variations in fragility outcomes via statistical distance concepts. Moreover, the previously unexplored influence of these practices on a range of performance measures (e.g. conditional probability of damage, risk of losses to individual structures, portfolio risks, and network recovery trajectories) is systematically evaluated via the posed statistical distance metrics. To this end, case studies using bridges and transportation networks are leveraged to systematically test the implications of alternative seismic fragility modeling practices. The results show that, contrary to the classically adopted archetype fragilities, parameterized ML-based models achieve similar results on individual risk metrics compared to structure-specific fragilities, promising to improve portfolio fragility definitions, deliver satisfactory risk and resilience outcomes at different scales, and pinpoint structures whose poor performance extends to the global network resilience estimates. Using flexible fragility models to depict heterogeneous portfolios is expected to support dynamic decisions that may take place at different scales, space, and time, throughout infrastructure systems.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1df668ef3edfc652ec92bf9992a77191",
  "timestamp": "2025-05-15T01:01:41.598429"
}