{
  "id": 9200,
  "title": "Methadone and buprenorphine for the management of opioid dependence: a systematic review and economic evaluation",
  "abstract": "Objectives: To assess the clinical effectiveness and cost-effectiveness of buprenorphine maintenance therapy (BMT) and methadone maintenance therapy (MMT) for the management of opioid-dependent individuals. Data sources: Major electronic databases were searched from inception to August 2005. Industry submissions to the National Institute for Health and Clinical Excellence were accessed. Review methods: The assessment of clinical effectiveness was based on a review of existing reviews plus an updated search for randomised controlled trials (RCTs). A decision tree with Monte Carlo simulation model was developed to assess the cost-effectiveness of BMT and MMT. Retention in treatment and opiate abuse parameters were sourced from the meta-analysis of RCTs directly comparing flexible MMT with flexible dose BMT. Utilities were derived from a panel representing a societal perspective. Results: Most of the included systematic reviews and RCTs were of moderate to good quality, and focused on short-term ( up to 1-year follow-up) outcomes of retention in treatment and the level of opiate use (self-report or urinalysis). Most studies employed a trial design that compared a fixed-dose strategy (i.e. all individuals received a standard dose) of MMT or BMT and were conducted in predominantly young men who fulfilled criteria as opiate-dependent or heroin-dependent users, without significant co-morbidities. RCT meta-analyses have shown that a fixed dose of MMT or BMT has superior levels of retention in treatment and opiate use than placebo or no treatment, with higher fixed doses being more effective than lower fixed doses. There was evidence, primarily from non-randomised observational studies, that fixed-dose MMT reduces mortality, HIV risk behaviour and levels of crime compared with no therapy and one small RCT has shown the level of mortality with fixed-dose BMT to be significantly less than with placebo. Flexible dosing (i.e. individualised doses) of MMT and BMT is more reflective of real-world practice. Retention in treatment was superior for flexible MMT than flexible BMT dosing but there was no significant difference in opiate use. Indirect comparison of data from population cross-sectional studies suggests that mortality with BMT may be lower than that with MMT. A pooled RCT analysis showed no significant difference in serious adverse events with MMT compared with BMT. Although treatment modifier evidence was limited, adjunct psychosocial and contingency interventions ( e. g. financial incentives for opiate-free urine samples) appeared to enhance the effects of both MMT and BMT. Also, MMT and BMT appear to be similarly effective whether delivered in a primary care or outpatient clinic setting. Although most of the included economic evaluations were considered to be of high quality, none used all of the appropriate parameters, effectiveness data, perspective and comparators required to make their results generalisable to the NHS context. One company (Schering-Plough) submitted cost-effectiveness evidence based on an economic model that had a 1-year time horizon and sourced data from a single RCT of flexible-dose MMT compared with flexible-dose BMT and utility values obtained from the literature; the results showed that for MMT vs no drug therapy, the incremental cost-effectiveness ratio ( ICER) was pound 12,584/quality-adjustedlife-year ( QALY), for BMT versus no drug therapy, the ICER was pound 30,048/QALY and in a direct comparison, MMT was found to be slightly more effective and less costly than BMT. The assessment group model found for MMT versus no drug therapy that the ICER was pound 13,697/ QALY, for BMT versus no drug therapy that the ICER was pound 26,429/QALY and, as with the industry model, in direct comparison, MMT was slightly more effective and less costly than BMT. When considering social costs, both MMT and BMT gave more health gain and were less costly than no drug treatment. These findings were robust to deterministic and probabilistic sensitivity analyses. Conclusions: Both flexible-dose MMT and BMT are more clinically effective and more cost-effective than no drug therapy in dependent opiate users. In direct comparison, a flexible dosing strategy with MMT was found be somewhat more effective in maintaining individuals in treatment than flexible-dose BMT and therefore associated with a slightly higher health gain and lower costs. However, this needs to be balanced by the more recent experience of clinicians in the use of buprenorphine, the possible risk of higher mortality of MMT and individual opiate-dependent users' preferences. Future research should be directed towards the safety and effectiveness of MMT and BMT; potential safety concerns regarding methadone and buprenorphine, specifically mortality and key drug interactions; efficacy of substitution medications ( in particular patient subgroups, such as within the criminal justice system, or within young people); and uncertainties in cost-effectiveness identified by current economic models.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1dfbd21190915a4f247953241a2e7d48",
  "timestamp": "2025-05-15T03:26:26.030499"
}