{
  "id": 4670,
  "title": "Specific Stressors Linked to Functional Outcomes in Psychology Doctoral Students",
  "abstract": "In response to the COVID-19 pandemic and the lack of research on stress levels among psychology doctoral students, this study aimed to investigate the functional outcomes of clinical and counseling psychology doctoral students (N = 889). The study examined the unique effects of various risk factors, including lifetime trauma, recent stressful experiences, COVID-19 stress, financial stress, and general stress, on functional outcomes such as quality of life, depression symptoms, anxiety symptoms, and physical pain. Furthermore, the study explored the effects of gender, racial/ethnic background, and sexual orientation on the relationship between risk factors and outcomes. Multivariate multiple regression analyses were conducted to examine the unique relationships between the risk factors and functional outcomes while controlling for demographic covariates. The findings revealed a considerable proportion of participants reporting diminished quality of life, elevated levels of physical pain, as well as symptoms of depression and anxiety, with 18.33% and 55.56% surpassing the threshold for a probable disorder, respectively. General stress and recent stressful experiences were associated with lower quality of life, increased depression and anxiety symptoms, and pain. Lifetime trauma and COVID-19 stress were linked to more depression and anxiety symptoms and pain, while financial stress was associated with lower quality of life. These findings underscore the critical need to address the concerning levels of stress experienced by psychology doctoral students, as all examined risk factors were associated with one or more of the studied outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e0883854651aab1fb8a54cc91ca71a9",
  "timestamp": "2025-05-15T02:39:57.420606"
}