{
  "id": 5758,
  "title": "POLICY DIVIDENDS AND PERFORMANCE: A CASE STUDY OF LISTED AGRICULTURE FIRMS IN GHANA",
  "abstract": "This paper aims to assess the relationship between policy dividends and agribusiness firms' performance in Ghana. The issue of dividend policy is one of the very essential elements in economics and business that cannot be overlooked. The dividend, which is the benefit of shareholders in return for their risk and investment, is determined by different factors in an organization. These factors include financing limitations, investment chances and choices, firm size, pressure from shareholders, and regulatory regimes, however, the dividend pay-out of agribusiness firms is not only the source of cash flow to the shareholders, but it also offers information relating to firm's current and future performance. Two specific objectives were coined to i) establish the relationship between dividend policy and agriculture firms' performance (ROE) for listed companies on GSE. ii) examine the effect of size, leverage, and growth on financial performance (ROE) of listed agriculture companies on GSE. The study used data collected from annual reports of five (5) agriculture companies listed on the Ghana Stock Exchange (GSE) for the period of nine (9) years (2010-2018) and employed panel data regression models to estimate the observed relationships. The study results show that dividend policy was a highly significant predictor in explaining the agriculture firms' performance (ROE). The firm size and leverage had a positive and statistically insignificant effect on the financial performance of listed agribusiness firms. The results seem to suggest that, for listed agriculture firms' on GSE, size and leverage do not necessarily influence their return on equity. The study recommended that listed agriculture firms should invest in profitable assets that will yield higher returns in the future to enhance their financial performance and attract investments in the future and investors should not rely on the number of dividends paid to ascertain the financial stability of the agribusiness firms.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e13210431308559fab65cadd1825843",
  "timestamp": "2025-05-15T02:50:54.022961"
}