{
  "id": 7927,
  "title": "Potentially Inappropriate Medication Use among Underserved Older Latino Adults",
  "abstract": "Background: Previous studies identified alarming increases in medication use, polypharmacy, and the use of potentially inappropriate medications (PIMs) among minority older adults with multimorbidity. However, PIM use among underserved older Latino adults is still largely unknown. The main objective of this study is to examine the prevalence of PIM use among underserved, community-dwelling older Latino adults. This study examines both the complexity of polypharmacy in this community and identifies associations between PIM and multimorbidity, polypharmacy, and access to medical care among this segment of our population. Methods: This community-based, cross-sectional study included 126 community-dwelling Latinos aged 65 years and older. The updated 2019 AGS Beers Criteria was used to identify participants using PIMs. We used multinomial logistic regression to examine the independent association of PIM with several independent variables including demographic characteristics, the number of chronic conditions, the number of prescription medications used, level of pain, and sleep difficulty. In addition, we present five cases in order to offer greater insight into PIM use among our sample. Results: One-third of participants had at least one use of PIM. Polypharmacy (=5 medications) was observed in 55% of our sample. In addition, 46% took drugs to be used with caution (UWC). In total, 16% were taking between 9 and 24 medications, whereas 39% and 46% were taking 5 to 8 and 1 to 4 prescription medications, respectively. The multinomial logit regression analysis showed that (controlling for demographic variables) increased PIM use was associated with an increased number of prescription medications, number of chronic conditions, sleep difficulty, lack of access to primary care, financial strains, and poor self-rated health. Discussion: Both qualitative and quantitative analysis revealed recurrent themes in the missed identification of potential drug-related harm among underserved Latino older adults. Our data suggest that financial strain, lack of access to primary care, as well as an increased number of medications and co-morbidity are inter-connected. Lack of continuity of care often leads to fragmented care, putting vulnerable patients at risk of polypharmacy and drug-drug interactions as clinicians lack access to a current and complete list of medications patients are using at any given time. Therefore, improving access to health care and thereby continuity of care among older Latino adults with multimorbidity has the potential to reduce both polypharmacy and PIM use. Programs that increase access to regular care and continuity of care should be prioritized among multimorbid, undeserved, Latino older adults in an effort toward improved health equity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e17103898bcb63a6dee96fabcf25e77",
  "timestamp": "2025-05-15T03:13:30.659828"
}