{
  "id": 9355,
  "title": "Models for malaria control optimization-a systematic review",
  "abstract": "BackgroundDespite advances made in curbing the global malaria burden since the 2000s, progress has stalled, in part due to a plateauing of the financing available to implement needed interventions. In 2020, approximately 3.3 billion USD was invested globally for malaria interventions, falling short of the targeted 6.8 billion USD set by the GTS, increasing the financial gap between desirable and actual investment. Models for malaria control optimization are used to disentangle the most efficient interventions or packages of interventions for inherently constrained budgets. This systematic review aimed to identify and characterise models for malaria control optimization for resource allocation in limited resource settings and assess their strengths and limitations.MethodsFollowing the Prospective Register of Systematic Reviews and Preferred reporting Items for Systematic Reviews and Meta-Analysis guidelines, a comprehensive search across PubMed and Embase databases was performed of peer-reviewed literature published from inception until June 2024. The following keywords were used: optimization model; malaria; control interventions; elimination interventions. Editorials, commentaries, opinion papers, conference abstracts, media reports, letters, bulletins, pre-prints, grey literature, non-English language studies, systematic reviews and meta-analyses were excluded from the search.ResultsThe search yielded 2950 records, of which 15 met the inclusion criteria. The studies were carried out mainly in countries in Africa (53.3%), such as Ghana, Nigeria, Tanzania, Uganda, and countries in Asia (26.7%), such as Thailand and Myanmar. The most used interventions for analyses were insecticide-treated bed nets (93.3%), IRS (80.0%), Seasonal Malaria Chemoprevention (33.3%) and Case management (33.3%). The methods used for estimating health benefits were compartmental models (40.0%), individual-based models (40.0%), static models (13.0%) and linear regression model (7%). Data used in the analysis were validated country-specific data (60.0%) or non-country-specific data (40.0%) and were analysed at national only (40.0%), national and subnational levels (46.7%), or subnational only levels (13.3%).ConclusionThis review identified available optimization models for malaria resource allocation. The findings highlighted the need for country-specific analysis for malaria control optimization, the use of country-specific epidemiological and cost data in performing modelling analyses, performing cost sensitivity analyses and defining the perspective for the analysis, with an emphasis on subnational tailoring for data collection and analysis for more accurate and good quality results. It is critical that the future modelling efforts account for fairness and target at risk malaria populations that are hard-to-reach to maximize impact.Trial registration: PROSPERO Registration number: CRD42023436966ConclusionThis review identified available optimization models for malaria resource allocation. The findings highlighted the need for country-specific analysis for malaria control optimization, the use of country-specific epidemiological and cost data in performing modelling analyses, performing cost sensitivity analyses and defining the perspective for the analysis, with an emphasis on subnational tailoring for data collection and analysis for more accurate and good quality results. It is critical that the future modelling efforts account for fairness and target at risk malaria populations that are hard-to-reach to maximize impact. Trial registration: PROSPERO Registration number: CRD42023436966",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e1a5b6cf48e97fbbbac84cadfe91a54",
  "timestamp": "2025-05-15T03:27:53.415495"
}