{
  "id": 5794,
  "title": "A Risk Typology for Depression in African Americans",
  "abstract": "Studies report that African Americans are likely to experience severe, chronic, and disabling depressive symptoms leading to poor depression outcomes. There are several psychosocial and sociocultural factors that individually contribute to depression in African Americans (i.e. chronic stress, negative life events, negative social interaction, social support, and religiosity). However, African Americans are a heterogeneous population and the identification of subpopulations with distinct constellations of multiple co-occurring risk and protective factors may offer greater explanatory potential into depression burden for African Americans. This study used data from the American's Changing Lives Survey to identify risk types for depression in a national sample of African American adults and older adults (n = 1174). Latent class analysis results revealed a risk typology that included 3 distinct risk patterns for African Americans. Individuals in the High Protective/Low Risk Type (41%) had high levels of religiosity and social support. Those in the Moderate Protection/Low Risk Type (44%) had moderate levels of religiosity and social support. The Low Protection/Low Risk Type (15%) had low organizational and non-organizational religiosity and relatively low social support. All three types were marked by relatively low risk factors (i.e. negative events, financial stress, and negative social interaction). Multinomial logistic regression results suggested associations between demographic characteristics (i.e. gender, age, education, marital status), depressive symptoms, and risk type. Study results have implications for the development of depression interventions that are targeted to a specific risk type and tailored to the demographic profile of individuals likely to experience poor depression outcomes.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e2fd2fb0591806b6cf9e21b9115ebe2",
  "timestamp": "2025-05-15T02:51:30.076328"
}