{
  "id": 7703,
  "title": "Digital Health as a Mechanism to Reduce Neonatal Intensive Care Unit Admissions: Retrospective Cohort Study",
  "abstract": "Background: Admission to the neonatal intensive care unit (NICU) is costly and has been associated with financial and emotional stress among families. Digital health may be well equipped to impact modifiable health factors that contribute to NICU admission rates. Objective: The aim of the study is to investigate how the use of a comprehensive prenatal digital health platform is associated with gestational age at birth and mechanisms to reduce the risk of admission to the NICU. Methods: Data were extracted from 3326 users who enrolled in a comprehensive digital health platform between January 2020 and May 2022. Multivariable linear and logistic regression models were used to estimate the associations between hours of digital health use and (1) gestational age at birth and (2) mechanisms to reduce the risk of a NICU admission. Multivariable logistic regression models estimated the associations between (1) gestational age at birth and (2) mechanisms to reduce the risk of a NICU admission and the likelihood of a NICU admission. All analyses were stratified by the presence of any gestational conditions during pregnancy. Results: For users both with and without gestational conditions, hours of digital health use were positively associated with gestational age at birth (in weeks; with gestational conditions: beta=.01; 95% CI 0.0006-0.02; P=.04 and without gestational conditions: beta=.01; 95% CI 0.0006-0.02; P=.04) and mechanisms that have the potential to reduce risk of a NICU admission, including learning medically accurate information (with gestational conditions: adjusted odds ratio [AOR] 1.05, 95% CI 1.03-1.07; P<.001 and without gestational conditions: AOR 1.04, 95% CI 1.02-1.06; P<.001), mental health management (with gestational conditions: AOR 1.06, 95% CI 1.04-1.08; P<.001 and without gestational conditions: AOR 1.03, 95% CI 1.02-1.05; P<.001), and understanding warning signs during pregnancy (with gestational conditions: AOR 1.08, 95% CI 1.06-1.11; P<.001 and without gestational conditions: AOR 1.09, 95% CI 1.07-1.11; P<.001). For users with and without gestational conditions, an increase in gestational age at birth was associated with a decreased likelihood of NICU admission (with gestational conditions: AOR 0.62, 95% CI 0.55-0.69; P<.001 and without gestational conditions: AOR 0.59, 95% CI 0.53-0.65; P<.001). Among users who developed gestational conditions, those who reported that the platform helped them understand warning signs during pregnancy had lower odds of a NICU admission (AOR 0.63, 95% CI 0.45-0.89; P=.01). Conclusions: Digital health use may aid in extending gestational age at birth and reduce the risk of NICU admission.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e3fecee577d35968cf4f802cc348f90",
  "timestamp": "2025-05-15T03:11:04.630397"
}