{
  "id": 5956,
  "title": "THE QUANTITATIVE SURVEY ON MACROECONOMIC DETERMINANTS OF AGGREGATE CREDIT RISK",
  "abstract": "Common exposure to macroeconomic risk factors across banks (financial institutions) is a source of systemic risk that influences, among others things, the quality of bank's loan portfolios and credit risk (Festic et al., 2011). This paper focuses on the growing literature on credit risk determinants (macroeconomic, bank-specific or institutional) that emerged especially in the last decade. The aim of the paper is to provide more general information on effects of macroeconomic credit risk drivers. The aim is fulfilled with usage of quantitative meta-analytic techniques. Concretely, general effects of macroeconomic determinants on credit risk are used in the meta-regression to identify key differences among relevant studies. The authors focus only on those studies, which use non-performing loans (NPLs) as an indicator of credit risk, although there are several possible measurements of the aggregate credit risk such as loan loss provisions, loan loss reserves or new bad debt ratio. More specifically, authors focus on the models, which use non-performing loans ratio (NPLR), calculated as the ratio of non-performing loans to the total gross loans, as dependent variable. The authors consider five most common macroeconomic determinants of non-performing loans ratio, which are presented in the relevant literature: economic growth, interest rate, inflation, unemployment and exchange rate. The general effects of selected macroeconomic credit risk drivers are calculated as weighted averages of parameters of respective macroeconomic determinants, which were estimated in the empirical studies. The weights of parameters, which represent precision of estimation, are calculated as an inverse of their standard errors; see for instance Knell and Stix (2005). In the case that standard errors are not provided in the papers, they are either calculated from other presented results such as standard deviations or tstatistics; or otherwise, if it is not possible to calculate them, the papers are excluded from the analysis. The preliminary results suggest that there are some significant differences among studies which could be identified when the meta-regression is employed, for instance, data specification or number of countries and observations included in the model play significant role.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e660ea4443b64f1e3ae980721e4cbf8",
  "timestamp": "2025-05-15T02:53:03.183673"
}