{
  "id": 1889,
  "title": "Forecasting sovereign risk perception of Brazilian bonds: an evaluation of machine learning prediction accuracy",
  "abstract": "Purpose Given the importance of credit rating agencies' (CRAs) assessment in affecting international financial markets, it is useful for policymakers and investors to be able to forecast it properly. Therefore, this study aims to forecast sovereign risk perception of the main agencies related to Brazilian bonds through the application of different machine learning (ML) techniques and evaluate their predictive accuracy in order to find out which one is best for this task. Design/methodology/approach Based on monthly data from January 1996 to November 2018, we perform different forecast analyses using the K-Nearest Neighbors, the Gradient Boosted Random Trees and the Multilayer Perceptron methods. Findings The results of this study suggest the Multilayer Perceptron technique is the most reliable one. Its predictive accuracy is relatively high if compared to the other two methods. Its forecast errors are the lowest in both the out-of-sample and in-sample forecasts' exercises. These results hold if we consider the CRAs classification structure as linear or logarithmic. Moreover, its forecast errors are not statistically associated with periods of changes in CRAs' opinion of any sort. Originality/value To the best of the authors' knowledge, this study is the first to evaluate the performance of ML methods in the task of predicting sovereign credit news, including not only the sovereign ratings but also the outlook and credit watch status. In addition, the authors investigate whether the forecasts errors are statistically associated with periods of changes in sovereign risk perception.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e93cfd3525f1422eb39dce151cf188f",
  "timestamp": "2025-05-15T02:08:39.043002"
}