{
  "id": 8674,
  "title": "The association between systemic immune-inflammation index (SII) and early nosocomial infections after cardiopulmonary bypass surgery in children with congenital heart disease",
  "abstract": "BackgroundInfections occurring postoperatively in pediatric patients with congenital heart disease (CHD) following cardiopulmonary bypass (CPB) surgery pose a considerable challenge, affecting the duration of hospitalization, financial costs, and patient outcomes. Studies investigating the association between systemic immune-inflammation index (SII) and early infections after CHD surgery are very rare. This study seeks to delineate the link between SII and the occurrence of early nosocomial infections in pediatric patients undergoing CPB surgery for CHD.MethodsA cross-sectional analysis was performed on 325 pediatric patients who underwent CPB surgery for CHD between July 2020 and June 2023. The primary exposure was the SII value on the first postoperative day. The outcome was the occurrence of nosocomial infections within the first week following CPB surgery. Multivariable logistic regression models and subgroup analyses were employed to evaluate the association between SII and the risk of early nosocomial infections.ResultsThe median age of the study cohort was 4.4 years, with a male preponderance of 51.7%. The median SII value was recorded at 0.6 x 10<^>12/L. The rate of nosocomial infections within the first week post-CPB surgery was 53.5%. An inverse association was observed between SII and the incidence of early nosocomial infections. After controlling for multiple confounders, an increment of 1 x 10<^>12/L in SII corresponded to a 25% reduction in the likelihood of nosocomial infections (OR = 0.75; 95%CI: 0.57, 0.99; P = 0.044). Subgroup analyses substantiated the consistency of these findings.ConclusionsThe study demonstrated that an elevated SII corresponded to a reduced likelihood of early nosocomial infections after CPB surgery in children with CHD, a finding that merits additional investigation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e955d2c7b1764e015b6fabf88836202",
  "timestamp": "2025-05-15T03:21:24.639554"
}