{
  "id": 2664,
  "title": "Is financial institutions' stability of BRICS block responsive to uncertain dimensions?",
  "abstract": "The aim of this seminal paper is the empirical analysis of geopolitical risk, economic policy uncertainty, financial stress, and infectious diseases' impact on financial institutions' stability at the country level. The quantitative research approach followed by regression analysis is employed using monthly time series data between January 2000 and January 2021. Separate models are performed for individual countries with and without control variables. The outcomes of this work suggest that geopolitical risk, economic policy uncertainty, financial stress, and infectious diseases hold adverse effects on the financial institutions' stability. There is evidence of declining financial institutions' stability with the rising level of predicting dimensions. The research is limited to the BRICS block but has paramount significance for literature enrichment and policymakers. The findings can assist decision-makers to plan for uncertain events disrupting the financial system. More rigorous research techniques can be levered to endorse the consistency of the evidence. The dimensions adopted in this study address the ongoing paradigm of research. The financial institutions' stability at the country level is a value addition of this work with the selection of persistent and novel predictors of financial systems like financial stress and infectious diseases.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1e9853a997fe561ffd146822d88a8d0a",
  "timestamp": "2025-05-15T02:18:06.122884"
}