{
  "id": 8159,
  "title": "Stability in mutual fund performance rankings: A new proposal",
  "abstract": "Market investors use financial performance measures to determine, often ex post, fund managers' investment ability and identify the fund managers who are best suited to managing their investments. The Sharpe ratio is the principal financial performance measure, although it has certain weaknesses. To correct for the Sharpe ratio's shortcomings, researchers and practitioners have developed alternative measures. This study investigated the most widely used performance measures. Their results were evaluated by ranking different investments. The analysis showed that the choice of measure affects the ranking of investments. The paper presents a new method that provides a stable ranking based on the notion of stability selection. This method was applied to daily prices of UK investment funds. The method enables identification of the top stable funds. The final ranking can help investors evaluate fund managers' ability using a combination of performance measures. In this research, measures are divided in five typologies: the Sharpe-like relative risk-adjusted ratios, among which would be the Sharpe ratio, the adjusted Sharpe ratio and double Sharpe ratio; those based on Value-at-Risk; those based on linear regression, such as Treynor ratio and Jensen alpha; those based on partial moments such as Omega, Sortino and Kappa ratios; and finally those based on drawdown, such as Kalmar, Sterling and Burke ratios. The aim of this work is ascertain that the choice of a particular measure has an impact on ranking of alternative investments and at the same time it evaluates the stability of the rankings of funds obtained from them. Using daily prices of British Investment Funds we show that the ranking obtained from the different measures are different, even if the measure belongs to the same typology. The disagreement between the rankings is greater when there are major differences in the higher moments of the distribution of returns. Finally, we suggest a new ranking method that tries to maximize stability, based on the well-known methods such as mean, median, t-test or rank-sum test and combining it with a bootstrapping technique. The novelty of the results lies in two aspects, firstly, it offers a new vision for the estimation of the stability and secondly, and certainly more useful for investors, the method is able to offer a final ranking that orders the elements according to their stability. This final ranking will be useful for investors when assessing their inversions while it will facilitate the evaluation of the fund managers' ability with a methodology that, using the combination of different performance measures, allows a single ranking based on stability.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eab5f4d8d101e1dbf023418ec6f4c68",
  "timestamp": "2025-05-15T03:15:38.482552"
}