{
  "id": 3815,
  "title": "Exploring the relationship between social activities and financial risk aversion in adults aged 50+with depression caseness",
  "abstract": "BackgroundRisk aversion due to depression is common among older adults, and social participation is associated with improved mental health and a lower risk of late-life depression. However, little is known about the connection between participation in social activities and risky financial decisions among adults with depression. Thus, we aim to examine the connection between participation in social activities and taking financial risks and investing in risky financial assets (with high-return potential) in such individuals, differentiated by age and gender. The study also focuses on analyzing the percentage of investors within each social activity, their attendance frequency, and motivation.MethodsThe data was obtained from the Survey of Health, Ageing and Retirement in Europe (SHARE) database Wave 2 (2006-2010). The study included 8,769 individuals aged 50 + with depression caseness, from 15 European countries and Israel who answered the question on participation in social activities and reported financial risk-taking intentions or behaviors (investing in stocks or shares, mutual funds or managed investment accounts, and both). The study utilized Pearson chi-square, odds ratios, Z, and hierarchical logistic regression tests.ResultsThe odds for taking financial risks and investing in risky financial assets were higher for those participating in social activities compared to those who did not, on both intentional (by 173%) and behavioral (by 240-397%) levels. Such social activities (attended at least once a week, without financial motivation) have been shown to be primarily represented by educational or training courses - where 33% of participants invested in risky financial assets. The connection persisted after controlling for gender, age, marital status, children, income.ConclusionsBy overcoming the subjects' financial risk aversion, participation in social activities may help improve mental health in individuals aged 50 + with depression caseness. This has important implications for policymakers in healthcare, who by updating healthcare policies can fund and facilitate participation in social activities. As a result, the national healthcare system may benefit from lower hospitalization-related expenses, and generate higher cash flows into the country's economy using the population's renewed interest in investing available funds. These results are relevant in the wake of COVID-19 that increased loneliness and depression rates.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eb052905ad7d234a1756e59f216bb70",
  "timestamp": "2025-05-15T02:30:28.619917"
}