{
  "id": 8996,
  "title": "The nexus between poverty and maternal healthcare utilization with a focus on antenatal care visits and choice of place of birth in Somaliland",
  "abstract": "Introduction Poverty poses a significant barrier to accessing healthcare globally, particularly in relation to antenatal care (ANC) visits and the use of childbirth facilities, both of which are crucial for women's health and fetal well-being. In Somaliland, only 47% of pregnant women attend healthcare facilities for ANC, with a mere 33% receiving care from skilled birth attendants. Despite this, no previous studies have examined the relationship between poverty and maternal healthcare utilization in Somaliland. This study aims to investigate the effect of poverty on maternal healthcare utilization with focus on ANC visits and the choice of place of birth in Somaliland.Method Utilizing data from the 2020 Somaliland Demographic Health Survey, a cross-sectional study design was employed, analyzing a nationally representative sample. The sample size used in this study was 3,183 women of reproductive age. Descriptive analysis, negative binomial regression, and multinomial logistic regression were conducted using Stata version 18.0. Diagnostic tests, including Chi-square - 2log likelihood statistic, Akaike Information Criterion, and Bayesian Information Criterion, were employed to evaluate model fit.Results Poverty, as indicated by wealth quintile, was associated with reduced ANC visits (adjusted incidence rate ratio (aIRR) = 0.884, 95% CI: 0.791-0.987) among women in poorer households compared to those in richer households. Women in Togdheer, Sool, and Sanaag regions had lower ANC visit rates compared to Maroodi Jeex region (aIRR = 0.803, 95% CI: 0.687-0.939; aIRR = 0.710, 95% CI: 0.601-0.839; aIRR = 0.654, 95% CI: 0.558-0.768, respectively). Women from poorer households had lower probabilities of opting for public health facilities (adjusted relative risk ratio (aRRR) = 0.457, 95% CI: 0.352-0.593) and private health facilities (aRRR = 0.195, 95% CI: 0.111-0.341) over home births compared to women in richer households. Women in Togdheer, Sool, and Sanaag regions had lower probabilities of choosing public (aRRR range: 0.331-0.175) and private (aRRR range: 0.350-0.084) health facilities for delivery over home births compared to women in Maroodi Jeex region.Conclusion Poverty significantly impedes maternal healthcare utilization, contributing to lower ANC attendance and preference for home births over public or private health facility births. Addressing these disparities requires initiatives to eliminate financial barriers, such as user fees, and enhance equitable access through community-based health insurance and improved healthcare infrastructure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eb1c2e589f8a33564ba0c7779b7e6c7",
  "timestamp": "2025-05-15T03:24:26.388575"
}