{
  "id": 6618,
  "title": "The OVIS study: health related quality of life measured by the EORTC QLQ-C30 and-BR23 in German female patients with breast cancer from Schleswig-Holstein",
  "abstract": "The OVIS study is a population-based study that aims at evaluating medical care in Schleswig-Holstein (Germany). In this paper, the health related quality of life (QoL, EORTC QLQ-C30 and -BR23) of 1,927 women with breast cancer is reported. The global health status/QoL score was comparable to reference data of the age-adjusted German general population, but clinical meaningful differences (>= 10 points) were found for all functioning scales (with the exception of physical functioning) and for three of the symptom scales/items (fatigue, dyspnoe, insomnia) with OVIS patients showing more deficits. Furthermore, OVIS patients scored higher on the item financial difficulties. Logistic regression analyses revealed that coming from an urban surrounding, having a higher social status and attendance to a regular aftercare predicted a good overall QoL, while factors that were related to perceived complications in the course of the therapy raised the risk for a low QoL rating. It is of interest, that attendance to a rehabilitation and interest in self-help groups independently predicted an increased risk for a low quality of life. Overall, we assume the global QoL is rating slightly too optimistic since major deficits were reported on the specific physical and functional scales/items.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eb80fd84feba5f355833f8085b18ad3",
  "timestamp": "2025-05-15T03:00:04.928200"
}