{
  "id": 7671,
  "title": "Risk Factors for Worsening Morphology and Visual Acuity in Eyes with Adult-Onset Foveomacular Vitelliform Dystrophy",
  "abstract": "Purpose: To explore clinical risk factors and OCT features associated with worse visual acuity (VA), progression of disease, choroidal neovascularization (CNV), and atrophy in eyes with adult-onset foveomacular vitelliform dystrophy (AOFVD). Design: Single-center, retrospective, observational cohort study. Participants: Patients seen at Duke Eye Center between January 2012 and May 2023 with a diagnosis of AOFVD confirmed via OCT and fundus autofluorescence. Methods: Baseline and final-visit images from eyes with AOFVD were examined. Disease stage was assigned, and presence of atrophy or CNV was determined. Clinical and OCT features associated with progression to atrophy and CNV were determined using t tests and chi-square analysis. Correlation with lower VA was determined using linear regression. Main outcome measures: Association of clinical characteristics and OCT features with worse VA, progression of disease, CNV, and atrophy as determined by independent t tests, chi-square analysis, and linear regression (P < 0.05). Results: One hundred one eyes (63 patients) met inclusion criteria for this study, with mean follow-up duration of 48 months (standard deviation, 31 months). Fifty-one percent of eyes progressed beyond baseline staging during follow-up; among baseline stage 1 eyes, incidence of atrophy was 0.068/person-year; incidence of CNV was 0.022/person-year. Risk factors for worse final VA were baseline presence of vitreomacular traction ([VMT], P = 0.006), ellipsoid zone attenuation (P = 0.02), and increased lesion height and width (P < 0.001). Predictors of progression include diabetes mellitus (P = 0.01), statin use (P = 0.03), presence of hyperreflective foci (P = 0.01), and increased lesion width and volume (P = 0.03 and P = 0.04, respectively). Predictors of atrophy include the baseline presence of VMT (P = 0.02), decreased choroidal thickness (P = 0.03), and greater maximal height, width, and volume of the lesion (P = 0.03, P = 0.02, and P = 0.009, respectively). Lower baseline VA (P = 0.03) and increased lesion volume (P = 0.04) were associated with CNV. Conclusions: Clinical and OCT imaging features at baseline may prove useful in stratifying patient risk for progression, atrophy, CNV, and worse VA. Features such as statin use, diabetes, baseline VA, and laterality should be accounted for. OCT features, such as lesion size, VMT, ellipsoid zone attenuation, choroidal thickness, and hyperreflective foci, may impart greater risk of poor outcomes. Future prospective analysis accounting for the time to development of atrophy and CNV is needed. Financial disclosures: Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eb9873a03f76cdf119201160e1613c3",
  "timestamp": "2025-05-15T03:11:04.501475"
}