{
  "id": 4189,
  "title": "Seismic vulnerability model development based on Bayesian parameter estimation: Application to the South Iceland loss data",
  "abstract": "Assessment of the seismic fragility and vulnerability of buildings is crucial in the evaluation of seismic risk. Our study employs a vulnerability model that is specifically developed and calibrated for the target building portfolio, providing a comprehensive and accurate representation of underlying behavior and characteristics of the buildings. This article presents the first application of a Bayesian Markov-Chain Monte Carlo (MCMC) method to quantify the seismic vulnerability of buildings using zero-inflated beta regression (ZIBR) models. Losses inflicted by the South Iceland earthquakes of June 2000 and May 2008 to low-rise residential buildings, registered in two independent building-by-building datasets, are investigated. Effects of different factors such as construction material, building height, and the status of seismic design code at the time of construction in overall performance of the buildings affected are explored and discussed. Although ZIBR models have previously been calibrated for these two datasets, the MCMC method applied in this work presents an added value in improving error estimates and determining posterior distributions of the model parameters and the predicted seismic vulnerability. The calibrated models provide distributions of damage factors of the affected buildings as functions of ground shaking intensity measures (IMs), which in this study are taken as the peak ground acceleration (PGA), as in previous studies; in addition, the average spectral acceleration (AvgSa) is also tested as an IM for the loss data. The comparison of the two datasets revealed substantial differences in the mean losses between 2000 and 2008 earthquakes. The average losses from the 2000 dataset were found to be approximately double those from the 2008 dataset for a given IM. The results also revealed that the seismic performance of the building stock was improved with the introduction of stronger seismic codes.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ec4068292a9987a1148d231abed12e6",
  "timestamp": "2025-05-15T01:24:25.491444"
}