{
  "id": 414,
  "title": "A general control variate method for multi-dimensional SDEs: An application to multi-asset options under local stochastic volatility with jumps models in finance",
  "abstract": "This paper presents a new control variate method for general multi-dimensional stochastic differential equations (SDEs) including jumps in order to reduce the variance of Monte Carlo method. Our control variate method is based on an asymptotic expansion technique, and does not require an explicit characteristic function of SDEs. This is an extension of previous researches using asymptotic expansions to obtain the control variates for such general models. Moreover, in our control variate method, the regression estimators can be chosen for each number of jump times with a stratified sampling, and improve the efficiency of the variance reduction. This paper also provides the asymptotic bias and variance of our method in terms of its terminal time and a small noise parameter used in an asymptotic expansion method. For an application of our method, we evaluate multi-asset options whose payoffs are expressed as linear functions of the underlying asset price processes in general local stochastic volatility with jumps models, and show a calculation scheme of control variates for Greeks. In numerical experiments, we apply the new control variate method to pricing basket, spread, and average options and Delta of basket options under a ZABR-type local stochastic volatility model with jumps, and confirm that our method works very well. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ed07ac61150184747a3f4541a0b9e5c",
  "timestamp": "2025-05-15T01:31:50.696725"
}