{
  "id": 4310,
  "title": "Motives for short selling from securities lending and stock returns",
  "abstract": "Generally, short selling means selling a security that the seller does not own or has borrowed from security lenders. Short sales of non-holding securities are under many restrictions such as the limitation of proceeds from sale, plus tick (a price higher than the previous trade) and minimum maintenance margin in capital market like NYSE. These constraints give rise to opportunity costs to short sellers. Therefore, costly short sales can have a higher proportion of informed traders than regular and uninformed ones. A short selling from securities lending, also, may be a trade with information because of its high costs, such as security lending fees and the supply of collaterals from it. Independent of whether short sales rise from securities lending or non-holding securities, informed traders are more likely to be short sellers than uninformed traders are if high short interest conveys adverse information, implying a negative relationship between short interest and stock returns. There are traders who go short with several motives, not only for the purpose of speculation but also for hedging and arbitrage in a capital market. Speculators usually expect to profit from a decline in the securities' price after shorting. On the other hand, hedgers and arbitragers participate in trades through the combination of short sale and other financial instruments (ex. option, futures) instead of transacting with only short sale. Therefore, as all other things being equal, the lack of reaction on a stock price after shorting may be contributed to the hedging and arbitrage. In this paper I investigate the motives for short selling from only securities lending and not from non-holding securities because the latter is not allowed in Korea. In addition, I study the relationship between short sale and its stock returns. I use daily data on short interest for 279 common stock securities listed on the Korea Stock Exchange from 2000 to 2002. For this study purpose, I perform the cross-sectional tests with the model equation after setting up proxy variables for speculative, hedging, and arbitrage motivation. Also, I analyse the individual stock approach by controlling variables of short interest and using correlation analysis about the relationship between short sales and stock returns. Further, I also study the portfolio analysis approach using Fama & French (1993)'s model for robustness checks about the relationship between them. Major results are summarized as follows. First, I find that security lending is increasing over time on the KSE. It is interesting to observe that the proportion of short interest is higher for stocks with large capitalization, high prices, above appropriate liquidity and volatility. Second, the results of the cross-sectional regression indicate that motives behind short selling from security lending is significantly strong for hedging and arbitrage and is very weak for speculation. Third, the negative relationship between short sales and stock returns obtained from the individual stock approach is for short term, concentrated on the only firms with increasing short interest. On the other hand, the portfolio analysis approach doesn't show such a significant and negative relationship. In considering only non-significant abnormal return signs, I find that unexpected high level of short interest is bad news and unexpected low level is good news. Overall, the results suggest that the negative relationship between short sales and stock returns is very weak on KSE. It is somewhat different from the findings of foreign studies (ex. Desai. et al. (2002)) which report significantly negative relationship between them. In conclusion for this study, the results from short selling through securities lending is close to those from previous papers on short sales for non-holding securities. Some differences may be due to several reasons such as securities lending systems in which individuals don't participate, securities lending motives focused on either hedging or arbitrage, and a relatively low level of short interest computed from only securities lending compared to that from non-holding securities in other countries.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ee27b324b34566d5491dc37eaf76dc0",
  "timestamp": "2025-05-15T01:25:50.515590"
}