{
  "id": 8423,
  "title": "Degenerative Lumbar Stenosis Surgery: Predictive Factors of Clinical Outcome-Experience with 1001 Patients",
  "abstract": "BACKGROUND: Degenerative lumbar spinal stenosis (DLSS) carries a high risk of morbidity and represents a financial burden to society. A late diagnosis can lead to severe disability. Although lumbar decompressive surgery has been widely used worldwide, the proper preoperative factors to define the ideal candidates for decompression are missing. METHODS: A total of 1001 patients who had undergone decompressive surgery from 2012 to 2019 for DLSS were screened for the presence of 9 clinical and radiological parameters. For all cases, the differences between the baseline and postoperative Oswestry disability index were calculated and the results categorized as 5 different classes (ranging from very poor outcomes to excellent outcomes) according to the specific scores. Generalized ordinal logistic regression was then used to analyze the significance of the 9 parameters (coded as dummy variables) in predicting the outcome as measured by Oswestry disability index improvement after surgery. RESULTS: Of the 9 parameters, 8 were found to be significant predictors. The radiological grade of compression was the strongest, followed by polyneuropathy, obesity, symptom duration, gait autonomy, radicular deficits, American Society of Anesthesiologists score, and level of surgery. In contrast, previous back surgery was not predictive of the outcome. CONCLUSIONS: Our findings have indicated that the ideal candidate for surgery will have the following preoperative characteristics: Schizas grade D, no signs of peripheral polyneuropathy, body mass index <30 kg/m(2), symptom duration of <2 years, gait autonomy <100 m, no radicular deficits, 1 level of stenosis, and an American Society of Anesthesiologists score of 1, 2, or 3.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ee98f8fb3a4266b638d10db1f60aa39",
  "timestamp": "2025-05-15T03:18:51.545795"
}