{
  "id": 2287,
  "title": "Return volatility, correlation, and hedging of green and brown stocks: Is there a role for climate risk factors?",
  "abstract": "We examine the effects of three monthly climate risk factors, climate policy uncertainty (CPU), climate change news (CCN), and negative climate change news (NCCN), on the long-run volatilities and correlation of daily green and brown energy stock returns, and perform a hedging analysis. Given that our dataset combines daily and monthly data, we apply mixed data sampling models such as GARCH-MIDAS and DCC-MIDAS. To deal with volatility clustering, asymmetric effects, and negative skewness in innovations, which characterize our dataset, we use those models in asymmetric form with a bivariate skew-t distribution. Firstly, the GARCH-MIDAS models indicate that climate risk has a significant impact on the long-run volatility of brown energy stocks. Secondly, the DCC-MIDAS models reveal that the long-run correlation of green-brown stock returns decreases with the climate risk, suggesting a negative effect and hedging opportunities. Thirdly, the hedging analysis shows that incorporating a climate risk factor, especially NCCN, into the long-run component of dynamic correlation significantly improves the hedging performance between green and brown energy stock indices. The results are robust to an out-of-sample analysis under various refitting window sizes. They matter to portfolio and risk managers for energy transition and portfolio decarbonization.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1eed2851e0a6d3a89f74d156b954141e",
  "timestamp": "2025-05-15T01:05:04.538451"
}