{
  "id": 6979,
  "title": "An analysis of 3,954 cases to determine surgical wound classification accuracy: Does your institution need a monday morning quarterback?",
  "abstract": "Introduction: Surgical site infections reporting has financial implications for institutions under Centers for Medicare and Medicaid Services (CMS) Pay-for-Performance programs. Surgical Wound Classification (SWC) is an important factor in performing risk adjustment and affects the accuracy of the Standardized Infection Ratio (SIR). This in turn leads to more accurate inter-hospital ratings and reimbursement. This study aims to measure (1) services and procedures associated with the highest rates of misclassification and (2) whether temporal factors influenced misclassification. Methods: Accuracy of SWC was assessed by comparing the wound classification documented by the Operating Room (OR) nurse at the time of the operation to the actual SWC determined from in-depth chart review using Centers for Disease Control and Prevention (CDC) wound classification algorithm by a trained reviewer. Cases were reviewed once operative reports were available. Results: Review of 3954 cases yielded an overall discordance rate of 22.15% (N = 876), with most cases being under-classified. Services with the highest rates of discordance include cardiothoracic (38.46%) and general surgery (37.86%), followed by general oncology (29.46%), OB-GYN (28.93%), urology (27.27%), and plastic surgery (27.14%). Procedures with the highest discordance rates are laparoscopic appendectomy (66.67%), cholecystectomy (52.90%), exploratory laparotomy (49.21%), and split-thickness skin graft (36.84%). Discordance rates were significantly higher (p = 0.0001) during weekends compared to weekdays, while operations starting after-hours during the week did not show a significant difference from daytime hours. Conclusion: At a level 1 trauma academic medical center, certain procedures were found to be misclassified in regards to SWC more often than other types of cases. The timing of the case, such that they occurred on the weekends also contributed to higher discordance rates between original and corrected wound classifications. Recognizing cases, services, and temporal factors frequently associated with misclassification of wound class can help allocate limited resources to maximize improvement of this important metric. (C) 2020 Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f0af6f470bb7ef617a90d052f428f28",
  "timestamp": "2025-05-15T03:03:55.693883"
}