{
  "id": 2920,
  "title": "Boundedly Rational Decisions on Exploration Versus Exploitation in Alliance Portfolios: Problemistic and Slack Searches Under CEO Overconfidence",
  "abstract": "How do firms configure exploration versus exploitation in alliance portfolios under the premise of bounded rationality? From the behavioural perspective, problemistic and slack searches can be used as behavioural explanations for their configurations. Furthermore, the boundedly rational decision-maker's limited cognitive capability in the form of CEO overconfidence also causes the subjective interpretation of information. This study investigates the links between below-aspiration performance, slack, and firms' boundedly rational decisions under the influence of CEO overconfidence in alliance portfolio configurations. A feasible generalized least-squares regression is performed to test the model empirically using data from 224 publicly traded high-tech firms in the United States. We find that below-aspiration performance and slack both play roles in emphasizing exploration relative to exploitation in alliance portfolios. Further, CEO overconfidence intensifies the positive roles of below-aspiration levels and slack in preference for exploration alliances. This study contributes to the bounded rationality literature by extending the implications of the behavioural theory of the firm to firms' preference in alliance portfolio configurations in terms of the exploration-to-exploitation ratio. Furthermore, our findings deepen the understanding of the role of overconfidence in CEOs' subjective interpretations, thus filling a critical research gap in extant behavioural research.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f162273c582947d81c717ce6f0dc544",
  "timestamp": "2025-05-15T01:11:48.429501"
}