{
  "id": 829,
  "title": "Application of the American College of Cardiology (ACC/AHA) 2017 Guideline for the Management of Hypertension in Adults and Comparison with the 2014 Eighth Joint National Committee Guideline",
  "abstract": "Objectives: This study aims to compare the 2017-ACC/AHA hypertension guideline with 2014-JNC-8 guideline in regard to the number of patients who are eligible for treatment and to determine the physicians' adherence and the financial impact of implementing the new guideline. Methods: A cross-sectional observational study was conducted on adult patients who attended the hospital outpatient setting in UAE during January 1, 2018 till February 28, 2018. Adults who are diagnosed with hypertension and those with blood pressure (BP) levels based on two or more readings obtained on two or more different occasions were screened for inclusion into this study and cardiovascular diseases (CVD) risk was calculated. The two guidelines were compared with respect to the number of patients diagnosed with hypertension and eligible for treatment. Results were extrapolated to the UAE population. Financial impact of applying the 2017-ACC/AHA guideline was also evaluated. Results: In comparison with the JNC-8, the 2017-ACC/AHA guideline would increase the proportion of patients diagnosed with hypertension among UAE adults from 40.8% to 76.3% and the number of UAE adults recommended for antihypertensive medications would rise from 2.42 million (32.1%) to 4.71 million (62.5%). Among UAE adults, almost 4.42 million (58.6%) and 0.76 million (10.1%) would have BP above the target according to the 2017-ACC/AHA and JNC-8 guidelines, respectively. The expected increase in the cost of anti-hypertension medications prescribed for the new labeled cases according to 2017-ACC/AHA but not JNC-8 would reach 1.8 billion AED/year. For those who were recommended for antihypertensive medications, who had BP above target, the additional cost would reach 3.5 billion AED/year. Conclusions: The current study reveals marked increase in the proportion of patients diagnosed with hypertension in concordance with the 2017-ACC/AHA guideline. This is also will be associated with almost double the number of UAE adults recommended for antihypertensive medications. The poor compliance with the 2017-ACC/AHA reflects the concern regarding the increase risk of adverse events.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f1acd2d8d45d14c073adbc8c1c3cdda",
  "timestamp": "2025-05-15T01:43:20.565880"
}