{
  "id": 8021,
  "title": "A nomogram based on peripheral blood count between 12 and 18 weeks of gestation for predicting early-onset pre-eclampsia in pregnant women: a retrospective case-control study",
  "abstract": "BackgroundEarly-onset pre-eclampsia (PE), which delivered before 34 weeks of gestation, is associated with high maternal and pediatric morbidity and mortality. Several studies have examined predictive factors and models to identify individuals at risk for early-onset pre-eclampsia. However, implementing these methods often requires additional tests and increases the financial burden on pregnant women. Our study aimed to determine if early-onset PE development could be predicted using a simple, convenient, and easily accessible test: the peripheral blood count.MethodsIn this study, we conducted a review of pregnant women who received routine prenatal visit and delivered in our hospital from April 2019 to April 2022. For each patient with PE, we matched them 1:1 with healthy pregnant women who were similar in terms of age, parity, and pre-gestational BMI. We gathered routine peripheral blood cell results between 12 and 18 weeks of gestation and utilized multivariate logistic regression to determine independent risk factors. Subsequently, a nomogram was created to forecast the likelihood of early-onset pre-eclampsia. Lastly, we assessed the model's predictive performance.ResultsIn our study, a total of 254 patients with PE were included, comprising of 41 patients with early-onset PE and 213 patients with late-onset PE, as well as 254 cases of normotensive pregnancy. The nomogram included four risk factors: mean corpuscular hemoglobin concentration (MCHC) >= 340.50 g/l, neutrophil-to-lymphocyte ratio (NLR) <= 4.40, platelet-to-lymphocyte ratio (PLR) <= 118.01, and platelet-to-mean platelet volume (PC/MPV) <= 17.81. Notably, the nomogram exhibited good diagnostic performance with an area under the curve (AUC) of 0.874, sensitivity of 95.1%, and specificity of 62.2%. Furthermore, the nomogram was validated through a decision curve analysis (DCA), which demonstrated a favorable positive net benefit, and the calibration curve showed a good fit and alignment with the ideal curve.ConclusionsOur nomogram, based on four predictors derived from peripheral blood cells and related ratios, offers a practical screening tool for early-onset PE in pregnant women.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f22581063f0a02888a20d631e5e0571",
  "timestamp": "2025-05-15T03:14:37.272038"
}