{
  "id": 138,
  "title": "Credit Risk Assessment Modeling Method Based on Fuzzy Integral and SVM",
  "abstract": "With the development of financial globalization and financial market volatility, credit risk has become more prominent and serious, and how to establish an effective enterprise credit evaluation system and bank credit risk evaluation model, provide scientific quantitative decision-making basis for bank decision-making, reduce non-performing loans, and improve the quality of credit assets is a common research topic faced by domestic banks. At present, domestic banks have not been effective to establish risk prevention as the core of credit culture and long-term mechanism, the existence of nonperforming loans is still not fully resolved, new risks continue to appear, and there is a lack of a perfect and effective credit risk evaluation system. With the development of the Internet and financial institutions and the fusion, banks and financial institutions drastically increase the recorded data, and this provides a good prerequisite for the application of intelligent algorithms. In view of the shortcomings of BP neural network in the establishment of credit risk assessment model, such as poor promotion ability and long prediction time, and considering that support vector machine (SVM) can deal with some multi-classification problems, this paper introduces SVM method into the field of bank credit risk assessment and establishes an optimization model of credit risk assessment. This paper discusses the structure and algorithm principle of SVM classification method and proposes an integrated SVM based on fuzzy integral to solve this kind of problem. The results show that the algorithm can effectively improve the prediction accuracy, solve the problem of high computation cost, reduce the occupied memory space, improve the operation efficiency, shorten the training time, and provide a more reliable basis for the rapid and effective evaluation of bank credit risk. On the one hand, the research results expand the application of artificial intelligence technology in the field of economic research; the evaluation model can continuously and accurately measure credit risk is obtained, which provides the necessary basis for upgrading and optimizing credit decision-making, so it has high theoretical value and practical value.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f2de0c877bc71c3e9d2d6063af0b969",
  "timestamp": "2025-05-15T01:47:14.099929"
}