{
  "id": 7827,
  "title": "ROLE OF COMMITTEES IN BANK VALUATION: EVIDENCE FROM AN EMERGING MARKET",
  "abstract": "The purpose of this study is to examine the effect of corporate governance mechanisms on bank performance in general and the effect of board-constituted committees on bank performance in particular. Primarily, two questions are addressed in the context of the banking sector of India. First, does corporate governance mechanisms reduce the quantum of non-performing assets (NPAs)? Second, does the internal committee affect bank performance? Hence, this paper determines whether independent directors strengthen corporate boards and whether committees affect bank performance. The panel data ordinary least square regression analysis is used for this study. We also use logistic regression models for various committees to find their relationship with bank performance and NPAs. Tobin's Q is used as proxy for bank performance. Independent variables are board size (BSIZE), proportion of independent directors on the board (PERIND), number of board meetings per year (BMEET), size of the audit committee (AUC), and two measures of the bank business (asset size and loan), and one control variable is time. We use financial and corporate governance data from 2005 to 2018, the study finds that independent directors play a major role on the board. It finds a positive and significant relationship between board independence and bank performance. The performance also increases with the increase in board size but after a point, the curve declines forming and an inverted U-shaped curve is formed. The mandatory internal committees have a crucial role to play, which is demonstrated by their effect on the reduction of NPAs. The significance of a well-functioning board and internal committees in discharging their fiduciary duties is highlighted in this study. An internal committee comprising a majority of independent directors is found to positively affect the performance of banks. They can help managers disburse good-quality loans and keep a check on risk-laden ventures.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f3beb80e5ec74bb30f948399bd5e8b6",
  "timestamp": "2025-05-15T03:12:36.422469"
}