{
  "id": 9401,
  "title": "Resilience of the critical infrastructure in hospitals Categorization and quantification as a basis for optimization",
  "abstract": "BackgroundCritical infrastructure (CRITIS) in hospitals has become the focus of resilience research due to the impact of the COVID-19 pandemic and also the events in Ukraine. This foundational research examines overall contexts, categorizing and quantifying them. Previous research examined limited scale damage situations with little CRITIS involvement: Worst case studies are missing. The vulnerabilities of the CRITIS of one or more countries will likewise be a prime target for attack in current and future conflicts or criminal extortion, this is especially true in the healthcare sector. Therefore, detailed research with a black swan scenario is necessary in this field.ObjectiveThe aim of the study was to create and validate a categorized and weighted model for the self-assessment of the resilience of critical infrastructure in German hospitals at different levels of care before the exemplary scenario of a prolonged supraregional power blackout.Material and methodsUsing an explorative design, experts from 8 hospitals of different care levels performed an expert-based qualitative system analysis to develop, weight and test the model. The resilience index was then calculated using adapted interdependence analyses in a Vester influence matrix.ResultsA total of 7 categories and 24 subcategories of hospital CRITIS were identified. There are several key elements: rank 1 of active elements is the emergency power system (E1), and for passive elements, it is the nursing staff (P2). This means that the emergency power system has the greatest impact on all other areas and the nursing staff are most dependent on all others for their work. The most critical elements, because they are most intertwined in the overall system, are the situation center/command staff (Z1) and technical staff (P3), on which the entire system depends. From the weighted individual elements of CRITIS, an overall resilience for a hospital can be calculated (resilience index). The developed model can be used by hospital crisis experts as part of a self-assessment to provide a basis for risk management, financial planning, technical planning, personnel planning or crisis and disaster management.ConclusionThe categorization and quantification of critical infrastructure (CRITIS) in hospitals with the aim of resilience documentation and optimization is possible. The model that has been developed allows rapid adaptation to changing initial situations and increases in resilience that can be realized in the short and medium term.Emergency and crisis preparedness is a dynamic process, which has been combined here with the further development of critical infrastructure. Consequently, there can be no final state to be achieved but only a certain best possible framework within which the hospital as a business enterprise can operate. The classification of the categories in the model must also be constantly further developed and adapted to the current status. Once the explorative and qualitative basic research has been completed, it is necessary in a further step to subject the model, which has been validated by experts, to a broader review. Ideally, this will be done using quantitative methods and a significantly larger sample.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f450257ba6bd7d7b0f820c52fea3559",
  "timestamp": "2025-05-15T03:28:17.633235"
}