{
  "id": 1211,
  "title": "An FTwNB Shield: A Credit Risk Assessment Model for Data Uncertainty and Privacy Protection",
  "abstract": "Credit risk assessment is an important process in bank financial risk management. Traditional machine-learning methods cannot solve the problem of data islands and the high error rate of two-way decisions, which is not conducive to banks' accurate credit risk assessment of users. To this end, this paper establishes a federated three-way decision incremental naive Bayes bank user credit risk assessment model (FTwNB) that supports asymmetric encryption, uses federated learning to break down data barriers between banks, and uses asymmetric encryption to protect data security for federated processes. At the same time, the model combines the three-way decision methods to realize the three-way classification of user credit (good, bad and delayed judgment), so as to avoid the loss of bank interests caused by the forced division of uncertain users. In addition, the model also incorporates incremental learning steps to eliminate training samples with poor data quality to further improve the model performance. This paper takes German Credit data and Default of Credit Card Clients data as examples to conduct simulation experiments. The result shows that the performance of the FTwNB model has been greatly improved, which verifies that it has good credit risk assessment capabilities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f4e259c0221dc4982d75575061ff056",
  "timestamp": "2025-05-15T01:59:56.421328"
}