{
  "id": 3172,
  "title": "Assessment of translational risk in drug research: Role of biomarker classification and mechanism-based PKPD concepts",
  "abstract": "In 2005, Danhof and coauthors proposed a new biomarker classification in the context of the application of mechanism-based PKPD modeling. They defined the term 'biomarker' as a measure that characterizes a drug-induced response, which is on the causal path between drug administration and clinical outcome. The biomarker classification identified seven categories that provide different insights into the kinetics of drug action, such as target site distribution, target engagement, or into the impact of the drug on physiology or disease. The original biomarker classification has been further modified into a translational biomarker scheme that is used as a communication tool for drug hunting teams to guide designing translational and early clinical development plans as part of an integrated model-informed drug discovery and development strategy. It promotes a dedicated discussion on the topic of the translational relevance of biomarkers and enables efficient identification of translational gaps and opportunities. Based on the elucidated PKPD characteristics exhibited by a novel drug and the kinetics of the investigated biomarker, prospective predictions can be made for the drug response under new conditions; translating from the preclinical arena to the clinical setting, from the healthy volunteer to the patient, or from an adult to an elderly or a child. These drug response predictions provide support to decisions on appropriate next steps in the development of the drug, while keeping clear line of sight on the potential to address unmet medical need. Moreover, this framework enables a transparent translational risk assessment for drug hunting projects, and as such can underpin decisions at program and portfolio level.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f672d0017b540fa7ecec6fe78d82ecf",
  "timestamp": "2025-05-15T01:14:16.244656"
}