{
  "id": 3505,
  "title": "TAXONOMY OF OPERATIONAL RISKS IN FINTECH: A SYSTEMATIC LITERATURE REVIEW",
  "abstract": "Objective: The Fintech industry is beginning to position itself in the financial system clients, thanks to the agility, scope and simplicity of the services offered through digital platforms. This paper aims to describe from the literature, the taxonomy for the identification of Fintech Operational Risks, mapping the current knowledge and identifying gaps in the relevant literature. Design/Methodology/Approach: A systematic literature review is performed based on a bibliometric analysis, using the search equation Fintech, Risk, Credit in the SCOPUS indexer, obtaining 80 scientific articles, from which a .cvs database is downloaded to perform the keyword co-occurrence study with the VOSviewer (R) software, and subsequently perform a content analysis with the ATLAS.ti (R) tool. Results/Discussion: The review proposes from the point of view of different authors a taxonomy of five codes: Cyber Risk, Model Risk, Business Practice Risk, Customer Knowledge Risk and Data Protection Risk, allowing to identify the risk classification of Fintechs, for their analysis. Conclusions: The analysis is performed by means of scatter diagrams, which evidence the degree of relationship between the different risk variables in Fintechs. Originality/Value: This paper provides a mapping of information and scientific knowledge related to the classification of Operational Risks in Fintechs, their degree of relationship and consequences.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f798dcb18cad400d00375fa342ca272",
  "timestamp": "2025-05-15T02:26:48.591441"
}