{
  "id": 9404,
  "title": "Exploring firm-level and sectoral variation in total factor productivity (TFP)",
  "abstract": "Purpose The objective of the study is to identify and explore factors affecting the productivity of companies in the Czech Republic with a focus on the role of firm size, firm age, indebtedness and long-term negative equity, efficiency of assets usage, liquidity, legal form, location and sector affiliation. Design/methodology/approach The study utilizes a large unbalanced panel dataset of 91,257 firms (548,998 observations in total) covering the period 2000-2019. The dependent variable, i.e. total factor productivity (TFP), reflecting the overall firm productivity, was estimated by ordinary least squares (OLS) regression. The main findings were obtained through the estimation of two econometric models explaining the effects of factors on firm-level TFP. First, the OLS regressions together with Nomenclature of Territorial Units for Statistics (NUTS) 3 regions, year dummies and robust standard errors were estimated. Second, as a robustness check, the very same model was estimated with the random effects (RE) generalized least squares (GLS) method. Findings The analysis has shown a statistically significant U-shaped relationship (with the turning point of 38, resp. 36 years) between firm age and the overall TFP among the Czech enterprises. The authors provide two key findings in terms of a firm size-productivity relationship. Firms with fewer employees, often officially registered as self-employed individuals/freelancers, report higher levels of productivity. Nevertheless, when it comes to firm property (assets), the authors find a positive relationship between firm size and TFP. A high proportion of debts in the capital structure of analysed companies, or even negative equity, has been negatively associated with TFP levels. Research limitations/implications More research is needed in the deeper exploration of sectoral and regional determinants of firm TFP, as both regional and sectoral heterogeneity were observed in the study. The authors propose the employment of a multi-level modelling approach, including a range of continuous variables and investigation of their role in shaping firm-level productivity. Practical implications Concerning the results, managers should be mindful of optimal capital structure principles due to the negative impact of a high level of debts on the productivity level. High indebtedness means high-interest payments drawing earnings off, which may be, especially in the long term, a hindrance to investments. The entrepreneurship and small- and medium-sized enterprise policies may be targeted at the soft policy actions, including advisory services and counselling on business development or risk and on the provision of financial capital allowing firms to strive for growth-oriented projects. Originality/value To the best of the authors' knowledge, this is the first attempt to provide insight into the firm-level productivity determinants, based on the large dataset covering enterprises across the whole economy over the long term, representing the structure of the country's entrepreneurial activity.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f8185981172d39bcba264eb1285e9a0",
  "timestamp": "2025-05-15T03:28:17.657770"
}