{
  "id": 511,
  "title": "High frequency volatility forecasting and risk assessment using neural networks-based heteroscedasticity model",
  "abstract": "High frequency volatility forecasting is essential for timely risk management and informed decision-making in dynamic financial markets. However, accurate forecasting is challenging due to the rapid nature of market movements and the complexity of underlying economic factors. This paper introduces a novel architecture combining Generalized Autoregressive Conditional Heteroscedasticity (GARCH) and Multi-layer Perceptron (MLP)-based models for enhanced volatility forecasting and risk assessment, where input variables are processed through GARCH-type models for volatility forecasting. The proposed GARCH-based MLP-Mixer (GaMM) model incorporates the stacking of multi-layer perceptrons, enabling deep representation learning, facilitating the extraction of temporal and feature information through operations along both time and feature dimensions, and addressing the complexity of high-frequency time-series data. The proposed model is evaluated on three high frequency financial times series datasets over three different years. The computational results demonstrate the proposed model's superior performance over sixteen forecasting methods in three error metrics, Value-at-risk, and statistical tests for high frequency volatility forecasting and risk assessment tasks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f861864bcf65cccc01814eb8f9d54fc",
  "timestamp": "2025-05-15T01:38:59.331386"
}