{
  "id": 812,
  "title": "The Optimal Threshold Selection for High-Frequency Pairs Trading via Supervised Machine Learning Algorithms",
  "abstract": "A high frequency pairs trading (HFPT) algorithm is built by the integration of pairs trading and threshold rebalancing algorithm. The determination of optimal threshold (OT) for the HFPT is crucial to maximize its profitability, and this study suggests a procedure to classify OT ranges by supervised machine learning (ML) techniques. In this regard, a sample dataset is created for ML applications. In this dataset, the target variables (OT values) are computed by the application of HFPT algorithm to real price data of 50 crypto-assets, and input variables (features) are calculated as portfolio mean, variance, skewness, kurtosis, value at risk, and correlation coefficient of the pairs. Before classification process, the pairs (or portfolios) are divided into three sub-groups (as positively, weakly and negatively correlated), and then OT values are classified by 6 ML methods. Comparing the evaluation metrics for ML methods, it is observed that the best accuracy, precision and F1\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$F_1$$\\end{document}-scores are obtained by the Random Forest (RF) classifier for all portfolio groups in two-class, three-class and four-class classification. Also, it is seen that the right classification performance of ML methods on positively and negatively correlated pairs are better than weakly correlated pairs. Furthermore, the success of RF classifier is verified with a test dataset that contains price series of 50 crypto-assets in January and February 2024. The applicability of OT range classification procedure in practical exchange markets is also demonstrated, and it is shown that the HFPT algorithm can yield reasonable profits when threshold selected in predicted range.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f8a217197b9f286c877dd45bba5e01d",
  "timestamp": "2025-05-15T00:48:22.385953"
}