{
  "id": 7499,
  "title": "Runaway and pregnant: Risk factors associated with pregnancy in a national sample of runaway/homeless female adolescents",
  "abstract": "Purpose: Homeless youth are at particularly high risk for teen pregnancy; research indicates as many as 20% of homeless Young women become pregnant. These pregnant and homeless teens lack financial resources and adequate health care, resulting in increased risk for low-birth-weight babies and high infant mortality. This study investigated individual and family-level predictors of teen pregnancy among a national sample of runaway/homeless youth in order to better understand the needs of this vulnerable population. Methods: Data from the Runaway/Home less Youth Management Information System (RHY MIS) provided a national sample of youth seeking services at crisis shelters. A sub-sample of pregnant females and a random sub-sample (matched by age) of nonpregnant females comprised the study sample (N = 951). Chi-square and t tests identified differences between pregnant and nonpregnant runaway females; maximum likelihood logistic regression identified individual and family-level predictors of teen pregnancy. Results: Teen pregnancy was associated with being an ethnic minority, dropping out of school, being away from home for longer periods of time, having a sexually transmitted disease, and feeling abandoned by one's family. Family factors, such as living in a single parent household and experiencing emotional abuse by one's mother, increased the odds of a teen being pregnant. Conclusions: The complex problems associated with pregnant runaway/homeless teens create challenges for short-term shelter services. Suggestions are made for extending shelter services to include referrals and coordination with teen parenting programs and other systems of care. (c) 2008 Society for Adolescent Medicine. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1f9b0e7161e3bb90b36e559ec0a74659",
  "timestamp": "2025-05-15T03:09:07.343878"
}