{
  "id": 3067,
  "title": "Risk management and financial performance of insurance firms in Kenya",
  "abstract": "This study examined the relationship between risk management and the financial performance of insurance firms in Kenya over the period 2013-2020. The data was collected from 51 Insurance firms licensed to operate in Kenya as of 31 December 2020. Regression analysis was used and the results showed that risk management significantly affects the financial performance of insurance firms. In particular, the results indicate that credit risk negatively and significantly affects financial performance. The results suggest that firms with a higher proportion of non-performing receivables than total receivables perform poorly. Insurance firms should therefore put in place credit management strategies to ensure receivables are collected within the stipulated time to avoid cases of non-performing receivables and thus improve performance. The results also showed that market risk management positively and significantly affects financial performance. The findings imply that sound investment decisions result in an increase in investment income, which in turn increases financial performance. Insurance firms should therefore ensure proper management of their investments to boost performance. The findings also indicate that operational risk management positively and significantly affects financial performance. The findings suggest that proper management of firms' operations results in reduced operating costs, which in turn result in an increase in net premiums and positively impact the performance of a firm. Insurance firms should thus implement proper operations management strategies to reduce costs and enhance financial performance. The results also indicate that liquidity risk management positively and significantly affects financial performance. The results imply that proper liquidity management ensures an increase in the proportion of current assets to current liabilities and in turn enhances the performance of a firm. Firms should thus ensure there is sufficient liquidity to discharge obligations when due to enhanced performance. This study demonstrates that risk management significantly affects the performance of insurance firms. Therefore, we recommend that directors and other stakeholders should put in place proper risk management strategies to boost financial performance. We also recommend that regulators and policymakers should come up with policies and regulations that will ensure firms adopt appropriate risk management strategies to enhance performance. The study contributes to the risk management literature by providing an empirical examination of the effect of the various risk management strategies adopted by insurance firms and gives recommendations that can be utilized by policymakers in assessing and reviewing risk management mechanisms. The study also gives recommendations to managers and other stakeholders regarding risk management mechanisms that can be adopted to boost the performance of a firm.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fb100e0b509e91f78bb77bf12a84015",
  "timestamp": "2025-05-15T02:22:25.054629"
}