{
  "id": 4157,
  "title": "Innovation and performance in Peruvian manufacturing firms: does R&D play a role?",
  "abstract": "Purpose - This paper aims to study whether Peruvian manufacturing firms that implement innovation have positive performance and whether R&D activities moderate these relationships.Design/methodology/approach - Using a data set of Peruvian manufacturing firms from the 2018 National Survey of Innovation, a LOGIT model analysis was applied to 774 companies. In addition, the authors fitted different models into subsamples to explore the moderating effects of R&D on manufacturing firms. Finally, the regression models were computed using R software.Findings - The results indicate that product, service and marketing innovation are associated positively with an increase in market share, while process and organizational innovations are associated positively with productivity. Moreover, companies with R&D are more productivity-oriented than companies without R&D.Research limitations/implications - This study contributes to the literature on innovation management by supporting the assumption that innovation results in increased productivity and expands market demand. In addition, findings highlight that R&D is essential for boosting firms' productivity.Practical implications - Managers should consider an appropriate combination of the innovation portfolio and R&D investments to make progress and increase performance in the company. In addition, policymakers should consider that investments to promote the development of R&D activities in manufacturing companies will likely lead to me?dium-or long-term returns.Social implications - The correct use of indicators to measure these relationships could help the policymaker to design and measure policy instruments more efficiently. Originality/value - These results provide a deeper understanding of how the effects of innovations implemented by manufacturing firms, especially service and process innovation, improve their performance.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fb42afee52b16692362aa8dd9d87ec8",
  "timestamp": "2025-05-15T01:24:25.348960"
}