{
  "id": 2452,
  "title": "Dynamic quantification anti-fraud machine learning model for real-time transaction fraud detection in banking",
  "abstract": "As the scenario of telecom network fraud intensifies, the development of anti-fraud models has become a focal point in financial technology, including banking sectors. Traditional anti-telecom fraud models, which primarily rely on expert rules and machine learning methodologies, are beset with limitations such as poor real-time performance and high false favourable rates, leading to biased predictive outcomes. This paper introduces a novel anti-fraud model: The Dynamic Quantification Anti-Fraud Model grounded in Real-time Transaction Flows to address these issues. This model combines multiple F-Beta features linearly, employs a DML (Double Machine Learning) framework for feature weight quantification, and conducts instantaneous risk assessments of account transactions. By dynamically adjusting feature weights based on historical single-feature false favourable rates and the branch's anti-fraud tolerance capacity, it significantly improves model performance and the efficiency of fraud prevention. Using transaction detail data of implicated cards from a case bank spanning January to June 2023 as an example for modelling, the validation sample recall rate reached 0.506. Post-deployment, the model facilitated a 30-percentage point reduction in the proportion of implicated cards within six months at the bank, alongside a substantial drop in its ranking among peers concerning the number of fraud cases. This comprehensive improvement solidly validates the precision and efficacy of the proposed model.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fcde08941456f989ad0d8854e2ec02b",
  "timestamp": "2025-05-15T02:15:27.089050"
}