{
  "id": 5912,
  "title": "Race and socioeconomic differences in post-settlement outcomes for African American and Caucasian Workers' Compensation claimants with low back injuries",
  "abstract": "The purpose of this study was to predict post-settlement pain intensity, psychological distress, disability, and financial struggle among African American (n = 580) and non-Hispanic Caucasian (n = 892) Workers' Compensation claimants with single incident low back injury. The study was a population-based telephone survey conducted in three population centers in Missouri. Post-settlement outcomes were predicted from claimant demographics (race, age, gender); socioeconomic status (SES); diagnosis and legal representation; and Workers' Compensation resolution variables (treatment costs, temporary disability status, disability rating, settlement costs). Simultaneous-entry, hierarchical multiple linear regression analyses indicated that African American race and lower SES predicted higher levels of post-settlement pain intensity, psychological distress (general mental health, pain-related catastrophizing), disability (pain-related role interference), and financial struggle, independent of age, gender, diagnosis, legal representation, and Workers' Compensation resolution variables. The results suggest that African American race and lower SES-relative to Caucasian race and higher SES-are risk factors for poor outcomes after occupational low back injury. Mechanisms to explain these associations are discussed, including patient-level, provider-level, legal, and Workers' Compensation system-level factors. (c) 2005 International Association for the Study of Pain. Published by Elsevier B.V. All rights reserved.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fd75eb29c85a328e5376fec5b1f0267",
  "timestamp": "2025-05-15T02:52:31.528566"
}