{
  "id": 8641,
  "title": "The moderating effects of gender on managerial performance assessment and dysfunctional behaviour: Evidence from Indonesia",
  "abstract": "Dysfunctional behaviour and gender are significant topics in economics and accounting research, especially behavioural accounting. The research has demonstrated a connection between managers' motivation and performance assessment. Organizations, both public and private engage in performance assessment as a crucial activity when assessing the accomplishment of organizational objectives. This study tries to explore the effect of managerial performance assessment and gender on dysfunctional behaviour and how it affects managers' dysfunctional behaviour. It also looks at how the role of gender in moderating the effect of managerial performance assessment on dysfunctional behaviour. The managers of Rural Banks/Sharia Rural Banks that were regulated by The Financial Services Authority Purwokerto, Central Java Province, Indonesia, are the respondents to this study. From 24 BPR/BPRS with complete data, 80 questionnaires were chosen using the purposive sampling technique. This study establishes through the use of linear regression that managerial performance evaluation has an impact on reducing dysfunctional behaviour. Additionally, research demonstrates that gender has no bearing on dysfunctional behaviour and does not moderate the effect of managerial performance assessment on dysfunctional behaviour. Other findings indicate that, despite the stereotype that women are more risk-averse, dysfunctional behaviour is not associated with gender identity. At various managerial levels, this study also discovered variations in how dysfunctional behaviour was perceived. Lower-level managers and middle-level managers, as well as lower-level managers and upper-level managers, have different perspectives on dysfunctional behaviour. Top managers and middle managers both view dysfunctional behaviour as unacceptable. Given the possibility of dysfunctional behaviour appearing while evaluating management performance, the findings of this study help to advance behavioural accounting.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fd7a5df32a16a1346c64feedcdd20b3",
  "timestamp": "2025-05-15T03:20:55.970663"
}