{
  "id": 4159,
  "title": "An Intelligent Decision Support System for Assessing the Default Risk in Small and Medium-Sized Enterprises",
  "abstract": "In the last years, default prediction systems have become an important tool for a wide variety of financial institutions, such as banking systems or credit business, for which being able of detecting credit and default risks, translates to a better financial status. Nevertheless, small and medium-sized enterprises did not focus its attention on customer default prediction but in maximizing the sales rate. Consequently, many companies could not cope with the customers' debt and ended up closing the business. In order to overcome this issue, this paper presents a novel decision support system for default prediction specially tailored for small and medium-sized enterprises that retrieves the information related to the customers in an Enterprise Resource Planning (ERP) system and obtain the default risk probability of a new order or client. The resulting approach has been tested in a Graphic Arts printing company of The Basque Country allowing taking prioritized and preventive actions with regard to the default risk probability and the customer's characteristics. Simulation results verify that the proposed scheme achieves a better performance than a naive Random Forest (RF) classification technique in real scenarios with unbalanced datasets.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fded382e1b24f88e7d122e5131f9be7",
  "timestamp": "2025-05-15T02:33:42.162420"
}