{
  "id": 2311,
  "title": "Interrelation of personal characteristics with financial literacy as a guide to financial behavior of Russian students",
  "abstract": "The research is aimed at analyzing influence of various personal characteristics of young students along with financial literacy on their expected financial behavior. Besides financial literacy, we singled out such personal characteristics as prodigality, credulity, risk preference and propensity for offence or unethical behavior. Our research is based on the data obtained by sample questionnaire survey of full-time students learning economics at Lobachevsky State University of Nizhni Novgorord, Russia. For evaluation of each personal characteristic we asked respondents to answer twelve direct and indirect questions, which enabled us to both outline distribution of the estimated features among students and calculate their average values. For the whole sample we found medium positive correlation between prodigality, risk preference and propensity for offence or unethical behavior, while other pairs demonstrated weak correlations. Further clustering of the whole sample into six approximately equal groups with use of the Ward's method allowed us to receive more pronounced dependencies between characteristics within these groups, albeit different by sign. We found out that combining various characteristics with different level of financial literacy ensured quite opposite types of expected financial behavior. This emphasizes the role of personality development as a complex task even more important for students just entering the financial market.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1fe06fddbd6dde6418d128288db1c573",
  "timestamp": "2025-05-15T02:13:31.911015"
}