{
  "id": 1934,
  "title": "Modelling the health, financial protection and equity impacts of upscaling the ACT NOW early intervention breast cancer pilot program in the Philippines: an extended cost-effectiveness analysis",
  "abstract": "Introduction Women in the Philippines experience significant health and economic burdens of breast cancer. The Philippines has reformed financial protection for breast cancer but does not have a national early detection and treatment programme. This study aims to model the health and economic impacts of ACT NOW (a pilot breast cancer programme that navigates women through free early detection to treatment) through an extended cost-effectiveness analysis.Methods A microsimulation decision tree model was used to model the ACT NOW intervention (including annual clinical breast examination (CBE) and biannual breast ultrasound for women at high risk of breast cancer) over 5 years for healthy women 40-69 years old. Outcomes included health gains (breast cancer deaths saved), financial protection (financial catastrophes saved) and incremental cost-effectiveness ratios (ICER) (cost per disability-adjusted life year (DALY) saved). Outcomes were stratified by income group. Probabilistic, one-way sensitivity and scenario analyses explored uncertainty.Results Over 5 years, the ACT NOW intervention is cost-effective with an ICER of PHP60 711 (USD1098) (average incremental cost PHP743 [95% UI 424-960] and DALYs saved 0.01 [95% UI 0.01-0.02], below Philippines 2022 gross domestic product per capita PHP178 751). Per 100 000 women, 57 deaths and eight financial catastrophes were saved. Cost-effectiveness did not vary significantly by income, but higher income groups incurred greater costs and lower DALYs. Results were sensitive to proportion of late-stage breast cancers post intervention, treatment adherence, intervention costs and downstaging effectiveness. Trade-offs are apparent between government contributions to financial protection and rates of financial catastrophe.Conclusions Early detection interventions (annual CBE, biannual breast ultrasound if at high risk of breast cancer) are likely to be cost-effective, reduce breast cancer-related mortality through detection at earlier stages and modestly effective in reducing the incidence of financial catastrophe. Further research is required to establish the best implementation model to pursue full implementation and ways of designing equity-based screening interventions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "1ffde9f0f177ad41e274181c8981b2fc",
  "timestamp": "2025-05-15T02:09:14.366837"
}