{
  "id": 8073,
  "title": "Data Driven Identification of Injury Risk Factors During Expansion on Irish Dairy Farms",
  "abstract": "Objectives: This paper sought to determine risk factors of occupational injury in the Irish dairy farming sector and to estimate the roles of both dairying expansion and the discipline of agricultural extension in influencing reducing injury occurrence.Methods: Data for this study was obtained via the Irish National Farm Survey (NFS). In total, 260 farm (83.6% of NFS dairy farm sample) workplace injury survey questionnaires were completed by NFS recorders by interviewing principal farm operators for year 2017. Injury survey data was analysed for 48 variables in conjunction with NFS core farm socio-economic, physical and financial data. Additionally, core data from 2010 for 78.5% of farms surveyed in 2017 was included in the study. Data were analysed using a three-step statistical testing process which met all Binary Logistic Regression assumptions.Results: The study found that dairy farms had a higher farm workplace occupational injury level compared to a previous study. The study data indicates occurrence of elevated injury levels on farms which expanded and which were intensively managed from a milk production perspective. Farm expansion was associated with increased labor units used and increased investment per hectare. The study also found that use of extension services and farm discussion group participation were not associated with injury occurrence.Conclusions: This study demonstrates how a retrospective farm workplace occupational injury survey of Irish dairy farms, analysed in combination with farm business data can be used to identify injury risk factors, including those associated with production expansion. Irish dairy farms have a heightened farm workplace occupation injury level while dairy production expansion increased injury levels. Extension engagement did not influence on injury levels. Approaches to improve farm safety on dairy farms are outlined.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2000bd546a87f9a82acb8b501e28b622",
  "timestamp": "2025-05-15T03:15:09.321541"
}