{
  "id": 7174,
  "title": "Social Determinants of Transactional Sex in a Sample of Young Black and Latinx Sexual Minority Cisgender Men and Transgender Women",
  "abstract": "Purpose: We sought to explore characteristics and risk factors associated with transactional sex in a sample of young black and Latinx sexual minority cisgender men and transgender women of age 15 to 24 years who were living with or at high risk for HIV infection and whether these associations vary by gender identity and HIV status. Methods: A total of 454 black and Latinx sexual minority cisgender men and transgender women from Baltimore, MD; Philadelphia, PA; Washington, DC; and St. Petersburg/Tampa, Fl, were recruited to participate in a multisite study that included a 45-minute baseline Web-based survey and HIV-1 rapid testing. Bivariate analysis was used to explore factors associated with transactional sex. Factors significant at p-value <.20 in bivariate analysis were entered into a final logistic regression models; and models were further stratified by gender identity and HIV status. Results: The mean age was 21.3 (standard deviation = 2.5), with 14.7% (n = 65) identifying as transgender, and 103 youth (22.7%) reporting lifetime transactional sex. Transactional sex was associated with transgender identity, recent unstable housing in the last 12 months, poorer perceived financial well-being, coerced sex, and marijuana use. Differences were noted by gender identity and HIV status, with marijuana use associated with transactional sex in cisgender men and unstable housing and sexual coercion in youth living with HIV. Conclusions: Young black and Latinx cisgender men and transgender women are at a high risk for engaging in transactional sex. Transactional sex may create a syndemic for HIV risk exposure through co-occurring and reinforcing conditions of unstable housing, violence, and substance use. (C) 2021 Society for Adolescent Health and Medicine. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2005a571cf958108a01cef60bf019e6a",
  "timestamp": "2025-05-15T03:06:01.146039"
}