{
  "id": 6189,
  "title": "An early prediction model on systemic risk under global risk: Using FinBERT and temporal fusion transformer to multimodal data fusion framework",
  "abstract": "Several United States banks went bankrupt in 2023, and the total scale exceeded the subprime 2008 mortgage crisis. Thus, determining how to better predict banks' systemic risks is crucial. While past research used quantitative data and statistical methods, rarely incorporated qualitative data, and lacked research exploring the impact of public confidence on systemic risk. This study examined 445,500 daily multimodal quantitative and qualitative data to analyze financial news. We obtained data on public confidence through finance bidirectional encoder representations from transformers (hereafter FinBERT) to explore the relationship between public confidence and systemic risk through temporal fusion transformers (TFTs). We established an early prediction model that predicts the next 5 and 20 days, achieving more accurate prediction performance than linear regression, LSTM (long short-term memory), and XGB (eXtreme gradient boosting). Based on the model that uses the past 20 days to predict the next five days, we found that positive and negative public confidence had a greater impact on systemic risk. In comparison, neutral public confidence had a lesser effect. Macro data such as carbon dioxide emissions also impact systemic risk. By expanding the time range to 60 days to predict 20 days, we found that the most significant impact on systemic risk factors was month, negative public information, interest rate, quasi-leverage, and the GDP growth rate. The findings indicate that public confidence deserves more attention than macro variables in preventing systemic risks in the banking industry. Negative public confidence significantly affects systemic risk, echoing the adage that Bad news has wings.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "200fb5a4522221bfa39f365591a1b970",
  "timestamp": "2025-05-15T02:55:44.559923"
}