{
  "id": 9051,
  "title": "Perampanel add-on therapy for drug-refractory epilepsy: A single-center retrospective study based on 6-month treatment outcomes in Central China",
  "abstract": "Objective: To systematically evaluate the efficacy, tolerability and retention of perampanel (PER) for treating drug-refractory epilepsy (DRE), and to investigate the independent factors affecting efficacy and retention. We hope this will provide clinicians with guidelines for the use of PER to treat patients with DRE. Methods: We conducted a single-center retrospective observational study of patients with DRE who received PER as add-on therapy at the Epilepsy Center of the People's Hospital of Henan Province, China, between 2020 Mar. and 2021 Sep. We collected clinical data from these patients. The observation period was 6 months. The observation endpoint is the drug response and retention rate at 6 months of PER use. Regression analyses were used to compare the differences in efficacy and retention rates, respectively. Results: Clinical data were obtained for 72 patients with DRE (mean duration of treatment: 10.6 months). At 6 months, 25% of patients (n = 18) were seizure free; 18.1% of patients (n = 13) remained seizure free for 6 months after the addition of PER. 22.2% of patients (n = 16) had a response (One of the patients was withdrawn 5 months after adding PER due to financial difficulties). The retention rate of PER at 6 months was 77.8%. Adverse effects tended to be dominated by neuropsychiatric symptoms. Multifactorial logistic regression analysis showed significant differences in whether the baseline seizure frequency exceeded 4 seizures/month (OR = 0.232, 95%CI: 0.077-0.702, p = 0.01) and whether the number of previously failed ASMs exceeded 3 (OR = 0.316; 95%CI:0.109-0.920, p = 0.035). This indicates that the risk of experiencing a nonresponse is higher with a higher baseline seizure frequency as well as with a higher number of previous ASM failures. Therefore, a baseline frequency exceeding four seizures/month and more than three previous ASM failures were independent influencing factors for PER addition treatment for patients with DRE. Multifactorial COX regression showed that patients with DRE due to infection had a lower retention rate (OR =15.957, 95% CI: 3.692-68.972, P < 0.001) than patients with DRE due to other noninfectious etiologies. Patients with DRE who only had a single seizure type (OR = 0.053, 95% CI:0.006-0.476, P = 0.009), and patients who did not have cognitive impairment (OR =134.253, 95% CI:5.623- 3205.104, P = 0.002) showed longer durations of PER use. Infection-related epilepsy etiology, experiencing multiple types of seizures, and with cognitive impairment were independent influencing factors on PER use retention in patients with DRE. Conclusion: Our study demonstrated the efficacy of PER for reducing seizure frequency in patients with DRE and found significant differences in efficacy and retention rate, respectively. This provides a basis for assessing the expected efficacy and duration of use of PER for patients with DRE. (c) 2022 Elsevier Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "201c9b8237fe6418a38d65a9385a3d43",
  "timestamp": "2025-05-15T03:24:54.966577"
}