{
  "id": 7163,
  "title": "Quality of life among caregivers of sickle cell disease patients: a cross sectional study",
  "abstract": "Purpose: To assess the quality of life (QoL) of caregivers of children with sickle cell disease (SCD) and to determine the risk factors associated with poor QoL. Method: A cross sectional study was conducted between 01 and 30 June 2015, in a tertiary care center in western Saudi Arabia to assess various dimensions of QoL by using TNO-AZL Questionnaire for Adult's Health-related Quality of Life (TAAQOL). A total 164 adult caregivers (aged 16 years or more) of children with SCD, who were regularly visiting the department were enrolled (refusal rate = 61.6%). The questionnaire scores were transformed into 0-100 scale; with higher scores indicating less difficulty and better QoL Demographic, socioeconomic data and a satisfaction questionnaire regarding participants' lifestyle were collected and analyzed as risk factors for impaired QoL, by comparing different QoL dimensions' scores using independent t-test, Oneway ANOVA, or linear regression, as appropriate. Results: Sixty-three caregivers were included; 79.4% were mothers, age range 21-71 years, 64.5% were from low social class receiving insufficient support and financial needs were unmet for considerable number of families. Analysis of QoL using TAAQOL showed that emotions (median [75th centile] = 44.44 [66.67] for negative and 61.11 [72.22] for positive emotions), sleep quality (66.67 [91.67]) and sexual life (50.00 [83.33]) were the most affected dimensions. Professional achievement (91.67 [100]), cognitive skills (83.33 [100]), and social contact (100 [100]) were relatively preserved. Negative emotions were more marked in mothers and mostly predicted by satisfaction with social relations notably with partner (B = 3.14, p = 0.016), friends (B = 2.51, p = 0.015) and relatives (B = 2.69, p = 0.016). Positive emotions were predicted by the levels of satisfaction of the caregiver with his/her health (B = 2.56, p = 0.001), job achievement (B = 4.54, p = 0.001), living conditions (B = 2.60, p = 0.034) and the condition of the diseased child (B = 2.55, p = 0.011). A strong correlation was found between sleep quality and cognitive skills. Conclusion: There are notable financial and emotional burdens on the caregivers of children with SCD affecting various aspects of their QoL, which are likely to be impacted by the individual levels of social and professional achievement. Physicians and health authorities should give particular attention to the QoL of caregivers and families of children with SCD, to help them cope up with the disease and overcome its related psychological and financial impacts.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20230e4854446bc8f6b55cf6aab641ee",
  "timestamp": "2025-05-15T03:06:01.077766"
}