{
  "id": 5906,
  "title": "Predictors of Depressive Symptoms Based on the Human Capital Model Approach: Findings From the Indonesia Family Life Survey",
  "abstract": "Depression is the leading factor of disability and the overall global burden of diseases. The human capital model provides an appropriate conceptual model for managing human health. This study aimed to determine the association between human capital (including social, emotional, physical, financial, and intellectual capital) and depressive symptoms among productive age groups in Indonesia. A cross-sectional study was conducted by analyzing data of 9,858 respondents aged 15-59 years that were obtained from the Indonesia Family Life Survey 5 (IFLS 5). Multivariate logistic regression was used to assess the association between human capital components and depressive symptoms. Among respondents, 23.65% had higher depressive symptoms. Social trust and social networks (part of social capital) were significantly related to depressive symptoms. Self-reported satisfaction (part of emotional capital) were also related to depressive symptoms, as well as self-rated health, sleep quality, a number of chronic disease, body mass index (BMI), and physical functioning (part of physical capital). Log income (part of financial capital) and education level (part of intellectual capital) were related to depressive symptoms after controlling for other variables. Of all the components of human capital, physical capital has the most attributes associated with the risk of depressive symptoms. Therefore, depression prevention programs can be prioritized on attributes related to physical capital.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "203abc2d1dfc60788c3450af084fe48b",
  "timestamp": "2025-05-15T02:52:31.505948"
}