{
  "id": 616,
  "title": "Randomized Trial of an Intervention to Improve Blood Pressure Control in Stroke Survivors",
  "abstract": "Background: We conducted the first-of-its kind randomized stroke trial in Africa to test whether a THRIVES (Tailored Hospital-based Risk reduction to Impede Vascular Events after Stroke) intervention improved blood pressure (BP) control among patients with stroke. Methods and Results: Intervention comprised a patient global risk factor control report card, personalized phone text-messaging, and educational video. Four hundred patients recruited from 4 distinct medical facilities in Nigeria, aged >= 18 years with stroke-onset within one-year, were randomized to THRIVES intervention and control group. The control group also received text messages, and both groups received modest financial incentives. The primary outcome was mean change in systolic BP (SBP) at 12 months. There were 36.5% females, 72.3% with ischemic stroke; mean age was 57.2 +/- 11.7 years; 93.5% had hypertension and mean SBP was 138.33 (23.64) mm Hg. At 12 months, there was no significant difference in SBP reduction from baseline in the THRIVES versus control group (2.32 versus 2.01 mm Hg, P=0.82). In an exploratory analysis of subjects with baseline BP >140/90 mm Hg (n=168), THRIVES showed a significant mean SBP (diastolic BP) decrease of 11.7 (7.0) mm Hg while control group showed a significant mean SBP (diastolic BP) decrease of 11.2 (7.9) mm Hg at 12 months. Conclusions: THRIVES intervention did not significantly reduce SBP compared with controls. However, there was similar significant decrease in mean BP in both treatment arms in the subgroup with baseline hypertension. As text-messaging and a modest financial incentive were the common elements between both treatment arms, further research is required to establish whether these measures alone can improve BP control among stroke survivors.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2046f9d17a7aed0665d8b8ddb644b9a4",
  "timestamp": "2025-05-15T01:40:51.072688"
}