{
  "id": 8168,
  "title": "Early Endophthalmitis Incidence and Risk Factors after Glaucoma Surgery in the Medicare Population from 2016 to 2019",
  "abstract": "Purpose: To determine early endophthalmitis incidence and risk factors after glaucoma surgeries in the Medicare population. Design: Retrospective, longitudinal study. Participants: Medicare Fee -for -Service (FFS) and Medicare Advantage beneficiaries in the United States aged 65 years or older undergoing glaucoma surgery. Methods: Medicare claims were used to identify all patients who underwent glaucoma, cataract, or combined cataract/glaucoma surgery from 2016 to 2019. Endophthalmitis cases within 42 days of the index surgery were identified using the diagnostic codes. Multivariable logistic regression models were used to evaluate factors associated with postoperative endophthalmitis. Main Outcome Measures: The 42 -day postoperative endophthalmitis incidence and risk factors associated with endophthalmitis after glaucoma surgery. Results: There were 466 928 glaucoma surgeries, of which 310 823 (66.6%) were combined with cataract surgery. Cataract surgeries alone (n = 8 460 360) served as a reference group. Microinvasive glaucoma surgeries constituted most glaucoma procedures performed (67.8%), followed by trabeculectomy (14.0%), tube shunt (10.9%), and other procedures (7.3%). There were 572 cases of endophthalmitis identified after all glaucoma surgeries. Endophthalmitis incidence after glaucoma, combined cataract/glaucoma, and cataract surgeries alone was 1.5 (95% confidence interval [CI], 1.3-1.7), 1.1 (95% CI, 1.0-1.2), and 0.8 (95% CI, 0.8-0.8) per 1000 procedures, respectively. The median day of diagnosis of endophthalmitis was later for glaucoma surgeries (16.5 days) compared with combined cataract/glaucoma or cataract surgeries alone (8 and 6 days, respectively). Compared with microinvasive glaucoma surgery (MIGS), tube shunts were the only surgery type to be a significant risk factor for endophthalmitis for both stand-alone (adjusted odds ratio [aOR], 1.8, P = 0.002) and combined surgery (aOR 1.8, P = 0.047). The other risk factor for both stand-alone (aOR 1.1, P = 0.001) and combined (aOR 1.06, P = 0.049) surgeries was the Charlson Comorbidity Index (CCI). Age (aOR 1.03, P = 0.004) and male gender (1.46, P = 0.001) were significant risk factors for combined cataract and glaucoma surgeries. Conclusions: Compared with cataract surgery, early endophthalmitis incidence was higher for both glaucoma and combined cataract/glaucoma surgeries, with the highest incidence among tube shunts. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2024;131:179-187 (c) 2023 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "205348b912497893defbb0b0507ff1c2",
  "timestamp": "2025-05-15T03:16:17.307189"
}