{
  "id": 8444,
  "title": "Out-of-pocket expenditure and its correlates for institutional deliveries in private and public healthcare sectors in India: findings from NFHS 5",
  "abstract": "BackgroundIncreased coverage for institutional delivery (ID) is one of the essential factors for improved maternal and child health (MCH). Though, ID increased over time, out-of-pocket expenditure (OOPE) for the care-seeking families had been found to be growing, parallelly. Hence, we estimated OOPE in public and private health centres for ID, along with their sources and attributing factors and compared state and union territory-wise, so that financial risk protection can be improved for MCH related services.MethodsWe used women's data from the National Family Health Survey, 2019-2021 (NFHS-5). Reproductive aged women (15-49 years) delivering one live child in last 5 years (n = 145,386) in any public or private institutions, were included. Descriptive statistics were presented as frequency and proportions. OOPE, was summarized as median and interquartile range (IQR). To estimate the extent for each covariate's effect, linear regression model was conducted.ResultsOverall median OOPE for ID was Rs. 4066 (median OOPE: private hospitals: Rs.25600, public hospitals: Rs.2067). Health insurance was not sufficient to slash OOPE down at private facilities. Factors associated significantly to high OOPE were mothers' education, elderly pregnancy, complicated delivery, birth order of the latest child etc.ConclusionA standard norm for ID should be implemented as a component of overseeing and controlling inequality. Aiding the needy is probably just one side of the solution, while the focus is required to be shifted towards reducing disparity among the health facilities, so that the beneficiaries do not need to spend on essential services or during emergencies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "205eadad5bef6e9f6bca5fc19bef3acf",
  "timestamp": "2025-05-15T03:18:51.647027"
}