{
  "id": 2969,
  "title": "Serving the underserved: the impact of the low-income designation on credit union performance",
  "abstract": "PurposeWe evaluate the influence of one type of financial inclusion initiative in the US. The low-income designation (LID) provides regulatory waivers and operational assistance to credit unions who obtain the designation. This study identifies the influence of LID on credit union financial performance.Design/methodology/approachUsing annual data from 5,300 call reports for years 2000-2019, we employ a regression analysis to study how LID affects credit union profitability, risk, and growth.FindingsLID significantly impacts credit union financial performance, improving profitability and driving asset and membership growth. Credit risk declines gradually post-designation. Larger credit unions grow faster, while well-capitalized ones expand conservatively. Loan composition influences growth, with auto and unsecured loans driving expansion, while mortgages and credit cards slow it. LID's impact was stronger pre-2012 when credit unions applied proactively, suggesting that credit unions that actively pursued LID status leveraged its benefits more effectively.Originality/valueThe findings provide insights regarding the sustainability of incentivizing financial institutions to provide financial inclusion services to the underserved, a subject that has received little scholarly attention. We contribute to the literature and provide practical insights regarding government-supported financial inclusion initiatives in the US.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2079a455423540319a7ea33fadc89afa",
  "timestamp": "2025-05-15T02:21:19.192179"
}