{
  "id": 188,
  "title": "Deep Learning to Improve the Sustainability of Agricultural Crops Affected by Phytosanitary Events: A Financial-Risk Approach",
  "abstract": "Given the challenges in reducing greenhouse gases (GHG), one of the sectors that have attracted the most attention in the Sustainable Development Agenda 2030 (SDA-2030) is the agricultural sector. In this context, one of the crops that has had the most remarkable development worldwide has been oil-palm cultivation, thanks to its high productive potential and being one of the most efficient sources of palmitic acid production. However, despite the significant presence of oil palm in the food sector, oil-palm crops have not been exempt from criticism, as its cultivation has developed mainly in areas of ecological conservation around the world. This criticism has been extended to other crops in the context of the Sustainable Development Goals (SDG) due to insecticides and fertilisers required to treat phytosanitary events in the field. To reduce this problem, researchers have used unmanned aerial vehicles (UAVs) to capture multi-spectral aerial images (MAIs) to assess fields' plant vigour and detect phytosanitary events early using vegetation indices (VIs). However, detecting phytosanitary events in the early stages still suggests a technological challenge. Thus, to improve the environmental and financial sustainability of oil-palm crops, this paper proposes a hybrid deep-learning model (stacked-convolutional) for risk characterisation derived from a phytosanitary event, as suggested by lethal wilt (LW). For this purpose, the proposed model integrates a Lagrangian dispersion model of the backward-Gaussian-puff-tracking type into its convolutional structure, which allows describing the evolution of LW in the field for stages before a temporal reference scenario. The results show that the proposed model allowed the characterisation of the risk derived from a phytosanitary event, (PE) such as lethal wilt (LW), in the field, promoting improvement in agricultural environmental and financial sustainability activities through the integration of financial-risk concepts. This improved risk management will lead to lower projected losses due to a natural reduction in insecticides and fertilisers, allowing a balance between development and sustainability for this type of crop from the RSPO standards.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "209523cac91ce9e4114c98f25998650d",
  "timestamp": "2025-05-15T01:35:04.442716"
}