{
  "id": 1204,
  "title": "A novel grey relational clustering model under sequential three-way decision framework",
  "abstract": "In the context of addressing clustering problems with small samples, grey relational clustering (GRC) plays a crucial role. Currently, a three-way GRC has gained popularity, particularly for its ability to handle the uncertain relationship between objects and classes. However, explicit clustering for some objects may not be achievable when employing the one-step decision, which is often a coarse-grained approach. In such cases, re-clustering these objects with a finer granularity becomes necessary. This is where the sequential three-way decision (STWD) proves to be an effective solution. Therefore, this paper is dedicated to designing a novel GRC under the STWD framework, namely GRC-STWD. Specifically, recognizing that some existing threshold calculations in GRCs can be overly subjective and that a pair-wise global threshold may not efficiently leverage available information for accurate object clustering, we introduce a novel threshold algorithm to address these limitations. Furthermore, we propose a conditional probability calculation method combining TOPSIS and grey relational degrees for clustering data lacking decision attributes or class labels. As the development of GRC within portfolio environments remains relatively nascent, we apply the proposed model to portfolio strategy construction. Finally, comparative and experimental analyses validate the model's effectiveness and feasibility. Notably, the developed model serves as a generalization of GRC, contributing to the broader advancement of GRC and STWD methodologies.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "209bc6167794608e2c54a2e80f8822c2",
  "timestamp": "2025-05-15T00:53:09.879079"
}