{
  "id": 936,
  "title": "Transformative reconstruction of missing acoustic well logs using multi-head self-attention BiRNNs",
  "abstract": "Acoustic well logs are vital for many industrial projects, such as mining, oil and gas, civil engineering, geothermal energy, water resource exploration, mineral exploration, and carbon capture and storage. However, these important well log data, which reveal acoustic properties of the subsurface properties, due to operational or financial constraints, may not be always available. This hinders well planning, drilling operation risk assessment, reservoir evaluation, and production optimization in these projects. In recent years, deep learning has gained prominence in well log prediction. Recurrent neural networks (RNNs), especially suited for capturing geological-driven trends in well logs, have emerged as a preferred technique. Multihead attention (MHA) is used to evaluate diverse facets of relationships within the data, enhancing contextual understanding and overcoming challenges. To the best of our knowledge, this study, for the first time, has examined three RNN variants, (BiRNN, BiLSTM and BiGRU), combined with MHA mechanism for the objective of reconstructing acoustic well logs using the existing well log data (i.e. Neutron, Gamma, Density). To this aim, three different models, MHA-BiRNN, MHABiLSTM, and MHA-BiGRU were designed, trained, validated and tested on well logging data taken from Shengli Oilfield. It is noteworthy that, to enhance the significance and reliability of the models, the dataset originated from a discerningly selected subset of 100 wells, purposefully chosen from a pool of 463 (making over 500,000 sequences). This deliberate approach ensures the impartiality of the data, enhancing the trustworthiness and robustness of our models. The results showed promising performance of MHA-BiGRU, MHA-BiRNN and MHA-BiLSTM in capturing nonlinear relationships and vertical depth sequence information between logging curves and good prediction accuracy in actual testing wells. Among them, MHA-BiGRU outperformed (R2 = 0.807, Pearson = 0.914). The proposed method provides a fast and effective way for filling missing values, which is valuable for geological research and engineering applications.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20a39477b44f01a0c79ef8d436e47cfb",
  "timestamp": "2025-05-15T01:44:35.452993"
}