{
  "id": 680,
  "title": "Innovative Risk Early Warning Model under Data Mining Approach in Risk Assessment of Internet Credit Finance",
  "abstract": "The financial risks of commercial banks are classified and evaluated through the Internet of Things (IoT) technology and big data technology to reduce the financial risk loss of commercial banks in the context of Internet finance. Firstly, based on the analysis of financial risks in the context of IoT technology, an IoT tail loss mathematical model of financial operation risk is constructed to classify the operation risks of commercial banks. Secondly, the BP neural network algorithm is applied to determine the number of nodes, activation function, learning rate, and other parameters of each BP neural network layer. Also, many data samples are used to build an early warning model of Internet credit risk. The constructed model is trained and tested. Finally, the genetic algorithm (GA) is used to optimize the neural network to improve early warning accuracy. The results show that introducing Internet technology can reduce the risk loss of commercial banks. In addition, based on 450 data samples of 90 companies in 5 years and the risk interval divided by the 3 sigma rule, the Internet credit risk level was initially determined. Then, the neural network is trained and tested. The prediction accuracy of the neural network reaches 85%. In order to avoid the defects of BP neural network falling into local extreme values, GA is used to optimize the neural network. The warning is more accurate and the error is smaller, and the accuracy rate can reach 97%. Therefore, the use of BP neural network for early warning and assessment of Internet credit risk has good accuracy and computing efficiency, which expands the application of BP neural network in the field of Internet finance, and provides a new development direction for the early warning and assessment of Internet credit risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20ab64a5cd5cd762323f9d52317bb0ea",
  "timestamp": "2025-05-15T01:53:59.337049"
}