{
  "id": 421,
  "title": "Assessment of Support Vector Machine performance for default prediction and credit rating",
  "abstract": "Predicting the creditworthiness of bank customers is a major concern for banking institutions, as modeling the probability of default is a key focus of the Basel regulations. Practitioners propose different default modeling techniques such as linear discriminant analysis, logistic regression, Bayesian approach, and artificial intelligence techniques. The performance of the default prediction is evaluated by the Receiver Operating Characteristic (ROC) curve using three types of kernels, namely, the polynomial kernel, the linear kernel and the Gaussian kernel. To justify the performance of the model, the study compares the prediction of default by the support vector with the logistic regression using data from a portfolio of particular bank customers. The results of this study showed that the model based on the Support Vector Machine approach with the Radial Basis Function kernel, performs better in prediction, compared to the logistic regression model, with a value of the ROC curve equal to 98%, against 71.7% for the logistic regression model. Also, this paper presents the conception of a support vector machine-based rating tool designed to classify bank customers and determine their probability of default. This probability has been computed empirically and represents the proportion of defaulting customers in each class.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20b14179a25fee8a0bb392d5a58a10bc",
  "timestamp": "2025-05-15T00:43:10.560716"
}