{
  "id": 2223,
  "title": "Anomaly detection in electronic invoice systems based on machine learning",
  "abstract": "Electronic invoice(E-invoice) has become the product of the information age, its issue will greatly save the cost of enterprises and achieve the goal of financial process automation. Hence, the generalization of electronic invoice is imperative. However, there exists the risk of malicious attacks in electronic invoice systems, such as sudden invoice of large invoice, invoice at abnormal time, etc. These malicious attacks are difficult to detect through the system itself or manually. To provide a secure service platform for the generalization of electronic invoice, this paper studies the attack detection technology of electronic invoice systems which is mainly based on machine learning to complete two aspects of research. The first is to propose a machine learning-based e-invoice anomaly detection method, which can accurately determine the anomalies occurring in the e-invoice systems. The second is to conduct deep fusion analysis on abnormal behaviors, mining potential threats in the electronic invoice systems, and designing and implementing the electronic invoice depth fusion analysis method based on k-means and Skip-gram. The experimental results indicate that the method we proposed can not only detect the malicious attacks effectively, and also capable of mining the potential threats in the electronic invoice systems. (C) 2020 Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20bb0bd6b000de0073241172a54ead5d",
  "timestamp": "2025-05-15T02:12:50.966365"
}