{
  "id": 3032,
  "title": "Personality traits and investor risk behavior: moderating role of financial literacy",
  "abstract": "PurposeThe study aims to examine the relationship between personality traits and investor risk behavior of the individuals trading in stock markets. Furthermore, this study establishes the association of financial literacy on the relationship between personality traits and investor risk behavior.Design/methodology/approachThe authors analyze cross-sectional survey method data by using moderated multiple regression analysis, a standard method of determining the moderation effect. PROCESS Model method has been used in this study to check the robustness of the results.FindingsThe findings reveal that personality traits significantly influence investor risk behavior and financial literacy modifies the fundamental relationships between personality traits and investor risk behavior. The findings also conclude that behavioral impact was predetermined by individuals' genetic traits and is influenced by financial literacy.Research limitations/implicationsThe current study provides valuable insights for investors and adamant grounds for future research. The two-fold role of individuals' personalities in case of gains and losses can be of interest to the researchers in future.Practical implicationsInvestors currently facing the complex financial choices which are far beyond the day-to-day financial advice. This study guides rational investment behavior for portfolio managers and investors for advanced investment options.Social implicationsMost of the prior literature is based on developed markets, whereas the current study focuses on less literate society (i.e. Pakistan) to protect the investors from scams and fraud. The current study supports the vital role of investors in the socio-economic development of emerging markets.Originality/valueThe authors believe this study expands the boundaries of personality theories, especially in the context of risk behavior and financial literacy. The study also contributes to advancing the personality theory trimmed with financial literacy and investor behavior while making important theoretical inroads for future research.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20be36409fd4f40cf8758fa78ad2b7d2",
  "timestamp": "2025-05-15T02:21:52.203449"
}