{
  "id": 5293,
  "title": "Effect of abnormal increase in credit supply on economic growth in Nigeria",
  "abstract": "PurposeThis paper investigates the effect of abnormal increase in credit supply on economic growth in Nigeria after controlling for the quality of the legal system, size of central bank asset, banking sector cost efficiency and bank insolvency risk.Design/methodology/approachThe authors employ the generalised method of moments (GMM) regression methodology to estimate the effect of abnormal increase in credit supply on two measures of economic growth in Nigeria.FindingsThe abnormal increase in credit supply has a significant effect on economic growth. Abnormal increase in credit supply increases real gross domestic product (GDP) growth. The abnormal increase in credit supply decreases real GDP per capita during the global financial crisis. The abnormal increase in domestic credit to the private sector has a significant positive effect on GDP per capita when there is strong legal system quality in Nigeria. In contrast, the abnormal increase in domestic credit to the private sector has a significant negative effect on real GDP growth when there is strong legal system quality in Nigeria.Practical implicationsThe abnormal increase in credit supply is ineffective in increasing GDP per capita during crisis years. Policymakers should be cautious in pressuring financial institutions to release an abnormally large amount of credit into the economy particularly during financial crises. Rather, policymakers should encourage financial institutions to supply credit in a sustained manner - not in an abnormal manner -and in a way that supports growth.Originality/valueThe present study contributes to the literature by analysing the effect of abnormal increase in credit supply on economic growth in a developing country context.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20c24e1ba14096c97415b8b1fc9d3b25",
  "timestamp": "2025-05-15T02:46:16.248923"
}