{
  "id": 7534,
  "title": "Weight Stigma Associated With Mental Health Concerns Among College Students",
  "abstract": "Introduction: Weight stigma is widespread and exists across numerous domains including health care, educational institutions, workplaces, mass media, and interpersonal relationships. Weight stigma experienced during the college years may be particularly consequential because the college years are a period of increased vulnerability for the development of mental health concerns. The purpose of the present study was to examine how experiences of weight stigma relate to mental health concerns, including symptoms of eating disorders, anxiety, and depression, among college students. Methods: Prevalence of interpersonal and anticipated weight stigma was examined among 2,707 students participating in the 2018-2019 and 2019-2020 Healthy Minds Study and tested for differences in prevalence across student characteristics. Logistic regression was used to explore relationships between measures of weight stigma and student mental health. Analyses were conducted in 2021-2023. Results: Interpersonal and anticipated weight stigma were reported by 12.3% and 15.3% of students, respectively. Experiences of interpersonal and anticipated weight stigma were generally lowest among cisgender male students, heterosexual students, those with the fewest financial concerns, and those who did not perceive themselves to be overweight. Both interpersonal and anticipated weight stigma were associated with elevated odds of high weight concerns, past -month binge eating, past -month purging, high eating disorder risk, moderate/severe anxiety symptoms, and moderate/ severe depressive symptoms. Conclusions: Findings implicate interpersonal and anticipated weight stigma as potential risk factors for a range of mental health concerns. Weight stigma is an under -recognized and under -funded public health problem.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20c48d89a936d672f94eee6068d05353",
  "timestamp": "2025-05-15T03:09:36.892617"
}