{
  "id": 6822,
  "title": "Impact of the great recession on self-perceived health in Spain: a longitudinal study with individual data",
  "abstract": "Objectives Our objective in this study is to evaluate the impact the Great Recession (2008-2014) had on selfperceived health in Spain. Design We use a longitudinal database (four waves of the Bank of Spain's Survey of Household Finances (2005, 2008, 2011 and 2014)) with repeated observations of the same individuals before and after the Great Recession. Interventions We consider the Great Recession in a natural experiment and we introduce it as an explanatory variable in a mixed logistic regression model in which we explain the probability of a subject declaring poor health (fair, bad and very bad). In the model we control for both observed and unobserved confounders at both individual and family level. Results We find an average downward trend in selfperceived health during the most severe period of the Great Recession (2009-2011). However, the fact that the adjusted measures are less volatile than the crude ones shows that variation in health status can be captured by either demographic or socioeconomic controls. In fact, there are significant differences in the impact the economic crisis had on health in terms of gender and age group. In particular, the (adjusted) risk of declaring poor health increases after the crisis began but only in those families in which the reference person is a woman younger than 45 years of age or a man aged 75 years or older. Conclusions Given our results, we discuss the link between financial wealth and self-rated health and how policy-makers could address the health inequalities that arise from adverse economic and financial shocks.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20c40c9157a33978e07ede7f929c07cf",
  "timestamp": "2025-05-15T03:02:07.436587"
}