{
  "id": 417,
  "title": "A K-Means Classification and Entropy Pooling Portfolio Strategy for Small and Large Capitalization Cryptocurrencies",
  "abstract": "In this study, we propose three portfolio strategies: allocation based on the normality assumption, the skewed-Student t distribution, and the entropy pooling (EP) method for 14 small- and large-capitalization (cap) cryptocurrencies. We categorize our portfolios into three groups: portfolio 1, consisting of three large-cap cryptocurrencies and four small-cap cryptocurrencies from various K-means classification clusters; and portfolios 2 and 3, consisting of seven small-cap and seven large-cap cryptocurrencies, respectively. Then, we investigate the performance of the proposed strategies on these portfolios by performing a backtest during a crypto market crash. Our backtesting covers April 2022 to October 2022, when many cryptocurrencies experienced significant losses. Our results indicate that the wealth progression under the normality assumption exceeds that of the other two strategies, though they all exhibit losses in terms of final wealth. In addition, we found that portfolio 3 is the best-performing portfolio in terms of wealth progression and performance measures, followed by portfolios 1 and 2, respectively. Hence, our results suggest that investors will benefit from investing in a portfolio consisting of large-cap cryptocurrencies. In other words, it may be safer to invest in large-cap cryptocurrencies than in small-cap cryptocurrencies. Moreover, our results indicate that adding large- and small-cap cryptocurrencies to a portfolio could improve the diversification benefit and risk-adjusted returns. Therefore, while cryptocurrencies may offer potentially high returns and diversification benefits in a portfolio, investors should be aware of the risks and carefully consider their investment objectives and risk tolerance before investing in them.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20d23ca22fd425be9d059481f79f1948",
  "timestamp": "2025-05-15T00:43:10.542083"
}