{
  "id": 7665,
  "title": "The value of utility payment history in predicting first-time homelessness",
  "abstract": "Homelessness is a costly and traumatic condition that affects hundreds of thousands of people each year in the U.S. alone. Most homeless programs focus on assisting people experiencing homelessness, but research has shown that predicting and preventing homelessness can be a more cost-effective solution. Of the few studies focused on predicting homelessness, most focus on people already seeking assistance; however, these methods necessarily cannot identify those not actively seeking assistance. Providing aid before conditions become dire may better prevent homelessness. Few methods exist to predict homelessness on the general population, and these methods use health and criminal history information, much of which may not be available or timely. We hypothesize that recent financial health information based on utility payment history is useful in predicting homelessness. In particular, we demonstrate the value of utility customer billing records to predict homelessness using logistic regression models based on this data. The performance of these models is comparable to other studies, suggesting such an approach could be productionalized due to the ubiquity and timeliness of this type of data. Our results suggest that utility billing records would have value for screening a broad section of the general population to identify those at risk of homelessness.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20d716506c2937c8e733f265b20b46c4",
  "timestamp": "2025-05-15T03:11:04.494589"
}