{
  "id": 7724,
  "title": "Compliance with prescriptions for wheelchairs, walking aids, orthotics, and pressure-relieving devices in patients with traumatic spinal cord injury",
  "abstract": "BACKGROUND: The use of adaptive equipment (AE) is the basic indication for patients with spinal cord injury (SCI). Inappropriate decisions concerning the use of AE imply treatment results, patient confidence. and patient and state costs. The present study is the first analysis of the causes of non-compliance conducted in Europe with the provision of AE in SCI patients using Wielandt and Strong's classification. AIM: The aim of this study is to analyze of the causes of non-compliance in the process of providing AE to SCI patients. DESIGN: Retrospective observational study. SETTING: STOCER Masovian Rehabilitation Centre, Konstancin-Jezioma, Poland. POPULATION: Seventy-two patients with traumatic SCI 10 months after the completion of the acute and post-acute phases of inpatient rehabilitation. METHODS: Wielandt and Strong's classification was used to determine the causes of non-compliance with AE provisions and the present authors' questionnaire with the World Health Organisation Quality of Life (WHOQOL-BREF) were used to identify the risk factors of noncompliance with AE provisions. RESULTS: Non-compliance with prescribed AE provisions was reported in 34 (49.3%) of 69 study participants. Non-compliance was due to medical-related factors in 44.1%, client-related factors in 20.6%, equipment-related factors in 11.8%, and unspecific factors in 17.8% of cases. Non-compliance with AE provisions correlated with complete neurological deficit, preserved ability to walk (in case of wheelchairs), the presence of bedsores (in cases of lower extremity devices), low financial status, and lost ability to walk (in cases of AE for standing and walking). The highest percentage of non-compliance was noted for the provision of knee-ankle-foot orthosis (50%). CONCLUSIONS: The most common causes of non-compliance with AE provisions include health status improvement in the patient and high cost of the device. CLINICAL REHABILITATION IMPACT: These results can be helpful for more effective treatment planning and the avoidance of unnecessary reimbursement costs covered by the state and users.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20e7dc7bb12b8fcc2a105ceb09a967ec",
  "timestamp": "2025-05-15T03:11:38.439639"
}