{
  "id": 2168,
  "title": "Comprehensive Decision Framework Combining Price Prediction and Production-Planning Models for Strategic Operation of a Petrochemical Industry",
  "abstract": "This paper presents a new decision-making framework for resource and production planning in the petrochemical industry under price uncertainty conditions. The framework consists of three main decision models: price prediction, paper trading, and production planning. Three different prediction models, system dynamics, multiple linear regression, and artificial neural network, were examined and compared for the precise forecasting of the price of the final products as well as naphtha as a raw material. We then developed a new optimization model using a mixed integer linear programming technique to establish the optimal operational strategies with a given inventory capacity. In the framework, the maximum profitability is ensured by solving a series of decision-making problems on the petrochemical plant, including timing and quantity of naphtha purchase and final product sales, inventory management, financial risk management with paper trading, and operation strategy of the involved processes. To illustrate the capability of the proposed model, the resource and production planning problem of a real petrochemical plant that produces six different major products, ethylene, propylene, butadiene, benzene, toluene, and xylene, was examined. As a result, the optimal production planning using the proposed model enabled the improvement of the total sales by 5.50% and the operating profit by 13.8% in comparison with the BAU case.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "20e8465a7e8d75e6f3353fff22fb51b2",
  "timestamp": "2025-05-15T02:12:17.348477"
}