{
  "id": 7732,
  "title": "Development and validation of the FRAGIRE tool for assessment an older person's risk for frailty",
  "abstract": "Background: Frailty is highly prevalent in elderly people. While significant progress has been made to understand its pathogenesis process, few validated questionnaire exist to assess the multidimensional concept of frailty and to detect people frail or at risk to become frail. The objectives of this study were to construct and validate a new frailty-screening instrument named Frailty Groupe Iso-Ressource Evaluation (FRAGIRE) that accurately predicts the risk for frailty in older adults. Methods: A prospective multicenter recruitment of the elderly patients was undertaken in France. The subjects were classified into financially-helped group (FH, with financial assistance) and non-financially helped group (NFH, without any financial assistance), considering FH subjects are more frail than the NFH group and thus representing an acceptable surrogate population for frailty. Psychometric properties of the FRAGIRE grid were assessed including discrimination between the FH and NFH groups. Items reduction was made according to statistical analyses and experts' point of view. The association between items response and tests with help requested status was assessed in univariate and multivariate unconditional logistic regression analyses and a prognostic score to become frail was finally proposed for each subject. Results: Between May 2013 and July 2013, 385 subjects were included: 338 (88%) in the FH group and 47 (12%) in the NFH group. The initial FRAGIRE grid included 65 items. After conducting the item selection, the final grid of the FRAGIRE was reduced to 19 items. The final grid showed fair discrimination ability to predict frailty (area under the curve (AUC) = 0.85) and good calibration (Hosmer-Lemeshow P-value = 0.580), reflecting a good agreement between the prediction by the final model and actual observation. The Cronbach's alpha for the developed tool scored as high as 0.69 (95% Confidence Interval: 0.64 to 0.74). The final prognostic score was excellent, with an AUC of 0.756. Moreover, it facilitated significant separation of patients into individuals requesting for help from others (P-value < 0.0001), with sensitivity of 81%, specificity of 61%, positive predictive value of 93%, negative predictive value of 34%, and a global predictive value of 78%. Conclusions: The FRAGIRE seems to have considerable potential as a reliable and effective tool for identifying frail elderly individuals by a public health social worker without medical training.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21045c2d83cc205741abfe7ab9047801",
  "timestamp": "2025-05-15T03:11:38.501976"
}