{
  "id": 6148,
  "title": "Agency conflicts, corporate governance, and capital structure decisions of Indian companies: evidence from new governance laws",
  "abstract": "PurposeThis study investigates the effects of elements of corporate governance along with firm specific variables on the financial leverage of listed Indian firms in the context of agency conflicts and new governance laws.Design/methodology/approachA series of panel ordinary least squares as well as fixed/random effects regression models of book and market value of financial leverage on variables of corporate governance (board size, board composition, board meeting, board attendance and board gender) along with a set of control variables (asset tangibility, firm size, growth, liquidity and profitability) were estimated by employing 113 listed Indian firms during 2010-2021. Dynamic panel generalized method of moments models were also estimated to check the robustness of empirical results. Further, the full sample of firms was divided into small and large board sized companies using the median approach to investigate differences between small and large board characteristics on financial leverage.FindingsThe evidence predominantly suggested that the governance variables have significant impact on leverage ratios of selected firms. Governance variables such as board size, composition, attendance and gender are significantly found to be reducing the financial leverage of firms indicating that in general these attributes in a way, through monitoring managers, put pressure on them to pursue lower financial leverage. Board meeting is found to be positive and significantly related with financial leverage suggesting that the frequency of meetings signals its monitoring ability that may influence lenders' risk assessment lowering borrowing cost. The results on small and large board sized companies indicate that firms with small boards relatively issue more debt compared to firms with large boards suggesting that small boards adopt high debt policy.Practical implicationsThe main policy implication of the study is that elements of internal corporate governance is a significant governance tool that has the potential to reduce agency conflict between the managers and agents through monitoring and decision making that has tangible effects on critical corporate decisions such as capital structure choices.Originality/valueThis paper contributes to the existing literature by bringing new evidence relating to agency conflicts and capital structure decisions in an emerging market like India post adoption of new regulations related to corporate governance specified in Clause 49 of Securities and Exchange Board of India and Companies Act, 2013 as there is significant dearth of such empirical work.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "210ad0cf04217a47312f8ddb70e7235d",
  "timestamp": "2025-05-15T02:55:12.945851"
}