{
  "id": 2992,
  "title": "EQUITY MARKETS RISKS AND RETURNS: IMPLICATIONS FOR GLOBAL PORTFOLIO CAPITAL FLOWS DURING PANDEMIC AND CRISIS PERIODS",
  "abstract": "The paper is devoted to the study of risk and return tradeoff in the global equity market as well as particular market groups: developed, emerging and frontier markets. Impact of this tradeoff on international equity portfolio liabilities is explored. The study confirms the hypothesis that there are some specific patterns of risk and return tradeoff during crisis periods and periods of markets regular regime that substantially differ from each other and define global portfolio equity flows and liabilities in a specific way. The paper thus carries out its main objective that implies revealing these patterns with respective qualitative features and quantitative markers, specifying their implications for equity portfolio flows to markets of different types. Risks and returns for different market groups and global market as a whole are calculated for the period between 2002 and 2020 using standard methodology of contemporary portfolio theory and MSCI indices monthly values. The data for international equity portfolio liabilities as well as the share of particular market group in the global market are used as dependent variables. The latter are regressed by calculated risks and returns. Using the model results and some analytical developments, two patterns of risk/return tradeoff are discovered. The pattern attributable to regular market regimes is characterized by positive returns which is 1.51 % in average for the global market, 1.48 % for developed markets and 2.03 % for emerging markets. Risks in regular pattern are relatively small or moderate at the average level of 3.05 for the global market and are all below the median (3.48). Respective risks for developed and emerging markets are 3.02 and 4.54. The Sharpe ratios in regular pattern are positive at the average level of 0.60 for the global market, 0.57 and 0.45 for developed and emerging market groups respectively. The crisis pattern implies negative returns at the mean of -1.04 for the global market, -0.97 for the developed group and -1.35 for the emerging markets. High risks are all above the median and in average compile 5.5 for the global market, 5.47 for the developed markets and 6.68 for the emerging group. Sharpe ratios for this pattern are negative being equal to -0.19 in the mean. The average value is -0.18 for developed markets and it is -0.24 for emerging markets. Specific pattern of 2020 crisis should be settled out. Its main feature that substantially distinguishes it from other crises is the combination of highest risk level and the positive returns at the same time. Elaborated regression model confirms the direct impact of return and indirect impact of risk on global portfolio liabilities. The influence of risk for regular and crisis patterns does not differ substantially while the impact of return is much stronger during periods of increased volatility (respective model parameters are 3793.76 and 447.24). However, the discovered impact is much more reliable in crisis pattern that is supported by much higher determination ratio. Developed markets experience similar effects.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2119e983d7a604dd5f7d4b21dc4891b2",
  "timestamp": "2025-05-15T01:12:42.978453"
}