{
  "id": 5630,
  "title": "Out-of-pocket payment and catastrophic health expenditure of tuberculosis patients in accessing care at public-private mix clinics in Myanmar, 2022",
  "abstract": "Background The financial burden of tuberculosis (TB) can hinder patients and their families, creating obstacles throughout the care cascade, despite TB prevention and control being provided free of charge. In Myanmar, patients can visit private providers operating under public-private mix (PPM) schemes, where TB services (diagnosis and treatment) are typically offered at no cost. The study focused on quantifying the financial burden faced by TB patients seeking care from Myanmar's PPM providers. Methods This cross-sectional telephone survey included 695 adults seeking TB treatment [drug-susceptible TB (DS-TB) and retreatment TB] from various private providers in four states and regions with high TB burden in Myanmar. Telephone interviews were conducted in May and June 2022. Both direct and indirect costs incurred from the patient and their household perspective were valued in 2022 and estimated throughout pre- and post-TB treatment episodes. The TB-affected households were defined as experiencing catastrophic health expenditure if their expenditure due to TB exceeded 20% of their capacity to pay, as recommended by the World Health Organization. All cost data were collected in Myanmar Kyats (MMK) and converted to USD (1 USD = 1850 MMK as of July 20, 2022). Logistic regression analysis was done to identify the determinants of catastrophic health expenditure. Results The findings showed patients made a median of 7 times for clinic visits throughout their treatment, with the median total cost for the entire TB treatment being 53.4 US dollars (USD), including direct medical and testing costs (11.9 USD) and direct non-medical patient expenditure (11.6 USD). Pre-treatment costs were higher compared to post-treatment costs (the intensive phase and continuation phase). During the intensive phase, TB care cost was nearly free, but during the continuation phase, it was a median of 2.6 USD. About 34.5% of patients experienced catastrophic health expenditure due to TB treatment, with expenses exceeding 20% of their capacity to pay. Multivariate regression analysis revealed that patients with a history of hospitalization (aOR = 14.84; P < 0.01), seeking care from regions other than Yangon (aOR = 2.6; P < 0.01), and using coping strategies (aOR = 12.53; P < 0.01), were more likely to face catastrophic financial burdens. Higher monthly household income (over 162 USD) was associated with a decreased risk of incurring catastrophic health expenditure (aOR = 0.38; P < 0.01). Conclusions TB patients and their households in Myanmar faced risk of catastrophic costs, even when treated in the private sector with free diagnostic charges and anti-TB medicine. The study highlighted the need for additional strategies or policies to make TB care affordable and mitigate the financial burden of TB-affected households.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2125b85c2274be265dd7a898afba12de",
  "timestamp": "2025-05-15T02:49:50.275800"
}