{
  "id": 3695,
  "title": "Disease-specific distress healthcare financing and catastrophic out-of-pocket expenditure for hospitalization in Bangladesh",
  "abstract": "Background Financial risk protection and equity are two fundamental components of the global commitment to achieve Universal Health Coverage (UHC), which mandates health system reform based on population needs, disease incidence, and economic burden to ensure that everyone has access to health services without any financial hardship. We estimated disease-specific incidences of catastrophic out-of-pocket health expenditure and distress financing to investigate progress toward UHC financial risk indicators and investigated inequalities in financial risk protection indicators by wealth quintiles. In addition, we explored the determinants of financial hardship indicators as a result of hospitalization costs. Methods In order to conduct this research, data were extracted from the latest Bangladesh Household Income and Expenditure Survey (HIES), conducted by the Bangladesh Bureau of Statistics in 2016-2017. Financial hardship indicators in UHC were measured by catastrophic health expenditure and distress financing (sale/mortgage, borrowing, and family support). Concentration curves (CC) and indices (CI) were estimated to measure the pattern and severity of inequalities across socio-economic classes. Binary logistic regression models were used to assess the determinants of catastrophic health expenditure and distress financing. Results We found that about 26% of households incurred catastrophic health expenditure (CHE) and 58% faced distress financing on hospitalization in Bangladesh. The highest incidence of CHE was for cancer (50%), followed by liver diseases (49.2%), and paralysis (43.6%). The financial hardship indicators in terms of CHE (CI = -0.109) and distress financing (CI = -0.087) were more concentrated among low-income households. Hospital admission to private health facilities, non-communicable diseases, and the presence of chronic patients in households significantly increases the likelihood of higher UHC financial hardship indicators. Conclusions The study findings strongly suggest the need for national-level social health security schemes with a particular focus on low-income households, since we identified greater inequalities between low- and high-income households in UHC financial hardship indicators. Regulating the private sector and implementing subsidized healthcare programmes for diseases with high treatment costs, such as cancer, heart disease, liver disease, and kidney disease are also expected to be effective to protect households from financial hardship. Finally, in order to reduce reliance on OOPE, the government should consider increasing its allocations to the health sector.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "212f48460e96fb1bcdcc1c1cf3960c10",
  "timestamp": "2025-05-15T02:29:00.181229"
}