{
  "id": 8351,
  "title": "The Incidence and Presentation Features of Glaucoma in Vogt-Koyanagi-Harada Syndrome",
  "abstract": "Topic: To determine the cumulative incidence and features of glaucoma in patients with Vogt-Koyanagi-Harada (VKH) syndrome compared with nonglaucoma patients. Clinical Relevance: Knowing the exact burden of secondary glaucoma in VKH could guide its screening and management in clinical practice as a part of the regular follow-up for patients with VKH. Methods: The review protocol was preregistered on Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PROSPERO) [CRD42023462794]. PubMed, Scopus, Web of Science, EBSCOhost, and Google Scholar were searched for studies reporting the cumulative incidence and features of glaucoma presentation in VKH. A manual search was also conducted to supplement the primary search. Subgroup analyses based on glaucoma type, VKH stage, and patients' age were conducted. All analyses were conducted using STATA. Fixed- and random-effects models were selected according to the observed heterogeneity. Studies' methodological quality was determined using the National Institutes of Health tool. Results: The analysis of 7084 eyes revealed a progressive increase in the cumulative incidence of secondary glaucoma overtime. The cumulative incidence was lowest at VKH onset (7%) and highest at 15 years (26%). Open- angle (12%; 95% confidence interval [CI]: 9%-14%) is more common than angle-closure glaucoma (7%; 95% CI: 3%-13%). Glaucoma cumulative incidence is highest in the chronic recurrent stage of VKH (33%; 95% CI: 12%59%) and among children <18 years of age (26%; 95% CI: 16%-37%). Features associated with glaucoma occurrence in VKH showed comparable rates with nonglaucoma cases. However, a meta-analysis to determine risk factors of glaucoma development in VKH was not feasible secondary to the lack of adjusted risk measures in included studies. Studies' quality was questionable in 5 studies. The certainty of evidence was moderate-to-high. Conclusion: The cumulative incidence of glaucoma increases throughout VKH's course, with a higher tendency in children, chronic recurrent stages, and long-term follow-up. Future research should focus on examining risk factors of glaucoma development in VKH through adjusted multivariable regression models. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Glaucoma 2024;7:587-601 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "213c5442270f5db2b863f0015b456e1a",
  "timestamp": "2025-05-15T03:17:49.192016"
}