{
  "id": 4376,
  "title": "Diabetic foot complications-lessons learned from real-world data derived from a specialized Austrian hospital",
  "abstract": "Background Diabetic foot complications, one of the most severe late complications of type 2 diabetes mellitus, are associated with a tremendous personal and financial burden. In order to drive the prevention of diabetic foot complications forward and facilitate early detection and personalized screening of high-risk patients, longitudinal studies are needed to identify risk factors associated with diabetic foot complications in large patient datasets. Methods This is a retrospective cohort study on 3002 patients with type 2 diabetes mellitus aged >= 18 years without prior foot complications. The data were collected between 2006 and 2017 in an Austrian hospital department specialized for diabetic patients. In addition to a univariate Cox regression analysis, multivariate Cox regression models were established to identify independent risk factors associated with diabetic foot complications and adjust for potential confounders. Results We observed a total of 61 diabetic foot complications in 3002 patients. In the multivariate Cox regression model, significant risk factors (hazard ratio, 95% confidence interval) for foot complications were age at diagnosis > 70 years (3.39, 1.33-8.67), male gender (2.55, 1.42-4.55), neuropathy (3.03, 1.74-5.27), peripheral arterial disease (3.04, 1.61-5.74), hypertension > 10 years after diagnosis (2.32, 1.09-4.93) and HbA1c > 9% (2.44, 1.02-5.83). Conclusion The identified risk factors for diabetic foot complications suggest that personalized early detection of patients at high risk might be possible by taking the patient's clinical characteristics, medical history and comorbidities into account. Modifiable risk factors, such as hypertension and high levels of blood glucose might be tackled to reduce the risk for diabetic foot complications.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "214719a85b3bf2f1c056cb793a88db0b",
  "timestamp": "2025-05-15T02:36:38.397954"
}