{
  "id": 3936,
  "title": "Market perception of firm strategy",
  "abstract": "Purpose - Research has shown that firms successfully pursuing either a cost leadership or a differentiation strategy are better able to gain competitive advantages over other firms and accordingly achieve superior performance. Thus, if firms actually do realize superior performance based on their strategic orientation, capital markets should recognize this and place a positive value on such strategy-focused firms. The aim of this paper is to empirically investigate how capital markets perceive and reward the strategies pursued by firms. Design/methodology/approach - The paper uses Tobin's Q as a measure of market perception. By regressing Tobin's Q against relevant control variables and proxies for differentiation and cost leadership strategies, the paper evaluates the relationship between market perception and firm strategy. Furthermore, the paper also conducts abnormal returns analyses (both portfolio and regression analysis) to determine whether the market accurately prices the different strategies, given the complexity in both the nature and the implementation of such strategies. Findings - The analysis shows that markets place a positive value on firms successfully pursuing either a cost leadership or a differentiation strategy; moreover markets place a higher value on firms pursuing a differentiation strategy compared to a cost leadership strategy. The abnormal returns analyses show that the market is not able to fully price the superior performance generated by pursuing differentiation strategy resulting in abnormal returns from portfolios formed based on higher levels of differentiation. Research limitations/implications - By providing detailed information to the market about the strategies they follow, firms will enable markets to value their strategies accurately, thus reducing their cost of capital. Fundamental investors looking to earn abnormal returns can use firm strategy in their portfolio selection. A variety of characteristics are conceived to influence a firm's strategic positioning and market perception of such characteristics. This evaluation is limited to a macro level assessment of the implications of the overall strategy pursued by a firm. Future research, in the form of detailed field studies, could be directed at evaluating the market perceptions and other implications of multi-dimensional, lower level, operational strategies on a firm-by-firm basis. Originality/value - To the best of the authors' knowledge, this is the first paper to show how financial markets value firm strategy. The paper also provides evidence to the complexity of a differentiation strategy, and how such complexity can lead to market mis-pricing.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "215e95672eb0e32772f40eb9a56de091",
  "timestamp": "2025-05-15T01:22:11.985899"
}