{
  "id": 7081,
  "title": "What drives the performance of different bank-ownership types in Indonesia? The pre- and post-GFC analysis",
  "abstract": "Purpose The Indonesian banks play crucial roles in the economy, especially because of less developed bond and stock markets. It has undergone drastic changes in bank-ownership composition over time. This paper aims to analyze the impact of bank-specific characteristics on the performance of different bank-ownership types in Indonesia to determine whether their profitability drivers differ. Design/methodology/approach Fixed-effect panel data regression is applied to 1,649 bank-year observations (97 banks throughout 2003-2019). It encompasses the pre- and post-global financial crisis (GFC) period. Findings The findings show that age, liquidity, equity and credit risk are significant determinants of bank performance. The significance of these effects differs for each bank-ownership type and show changes between the pre-GFC and post-GFC periods. Research limitations/implications Notwithstanding the merit of this paper, the results are not without limitations. This paper only focuses on one country. Furthermore, the prominence of banks relative to bond and stock markets with consideration of the GDP of countries may result in different findings Practical implications These findings provide the owners and managers of banks with information that can be applied to compare and assess own bank drivers and performance to enhance their own efficiency. The findings also inform bank authorities and regulators about differences in performance drivers that could be considered in changes to policies aimed at improving the performance of different bank-ownership types. Originality/value This paper is a pioneer study that focuses on the drivers of bank performance for different ownership types during the pre- and post-GFC periods in a country where the financial market is overall small and bank credits dominate capital supply.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21735ef74f9661e93e1c94e429610c72",
  "timestamp": "2025-05-15T03:05:03.420864"
}