{
  "id": 8897,
  "title": "Gender differences in associations of neighbourhood disadvantage with alcohol's harms to others: A cross-sectional study from the USA",
  "abstract": "Introduction and Aims To examine whether alcohol's harms to others are more prevalent in socioeconomically disadvantaged neighbourhoods and whether men or women are at differential risk in these neighbourhoods. Design and Methods Cross-sectional survey data from 2000 and 2005 National Alcohol Surveys were linked to geo-referenced indicators of neighbourhood disadvantage from the US 2000 Decennial Census. The pooled sample included 10 121 adults (54% female; average age 44.4 years; 69% White; 13% African-American; 13% Hispanic). A dichotomous indicator denoted neighbourhoods based on the top quartile on a five-item measure of disadvantage (alpha = 0.90). We examined past-year family problems due to someone else's drinking (marriage difficulties and/or financial trouble) and victimisation by someone who had been drinking (having property vandalised and/or being pushed, hit or assaulted). Results During the prior 12 months, 6% of women and 3% of men experienced family problems from someone else's drinking, and 4% of women and 7% of men reported being victimised by drinkers. Multivariate logistic regression models adjusting for individual-level socioeconomic status and other demographic characteristics showed the relationship between neighbourhood disadvantage and harms from someone else's drinking was moderated by gender, with significantly higher odds of family problems in disadvantaged neighbourhoods for men but not for women, as well as significantly higher odds of crime victimisation in disadvantaged neighbourhoods for women but not men. Discussion and Conclusions Experiences of harms from someone else's drinking in disadvantaged neighbourhoods vary for men and women. Targeted intervention strategies are needed to reduce alcohol's harm to others. [Karriker-Jaffe KJ, Greenfield TK. Gender differences in associations of neighbourhood disadvantage with alcohol's harms to others: A cross-sectional study from the USA. Drug Alcohol Rev 2014;33:296-303]",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21740c79acd7afe289d24b02289c061b",
  "timestamp": "2025-05-15T03:23:27.861150"
}