{
  "id": 1437,
  "title": "Exploiting the Black-Litterman framework through error-correction neural networks",
  "abstract": "The Black-Litterman (BL) model is a particularly essential analytical tool for effective portfolio management in financial services sector since it enables investment analysts to integrate investor views into market equilibrium returns. In this research, we define and study the continuous-time BL portfolio optimization (CTBLPO) problem as a time-varying quadratic programming (TVQP) problem. The investor's views in the CTBLPO problem are regarded as a forecasting problem, and they are generated by a novel neural network (NN) model. More precisely, employing a novel multi-function activated by a weights and-structure-determination for time-series (MAWTS) algorithm, a 3-layer feed-forward NN model, called MAWTSNN, is proposed for handling time-series modeling and forecasting problems. Then, using real-world datasets, the CTBLPO problem is approached by two different TVQP NN solvers. These solvers are the zeroing NN (ZNN) and the linear-variational-inequality primal-dual NN (LVI-PDNN). The experiment findings illustrate and compare the performances of the ZNN and LVI-PDNN in three various portfolio configurations, as well as indicating that the MAWTSNN is an excellent alternative to the traditional approaches. To promote and contend the outcomes of this research, we created two MATLAB repositories for the interested user, that are publicly accessible on GitHub.(c) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2181182b40c0bed25b2a567e65f14e1b",
  "timestamp": "2025-05-15T00:55:28.596526"
}