{
  "id": 9079,
  "title": "Enrollment of reproductive age women in community-based health insurance: An evidence from 2019 Mini Ethiopian Demographic and Health Survey",
  "abstract": "BackgroundUniversal health coverage (UHC) is aimed at ensuring that everyone has access to high-quality healthcare without the risk of financial ruin. Community-based health insurance (CBHI) is one of the essential means to achieve the sustainable development goals (SDGs) global health priority of UHC. Thus, this study assessed health insurance enrollment and associated factors among reproductive age women in Ethiopia. MethodsWe computed the health insurance enrollment of reproductive-age women using secondary data from the recent Ethiopian Mini Demographic and Health Surveys (EMDHS) 2019. The EMDHS was a community-based cross-sectional study carried out in Ethiopia from March 21 to June 28, 2019. Cluster sampling with two stages was employed for the survey. The study comprised 8885 (weighted) reproductive-age women. STATA 14 was used for data processing and analysis. Bivariate and multivariable logistic regression analyses were conducted. Adjusted odds ratio (AOR) with 95% confidence interval (CI) was reported and statistical significance was set at a value of p < 0.05. ResultsOf the 8,885 study participants, 3,835 (43.2, 95% CI; 42.1, 44.2%) of women had health insurance. Women aged 20-24 years, 25-29 years, and 30-34 years less likely to enroll in health insurance compared to their younger counterparts (15-19 years). Women living in rural areas, had greater than five family sizes, living with a female household head, and having more than five living children were negatively associated with enrollment in health insurance. Besides, health insurance enrollment among reproductive-age women is significantly affected by region and religious variation. ConclusionThe overall CBHI enrolment among reproductive-age women in Ethiopia was low. To achieve the SDGs of reducing maternal mortality ratio and neonatal mortality, improving reproductive-age women's access to health insurance is essential. The national, regional, and local officals, policymakers, NGOs, program planners, and other supporting organizations working on improving health insurance enrollment of reproductive age women need to create awareness and support them based on these significant factors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2189ea32c794537de1079e5f4ff63adb",
  "timestamp": "2025-05-15T03:25:27.678845"
}