{
  "id": 3666,
  "title": "Co-movement of prices between biofuel co-products in Canada: ethanol, electricity, and pellets",
  "abstract": "The potential emergence of a second-generation ethanol industry in Canada will depend on future production technologies and prices. Financial viability might be improved by producing cellulosic ethanol with co-products such as lignin pellets or electricity. Financial returns to ethanol production will depend on price variability and possible price spillovers among ethanol and its co-products. We use a multivariate BEKK-GARCH approach to investigate past mean price interactions and volatility spillovers between ethanol and electricity prices. Wood pellets are investigated in a univariate framework because of data constraints. Results show substantial price interactions and volatility spillovers among these products. If a second-generation ethanol industry emerges, co-production of products from common feedstocks may strengthen already established relationships between the prices of these energy products. These conditions could create increased risk and the clustering of high-low price fluctuations among co-products. For investors, results suggest that risk reduction strategies should protect against correlated volatility. For policy makers, results suggest that policies that target one commodity may lead to unintended impacts on co-product(s). In sum, understanding links between markets is important for designing future policies and for insights into how a second-generation ethanol industry may emerge.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2195f6a362123cc5303fdd9b5eabd83d",
  "timestamp": "2025-05-15T02:29:00.016241"
}