{
  "id": 6137,
  "title": "Impact of the HITECH financial incentives on EHR adoption in small, physician-owned practices",
  "abstract": "Background: Physicians in small physician-owned practices in the United States have been slower to adopt EHRs than physicians in large practices or practices owned by large organizations. The Health Information Technology for Economic and Clinical Health (HITECH) Act of 2009 included provisions intended to address many of the potential barriers to EHR adoption cited in the literature, including a financial incentives program that has paid physicians and other professionals $13 billion through December 2015. Objective: Given the range of factors that may be influencing physicians' decisions on whether to adopt an EHR, and given the level of HITECH expenditures to date, there is significant policy value in assessing whether the HITECH incentives have actually had an impact on EHR adoption decisions among U.S. physicians in small, physician-owned practices. This study addresses this question by analyzing physicians' own views on the influence of the HITECH incentives as well as other potential considerations in their decision-making on whether to adopt an EHR. Methods: Using data from a national survey of physicians, five composite scales were created from groups of survey items to reflect physician views on different potential facilitators and barriers for EHR adoption as of 2011, after the launch of the HITECH incentives program. Multinomial and binary logistic regression models were specified to test which of these physician-reported considerations have a significant relationship with EHR adoption status among 1043 physicians working in physician-owned practices with no more than 10 physicians. Results: Physicians' views on the importance of the HITECH financial incentives are strongly associated with EHR adoption during the first three years of the HITECH period (2010-2012). In the study's primary model, a one-point increase on a three-point scale for physician-reported influence of the HITECH financial incentives increases the relative risk of being in the process of adoption in 2011, compared to the risk of remaining a non-adopter, by a factor of 4.02 (p < 0.001, 95% CI of 2.06-7.85). In a second model which excludes pre-HITECH adopters from the data, a one-point increase on the incentives scale increases the relative risk of having become a new EHR user in 2010 or 2011, compared to the risk of remaining a non adopter, by a factor of 3.98 (p < 0.01, 95% CI of 1.48-10.68) and also increases the relative risk of being in the process of adoption in 2011 by a factor of 5.73 (p < 0.001, 95% CI of 2.57-12.76), compared to the risk of remaining a non-adopter in 2011. In contrast, a composite scale that reflects whether physicians viewed choosing a specific EHR vendor as challenging is not associated with adoption status. Conclusions: This study's principal finding is that the HITECH financial incentives were influential in accelerating EHR adoption among small, physician-owned practices in the United States. A second finding is that physician decision-making on EHR adoption in the United States has not matched what would be predicted by the literature on network effects. The market's failure to converge on a dominant design in the absence of interoperability means it will be difficult to achieve widespread exchange of patients' clinical information among different health care provider organizations. (C) 2016 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21a6ddfc848bc6807a2345972be759dd",
  "timestamp": "2025-05-15T02:55:12.895639"
}