{
  "id": 3618,
  "title": "The nonlinear and negative tail dependence and risk spillovers between foreign exchange and stock markets in emerging economies",
  "abstract": "Using half-rotated technology of copula, this study proposes a generalized autoregressive conditional heteroskedasticity (GARCH) copula quantile regression (CQR) model to describe the asymmetric negative and nonlinear tail dependence between foreign exchange rates (FX) and stock markets. Based on daily data ranging from January 2003 to December 2021 for ten economies, including Brazil, Chile, Hungary, India, Mexico, Philippines, Poland, Russia, South Africa, and Thailand, we explore the risk spillovers from the FX to the stock markets. The empirical results suggest that upside and downside tail dependence structures between FX and stock markets can be best described by the 90- and 270-degree rotated Gumbel copula, then upside and downside risk spillovers can be estimated by the corresponding GARCH CQR model. Second, the Brazilian and the Russian markets display the largest upside and downside risk spillovers, respectively. Third, there is an asymmetric behavior in the spillover from FX to the stock markets, with the downside risk spillovers being greater than the upside spillovers, consistent with the phenomenon of flight-to-quality. Our results provide important implications for portfolio managers and international supervisory authorities.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21cc0e0ee5e7771ad0a05805d7e8dc67",
  "timestamp": "2025-05-15T01:19:00.709135"
}