{
  "id": 7151,
  "title": "Patient Characteristics and the Occurrence of Never Events",
  "abstract": "Objective: To determine whether the occurrence of never events after major surgical procedures is affected by patient and disease characteristics and by the type of operation performed. Design: Epidemiological analysis. Interventions: Derivation and assessment of predictive equations for postoperative infectious events and decubitus ulcers using Healthcare Cost and Utilization Project Nationwide Inpatient Sample administrative claims data for patients hospitalized between 2002 and 2005. Main Outcome Measures: C statistics for each predictive equation with and without hospital dummy variables. Results: Predictive equations for 6 of 8 complications had C statistics greater than 0.65 without hospital variables, while 2 had C statistics of less than 0.55. All equations had C statistics greater than 0.75 when hospital dummy variables were included. Conclusions: Patient characteristics and type of operative procedure are important predictors of complications of surgical care evaluated in this study, undermining the rationale for their current classification as never events. Variations in risk-adjusted complication rates among hospitals support the influence of quality of care on their occurrence. Development and use of warranties to cover costs associated with caring for the unavoidable components of potentially avoidable complications is proposed as a means of rewarding high-quality providers without creating unrealistic expectations or perverse financial incentives.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21e26728688de242cf91a429bf2423d1",
  "timestamp": "2025-05-15T03:05:32.089861"
}