{
  "id": 9189,
  "title": "Acute lymphoid and myeloid leukemia in a Brazilian Amazon population: Epidemiology and predictors of comorbidity and deaths",
  "abstract": "Introduction Leukemia is the most common cancer in children and has the highest rates of incidence in industrialized countries, followed by developing countries. This epidemiologic profile can mainly be attributed to the availability of diagnostic resources. In Brazil, leukemia diagnosis is a challenge due to financial viability, lack of hemovigilance services in isolated regions and the vast size of the territory. Its incidence in the state of Amazonas has been increasing since 2010. Therefore, this study aims to describe the epidemiological pattern and spatial distribution of patients with acute lymphoid leukemia and acute myeloid leukemia in Amazonas and identify the predictors of comorbidity and death. Materials and methods A retrospective cross-sectional study was carried out based on patients' data which was obtained from the database of a referral center for the period of 2005 to 2015. Variables included age, gender, ethnicity, civil status, schooling, income, location of residence, subtype of leukemia, comorbidities, and date of death. The spatial distribution was performed using QGIS v.2.18. Stata software was used for univariable and multivariable logistic regression to evaluate the association between both comorbidities and death for all characteristic groups of ALL and AML. Results The group that was studied was composed of 577 ALL and 266 AML patients. For both, most patients were male, with a schooling period of 1-4 years, received<1 minimum wage, and lived mostly in Manaus, followed by the municipality of Tefe. There was no association between the development of comorbidities and analyzed variables in patients with ALL. AML patients that were >60 years old and with family history of the disease had the highest risk of developing comorbidities (OR = 5.06, p = 0.038; OR = 2.44, p = 0.041, respectively). Furthermore, patients with ALL and in the 41-50-year age group had a higher risk of death (OR = 31.12; p = 0.001). No association between death and explanatory variables were found in patients with AML. In addition, significant difference was observed in time to death (chi2 = 4,098.32, p = 0.000), with 50% of patients with AML dying within two years after diagnosis, whereas in ALL, this percentual of death only is reached in approximately 5 years. Conclusion Our study describes the data of patients with acute leukemia in Amazonas, a remote region in the north of Brazil. In addition, it highlights the importance of hemovigilance in an Amazon region state, while focusing on peripheral areas which don't have prevention, diagnosis and treatment tools for this disease.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21e7880aae3885f8d2dd6f244bd6bfbd",
  "timestamp": "2025-05-15T03:26:25.986988"
}