{
  "id": 3933,
  "title": "BUSINESS ENTERPRISES AND GENERATORS OF THEIR VALUE",
  "abstract": "Businesses are the driving force of economies in today's globalized world, especially in developing countries. These companies associate buyers with sellers, but do not participate directly in the ownership or storage of goods, they make revenues through commissions. Globally, the goal of any business is to increase the value of an enterprise. To determine the value of the business, traditional financial analysis proved to be inadequate. The need for application and use of new indicators that more accurately measure the efficiency of both the processes and the elements that generate the value caused great interest in the so-called value generators. Value generators refer to activities and capabilities that increase profitability, reduce risk, and promote growth in the company. This paper aims to identify generators of the value of an average business enterprise in the Czech Republic. The assumption is that we measure the value of an enterprise using the EVA equity indicator. The data set contains the complete financial statements of the Czech companies for the year 2016. EVA equity is calculated for each enterprise. For statistical analysis, the software Statistica and artificial neural networks are used. A total number of 1,000 neural networks are generated, five of them showing the best characteristics, are preserved. The result is the neural network that predicts EVA equity based on input data from which we are able to derive the probable EVA equity value. The most important variables are identified which most influence the value of the average business enterprise in the Czech Republic.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "21fff0957382578e2de0225cca30b76a",
  "timestamp": "2025-05-15T02:31:28.389712"
}