{
  "id": 2672,
  "title": "Bank efficiency and failure prediction: a nonparametric and dynamic model based on data envelopment analysis",
  "abstract": "For decades, the prediction of bank failure has been a popular topic in credit risk and banking studies. Statistical and machine learning methods have been working well in predicting the probability of bankruptcy for different time horizons prior to the failure. In recent years, bank efficiency has attracted much interest from academic circles, where low productivity or efficiency in banks has been regarded as a potential reason for failure. It is generally believed that low efficiency implies low-quality management of the organisation, which may lead to bad performance in the competitive financial markets. Previous papers linking efficiency measures calculated by Data Envelopment Analysis (DEA) to bank failure prediction have been limited to cross sectional analyses. A dynamic analysis with the updated samples is therefore recommended for bankruptcy prediction. This paper proposes a nonparametric method, Malmquist DEA with Worst Practice Frontier, to dynamically assess the bankruptcy risk of banks over multiple periods. A total sample of 4426 US banks over a period of 15 years (2002-2016), covering the subprime financial crisis, is used to empirically test the model. A static model is used as the benchmark, and we introduce more extensions for comparisons of predictive performance. Results of the comparisons and robustness tests show that Malmquist DEA is a useful tool not only for estimating productivity growth but also to give early warnings of the potential collapse of banks. The extended DEA models with various reference sets and orientations also show strong predictive power.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "220520009442e0e11656a4fb83ce1f2a",
  "timestamp": "2025-05-15T02:18:06.139805"
}