{
  "id": 8541,
  "title": "Quantile analysis of Bitcoin returns: uncovering market dynamics",
  "abstract": "PurposeThis study delves into Bitcoin's return dynamics to address its pronounced volatility, particularly in extreme market conditions. We analyze a broad range of explanatory variables, including traditional financial indicators, innovative cryptocurrency-specific metrics and market sentiment gauges. We uniquely introduce the Conference Board Leading Economic Indicator (LEI) to the cryptocurrency research landscape.Design/methodology/approachWe employ quantile regression to examine Bitcoin's daily and monthly returns. This approach captures timescale dependencies and evaluates the consistency of our findings across different market conditions. By conducting a thorough analysis of the entire return distribution, we aim to reveal how various factors influence Bitcoin's behavior at different risk levels. The research incorporates a comprehensive set of explanatory variables to provide a holistic view of Bitcoin's market dynamics. Additionally, by segmenting the study period, we assess the consistency of the results across diverse market regimes.FindingsOur results reveal that factors driving Bitcoin returns vary significantly across market conditions. For instance, during downturns, an increase in transaction volume is linked to lower Bitcoin returns, potentially indicating panic selling. When the market stabilizes, a positive correlation emerges, suggesting healthier ecosystem activity. Active addresses emerge as a key predictor of returns, especially during bearish phases, and sentiment indicators such as Wikipedia views reveal shifting investor optimism, depending on market trends. Monthly return analysis suggests Bitcoin might act as a hedge against traditional markets due to its negative correlation with the S&P 500 during normal conditions.Practical implicationsThe study's findings have significant implications for investors and policymakers. Understanding how different factors influence Bitcoin returns in varying market conditions can guide investment strategies and regulatory approaches.Originality/valueA novel contribution of this study is the identification of Bitcoin's sensitivity to broader economic downturns as demonstrated by the negative correlation between LEI and returns. These insights not only deepen our understanding of Bitcoin market behaviour but also offer practical implications for investors, risk managers and policymakers navigating the evolving cryptocurrency landscape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2206533495423b0efea69f333e06013e",
  "timestamp": "2025-05-15T03:19:52.140506"
}