{
  "id": 655,
  "title": "Application of Machine Learning Algorithms for Prediction of Unemployment Duration",
  "abstract": "Research background: Unemployment affects individuals' financial stability and well-being while also posing challenges to social cohesion, economic growth, and overall societal development. Therefore, using machine learning models for predicting every jobseeker's unemployment duration has great potential, mainly in identifying individuals threatened by long-term unemployment. Purpose of the article: This paper presents two machine learning models for predicting the duration of unemployment with high accuracy and precision, where the focus is not only on the predictions themselves but also on identifying important factors that influence the duration of unemployment of the jobseekers. Methods: In the paper, we used real data on registrations of citizens in Slovakia in the database of jobseekers. We used jobseekers' characteristics and variables describing their previous unemployment history as the input variables. Two machine learning algorithms, classification and regression tree (CART) and neural networks (NN), are employed for prediction modelling. Findings & Value added: The developed models exhibit strong performance in predicting unemployment duration. Both models have an accuracy of over 77% and, furthermore, excel in identifying the most problematic group of jobseekers with potential unemployment durations exceeding 12 months, with a prediction accuracy of almost 92%. The study also highlights the key predictors of unemployment duration. This information allows for the identification of high-risk jobseekers threatened by long-term unemployment and can assist policymakers, job placement agencies, and individuals in making informed decisions and implementing targeted interventions to mitigate the risk of long-term unemployment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "220a3fe9a0baea28ba22412dc9843e99",
  "timestamp": "2025-05-15T01:53:24.972960"
}