{
  "id": 3698,
  "title": "Assessment framework for automotive suppliers' technological adaptability in the electric vehicle era",
  "abstract": "As car original equipment manufacturers (OEMs) announce the electrification of their product line-ups, assessing the technological adaptability of their suppliers in the electric vehicle (EV) era is necessary. The technological adaptability of a supplier can vary significantly in terms of accumulated technologies. Herein, we propose a framework to assess adaptability from two aspects-EV-related and pivoting-based on patent portfolio analysis. First, adaptability to EV-related technologies is evaluated in terms of a supplier's patents applied individually and copatents with OEMs for parts to be modified. The degree of similarity of the patents related to internal combustion engine vehicle (ICEV) components with the patents related to EVs is calculated using PatentSBERTa, which reflects the modification degree required for ICEV components to be suitable for EVs. Second, we utilize automotive industry-related and unrelated diversity based on the entropy of International Patent Classification (IPC) codes to measure the supplier's technological adaptability to pivot within the automotive industry or other industries. The framework is empirically applied to suppliers in the drivetrain and climate control sectors to assess their technological adaptability to supply EV parts associated with the parts they are delivering. Our framework is expected to provide transition strategies for automotive suppliers in the EV era.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22115736c64ac118d6583c0c9e4f5994",
  "timestamp": "2025-05-15T01:20:03.379157"
}