{
  "id": 7239,
  "title": "Urban Environmental Threat Moderates the Relationship Between Depression and Insulin Resistance Among Latinxs With Type 2 Diabetes",
  "abstract": "As the largest minoritised ethnic group in the United States, Latinxs face a greater risk for type 2 diabetes and depression. The aim of the present study was to explore whether the relationship between depressive symptoms and insulin resistance among Latinxs with type 2 diabetes was moderated by toxic stressors arising from urban environmental threat (i.e., uncomfortable or unsafe aspects of city life). A community sample of Latinx adults with type 2 diabetes (n = 121) was recruited from Hartford, Connecticut. Participants self-reported depressive symptoms and exposure to urban environmental threat using items from the Patient Health Questionnaire and Urban Hassles Index, respectively. Insulin and glucose levels assessed via fasting blood draw were used to calculate insulin resistance using the HOMA-IR formula. After controlling for demographic, financial and health-related factors, results from a regression analysis revealed a significant interaction between depressive symptoms and urban environmental threat; more severe symptoms of depression predicted greater insulin resistance, but only amongst those with frequent exposure to urban environmental threats. Findings from the current study suggest that improving urban living conditions may offer an alternate avenue for attenuating the deleterious impacts of depression on type 2 diabetes progression in Latinxs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2217d68815875d3856a2b7a59ce03c8a",
  "timestamp": "2025-05-15T03:06:35.394820"
}