{
  "id": 6783,
  "title": "Does CEO power affect the risk profile of acquiring insurance company?",
  "abstract": "Purpose-This study aims to examine, on the one hand, the effect of mergers and acquisitions (M&A) on the evolution of the risk profile of insurance companies and, on the other hand, determine the impact of chief executive officer (CEO) power as well as its determinants on the evolution of the risk profile of the acquiring insurance company. Design/methodology/approach-The analysis is based on 131 transactions between 2010 and 2022 involving European Union-based acquirers. To assess the impact of M&A on the acquiring insurance company's risk profile (RP), the authors compare changes in the acquirer's RP to control insurance companies. This study uses linear regression with two-stage least squares instrumental variables to examine the effect of CEO power on changes in merger-related risk. Findings-The results indicate that M&A significantly increase the RP of the acquiring insurance company. Furthermore, CEO power, as measured by its four proxies (structural, ownership, experience and prestige), is positively correlated with an increase in the RP of the acquiring insurance company. These findings suggest that powerful CEOs tend to take on more risk during M&A transactions in the insurance sector. Practical implications-The study's findings can inform managerial decision-making around mergers and executive incentives. Regulators can use the insights to develop early warning systems and policies to promote financial stability. Insurance firms can enhance their own risk management by assessing the potential M&A impact and designing robust risk governance frameworks. Investors can better evaluate the risk implications of M&A and CEO influence when assessing insurance companies. Originality/value-To the best of the author's knowledge, this study is the first empirical investigation to introduce diverse executive power metrics to analyze the link between executive power and risk-taking in the European insurance sector, with a specific emphasis on the impact on M&A as critical investment choices.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "221cb90ec120d87c1057707ca303208f",
  "timestamp": "2025-05-15T03:01:31.414507"
}