{
  "id": 2044,
  "title": "SME supply chain portfolios: firm satisfaction and organization resources",
  "abstract": "Purpose - The purpose of this research is to investigate the combination of relational and organizational resource factors that influence small-to-medium-sized firm satisfaction with their supply chain portfolio performance. Design/methodology/approach - This research employs two complementary theoretical lenses frequently used in the explanation of relationship performance, resource-based view of the firm and strategic behavior theory. The authors then used an international survey based in three Northern European countries to test their hypotheses with hierarchical linear regression. Findings - The quantitative analysis supports all three hypotheses indicating that supply chain portfolio flexibility is an important determinant for small-to-medium-sized firm satisfaction with supply chain portfolio performance. Additionally, firm alliance orientation and entrepreneurial orientation both significantly influence the relationship between supply chain flexibility and performance satisfaction. Research limitations/implications - This research is limited by the categorization of the supply chain portfolio flexibility types as high and low resource linkages by the researchers. Future research may look at additional ways to measure individual agreements and have firms categorize them according to resource requirements. However, the findings of this research provide a theoretical and empirical foundation through the application of resource-based view of the firm and strategic behavior theory for future research in the area of small-to-medium-sized firms and their satisfaction with supply chain portfolios. Practical implications - Important managerial implications are found for small to medium-sized firms and larger firms that work with them when managing portfolio satisfaction. This research indicates that it makes sense for managers to consider categorizing supply chain relationships similar to the way they categorize their end-user relationships. This allows small-to-medium-sized firms across the portfolio to be segmented into groups where appropriate relationship maintenance can take place and where more suitable satisfaction goals can be defined in terms of operational metrics. Originality/value - The framework developed in this paper provides insights on small-to-medium-sized firm satisfaction with supply chain portfolio performance. This research stimulates a new research stream towards an integrated theory of supply chain portfolio management.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "221ca134f47bd2f255fe727661c87ec1",
  "timestamp": "2025-05-15T01:02:32.794780"
}