{
  "id": 1317,
  "title": "PREDICTING STATUS OF CHINESE LISTED COMPANIES BASED ON FEATURES SELECTED BY PENALIZED REGRESSION",
  "abstract": "China's companies have attracted much attention due to the development of stock market in China. The listing status of listed Chinese companies becomes an important indicator which implies the potential risk of a stock. Thus predicting the status of listed Chinese companies is obviously crucial for stockholders and investors when they make further decisions. According to the four possible listing statuses for Chinese companies, researchers formulate the above issue as a classification problem which is typical in data mining area. Plenty of classification techniques have been implemented to predict the status of the listing Chinese companies based on their financial factors. Usually, there are more than 150 financial factors for each of the listed companies, and feature selection is needed before the implementation of classification methods. In the literature, researcher used t-test with variance inflation factor (VIF) analysis to select relevant factors. However, such method can not be applied in the high dimensional case. In this paper, we apply the idea of penalized regression to select the interested factors based on a logistic regression model, and then apply popular classification methods to predict the companies' statuses. Our results show that the proposed method can find more representative factors and improves the prediction accuracy of the classification methods.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "222a637f20315f66bff879b0ec67e8c8",
  "timestamp": "2025-05-15T02:01:44.679700"
}