{
  "id": 7385,
  "title": "Higher Hospitalization Costs and Fewer Routine Discharges in the Medicaid Expansion Era for Lung Transplant Recipients",
  "abstract": "Background In January 2014, states expanded Medicaid access under the Affordable Care Act. We studied the financial implications of this policy on lung transplantation, a costly procedure. Methods Lung transplant (LT) hospitalizations were identified within the National Inpatient Sample (2005-2020). Recipients were categorized as pre-expansion (1/2005-12/2013) versus post-expansion (1/2014-12/2020) of Medicaid and as being in expander versus non-expander regions. We calculated difference-in-differences estimates comparing pre- and post-expansion eras in expander versus non-expander regions for inflation-adjusted hospitalization costs and for discharge disposition. We evaluated total hospitalization costs using multivariable generalized linear regression, adjusting for recipient demographics, Charlson Comorbidity Index, single versus double-lung transplant, and extracorporeal membrane oxygenation (ECMO), ex-vivo lung perfusion (EVLP), and mechanical ventilation usage. Results Of the 29 225 LT recipients identified, 14 085 were pre-expansion and 15 140 were post-expansion. More recipients were insured by Medicaid in expander n = 735 (9%) versus non-expander n = 220, (3%) regions (p = 0.01) post-expansion. Hospitalization costs increased post- versus pre-expansion by $20 948 (95% CI = $8713-$33 183, p < 0.001) more in expander versus non-expander regions even after adjustment for risk factors associated with increased costs. Within expander regions, recipients post- versus pre-expansion were less likely to be discharged routinely (n = 2625, 28% vs. n = 3959, 44%) and more likely to be discharged to care facilities (n = 2045, 22% vs. n = 1045, 12%, p < 0.001). Conclusions Although Medicaid expansion resulted in greater access to care, it was associated with increased hospitalization costs and fewer routine discharges for LT recipients. Further research is warranted to identify the reasons that underpin the financial sequelae of Medicaid expansion, including changes in access to care for sicker patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "222e6a00c02aa89b22ffcbc76bbf818d",
  "timestamp": "2025-05-15T03:08:00.797653"
}