{
  "id": 2014,
  "title": "Investigating determinants of out-of-pocket spending and strategies for coping with payments for healthcare in southeast Nigeria",
  "abstract": "Background: Out-of-pocket spending (OOPS) is the major payment strategy for healthcare in Nigeria. Hence, the paper assessed the determinants socio-economic status (SES) of OOPS and strategies for coping with payments for healthcare in urban, semi-urban and rural areas of southeast Nigeria. This paper provides information that would be required to improve financial accessibility and equity in financing within the public health care system. Methods: The study areas were three rural and three urban areas from Ebonyi and Enugu states in South-east Nigeria. Cross-sectional survey using interviewer-administered questionnaires to randomly selected householders was the study tool. A socio-economic status (SES) index that was developed using principal components analysis was used to examine levels of inequity in OOPS and regression analysis was used to examine the determinants of use of OOPS. Results: All the SES groups equally sought healthcare when they needed to. However, the poorest households were most likely to use low level and informal providers such as traditional healers, whilst the least poor households were more likely to use the services of higher level and formal providers such as health centres and hospitals. The better-off SES more than worse-off SES groups used OOPS to pay for healthcare. The use of own money was the commonest payment-coping mechanism in the three communities. The sales of movable household assets or land were not commonly used as payment-coping mechanisms. Decreasing SES was associated with increased sale of household assets to cope with payment for healthcare in one of the communities. Fee exemptions and subsidies were almost non-existent as coping mechanisms in this study Conclusions: There is the need to reduce OOPS and channel and improve equity in healthcare financing by designing and implementing payment strategies that will assure financial risk protection of the poor such pre-payment mechanisms with government paying for the poor.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22415164660ca1fd479dd7af7c4b0efe",
  "timestamp": "2025-05-15T02:10:25.648712"
}