{
  "id": 7809,
  "title": "The positive influence of sense of control on physical, behavioral, and psychosocial health in older adults: An outcome-wide approach",
  "abstract": "Accumulating research indicates robust associations between sense of control and salutary health and well-being outcomes. However, whether change in sense of control is associated with subsequent outcomes has been underevaluated. Participants (N = 12,998) were from the Health and Retirement Study-a diverse, nationally representative, and longitudinal sample of U.S. adults aged >50 years. We examined how increase in sense of control (from t0:2006/2008 to t1: 2010/2012) was associated with better outcomes on 35 indicators of: physical-, behavioral-, and psychosocial-health (t2:2014/2016). We used multiple logistic-, linear-, and generalized-linear regression models and controlled for sociodemographic characteristics, personality traits, sense of control, and all outcomes in the pre-baseline wave (t0:2006/2008). During the 4-year follow-up, people in the highest (vs. lowest) quartile of sense of control, conditional on prior sense of control, had reduced risk of mortality and improved physical-health outcomes (lower risk of: stroke, lung disease, physical limitations, cognitive impairment, chronic pain and higher self-rated health). Sense of control was related to better health-behaviors (increased physical activity, reduced sleep problems), higher psychological well-being (positive affect, life satisfaction, optimism, purpose, personal-, health-, financial-mastery), lower psychological distress (depression, hopelessness, negative affect, perceived constraints), decreased loneliness, and increased contact with friends. Sense of control was unrelated to other physical health indicators (diabetes, hypertension, heart disease, cancer, arthritis, overweight/obesity), health behaviors (binge drinking, smoking), and social factors (living with spouse/partner, frequency of contact with children and other family). These findings underscore the importance of sense of control as a potential intervention target for fostering physical-, behavioral-, and psychosocial-health.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "224d8677ac27cc592b2d8ffe86d14168",
  "timestamp": "2025-05-15T03:12:11.717705"
}