{
  "id": 472,
  "title": "Patient socioeconomic determinants for the choice of the cheapest molecule within a cluster: evidence from Belgian prescription data",
  "abstract": "Reference pricing is a common cost-sharing mechanism, with the financial penalty for the use of costly drugs shifted from the third-party payer to the patient. Unintended distributional consequences might arise, if the weakest socioeconomic groups face a relatively higher financial burden. This study analyzed for a sample of Belgian individual prescription data for 4 clusters of commonly used drugs (proton pump inhibitors, statins and two groups of antihypertensives [drugs acting on renin-angiotensin system and dihydropyridine derivatives]) whether the probability to receive the least expensive molecule within a cluster was linked to the socioeconomic status of the patient. Logistic regression models included individual demographic, working, chronic illness and financial status and small area education data for 906,543 prescriptions from 1,280 prescribing general practitioners and specialists. For the 4 clusters, results show that patients with lower socioeconomic status consistently use slightly more the least expensive drugs than other patients. Larger effects are observed for patients residing in a nursing home for the elderly, patients entitled to increased reimbursement of co-payments, unemployed, patients treated in a primary care center financed per capita (and not fee-for-service) and patients having a chronic illness. Also, patients residing in neighborhoods with low education status use more less expensive drugs. The findings of the study suggest that although equity considerations were not explicitly taken into account in the design of the reference price system, there is no real equity problem, as the costly drugs with supplement are not prescribed more often in patients from lower socioeconomic classes.",
  "year": 2012,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2253493cbfb16633f2119ac2c00c23f0",
  "timestamp": "2025-05-15T01:32:30.170450"
}