{
  "id": 660,
  "title": "Credit Scorecards & Forecasting Default Events - A Novel Story of Non-financial Listed Companies in Pakistan",
  "abstract": "This study innovates in credit default prediction in Pakistan by developing, calibrating, and recalibrating machine learning-based credit scorecards for non-financial listed firms, leveraging extensive financial ratio analysis. This study innovates in credit default prediction in Pakistan by developing, calibrating, and recalibrating machine learning-based credit scorecards for non-financial listed firms, leveraging extensive financial ratio analysis. Identifies 12 key financial ratios out of 71 remained vital for default prediction, with Random Forest and Artificial Neural Networks leading in scorecard performance. This marks Pakistan's first detailed scorecard approach as a potential alternative to traditional banking systems. Offers advanced risk assessment tools (credit scorecards) for improved credit risk management, aiding policymakers and finance professionals in decision-making. This research distinguishes itself through a detailed longitudinal study of non-financial Pakistani firms and a comprehensive evaluation of machine learning algorithms for default prediction. By exploiting various financial ratios to develop scorecards (an alternative of Internal Ratings-based - IRB System), it offers new insights into risk evaluation and significantly advances financial risk management. Acknowledging data limitations and variable exclusions, it sets the stage for further exploration of credit risk environment in context of Pakistan.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "225c2056ad2e466ee4848e07af287da9",
  "timestamp": "2025-05-15T01:53:24.992376"
}