{
  "id": 8027,
  "title": "Prevalence of depressive symptom and its associated factors among epilepsy patients in Amhara region, Ethiopia: cross-sectional study",
  "abstract": "BackgroundDepressive symptom is the most common type of psychiatric co-morbidity among persons with epilepsy. Epilepsy patients are identified as at higher risk of suffering depressive symptom explicitly in low- and middle-income countries due to poor mental health care systems and financial burdens. The co-occurrence of depressive symptom among epilepsy patients deteriorates the prognosis of the disease and diminishes the quality of life of both the patients and their families. However, there is limited evidence on the prevalence of depressive symptom and associated factors in Ethiopia. Therefore, this study is intended to assess the prevalence of depressive symptom and associated factors among epilepsy patients attending in Amhara region, Ethiopia.MethodA multi-center institution-based cross-sectional study was done among epilepsy patients attending at Amhara region, Ethiopia. The Hospital Anxiety Depression tool was used to assess depressive symptom. To determine the factors associated with depressive symptom, a binary logistic regression model was used. Adjusted Odds Ratio (AOR) with the 95% Confidence Interval (CI) was reported in the multivariable binary logistic regression analysis.ResultsAbout 406 participants were registered in the study with a response rate of 97.6%. The prevalence of depressive symptom among epilepsy patients was 53.9% [95%CI: 49.1%, 58.8%]. In the multivariable binary logistic regression analysis, taking polytherapy treatment [AOR = 1.87, 95% CI: 1.04, 3.36], perceived stigma [AOR = 5.73, 95%CI: 3.11, 10.55], poor antiepileptic medication adherence [AOR = 3.33, 95%CI: 1.30, 8.54] and having poor [AOR = 5.83, 95%CI: 2.44, 13.90] and moderate social support [AOR = 3.08, 95%CI: 1.34, 7.09] were significantly associated with depressive symptom.ConclusionsThis study revealed that the magnitude of depressive symptom among epilepsy patients in Ethiopia was relatively high and multiple factors determined the likelihood of depressive symptom. Thus, healthcare providers and concerned stakeholders should strengthen comprehensive health education to reduce the magnitude and consequences of depressive symptom among this segment of the population. Moreover, strong social support with special attention should be given to epilepsy patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2268888d30f65afce59560ff4dea123a",
  "timestamp": "2025-05-15T03:14:37.295382"
}