{
  "id": 4486,
  "title": "A model of financial bubbles and drawdowns with non-local behavioral self-referencing",
  "abstract": "We propose a novel class of asset price models in which the crash hazard rate is determined by a function of a non-local estimation of mispricing. Rooted in behavioral finance, the non-local estimation embodies in particular the characteristic of 'anchoring' on past price levels and the 'probability judgment' about the likelihood of a crash as a function of the self-referential mispricing, enabling us to disentangle the risk-return relationship from its instantaneous connection. By describing drawdowns and crashes as market regimes with correlated negative jumps clustering over a finite period of time, our model provides a solution to the problem plaguing most crash jump models, which are in general rejected in calibrations of real financial time series because they assume that crashes occur in a single large negative jump, which is counterfactual. The model estimation is implemented on synthetic time series and real markets, shedding light on the estimation of the 'true' expected return, which is usually confounded by the entanglement between volatility and jump risks. Estimated from the daily time series of three stock indexes, the hidden expected return exhibits a secular increase over time and tends to be larger than the realized return, suggesting that financial markets have been overall underpriced.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "227078633d06def670cefa2e682bfba3",
  "timestamp": "2025-05-15T02:37:47.517195"
}