{
  "id": 8306,
  "title": "Pandemic-related attitudes, stressors and work outcomes among medical assistants during the SARS-CoV-2 (Coronavirus) pandemic in Germany: A cross-sectional Study",
  "abstract": "Background The SARS-CoV-2 virus has spread rapidly around the globe since December 2019 creating much uncertainty among medical staff. Due to close patient contact, medical assistants are at increased risk of an infection. Several studies have investigated psychological consequences of the SARS-CoV-2 pandemic on medical staff, yet studies in the outpatient setting are scarce and studies addressing medical assistants are lacking. This study aimed to investigate pandemic-related stressors, attitudes, and work outcomes among medical assistants and to identify possible determinants. Methods The population under study were medical assistants across entire Germany. A self-devised online questionnaire was published between April 7th, 2020, and April 14th. including questions on pandemic-related stressors, attitudes and work outcomes. Additionally, symptoms of depression and anxiety disorder were measured by PHQ-2 and GAD-2, respectively. Logistic regression was performed to identify possible determinants. Results 2150 medical assistants provided complete data (98.0% female, mean age 37.6 years). Major stressors were uncertainty about the temporal scope of the pandemic (95.1% agreement), about how to act correctly (77.5%), feelings of not being allowed to let patients down (75.9%), uncertainty about one's financial situation (67.4%) and about contact persons for further information (67.1%). One third (29.9%) of the study population screened positively for depression and 42.6% for anxiety disorder. Feeling burdened by one's financial situation was significantly associated with working in specialist practices (1.32 [1.08-1.62]), caring for children (1.51 [1.22-1.87]), depression (1.28 [1.01-1.62]), and anxiety disorder (1.93 [1.55-2.39]). Feeling burdened by thoughts about virus contraction at work was also significantly associated with working in specialist practices (1.33 [1.07-1.64]), caring for children (1.33 [1.07-1.66]), depression (1.54 [1.18-2.00]), and anxiety (4.71 [3.71-5.98]). Conclusions This study provides novel evidence regarding major SARS-CoV-2 pandemic-related stressors among medical assistants and suggests need for special support for medical assistants caring for children and working in specialist practices.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2275e44dd85038e557ff20537d863b31",
  "timestamp": "2025-05-15T03:17:21.596597"
}