{
  "id": 7354,
  "title": "Risk of Readmission Among HIV Patients in Public Portuguese Hospitals: Longitudinal Multilevel Population-Based Study",
  "abstract": "Background: Thirty-day hospital readmission is receiving growing attention as an indicator of the quality of hospital care. Understanding factors associated with 30-day hospital readmission among HIV patients in Portugal is essential given the high burden cost of HIV hospitalizations in Portugal, a country suffering from financial constrains for almost 10 years. Objectives: We aimed to estimate the 30-day hospital readmission rates among HIV patients in Portugal and to identify its determinants using population-based data for Portuguese public hospitals. Study Design: A multilevel longitudinal population-based study. Methods: Between January 2009 and December 2014, a total of 37,134 registered discharges in the Portuguese National Health Service (NHS) facilities with HIV/AIDS as a main or secondary cause of admission were analyzed. Logistic regression was used to compare 30-day hospital readmission categories by computing odds ratio (OR) and corresponding 95% confidence intervals (95% CIs). A normal random effects model was used to determine unmeasured factors specific to each hospital. Results: A total of 4914 (13.2%, 95% CI: 12.9%-13.6%) hospitalizations had a subsequent 30-day readmission. Hospitalizations that included exit against medical opinion (OR = 1.18, 95% CI: 1.01-1.39), scheduled admissions (OR = 1.71, 95% CI: 1.58-1.85), and tuberculosis infection (OR = 1.20, 95% CI: 1.05-1.38) exhibited a higher risk of hospitalizations with subsequent 30-day readmission. In contrast, hospitalizations that included females (OR = 0.87, 95% CI: 0.81-0.94), a transfer to another facility (OR = 0.78, 95% CI: 0.67-0.91), and having a responsible financial institution (OR = 0.63, 95% CI: 0.55-0.72) exhibited a lower risk of hospitalizations with subsequent 30-day readmission. Hospitalizations associated with higher number of diagnosis, older ages, or hospitalizations during the economic crisis showed an increasing trend of 30-day readmission, whereas an opposite trend was observed for hospitalizations with higher number of procedures. Significant differences exist between hospital quality, adjusting for other factors. Conclusion: This study analyzes the indicators of 30-day hospital readmission among HIV patients in Portugal and provides useful information for enlightening policymakers and health care providers for developing health policies that can reduce costs associated with HIV hospitalizations.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "227f74bd32eec22cb3543b9b3b9f0238",
  "timestamp": "2025-05-15T03:07:32.001055"
}