{
  "id": 6417,
  "title": "The validity of self-reported health-care utilization by AIDS patients",
  "abstract": "Objectives: To examine the validity of self reported health-care utilization among persons with AIDS. Design: A comparison of survey data with information collected from medical and financial records. Methods: Personal interviews provided information on utilization within a 4-month period for inpatient admissions (n = 296), ambulatory visits (n = 284), and hours of homecare (n = 106). Risk group, socioeconomic characteristics, disease stage, functional status, memory, and respondent's recall ability were also measured. Reporting error was defined as the difference between self reports and medical/financial records. Variations among subgroups of patients were examined using t tests and multiple regression. To determine whether reporting errors affected analysis of utilization data, we compared coefficients from parallel utilization models using each data source to predict use/non-use and total utilization. Results: Mean overall reporting errors were small and not significantly different from zero. Reporting errors were lowest for hospital admissions and highest for homecare. High utilizers underreported all types of services. The interviewer evaluation of recall was an independent and significant predictor of reporting errors for admissions and ambulatory visits. Reporting errors varied by selected subgroup characteristics, but the direction and significance of the error depended on the type of utilization measured. In the parallel utilization models, few differences appeared between models using self-reports and medical/financial records to identify correlates of use/non-use, but some differences between the models of total utilization were apparent. Conclusions: Self-reports of utilization by AIDS patients with a recall period of 4 months or less provide, on average, valid data for analytic purposes. However, caution should be applied to reports by high or low users or by respondents judged by interviewers to have major recall problems.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "228091f5421b7b162e191d242f06490a",
  "timestamp": "2025-05-15T02:58:05.579941"
}