{
  "id": 2489,
  "title": "A mathematical model of utility for single screening of asymptomatic unruptured intracranial aneurysms at the age of 50 years",
  "abstract": "Although rupture of intracranial aneurysms carries high mortality and morbidity rates, the clinical and financial benefit of screening certain high-risk groups is uncertain. We designed a mathematical model to interrogate the clinical benefit and cost-effectiveness of screening. A decision tree analysis model was used to calculate the outcome and cost of two scenarios applied to the same population: one-off screening for intracranial aneurysms versus not screening. Each scenario had an associated gain or loss of Quality Adjusted Life Years (QALY) and cost; the difference between the two scenarios was calculated. The variable inputs were the aneurysm prevalence and risk of rupture after 5 years. Sensitivity analyses were performed to determine the effects of altering various factors on outcomes. Screening of the asymptomatic general population results in a QALY loss, equating to a negative clinical impact. The threshold 5-year risk of rupture at which screening resulted in a gain in QALYs was 13 %. This held true for any prevalence between 1 and 25 %. Risk of rupture had a greater impact on outcome than prevalence. Halving the risk of intervention (either surgery or coiling) reduced the threshold 5-year risk of rupture at which screening results in gain of QALYs to 6 %. The age of screening also had important effects on outcome. The QALY benefit and cost-effectiveness of screening are most sensitive to the 5-year risk of rupture. Screening is beneficial only in populations with a high risk of rupture; this should be the focus of future research.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2287a29769eeb178f0eed5ad16e8fce5",
  "timestamp": "2025-05-15T02:15:59.859122"
}