{
  "id": 7105,
  "title": "Does Gender and Family Income Impact Stock Trading of B-School Students? Findings from a Stock Simulation Exercise",
  "abstract": "Educators across the globe utilize online stock market simulation games to introduce students to trading in the stock market. The primary objective of the simulation exercise is to expose students to the practical application of financial theories on fundamental analysis, stock selection, building an optimal portfolio, monitoring the risk-return characteristics and continuously improving the portfolio based on changing realities. This article utilizes the trading data from a simulation exercise conducted by a leading B-school in India. The exercise was conducted as part of Security Analysis and Portfolio Management (SAPM) course offered by the B-school. The objective of the article is to understand the role of gender and family income in the trading patterns of students in the simulation exercise. The article covers 163 students who were part of the simulation exercise in 2019. The results indicate that male students trade more aggressively than female students, both in terms of number of trades and the number of companies traded. However, the female students reported higher stock trading performance, measured in stock returns. This is observed to be true at all the quartiles, with the largest magnitude of the difference in the mid-quartiles. The study also indicates that the students from wealthier families perform better than those from poorer backgrounds. However, family income is an insignificant differentiating factor. Further, regression analysis indicates that gender is a significant determinant of stock returns. Based on these findings, the authors argue that gender has a significant role in the stock trading performance of B-schoolers. The article contributes to the field of behavioural finance, especially on the literature of gender and performance in financial markets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "228746ee1359e5d4cb2a402ca74edbab",
  "timestamp": "2025-05-15T03:05:03.560948"
}