{
  "id": 2778,
  "title": "Using option theory and fundamentals to assessing default risk of listed firms",
  "abstract": "The purpose of this study is to explore and extend the usefulness of the two major default risk modeling approaches, the fundamental approach and the classic option pricing approach. First, we use market information from option based measures of financial performance such as leverage, profitability and business risk to assessing default risk for listed firms. The above option based measures are used in a binary probit regression to examine their informational context and properties as leading indicators of corporate distress and to estimate default probabilities for listed firms. We find that the default probabilities estimated from the option based measures of financial performance have more explanatory power and predictive ability in assessing corporate distress than the distance to default rates generated from the same option pricing model. Then, we combine the two modeling approaches by enriching the above option based measures with accounting based measures of financial performance. The results suggest that by adding accounting information from financial statements to market information from option theory we can imporove both in sample and out of sample predictabilty of defaults. Our main conclusion, is that financial statement provide signficant and incremental information and thus, option theory does not generate sufficient statistics to assessing default risk of listed firms.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "229499cac546e56c76bd2c8b3c070aac",
  "timestamp": "2025-05-15T02:19:08.426786"
}