{
  "id": 3765,
  "title": "Use of Multiple Linear Regression Techniques to Predict Energy Storage Systems' Total Capital Costs and Life Cycle Costs",
  "abstract": "In the United States, legislative and regulatory requirements are the primary drivers for the use of grid-level energy storage. In some cases, state-level legislative mandates called Renewable Portfolio Standards (RPSs) necessitate the use of storage to support renewable generation (e.g., solar, wind energy). At the federal level, the Federal Energy Regulatory Commission (FERC) has issued final Orders that stipulate fair and equitable competition rules for regional interstate transmission markets. In both instances, it is the investor-owned utility (IOU) entities that are financially responsible to either satisfy the state and FERC Orders or face noncompliance tines or tariffs. Unfortunately, utility investors do not have a reliable tool to assist in understanding the front-end installation costs or whole life cycle costs for electrical storage systems that service the electric grid. This paper proposes the use of multiple linear regression (MLR) techniques using R-Script to predict the total capital cost. (TCC) and life cycle cost (LCC) of real-world energy storage systems (ESSs) derived from manufactures' design specifications and intrinsic characteristics of lead-acid, lithium-ion, sodium sulfur; and vanadium and Ainc-based Aow Aatteries.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22ad337a0db1be4dc549e28851e51fbd",
  "timestamp": "2025-05-15T01:20:36.092620"
}