{
  "id": 2537,
  "title": "Treatment discontinuation in adults with atypical hemolytic uremic syndrome (aHUS): a qualitative study of international experts' perspectives with associated cost-consequence analysis",
  "abstract": "BackgroundAtypical hemolytic uremic syndrome (aHUS) is a rare, life-threatening thrombotic microangiopathy (TMA) related to congenital mutations impeding control of the alternative pathway of complement. Following approval of the complement C5 inhibitor eculizumab by the European Medicines Agency and the US Food and Drug Administration, initial guidelines suggested lifelong therapy. Yet, growing evidence indicates that discontinuation of eculizumab, or its long-acting form ravulizumab, is possible for many patients. This mixed-methods study sought to explore international experts' perspectives and experiences related to treatment duration in adult patients with aHUS, while also estimating the financial and potential health consequences of early discontinuation.MethodsBetween January and December 2023, we conducted 10 qualitative interviews with experts in the treatment of aHUS, based upon which we constructed a quantitative decision tree, designed to estimate time on treatment and treatment- and disease-related adverse events.ResultsThematic analysis of the interview data identified four main themes: (1) Concerns and prior experience; (2) High-risk vs. low-risk groups; (3) Patient preference and adherence; and (4) Funding for monitoring and re-treatment. Although most interviewees were in favour of considering treatment discontinuation for many patients (citing the high cost, burden, and potential side effects of lifelong treatment as key reasons), a prior negative experience of discontinuation seemed to make others more reluctant to stop. Deciding which patients required lifelong treatment and which not involved consideration of a wide range of factors, including patient- and system-related factors. Cost-consequence analysis demonstrated the financial savings associated with early treatment discontinuation at the expense of increased risk of recurrent TMA events. Close monitoring for these events had the potential to minimise any long-term injury, primarily renal, with an estimated one event per 100 patient years. For patients at high risk of TMA and with poor adherence to monitoring, rates of renal injury rose to three events per 100 patient years.ConclusionsaHUS treatment protocols are changing globally in response to new clinical evidence. Against this backdrop, our mixed-methods study provides compelling evidence on the complexity of factors influencing treatment discontinuation decisions in aHUS, as well as the financial and health consequences of early discontinuation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22c072c684516049fa2c47ccc542b27b",
  "timestamp": "2025-05-15T02:16:32.667413"
}