{
  "id": 7352,
  "title": "Operational Implications and Risk Assessment of COVID-19 in Dental Practices",
  "abstract": "The unprecedented situation of the coronavirus pandemic has impacted the entire world, with dental practice being significantly affected. In this study, we aim to evaluate the operational implications and risk assessment of the coronavirus in dental practice. This observational study comprised the electronic distribution of two surveys, one to patients and the second to dental professionals. The first questionnaire consisted of demographics along with 15 closed-ended questions. The second questionnaire consisted of demographics along with 43 questions from eight domains: financial impact, psychological impact, patient satisfaction, hygiene, patient management, COVID-19 lockdown, perspective, and practicing dentistry after the COVID-19 pandemic. The statistical analysis was performed using SPSS-25. A linear regression test was applied to assess the effect of the dependent variable (patient's satisfaction with the dental practice) on independent variables (age, gender, education). The ANOVA test was applied to assess the effect of the independent variables (financial impact, psychological impact, patient satisfaction, hygiene, patient management, lockdown, perspective, and post-COVID-19) on the dependent variables (age, gender, education, experience of dentists, qualification of dentists). A total of 711 patients and dental professionals participated in this study, with a response rate of 88.87%. Approximately 67.9% of the patients felt comfortable in the dental clinic, with 74.5% being satisfied with the dental clinic's services. The majority (77.4%) of the dentists were psychologically affected. Many of the participants chose to use masks, gowns, respiratory equipment, and face shields for protection. Teledentistry was preferred by the majority of dentists in non-emergency cases. Many of the dentists chose alternative procedures to minimize the generation of aerosols. The majority of the dentists suggested changes in the dynamics of dentistry in the post-COVID era, such as the suggestion that the management of the finances of a dental practice along with infection control protocols should be practiced more optimally. Patients and dental professionals were well aware of the necessary precautionary measures required to combat the coronavirus, as well as the implications of different operational measures along with performing risk assessment, keeping in mind the changing dynamics of dentistry.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22d9fdeb32a543c0f35c18e823e89672",
  "timestamp": "2025-05-15T03:07:31.990060"
}