{
  "id": 3956,
  "title": "Disaster risk management of debris flow based on time-series contribution mechanism (CRMCD): Nonnegligible ecological vulnerable multi-ethnic communities",
  "abstract": "Disaster management often serves as the primary defense against ecological damage and threats to social wellbeing resulting from natural disasters. However, the quantitative research on unified disaster risk management capacity assessment has not been scrutinized. Based on the time series structure, this study proposes a novel framework and risk management contribution models for exploiting a community risk management capacity to debris flows (CRMCD) assessment system. A comprehensively improved method was utilized for indicator selection by combining R hierarchical clustering (RHC) and coefficient of variation methods (CV). Entropyweighted grey correlation analysis (EGCA) and geographic information system (GIS) methods are employed to assign weights and visualize the disaster management capacity of research areas. Three risk management contribution models are constructed according to the criterion layers defined by CRMCD: prevention-oriented, emergency-oriented, and recovery-oriented. Furthermore, a questionnaire was designed by introducing multiethnic cultural scenarios to assess public risk awareness, avoidance behaviors, and management demands. A total of 3,060 survey samples were conducted among ethnic minority communities in Sichuan that issued debris flow disaster declarations in 2022. Social welfare and public satisfaction were examined to validate the applicability of the CRMCD assessment system and risk management contribution model. The results identified key indices contributing to enhancing CRMCD: The proportion of financial investment in disaster prevention and public security, Professional skills diversity of emergency responders, and Installed power capacity. The multinomial logistic regression analysis revealed public preference for the prevention-oriented type in the risk management contribution model, and interviewees demonstrated a more positive response regarding motivation and participation in disaster prevention under this model. Kruskal-Wallis H significance analysis highlighted that ethnic minorities and elderly populations exhibited lower levels of disaster knowledge reserves, avoidance awareness, and propensity to purchase disaster insurance. Unexpectedly, respondents with higher household income and education levels paid less attention to seeking assistance from professional community organizations. Disaster early warning emerged as a priority for respondents interested in strengthening community disaster management initiatives. Overall, this study outlines a systematic methodology to establish an objective index system and summarize management models, which provide breakthroughs in developing participatory disaster management frameworks and resilience communities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22eb0b0315542c17f4eaa6a42d8c92c0",
  "timestamp": "2025-05-15T02:31:28.503456"
}