{
  "id": 2344,
  "title": "Resilience for financial networks under a multivariate GARCH model of stock index returns with multiple regimes",
  "abstract": "Targeting systemic risk, we propose a two-stage analysis of a large collection of stock markets by considering their interconnections. First, we characterize the joint dynamics of stock returns using a multivariate GARCH model in the presence of regime changes. The model detects three regimes of volatility rising from two unknown but common endogenous breaks. We compute filtered returns by normalizing them using the dynamic GARCH volatility. Second, we build a Gaussian signed weighted and undirected worldwide financial network from filtered stock returns, that evolves across regimes. The best network is built from the partial correlation matrix of filtered stock returns over each regime using regularisation and the minimum Extended Bayesian Information Criterion. To gain insights into the resilience of the financial network and its systemic risk over time, we then compute relevant nodal centrality measures-including the clustering coefficient-over each regime. Thus, we characterize the ever-changing network topology and structure by detecting group-like and community-like patterns (e.g., clustering and community detection, network cohesion). Under the resilience framework and depending on the studied regime, we analyse the propensity of a shock to propagate across the network thanks to positive weights, and the network's ability to mitigate shocks thanks to negative weights. The balance between spreading and inhibiting node influences drives the network's frailty and resilience to shocks. Hence, the network exhibits a high level of systemic risk when its connectivity is large and most edge weights are significantly positive (i.e., strong and multiple conditional dependencies of world stock markets). It is of high significance to policymakers because systemic risk/financial frailty is potentially costly (i.e., loss) while resilience is rewarding (i.e., gain).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22fcec7fa7ddf97c38b97aab98264de6",
  "timestamp": "2025-05-15T02:14:19.631415"
}