{
  "id": 2935,
  "title": "An assessment of OECD sustainable portfolios with a multi-criteria approach under uncertainty",
  "abstract": "Purpose - This paper aims to analyse the differences in financial performance portfolios between sustainable and non-sustainable firms through the use of portfolio theory and OptQuest algorithms from 2007 to 2013. Design/methodology/approach - The sample consists of 1,078 firms from 15 Organisation for Economic Cooperation and Development countries. A maximisation weighted ratio is estimated by applying OptQuest algorithms to measure the portfolio performance considering a fuzzy Jensen's alpha and the percentage of the portfolio's performance that exceeds the market. Findings - The results show a similar financial performance in sustainable portfolios (SP) and non-SP, but considering the uncertainty, the performance in sustainable firms was better than that of non-sustainable ones. Uncertainty was reduced, as it passed the beginning of the crisis from 2008-2009 to 2012-2013. Research limitations/implications - The main limitation is the different assessments of sustainability indexes in each of the countries. Practical implications - The results help investors assess their decisions in an uncertain economic environment and allocate their investment in not only financial terms but also social character. Social implications - Countries with higher financial performances in SP show the efficiency in their legal environmental regulations. On the other hand, the degree of uncertainty is lower in the SP than non-SP, suggesting that sustainable firms in financial crisis could be more responsible in social claims such as good working conditions. Originality/value - This study contributes to existing research in two ways. First, the paper studies corporate social responsibility by different continents and countries in an uncertain economic timespan. For this, the legal, cultural and socioeconomic divergences and convergences were explored. Second, the research presented an analysis of the financial performance differences between sustainable and non-SP by applying a hybrid methodology with fuzzy regression and OptQuest algorithms.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "22fdc1c536072e7679d55092cb507834",
  "timestamp": "2025-05-15T01:11:48.489477"
}