{
  "id": 4291,
  "title": "From evidence to policy: Findings from the Christchurch Health and Development Study",
  "abstract": "The Christchurch Health and Development Study is a longitudinal study of a birth cohort of 1265 children who were born in Christchurch New Zealand in 1977. This cohort has now been studied from birth to the age of 35. This article examines a series of findings from the Christchurch Health and Development Study that address a range of issues relating to the measurement, explanation and prevention of crime and antisocial behaviour. These issues include: center dot The measurement of antisocial behaviour in middle childhood; center dot The effects of maternal smoking during pregnancy on later criminal offending; center dot The long-term consequences of conduct problems, self-control and attention deficits for later crime and delinquency; center dot The role of the marker for the monoamine oxidase (MAOA) genotype in moderating the associations between crime and life course predictors of crime; center dot The development of trajectory models of crime; center dot The use of fixed effects regression in longitudinal analyses to control non-observed sources of confounding; center dot Findings from evaluations of home visiting and parent behaviour management programmes. In general, the findings of the Christchurch Health and Development Study suggest that: (a) conduct problems in childhood and adolescence are a strong and consistent predictor of adult crime; (b) maternal smoking may be an important factor in the development of crime and antisocial behaviour; (c) individuals with the low activity variant of the marker for the MAOA genotype may be at particular risk of criminal offending in adulthood if exposed to environmental risks; (d) the linkages between alcohol misuse and criminal offending are specific to more impulsive kinds of crime such as assault and vandalism; and (e) that home visitation and parent behaviour management programmes may be effective in reducing both child abuse and childhood behaviour problems, amongst other beneficial effects. Two general themes unite this diverse portfolio of findings. The first has been the commitment of the Christchurch Health and Development Study research team to develop, pioneer and apply statistical methods for addressing long-standing issues relating to measurement and causal analysis in developmental data. The second has been the commitment of the group to translating research findings to develop well-evaluated evidence-based programmes.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "230b19c52678732ddbe70d8c749e63f5",
  "timestamp": "2025-05-15T01:25:50.470329"
}