{
  "id": 4337,
  "title": "THE APPROACH OF LIFE CYCLE SUSTAINABILITY ASSESSMENT OF BIOREFINERIES",
  "abstract": "A key driver for the necessary sustainable development is the implementation of the BioEconomy, which is based on renewable resources to satisfy its energy and material demand of our society. The broad spectrum of biomass resources offers great opportunities for a comprehensive product portfolio to satisfy the different needs of a BioEconomy. The concept of biorefining guarantees the resource and energy efficient use of biomass resources. The IEA Bioenergy Task 42 Biorefining has the following definition on biorefining: Biorefining is the sustainable processing of biomass into a spectrum of bio-based products (food, feed, chemicals, and materials) and bioenergy (biofuels, power and/or heat). Currently many different biorefinery concepts are developed and already implemented which play a key role in establishing a BioEconomy. The purpose of the work is to develop implementing strategies of Biorefineries in the BioEconomy by applying and using a Life Cycle Sustainability Assessment Approach developed in cooperation with IEA Bioenergy Task 42 Biorefining and applied to an algae based biorefinery demonstrated in the EU project FUEL4ME. The aim is to provide facts, figures and framework conditions to maximise the overall sustainability benefits of an integrated material and energetic use of biomass. The scientific innovation is to integrate and combine these broad aspects of an overall assessment of a biorefinery in a common framework and the proof of its practical application to a biorefinery example. The framework covers 1) biorefinery classification, 2) assessment of the technologies and processes with their  Technology Readiness Level (TRL) integrated in the Biorefinery Complexity Index (BCI), 3) economic assessment based on Life Cycle Costing (LCC), 4) environmental effects based on Life Cycle Assessment (LCA), 5) social issues in a Social Life Cycle Assessment (sLCA) 6) overall Life Cycle Sustainability Assessment (LCSA), 7) identification of most attractive industry sectors (Hot Spots) for rolling out BioEconomy, 8) highlighting necessary R&D demand for commercialisation and 9) concluding on the possible future role of biorefining in a BioEconomy in a regional, national and international context. An innovative presentation in a compact format is developed - Biorefinery Fact Sheet - to present the assessment results. A set of broadly accepted sustainability indicators for comparison with conventional systems is identified: a) Environment: GHG emissions (t CO2-eq/a), primary energy demand (GJ/a), area demand (ha/a); b) Economy: production costs ((sic)/a), revenues from products ((sic)/a), value added ((sic)/a), employment (persons/a), trade balance ((sic)/a); c) Society: workers, consumers, local community. The whole concept is applied to a case study of using algal biomass to produce HVO-biofuels, PUFA and fertilizer, developed in the EU-demonstration project FUEL4ME for a future commercial scale. The results concentrated in the Biorefinery Fact Sheet for single biorefinery systems assist various stakeholders in finding their position on biorefining in a future biobased economy while minimising unexpected technical, economic and financial risks.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "233731af2f727c72f996b08f2d65d2eb",
  "timestamp": "2025-05-15T01:25:50.615958"
}