{
  "id": 8335,
  "title": "The effectiveness of diabetes self-management education (DSME) on glycemic control among T2DM patients randomized control trial: systematic review and meta-analysis protocol",
  "abstract": "Background Type 2 Diabetes mellitus (T2DM) has been a global pandemic resulting in physical, financial and psychosocial crises. Thus, it is important to investigate pooled effectiveness of Diabetes Self-Management Education (DSME) on glycemic control among T2DM patients. Objective The aim of this systematic review and meta-analysis is to investigate the association between DSME or Support (DSME/S) and glycemic control among (T2DM) patients. Methods The systematic review and meta-analysis will include studies conducted throughout the world from 2010 to 2019. T2DM patients and their clinical, anthropometric, biomarkers from baseline to end line will be recorded. We will search all relevant articles from five databases namely; Cochrane Library, BioMed Central, MEDLINE (EBSCOhost), MEDLINE/PubMed and SCOPUS. Key terms will be used for questing relevant articles. Further efforts will be made to check quality of studies base on quality assessment instruments. Finally, the report will be made according Preferred Reporting Items for Systematic Review and Meta-analysis (PRISMA) guidelines. Pooled standard mean difference in HbA1c will be used to calculate the effect size between the variables with random effects analysis assumption. Further subgroup analysis will be carried out for assessing the risk difference among groups. Conclusion Based on the existing and eligible researches this systematic review and meta-analysis will bring the best evidence on the effectiveness of DSME/S on glycemic control among the T2DM patients. Moreover, the subgroup analysis will inform the effectiveness heterogeneity based on continent, International Diabetes Federation (IDF) region, intervention period, World bank economic classification and glycemic markers used to follow the patients. The proposed review has been registered in the International PROSPERO website with registration numberCRD42020124236.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "234739db57283b31f4fc8dd29bb213be",
  "timestamp": "2025-05-15T03:17:49.134637"
}