{
  "id": 7869,
  "title": "The Influence of Managerial Mindfulness on Innovation: Evidence from China",
  "abstract": "This study attempts to investigate the influence of managerial mindfulness on firm innovation. Managerial mindfulness is defined as a collective psychological state shared by top management team (TMT) members and represents their collective attention to present-moment events and experiences. Drawing from two psychological mechanisms of mindfulness, we argue that managerial mindfulness can positively affect R&D intensitya proxy for firm innovation. The first psychological mechanism is that mindfulness facilitates self-regulation. By facilitating self-regulation, managerial mindfulness enables TMT members to behave less opportunistically and act in a less self-serving manner. Therefore, TMT members are concerned about the shareholders' interests in long-term value creation and hence are willing to take more risk such as investing more in R&D. The second psychological mechanism is that mindfulness facilitates goal-pursuit, especially for intrinsic goals. Mindful TMT members are autonomously motivated to pursue goals that are more satisfying, persist for longer durations, and show greater success than goals that are extrinsically motivated; mindful TMT members are likely to view R&D as an intrinsic goal to pursue. In addition to the main effect, this study also examines several moderators and suggests that the positive relationship between managerial mindfulness and R&D intensity is moderated by firm age, slack resources, and past financial performance. Specifically, this relationship becomes weaker when a firm grows older and the firm has better past financial performance, while it is stronger when a firm has greater slack resources. To empirically test our hypotheses, we rely on a sample of Chinese listed companies and collect data from the China Stock Market and Accounting Research (CSMAR). Feasible generalized least squares (FGLS) regression is adopted due to the presence of significant autocorrelations and heteroskedasticity. The empirical analyses provide full support for our hypotheses. Therefore, this study contributes to literature of mindfulness, as well as studies on TMT's influence on firm strategy and decision-making.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "234973675b475c1e00472e3ce5fa5caa",
  "timestamp": "2025-05-15T03:13:04.871579"
}