{
  "id": 7011,
  "title": "Legal Protection for Creditors in Bankruptcy Law: Implementing the Bankrupt Boedel Execution",
  "abstract": "Bankruptcy is a legally recognised mechanism employed to safeguard the financial interests of creditors. The proper administration of the bankruptcy estate is a crucial aspect of the bankruptcy process. Currently, the evolution of various goods necessitates the executor to consider the regulations that control them. The process of executing collateral objects necessitates the categorization of object types and the consideration of various factors. This includes the execution of objects that are not part of the bankruptcy estate, which requires the regulation and classification of these objects. By effectively managing the execution of these objects and their classification, the bankruptcy execution process can be conducted efficiently. The purpose of implementing measures to safeguard creditors in the event of debtor bankruptcy is to promote sustainable practises within entrepreneurship. By ensuring that creditors are not at risk of financial harm when debtors associated with them declare bankruptcy and are unable to fulfil their debt obligations, it becomes possible to maintain business continuity. This article employs a normative juridical approach. Normative juridical research pertains to the examination and analysis of the doctrines or principles within the field of legal science. The normative juridical approach refers to a legal methodology that involves the examination of regulations, including primary legal sources and secondary legal resources, as well as the application of relevant laws to address and resolve legal issues. This study also aims to elucidate the processes involved in the implementation of bankruptcy-related executions. The legal safeguards for creditors involved in the administration of bankruptcy estates have been effectively controlled and safeguarded in the Guidelines for the Implementation of Auctions issued by the Minister of Finance of the Republic of Indonesia, as well as in the provisions of the Civil Code. The safeguarding process is implemented during the administration of the bankruptcy estate via an auction mechanism. In this particular instance, the court has declared the debtor bankrupt, resulting in the initiation of an auction to liquidate the debtor's assets. The auction method represents a legally established safeguard for creditors. Nevertheless, during the execution of the auction, it is imperative to adhere to many legal frameworks, including the Civil Code and the Minister of Finance's Regulation on Auction Implementation Guidelines. The purpose of this measure is to ensure that the auction process remains mindful of the principle of legal certainty.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "235a5a5f50c123bfe29283bf61597a9f",
  "timestamp": "2025-05-15T03:03:55.872426"
}