{
  "id": 8215,
  "title": "Does Mobile Payment Raise the Poverty-Alleviation Resilience of Chinese Households?",
  "abstract": "Considering the complex environment facing the future poverty reduction process in China, and it is increasingly urgent to shift the conversation from the poverty vulnerability to poverty-alleviation resilience of households. Coinciding with poverty-alleviation progress, mobile payment has experienced explosive growth, resulting in significant and far-reaching influences on production and lifestyle. This study constructs a theoretical framework to analyze the impact of mobile payment on poverty-alleviation resilience (splitting into poverty-eradication resilience and development resilience). Meanwhile, the impact is empirically investigated using the China Household Finance Survey for 2017 and 2019. The findings reveal that, first, mobile payment significantly increases both poverty-eradication resilience and development resilience. According to the quantile regression results, mobile payment has a larger contribution to households with a lower poverty-alleviation resilience, with the contribution diminishing as poverty-alleviation resilience improves; second, mobile payment significantly increases poverty-alleviation resilience by increasing self-insurance capacity and participation in commercial insurance (ex ante), alleviating financial exclusion (ex interim), and promoting entrepreneurship and improving entrepreneurial performance (ex post); and third, social trust significantly improves the effect of mobile payment on poverty-alleviation resilience, whereas the age of the household head has the reverse effect. Since risk and shocks play a more pronounced role in the persistence of poverty, our research helps to understand poverty alleviation and offers insights into how to eradicate poverty in all its forms and dimensions, thus realizing the 2030 Agenda for Sustainable Development.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23737478b4fab9e20f912ed6e0a4b737",
  "timestamp": "2025-05-15T03:16:48.845812"
}