{
  "id": 4800,
  "title": "Combatting Senior Scams Using a Large Language Model-Created Rubric",
  "abstract": "This paper addresses the critical issue of internet scams targeting seniors by developing a robust, Machine Learning (ML) based solution employing a Large Language Model (LLM), specifically ChatGPT, to enhance scam detection and prevention. Elderly internet users are particularly vulnerable to digital fraud due to a lack of familiarity with technological safeguards and a tendency not to report incidents. Traditional security measures often fail to accommodate the unique challenges faced by this demographic, prompting our focus on a specialized, user-friendly solution. We propose an innovative approach using ChatGPT 3.5 to analyze and score emails based on their likelihood of being scams, thus providing seniors with a tool that requires minimal interaction while offering maximum protection. This system uses a custom rubric developed through ML techniques to evaluate potential threats effectively. By integrating word embeddings and a diverse training dataset, the model adapts to the nuanced and evolving nature of scam tactics. The methodology utilized in this paper ensures that the ML model not only identifies common scam indicators but also provides actionable feedback to users, making it a practical tool for real-world applications. Preliminary results demonstrate the system's efficacy in recognizing scam emails, thereby significantly reducing the risk of financial loss among seniors and enhancing their confidence in digital communication. This paper outlines the design, implementation, and testing phases of the project, highlighting the potential of LLMs in cybersecurity, specifically in protecting a vulnerable population.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23773fc1d34d82bfa84449b4919b0fc3",
  "timestamp": "2025-05-15T02:41:00.902602"
}