{
  "id": 9049,
  "title": "Catastrophic health expenditure: A comparative analysis of smoking and non-smoking households in China",
  "abstract": "Introduction Smoking is hazardous to health and places a heavy economic burden on individuals and their families. Clearly, smoking in China is prevalent since China is the largest consumer of tobacco in the world. Chinese smoking and nonsmoking households were compared in terms of the incidence and intensity of Catastrophic Health Expenditures (CHEs). The factors associated with catastrophic health expenditures were analyzed. Methods Data for this study were collected from two waves of panel data in 2011 and 2013 from the national China Health and Retirement Longitudinal Study (CHARLS). A total of 8073 households with at least one member aged above 45 were identified each year. Catastrophic health expenditure was measured by the ratio of a household's out-of-pocket healthcare payments (OOP) to the household's Capacity to Pay (CTP). A panel logit random-effects model was used to examine correlates with catastrophic health expenditure. Results The incidence of catastrophic health expenditures for Chinese households with members aged 45 and above in 2011 and 2013 were 12.99% and 15.56%, respectively. The mean gaps (MGs) were 3.16% and 4.88%, respectively, and the mean positive gaps (MPGs) were 24.36% and 31.40%, respectively. The incidences of catastrophic health expenditures were 17.41% and 20.03% in former smoking households, 12.10% and 15.09% in current smoking households, and 12.72% and 13.64% in nonsmoking households. In the panel logit regression model analysis, former smoking households (OR = 1.444, P<0.001) were more prone to catastrophic health expenditures than nonsmoking households. Risk factors for catastrophic health expenditures included members with chronic diseases (OR = 4.359, P<0.001), hospitalized patients (OR = 8.60, P<0.001), elderly people aged above 65 (OR = 1.577, P<0.001), or persons with disabilities (OR = 1.275, P<0.001). Protective factors for catastrophic health expenditures included being in an urban household, having a larger family size, and having a higher household income. Conclusions The incidence of catastrophic health expenditures in Chinese households is relatively high. Smoking is one of the primary risk factors for catastrophic health expenditures. Stronger interventions against smoking should be made in time to reduce the occurrence of health issues caused by smoking and the financial losses for individuals, families and society.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23781cab3ae3da616bf384fe11d86c08",
  "timestamp": "2025-05-15T03:24:54.947333"
}