{
  "id": 6964,
  "title": "Effect of Chronic Low Back Pain and Post-Traumatic Stress Disorder on the Risk for Separation from the US Army",
  "abstract": "Introduction: Co-morbid post-traumatic stress disorder (PTSD) and low back pain (LBP) are common reasons for increased disability in the Veteran communities. Medical discharge from the military represents a considerable financial cost to society. Little is currently known about the impact of LBP and PTSD as longitudinal risk factors for medical discharge from Active Duty military service. Materials and Methods: A retrospective analysis of US Army Active Duty Soldiers from 2002 to 2012 was performed to determine the risk for medical discharge. Four levels of exposure for were identified as independent variables: no chronic LBP or PTSD, chronic LBP only, PTSD only, and co-morbid PTSD present with chronic LBP. Statistical analysis utilized modified Poisson regression controlling for sex, age, rank, time in service, deployment, mental health, sleep disorders, alcohol use, tobacco use, obesity, and military occupation. This study was approved by a Department of Defense Institutional Review Board. Results: After controlling for potential confounding variables, the RR for chronic LBP and PTSD independently was 3.65 (95% CI: 3.59-3.72) and 3.64 (95% CI: 3.53-3.75), respectively, and 5.17 (95% CI: 5.01-5.33) when both were present. Conclusions: This is the first study to identify a history of both chronic LBP and PTSD as substantial risk factors for medical discharge from the US Army. PTSD and chronic LBP may mutually reinforce one another and deplete active coping strategies, making Soldiers less likely to be able to continue military service. Future research should target therapies for co-morbid PTSD and chronic LBP as these conditions contribute a substantial increase in risk of medical discharge from the US Army.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "237a8f7d66235cbc3b66b5a3d8cdf488",
  "timestamp": "2025-05-15T03:03:55.671397"
}