{
  "id": 771,
  "title": "Association of Economic Policies With Hypertension Management and Control: A Systematic Review",
  "abstract": "Importance Economic policies have the potential to impact management and control of hypertension. Objectives To review the evidence on the association between economic policies and hypertension management and control among adults with hypertension in the US. Evidence Review A search was carried out of PubMed/MEDLINE, Cochrane Library, Embase, PsycINFO, CINAHL, EconLit, Sociological Abstracts, and Scopus from January 1, 2000, through November 1, 2023. Included were randomized clinical trials, difference-in-differences, and interrupted time series studies that evaluated the association of economic policies with hypertension management. Economic policies were grouped into 3 categories: insurance coverage expansion such as Medicaid expansion, cost sharing in health care such as increased drug copayments, and financial incentives for quality such as pay-for-performance. Antihypertensive treatment was measured as taking antihypertensive medications or medication adherence among those who have a hypertension diagnosis; and hypertension control, measured as blood pressure (BP) lower than 140/90 mm Hg or a reduction in BP. Evidence was extracted and synthesized through dual review of titles, abstracts, full-text articles, study quality, and policy effects. Findings In total, 31 articles were included. None of the studies examined economic policies outside of the health care system. Of these, 16 (52%) assessed policies for insurance coverage expansion, 8 (26%) evaluated policies related to patient cost sharing for prescription drugs, and 7 (22%) evaluated financial incentive programs for improving health care quality. Of the 16 studies that evaluated coverage expansion policies, all but 1 found that policies such as Medicare Part D and Medicaid expansion were associated with significant improvement in antihypertensive treatment and BP control. Among the 8 studies that examined patient cost sharing, 4 found that measures such as prior authorization and increased copayments were associated with decreased adherence to antihypertensive medication. Finally, all 7 studies evaluating financial incentives aimed at improving quality found that they were associated with improved antihypertensive treatment and BP control. Overall, most studies had a moderate or low risk of bias in their policy evaluation. Conclusions and Relevance The findings of this systematic review suggest that economic policies aimed at expanding insurance coverage or improving health care quality successfully improved medication use and BP control among US adults with hypertension. Future research is needed to investigate the potential effects of non-health care economic policies on hypertension control.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2388558f6dc910ef86fbd97195237c16",
  "timestamp": "2025-05-15T01:42:44.392748"
}