{
  "id": 6798,
  "title": "Associations between neighbourhood support and financial burden with unmet needs of head and neck cancer survivors",
  "abstract": "Purpose: To assess the unmet needs of head and neck cancer survivors and investigate associated factors. In particular, to explore whether social support (family/friends and neighbours) and financial burden are associated with unmet needs of head and neck cancer (HNC) survivors. Methods: This was a cross-sectional study of HNC survivors, with 583 respondents included in the analysis. Information was collected on unmet supportive care needs as measured by the Supportive Care Needs Survey (SCNS-SF34). Poisson regression with robust standard errors was used to examine factors associated with having one or more needs in each of the five domains (physical; psychological; sexuality; patient care and support; and health system and information). Results: The mean age of respondents was 62.9 years (standard deviation 11.3 years) and one third of respondents were female. The top ten unmet needs was composed exclusively of items from the physical and psychological domains. Financial strain due to cancer and finding it difficult to obtain practical help from a neighbour were both associated with unmet needs in each of the five domains, in the adjusted analyses. Conclusion: Whilst in each domain, a minority of respondents have unmet needs, approximately half of respondents reported at least one unmet need, with the commonest unmet needs in the psychological domain. Providing services to people with these needs should be a priority for healthcare providers. We suggest that studies, which identify risk factors for unmet needs, could be used to develop screening tools or aid in the targeting of support. (C) 2016 Elsevier Ltd. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "238aa0995c9a163777398e014ef41576",
  "timestamp": "2025-05-15T03:01:31.468226"
}