{
  "id": 3256,
  "title": "The integration of Maqasid Shariah in evaluating stablecoins and traditional cryptocurrencies for Islamic portfolios diversification",
  "abstract": "PurposeThis study aims to examine the integration of Maqasid Shariah principles in evaluating stablecoins and traditional cryptocurrencies within Islamic investment portfolios. The focus is on enhancing returns and reducing risk, providing a Shariah-compliant framework for Islamic investors.Design/methodology/approachThis study uses quantile regression and Monte Carlo simulation to analyse the diversification benefits of stablecoins (Tether [USDT] and Tether Gold [XAUT]) and traditional cryptocurrencies (Bitcoin [BTC]) across different Islamic indices by market capitalisation size from 31 December 2020 to 1 July 2024.FindingsBTC increases returns but with higher volatility, which may conflict with the principles of Islamic finance. However, when viewed from a portfolio perspective, pairing BTC with stablecoins like USDT and XAUT can provide stability and risk mitigation. This strategy aligns better with Maqasid Shariah by minimising excessive uncertainty (Gharar) and offering tangible asset backing. These strategies are particularly relevant to large-cap indices. However, the increased risk in Islamic Mid and Islamic Small portfolios suggests that the diversification benefits are less pronounced for these indices.Practical implicationsThe results offer practical insights for investors, portfolio managers, Shariah advisors and policymakers in asset allocation and risk management. Incorporating stablecoins and cryptocurrencies can optimise risk-adjusted returns in Islamic portfolios.Originality/valueTo the best of the authors knowledge, this study is the first to integrate Maqasid Shariah principles in the evaluation of stablecoins and traditional cryptocurrencies, extending the literature on Islamic finance and digital assets. This research offers empirical evidence on the performance and compliance of these assets within Islamic portfolios, providing a comprehensive framework for Shariah-compliant investment strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2391540be74ce1d9831fd55c63bd1404",
  "timestamp": "2025-05-15T01:15:26.082527"
}