{
  "id": 4803,
  "title": "Probabilistic Risk Assessment in Power Systems With High Wind Energy Penetration",
  "abstract": "Power systems are increasingly confronted with operational uncertainties. These stem from the integration of wind and solar energy sources with inherently stochastic generation behavior. The ensuing risks include power plant curtailments or grid imbalances. The deterministic approaches that currently underpin most planning have proven insufficient to manage these risks. This paper presents an alternative in the form of a data-driven probabilistic approach with direct relevance for transmission system operators. The models present a novel methodology that is independent of the common boundary conditions, e.g. case-specific models. First, we compare several data-driven algorithms and assign the forecasting task to the best-performing one. Second, the resulting forecast serves as an input for three optimal power flow (OPF) problems we tailor to the German power system. These problems minimize energy import volumes, energy import costs, and overall power losses. Third, based on the OPF results, we perform a risk assessment for operational instability, power loss, financial losses, and renewable energy waste. The results show that neural networks slightly outperform traditional machine learning algorithms in forecasting accuracy. However, linear-quadratic regulators remain attractive for their simplicity-performance ratio. Our probabilistic OPF approach can reduce power losses and identify frequency and line loading irregularities that deterministic methods do not. The data-driven approach we propose is superior to existing approaches in terms of its performance, usability, and applicability to complex power systems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23946888f5f6abf9874dcf0142071629",
  "timestamp": "2025-05-15T02:41:00.905604"
}