{
  "id": 4311,
  "title": "MECHANISM FOR NEUTRALIZING INTERNAL AND EXTERNAL THREATS TO THE FINANCIAL SECURITY",
  "abstract": "The main purpose of the article is to form a consistent and clear mechanism for neutralizing internal and external threats to financial security. Financial security at any level always implies a state of security against the impact of threats. Terms such as risk, call and danger are often used. The article establishes the essence of the concepts of financial security of higher education institution, danger, risk, challenge and threat. Classification of threats into internal and external ones is carried out, their sources and factors are identified. The methods used to assess risks, their advantages and disadvantages are defined. It is offered to carry out an estimation of risks of financial security of higher education institutions by means of SWOT-analysis and expert methods, and using point marks to establish a generalized estimation of one expert of influence of factors of strong and weak sides of activity of higher education institution on assistance to use of possibilities and protection against threats taking into account probability of their occurrence. The generalized result of activity of higher educational institutions is calculated, which showed insignificant prevalence of internal strong factors in activity of higher educational institutions on quality of educational services provided by them and provision of financial security. Weaknesses of activity of higher education institutions on which management of quality of educational services for the purpose of maintenance of financial security should be focused, and also those strong sides of activity which potential should be used for achievement of the set goal are established. Based on the results of the study, it was identified the main weaknesses that the management of the quality of educational services should pay attention to in order to ensure the financial security of higher education institutions. It is necessary to take into account that the results of this assessment are quite variable in time, because according to the circumstances may change the system of factors, and step their influence. According to the results of the analysis, the most significant factors of internal and external environment of the institution of higher education were identified, and the matrix of components of the SWOT-analysis will take shape.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23946681731d29393278de962a892ad0",
  "timestamp": "2025-05-15T02:35:26.369559"
}