{
  "id": 2373,
  "title": "Performance measurement for option portfolios in a stochastic volatility framework",
  "abstract": "Measuring the performance of stock portfolios that include options is challenging due to options' nonlinearity in the underlying, their exposure to volatility risk, and their time decay. Our contribution to the literature is twofold: First, we provide a theoretically rigorous derivation of the time-variable factor loadings in a two-factor model under stochastic volatility according to [Heston, S.L., A closed-form solution for options with stochastic volatility with applications to bond and currency options. Rev. Financ. Stud., 1993, 6, 327-343.]. Within this setting, the portfolio returns are explained by the market and an additional option factor, i.e. a portfolio of standard options exposed to volatility risk. We show that (i) any option factor is suitable to perfectly explain the portfolio behavior if simple returns are considered in instantaneous time and that (ii) the option factor's loading equals the fraction of the volatility elasticities of the portfolio and of the option factor while the option factor's underlying elasticity enters the factor loading of the underlying. Second, we analyze the behavior of option factors in practical applications, where time is discrete and factor loadings are estimated in a single regression over a certain time horizon. We show how the bias of (Jensen) alpha and its sign depend on the skewness of market returns. For several option factors from the literature, we conduct a simulation study to analyze their suitability to reduce this bias. As the results are disappointing, we propose a two-step procedure for choosing an adequate factor.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "239ca4afc91f9f45c5995c2cd9f6e459",
  "timestamp": "2025-05-15T01:06:10.777339"
}