{
  "id": 7558,
  "title": "Correlates of Susceptibility to Hepatitis B among People Who Inject Drugs in Sydney, Australia",
  "abstract": "Despite a safe, effective vaccine, hepatitis B virus (HBV) vaccination coverage remains low among people who inject drugs (PWID). Characteristics of participants screened for a trial investigating the efficacy of financial incentives in increasing vaccination completion among PWID were examined to inform targeting of vaccination programs. Recruitment occurred at two health services in inner-city Sydney that target PWID. HBV status was confirmed via serological testing, and questionnaires elicited demographic, drug use, and HBV risk data. Multinomial logistic regression was utilized to determine variables independently associated with HBV status. Of 172 participants, 64% were susceptible, 17% exposed (HBV core antibody-positive), and 19% demonstrated evidence of prior vaccination (HBV surface antibody a parts per thousand yenaEuro parts per thousand 10 mIU/ml). Compared with exposed participants, susceptible participants were significantly more likely to be aged less than 35 years and significantly less likely to be receiving current opioid substitution therapy (OST) and to test hepatitis C antibody-positive. In comparison to vaccinated participants, susceptible participants were significantly more likely to be male and significantly less likely to report daily or more frequent injecting, current OST, and prior awareness of HBV vaccine. HBV vaccination uptake could potentially be increased by targeting younger, less frequent injectors, particularly young men. In addition to expanding vaccination through OST, targeting at risk youth who are likely to have missed adolescent catch-up programs may be an important strategy to increase coverage. The lack of an association between incarceration and vaccination also suggests increasing vaccination uptake and completion in adult and juvenile correctional facilities may also be important.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23a000db66f4fdae61a558d46a23fa6e",
  "timestamp": "2025-05-15T03:09:36.980772"
}