{
  "id": 3366,
  "title": "The WALLET Study: Financial Decision Making and Key Financial Behaviors Associated with Excess Spending",
  "abstract": "ObjectivesThe Wealth Accumulation and Losses in Later life Early Cognitive Transitions (WALLET) study data was used to examine correlates with excess spending in older adults who do and do not have early memory loss.MethodsThe WALLET study collected detailed financial information from participants' primary checking account statements (n = 150). Information on participant sociodemographic, health, and disability status, memory functioning, financial decision-making, and financial literacy was also collected. Participants either had no memory problems or early memory loss. Bivariate and multiple regression analyses were conducted.ResultsThe early memory loss group had significantly higher excess spending than those with no memory loss. Financial decision-making and higher-risk financial behaviors were also linked to higher excess spending. Early memory loss was no longer statistically significant after accounting for financial stressors and resources.ConclusionsThe multidimensional nature of financial capacity assessment has long been known. The WALLET study data is unique, however, in that it demonstrates the links between excess spending with decision-making, early memory loss, and a set of specific financial behaviors.Clinical ImplicationsReal-world assessments of financial management and financial decision-making yield important information about how older adults are managing money and making key financial decisions. Checking account reviews can be used to determine excess spending.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23b97fa3dd6d3d3b0ce3aadd95096b00",
  "timestamp": "2025-05-15T02:25:40.075564"
}