{
  "id": 1222,
  "title": "Bankruptcy Prediction for Micro and Small Enterprises Using Financial, Non-Financial, Business Sector and Macroeconomic Variables: The Case of the Lithuanian Construction Sector",
  "abstract": "Credit-risk models that are designed for general application across sectors may not be suitable for the construction industry, which has unique characteristics and financial risks that require specialised modelling approaches. Moreover, advanced bankruptcy-prediction models are often used to achieve the highest accuracy in large modern datasets. Therefore, the aim of this research is the creation of enterprise-bankruptcy prediction (EBP) models for Lithuanian micro and small enterprises (MiSEs) in the construction sector. This issue is analysed based on classification models and the specific types of variable used. Firstly, four types of variable are proposed. In EBP models, financial variables substantially explain an enterprise's financial statements and performance from different perspectives. Including enterprises' non-financial, construction-sector and macroeconomic variables improves the characteristics of EBP models. The inclusion of macroeconomic variables in the model has a particularly significant impact. These findings can be of great significance to investors, creditors, policymakers and practitioners in assessing financial risks and making informed decisions. The second question is related to the classification models used. To develop the EBP models, logistic regression (LR), artificial neural networks (ANNs) and multivariate adaptive regression splines (MARS) were used. In addition, this study developed two-stage hybrid models, i.e., the LR is combined with ANNs. The findings show that two-stage hybrid models do not improve bankruptcy prediction. It cannot be argued that ANN models are more accurate in predicting bankruptcy. The MARS model demonstrates the best bankruptcy prediction, i.e., this model could be a valuable tool for stakeholders to evaluate enterprises' financial risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23c28c1e729ef8e011a78e999e3a5143",
  "timestamp": "2025-05-15T02:00:30.490397"
}