{
  "id": 8631,
  "title": "Job strain, occupation, and bladder health among women",
  "abstract": "ObjectivesLower urinary tract symptoms (LUTS) are common among employed women. An underexplored topic is whether characteristics of women's occupations may influence LUTS. The present study examined whether job strain and its individual components (psychological demands, decision latitude) were associated with greater LUTS and their impact and whether, compared to managerial and professional occupations, occupations characterized by manual labor, sales, service, nursing, and teaching were associated with greater LUTS and their impact.MethodsCoronary Artery Risk Development in Young Adults cohort study data were analyzed. Job strain and occupation were assessed in 1987-88 and 1995-96. In 2012-13, LUTS and their impact were assessed. LUTS/impact category (a composite variable ranging from bladder health to mild, moderate, and severe LUTS/impact) was regressed on job strain and occupation in separate analyses, adjusting for age, race, parity, education, and financial hardship (n = 1006).ResultsJob strain and its individual components were not associated with LUTS/impact. In comparison to managerial and professional occupations, service occupations in 1987-88 and 1995-96 were both associated with greater odds of LUTS/impact in proportional odds logistic regression analyses. Employment as a nurse, health assistant, or health aide in 1995-96 was associated with greater odds of any LUTS/impact versus bladder health. Support positions in 1987-88 and sales positions in 1995-96 were associated with greater odds of moderate or severe LUTS/impact versus bladder health or mild LUTS/impact.ConclusionsFuture research should examine characteristics of workplaces that may promote or constrain bladder health (e.g., time and autonomy to void when desired, infrastructure to void).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23e0dd48741579b110aa8be86997bf18",
  "timestamp": "2025-05-15T03:20:55.873268"
}