{
  "id": 8334,
  "title": "Cost analysis of intubation-related tracheal injury using a national database",
  "abstract": "OBJECTIVE: To perform risk analysis of tracheal injuries caused by endotracheal intubation (ETI) and to estimate the financial impact of these sequelae. STUDY DESIGN: Cost analysis using a national database. SETTINGS: The Agency for Healthcare Research and Quality (AHRQ) 2006 National Inpatient Sample. SUBJECTS AND METHODS: We identified clinical manifestations and treatments of complications associated with endotracheal tubes and codified them into International Classification of Disease-ninth revision diagnosis and procedure codes, intentionally excluding alternative etiologies of tracheal injury. Using the AHRQ 2006 National inpatient Sample, we then compared patients with tracheal injury coded during the medical or surgical stay for length of stay (LOS) and mean hospital cost with diagnosis-related group (DRG)-matched controls; we also examined re-admissions treating tracheal injury. RESULTS: Tracheal injury presents as tracheal stenosis, tracheomalacia, tracheoesophageal fistula, laryngotracheal ulceration, and vocal cord paralysis. A total of 3232 discharge records met criteria for tracheal injury from ETI within the index hospital stay. Average LOS for patients with tracheal injury (6.3 days; 95% confidence interval [CI] 6.0-6.3) exceeded LOS in the uncomplicated sample (5.2 days; CI 5.1-5.3) by 1.1 days. The average hospital cost was $1888 higher with tracheal injury ($10,375 [CI $9762-$10,988] vs $8487 [CI $8266-$8669]). LOS for procedures treating prior tracheal injury averaged 4.7 days and cost an average of $11,025 per discharge. CONCLUSION: Tracheal injury from ETI is associated with a significant increase in healthcare costs that accrue both during the index admission and during subsequent hospitalizations required to treat the injury. (C) 2010 American Academy of Otolaryngology-Head and Neck Surgery Foundation. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23f579732b6cdde732dc64ee0a4eaa5b",
  "timestamp": "2025-05-15T03:17:49.132498"
}