{
  "id": 3872,
  "title": "Risk Tolerance in Investment Decisions: Are Personality Traits the Real Triggers?",
  "abstract": "Purpose: Investment decisions of investors are strongly influenced by their risk tolerance. Previous research suggests that risk tolerance is influenced by various social, economic, demographic and psychological factors. This research aims to extend the investigative line of inquiry regarding the influence of one such psychological factor, that is, personality, on the risk tolerance of small investors without limiting their asset class or classifying them into any groups. Design/Methodology/Approach: A quantitative research method is used to measure personality traits and risk tolerance in the investment decisions of small investors in Kashmir. The study uses a structured questionnaire adopted in parts from various established scales to collect data from small investors. Correlations and multiple regression have been used to arrive at the results. Findings: Results of the study indicated that extrovert and open-to-experience individuals showed tolerance to risk. In contrast, conscientious, neurotic and agreeable individuals were risk-averse in the geographical location considered for this study. The results imply that financial advisors must consider the personality traits of investors when giving investment advice to small investors. Practical Implications: It becomes essential for financial planners and advisors to follow an investor-centric approach wherein they consider the personal characteristics of individuals when giving investment advice, and they must design the portfolios/investment avenues according to the investors' personalities. The results of this study show that investors with different characters have different risk-taking capabilities, and a particular investor will feel comfortable investing in a specific risk-class asset. Originality/Value: There is no study or research about the influence of personality traits on risk tolerance in investment decisions in this particular geographical area, that is, Kashmir. Therefore, this study will contribute significantly towards understanding investor behaviour and help financial advisors and investment bankers suggest appropriate investment avenues.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "23f628e0e56c90ec83cac4505fff5d5f",
  "timestamp": "2025-05-15T02:30:58.205477"
}