{
  "id": 7226,
  "title": "Predictors of gambling and problem gambling in Canada",
  "abstract": "Objectives The purpose of this study is to provide an updated profile of gamblers and problem gamblers in Canada and to identify characteristics most strongly associated with problem gambling. Methods An assessment of gambling participation and problem gambling was included in the 2018 Canadian Community Health Survey and administered to 23,952 individuals 18 years and older. Descriptive statistics provided a demographic profile for each type of gambling involvement as well as category of gambler (non-gambler, non-problem gambler, at-risk gambler, problem gambler). A logistic regression identified characteristics that best distinguished problem from non-problem gamblers. Results Gambling participation and problem gambling both varied as a function of gender, income, educational attainment, and race/ethnicity. However, multivariate analysis identified electronic gambling machine (EGM) participation to be the primary predictor of problem gambling status, with race/ethnicity, presence of a mood disorder, male gender, casino table game participation, older age, a greater level of smoking, participation in speculative financial activity, instant lottery participation, lower household income, and lottery or raffle ticket participation providing additional predictive power. Provincial EGM density and EGM participation rates are also very strong predictors of provincial rates of at-risk and problem gambling. Conclusion Problem gambling has a biopsychosocial etiology, determined by personal vulnerability factors combined with the presence of riskier types of gambling such as EGMs. Effective prevention requires a multifaceted approach, but constraints on the availability and operation of EGMs would likely have the greatest single public health benefit.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "240a9c1dafc02263179c3d312494806b",
  "timestamp": "2025-05-15T03:06:35.341363"
}