{
  "id": 544,
  "title": "A hybrid texture analysis system based on non-linear & oriented kernels, particle swarm optimization, and kNN vs. support vector machines",
  "abstract": "The presented work reports on the progress of our methodology and framework for automated image processing and analysis system design for industrial vision application. We focus on the important task of automated texture analysis, which is an essential component of automated quality-control systems. In this context, the portfolio of texture operators and assessment methods has been enlarged. Optimized operator parameterization is investigated using particle swarm optimization (PSO). A particular goal of this work is the investigation of support vector machines (SVM) as alternative assessment method for the operator parameter optimization, incorporating the efficient inclusion of SVM parameter settings in this optimization. Methods of the enhanced portfolio were applied employing benchmark textures, real application data from leather inspection, and synthetic textures including defects, specially designed to industrial needs. The key results of our work are that SVM is a highly esteemed and powerful assessment and classification method and parameter optimization, based, e.g., on SVM/PSO of standard and proprietary texture operators boosted performance in all cases. However, the appropriateness of a certain operator proved to be highly data-dependent, which advocates our methodology even more. Thus, the operator selection has been included and investigated for the synthetic textures. Summarising, our work provides a generic texture analysis system, even for unskilled users, that is automatically configured to the application. The method portfolio will be enlarged in future work.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "240c2907711b20722cc03b6feeef91e5",
  "timestamp": "2025-05-15T00:45:01.248620"
}