{
  "id": 2150,
  "title": "Comprehensive Assessment of Logistics Financial Risk in Port Regional Supply Chain",
  "abstract": "Under the information environment, in order to reduce the financial risk of port regional supply chain logistics, a comprehensive risk assessment model of port regional supply chain logistics based on fuzzy statistical association rules is proposed, and the big data distribution model of port regional supply chain logistics financial statistics is constructed by using financial accounting big data information sampling method. The sampled financial data are analyzed by standard F statistical analysis method, the objective function of comprehensive evaluation of logistics financial risk in port regional supply chain is established, the fuzzy control constraint method is used to carry out comprehensive risk assessment and forecast, and the logarithmic likelihood value and regression standard deviation of logistics financial risk in port regional supply chain are estimated. According to the estimated results of risk probability density, the risk of stagnant debt and bad debt is predicted. Realize the accurate prediction and evaluation of logistics financial risk in port regional supply chain. The results of empirical analysis show that this method has high accuracy and statistics, which improves the probability confidence level of comprehensive risk assessment of port regional supply chain logistics. The empirical analysis results show that the comprehensive evaluation of port supply chain logistics financial risk is accurate and the statistics of probability distribution area is strong, which improves the probability confidence level of risk comprehensive assessment.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "241ae2a5a8d011c3be585da9faeea54e",
  "timestamp": "2025-05-15T02:11:40.609933"
}