{
  "id": 6358,
  "title": "The association between intimate partner violence and multiple partner fertility among Colombian women",
  "abstract": "Objective This study assessed the relationship between multiple partner fertility (MPF) and intimate partner violence (IPV) and whether such relationship differed by children's age. Background IPV negatively impacts the well-being of women and children. Some risk factors for IPV, such as financial insecurity and young age, have been identified. Much less is known about the extent to which MPF, an increasingly common experience for women in a wide range of countries, is associated with an increased risk of IPV. Method We used data of mothers with at least two children from the Colombian 2015 Demographic and Health Surveys (N = 16,621). We estimated a series of logistic regression models to examine the association between MPF and IPV; our models controlled for various measures of mothers' and households' characteristics. Results The prevalence of IPV was higher among mothers with MPF than mothers with single partner fertility (SPF). MPF was associated with an increased risk of IPV, but this relationship was only significant for younger mothers (aged 25-29 years). The association between MPF and IPV did not differ by the age of the youngest child. Conclusion Younger mothers with MPF are at a higher risk of experiencing IPV than younger mothers with SPF. Implications IPV programming would benefit from targeted interventions aimed at young mothers with MPF and their children. More research exploring the dynamics of family complexity and IPV is needed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "241cfc957b77f1a8eac8da4ac248c4df",
  "timestamp": "2025-05-15T02:57:07.791905"
}