{
  "id": 3918,
  "title": "Characteristics of Oncology Clinical Trials Insights From a Systematic Analysis of ClinicalTrials.gov",
  "abstract": "Importance: Clinical trials are essential to cancer care, and data about the current state of research in oncology are needed to develop benchmarks and set the stage for improvement. Objective: To perform a comprehensive analysis of the national oncology clinical research portfolio. Design: All interventional clinical studies registered on ClinicalTrials.gov between October 2007 and September 2010 were identified using Medical Subject Heading terms and submitted conditions. They were reviewed to validate classification, subcategorized by cancer type, and stratified by design characteristics to facilitate comparison across cancer types and with other specialties. Results: Of 40 970 interventional studies registered between October 2007 and September 2010, a total of 8942 (21.8%) focused on oncology. Compared with other specialties, oncology trials were more likely to be single arm 62.3% vs 23.8%; P < .001), open label (87.8% vs 47.3%; P < .001), and nonrandomized (63.9% vs 22.7%; P < .001). There was moderate but significant correlation between number of trials conducted by cancer type and associated incidence and mortality (Spearman rank correlation coefficient, 0.56 [P=. 04] and 0.77 [P=.001], respectively). More than one-third of all oncology trials were conducted solely outside North America. Conclusions and Relevance: There are significant variations between clinical trials in oncology and other diseases, as well as among trials within oncology. The differences must be better understood to improve both the impact of cancer research on clinical practice and the use of constrained resources.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2430b1a4375e880fa07134b06825224d",
  "timestamp": "2025-05-15T01:22:11.866739"
}