{
  "id": 2526,
  "title": "The medical and societal impact of big data analytics and artificial intelligence applications in combating pandemics: A review focused on Covid-19",
  "abstract": "With Covid-19 impacting communities in different ways, research has increasingly turned to big data analytics (BDA) and artificial intelligence (AI) tools to track and monitor the virus's spread and its effect on humanity and the global economy. The purpose of this study is to conduct an in-depth literature review to identify how BDA and AI were involved in the management of Covid-19 (while considering diversity, equity, and inclusion (DEI)). The rigorous search resulted in a portfolio of 607 articles, retrieved from the Web of Science database, where content analysis has been conducted. This study identifies the BDA and AI applications developed to deal with the initial Covid-19 outbreak and the containment of the pandemic, along with their benefits for the social good. Moreover, this study reveals the DEI challenges related to these applications, ways to mitigate the concerns, and how to develop viable techniques to deal with similar crises in the future. The article pool recognized the high presence of machine learning (ML) and the role of mobile technology, social media and telemedicine in the use of BDA and AI during Covid-19. This study offers a collective insight into many of the key issues and underlying complexities affecting public health and society from Covid-19, and the solutions offered from information systems and technological perspectives.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2432b6ff59634db7f9892cf5fb445498",
  "timestamp": "2025-05-15T01:07:35.766809"
}