{
  "id": 4888,
  "title": "Association of Social and Behavioral Risk Factors With Mortality Among US Veterans With COVID-19",
  "abstract": "IMPORTANCE The US Department of Veterans Affairs (VA) offers programs that reduce barriers to care for veterans and those with housing instability, poverty, and substance use disorder. In this setting, however, the role that social and behavioral risk factors play in COVID-19 outcomes is unclear. OBJECTIVE To examine whether social and behavioral risk factors were associated with mortality among US veterans with COVID-19 and whether this association might be modified by race/ethnicity. DESIGN, SETTING, AND PARTICIPANTS This cohort study obtained data from the VA Corporate DataWarehouse to form a cohort of veterans who received a positive COVID-19 test result between March 2 and September 30, 2020, in a VA health care facility. All veterans who met the inclusion criteria were eligible to participate in the study, and participants were followed up for 30 days after the first SARS-CoV-2 or COVID-19 diagnosis. The final follow-up date was October 31, 2020. EXPOSURES Social risk factors included housing problems and financial hardship. Behavioral risk factors included current tobacco use, alcohol use, and substance use. MAIN OUTCOMES AND MEASURES The primary outcome was all-cause mortality in the 30-day period after the SARS-CoV-2 or COVID-19 diagnosis date. Multivariable logistic regressionwas used to estimate odds ratios, clustering for health care facilities and adjusting for age, sex, race, ethnicity, marital status, clinical factors, and month of COVID-19 diagnosis. RESULTS Among 27 640 veterans with COVID-19 who were included in the analysis, 24 496 were men (88.6%) and the mean (SD) age was 57.2 (16.6) years. A total of 3090 veterans (11.2%) had housing problems, 4450 (16.1%) had financial hardship, 5358 (19.4%) used alcohol, and 3569 (12.9%) reported substance use. Hospitalization occurred in 7663 veterans (27.7%), and 1230 veterans (4.5%) died. Housing problems (adjusted odds ratio [AOR], 0.96; 95% CI, 0.77-1.19; P = .70), financial hardship (AOR, 1.13; 95% CI, 0.97-1.31; P = .11), alcohol use (AOR, 0.82; 95% CI, 0.68-1.01; P = .06), current tobacco use (AOR, 0.85; 95% CI, 0.68-1.06; P = .14), and substance use (AOR, 0.90; 95% CI, 0.71-1.15; P = .41) were not associated with higher mortality. Interaction analyses by race/ethnicity did not find associations between mortality and social and behavioral risk factors. CONCLUSIONS AND RELEVANCE Results of this study showed that, in an integrated health system such as the VA, social and behavioral risk factors were not associated with mortality from COVID-19. Further research is needed to substantiate the potential of an integrated health system to be a model of support services for households with COVID-19 and populations who are at risk for the disease.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2446aa834cbeb0e9e1a02f7a52c03d93",
  "timestamp": "2025-05-15T02:42:04.869645"
}