{
  "id": 5559,
  "title": "Analysis of the status and associated factors of stigma in patients undergoing maintenance hemodialysis",
  "abstract": "This cross-sectional survey assessed the status and the associated factors of stigma among patients undergoing maintenance hemodialysis (MHD). 154 MHD patients were enrolled. General information was collected. The Social Impact Scale, the Generalized Anxiety Disorder-7 Scale, the Patient Health Questionnaire-9, the Perceived Social Support Scale, and the Barthel Index Scale were used for data collection. These patients had an average age of 60.89 years, with 76 (49.4%) male patients, and an average hemodialysis duration of 8.35 years. The total score of stigma was 58.11 +/- 9.22, with the highest score in the social rejection dimension (19.03 +/- 3.93) and the lowest score in the financial insecurity dimension (7.95 +/- 1.87). Univariate analysis showed that there were significant differences in stigma in terms of self-perceived financial burden (p = 0.001), history of falls in the past year (p = 0.004), and different hemodialysis durations (p = 0.042). Pearson correlation analysis revealed that the total score of stigma was positively correlated with the total scores of anxiety and depression, negatively correlated with the total score of social support, and not correlated with the total score of activities of daily living. Multivariate lin ear regression analysis indicated that selfperceived financial burden, a history of falls in the past year, and anxiety were significant factors associated with stigma. Collectively, the stigma in MHD patients is closely related to self-perceived financial burden, history of falls in the past year, and total anxiety score, suggesting that intervention strate gies should be enhanced based on these risk factors. Our findings may guide the intervention of stigma in this population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2447c92990c2fa7c7d948f5642a145a2",
  "timestamp": "2025-05-15T02:48:51.404497"
}