{
  "id": 7498,
  "title": "Preventing Endoscopy Clinic No-Shows: Prospective Validation of a Predictive Overbooking Model",
  "abstract": "OBJECTIVES: Patient absenteeism for scheduled visits and procedures (no-show) occurs frequently in healthcare systems worldwide, resulting in treatment delays and financial loss. To address this problem, we validated a predictive overbooking system that identifies patients at high risk for missing scheduled gastrointestinal endoscopy procedures (no-shows and cancellations), and offers their appointments to other patients on short notice. METHODS: We prospectively tested a predictive overbooking system at a Veterans Administration outpatient endoscopy clinic over a 34-week period, alternating between traditional booking and predictive overbooking methods. For the latter, we assigned a no-show risk score to each scheduled patient, utilizing a previously developed logistic regression model built with electronic health record data. To compare booking methods, we measured service utilization-defined as the percentage of daily total clinic capacity occupied by patients-and length of clinic workday. RESULTS: Compared to typical booking, predictive overbooking resulted in nearly all appointment slots being filled-2.5 slots available during control weeks vs. 0.35 slots during intervention weeks, t(161)=4.10, P=0.0001. Service utilization increased from 86% during control weeks to 100% during intervention weeks, allowing 111 additional patients to undergo procedures. Physician and staff overages were more common during intervention weeks, but less than anticipated (workday length of 7.84h (control) vs. 8.31h (intervention), t(161)=2.28, P=0.02). CONCLUSIONS: Predictive overbooking may be used to maximize endoscopy scheduling. Future research should focus on adapting the model for use in primary care and specialty clinics.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24562f578458e2f4ee971c3c31295d75",
  "timestamp": "2025-05-15T03:09:07.336921"
}