{
  "id": 6259,
  "title": "Prevalence of depression and anxiety symptoms and their influence factors during menopausal transition and postmenopause in Beijing city",
  "abstract": "Objective: To investigate the prevalence of depression and anxiety symptoms and their influence factors in women during menopausal transition and postmenopause. Methods: A cross-sectional investigation was conducted with a composed questionnaire on general conditions, social support scoring, the Zung self-evaluating depression and anxiety scoring. All of the Parameters were input into a database and analyzed with t-test, chi(2) and logistic regression using SPSS. Results: A total of 1280 women aged 45-59 in Beijing city were interviewed with the questionnaire mentioned above. The prevalence of depression symptoms and anxiety in these women was 306 (23.9%) and 131 (10.2%), respectively. Risk factors associated with depression included strait financial status, social Support, dyspareunia and dry vagina, hot flashes and sweating, satisfaction with family, children fail college or job and divorced or separated. Risk factors associated with anxiety included history of premenstrual dysphoric disorder (PMDD), hot Hashes, vaginal dryness or dyspareunia and some negative life events. Conclusions: Depression and anxiety were common symptoms in Chinese women during menopausal transition and postmenopause. Some psycho-social factors may play a role in the Prevalence of them. (C) 2008 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24600b21bc300203853c6cea92609c92",
  "timestamp": "2025-05-15T02:56:11.061748"
}