{
  "id": 5510,
  "title": "LIQUID ASSETS IN BANKING: WHAT MATTERS IN THE VISEGRAD COUNTRIES?",
  "abstract": "The recent financial crisis has shown that a liquidity risk plays an important role in the current developed financial system. Some Hungarian and Polish banks suffered liquidity problems, too. This paper therefore aims to describe development of liquid asset ratio and to find out determinants which affect their values in the Visegrad countries. The data cover the period from 2000 to 2011. Liquidity of Czech banks declined in 2000-2009 (due to higher lending activity and decrease of balances with central banks and other banks) but it has improved during last two years. Liquidity of Slovak banks has decreased in 2009 and 2010 due to impact of financial crisis on some economic sectors and due to changes in interbank market transactions. Very similar is the development of liquid asset ratio in Hungary and Poland where it has gone down during last five years due to important structural weaknesses such as very high loan-to-deposit ratio, high share of foreign debts, and negative net position in the interbank market. Furthermore, we focus on determinants of liquid asset ratio. Results of the panel data regression analysis showed that the liquid asset ratio is mostly influenced by the size of the bank, its capital adequacy and profitability. Also overall macroeconomic conditions, such as growth rate of gross domestic product, the existence of financial crisis, exchange rate or rate of unemployment and the development of interest rates (both on loans and interbank transaction) are important. Although the Visegrad countries have a lot in common, different factors determined liquid asset ratio in individual countries and also the direction of influence of some factors may differ.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "246463c9f138b97b1bfe3ec00d0cf6db",
  "timestamp": "2025-05-15T02:48:23.838671"
}