{
  "id": 5932,
  "title": "Suicidal risk factors in major affective disorders",
  "abstract": "Background Rates and risk factors for suicidal behaviour require updating and comparisons among mood disorders. Aims To identify factors associated with suicidal risk in major mood disorders. Method We considered risk factors before, during and after intake assessments of 3284 adults with/without suicidal acts, overall and with bipolar disorder (BD) versus major depressive disorder (MDD), using bivariate comparisons, multivariable regression modelling and receiver operating characteristic (ROC) analysis. Results Suicidal prevalence was greater in BD versus MDD: ideation, 29.2 versus 17.3%; attempts, 18.8 versus 4.78%; suicide, 1.73 versus 0.48%; attempts/suicide ratio indicated similar lethality, 10.9 versus 9.96. Suicidal acts were associated with familial BD or suicide, being divorced/unmarried, fewer children, early abuse/trauma, unemployment, younger onset, longer illness, more dysthymic or cyclothymic temperament, attention-deficit hyperactivity disorder (ADHD), substance misuse, mixed features, hospital admission, percentage time unwell, less antidepressants and more antipsychotics and mood stabilisers. Logistic regression found five independent factors: hospital admission, more depression at intake, BD diagnosis, onset age <= 25 years and mixed features. These factors were more associated with suicidal acts in BD than MDD: percentage time depressed/ill, alcohol misuse, >4 pre-intake depressions, more dysthymic/cyclothymic temperament and prior abuse/trauma. ADHD and total years ill were similar in BD and MDD; other factors were more associated with MDD. By ROC analysis, area under the curve was 71.3%, with optimal sensitivity (76%) and specificity (55%) with any two factors. Conclusions Suicidal risks were high in mood disorders: ideation was highest with BD type II, attempts and suicides (especially violent) with BD type I. Several risk factors for suicidal acts differed between BD versus MDD patients. Declaration of interest No author or immediate family member has financial relationships with commercial entities that might appear to represent potential conflicts of interest with the information presented.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2499577228d7f7b2716bf0c9c4a25afd",
  "timestamp": "2025-05-15T02:53:03.071617"
}