{
  "id": 5783,
  "title": "Lack of Workplace Support for Obstetric Health Concerns is Associated With Major Pregnancy Complications A National Study of US Female Surgeons",
  "abstract": "Objective: We sought to assess whether lack of workplace support for clinical work reductions during pregnancy was associated with major pregnancy complications. Background: Surgeons are at high risk of major pregnancy complications. Although rigorous operative schedules pose increased risk, few reduce their clinical duties during pregnancy. Methods: An electronic survey was distributed to US surgeons who had at least 1 live birth. Lack of workplace support was defined as: (1) desiring but feeling unable to reduce clinical duties during pregnancy due to failure of the workplace/training program to accommodate and/or concerns about financial penalties, burden on colleagues, requirement to make up missed call, being perceived as weak; (2) disagreeing colleagues and/or leadership were supportive of obstetrician-prescribed bedrest. Multivariate logistic regression determined the association between lack of workplace support and major pregnancy complications. Results: Of 671 surgeons, 437 (65.13%) reported lack of workplace support during pregnancy and 302 (45.01%) experienced major pregnancy complications. Surgeons without workplace support were at higher risk of major pregnancy complications than those who had workplace support (odds ratio: 2.44; 95% confidence interval: 1.58-3.75). Bedrest was prescribed to 110/671 (16.39%) surgeons, 38 (34.55%) of whom disagreed that colleagues and/or leadership were supportive. Of the remaining surgeons, 417/560 (74.5%) desired work reductions but were deterred by lack of workplace support. Conclusions: Lack of workplace support for reduction in clinical duties is associated with adverse obstetric outcomes for surgeons. This is a modifiable workplace obstacle that deters surgeons from acting to optimize their infant's and their own health. To ensure the health of expectant surgeons, departmental policies should support reduction of clinical workload in an equitable manner without creating financial penalties, requiring payback for missed call duties, or overburdening colleagues.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24a38188be73b55e1b3bbd0cea6996a9",
  "timestamp": "2025-05-15T02:51:30.030073"
}