{
  "id": 7538,
  "title": "Emotion regulation in emerging adult gamblers and its mediating role with depressive symptomology",
  "abstract": "Background: It is presently estimated that as much as 10% of emerging adults are at risk for a gambling disorder. The consequences stemming from problematic gambling engagement include increased substance use, mental health disorders, suicidality, financial strain and legal issues. The present study explores whether deficits in emotion regulation explain the association between problem gambling severity and depression. Methods: A sample of 820 emerging adult gamblers (M-age = 21.14 years-old, SD = 2.90, 50.9% female) completed an online survey including an assessment of problematic engagement in gambling over the past year, levels of anxious/depressive symptomology, and difficulties in emotion regulation. In total, 15.6% and 8.2% of this sample were at moderate or high risk for gambling disorder. Results: Results from a linear regression model revealed that difficulties with impulse control positively contributed to problem gambling scores and engagement in goal-directed behavior positively contributed to problem gambling scores, even after accounting for symptoms of depression. Moreover, results from a mediation model revealed that the association between problem gambling and depression was explained by participants' deficits in non-acceptance, goals, strategies, and clarity. Limitations: Limitations include the use of self-report and cross-sectional data making it difficult to infer causality. Conclusions: These findings add to our understanding of the mechanisms that appear to explain for the first time the affective consequences of problem gambling. Enhancing specific dimensions of emotion regulation will allow for tailored interventions among gamblers with depression, ultimately achieving better mental health outcomes.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24a40162bcbd564c5394e5b47e84c4f0",
  "timestamp": "2025-05-15T03:09:36.915552"
}