{
  "id": 7022,
  "title": "WELL-BEING AND ITS SELECTED PSYCHOSOCIAL AND BEHAVIOURAL VARIABLES IN A SAMPLE OF NURSES",
  "abstract": "Objectives. The presented paper is focused on the issue of well-being, which is considered as one of the most important sources of the quality of life. The concept of well-being is understood as the combination of feeling good and functioning effectively, and paper is related to the specific features of the sense of personal well-being and satisfaction with life in a sample of Czech nurses, the largest group in health care that is active in all aspects of the health care system. Sample and setting. A sample of 337 (mostly) Czech nurses (average age 34 years) has been surveyed with a set of questionnaires (Satisfaction with Life Scale, Anamnesis questionnaire; Social Readjustment Rating Scale; a list of stressful items and ways of coping with stress). Research questions and hypotheses. It was supposed that the most important stressors for nurses are overburdening, tiredness and low level of financial compensation. The majority of the sample of nurses will show the high-risk level of life events score. The substance of the influence of stressors on our sample of nurses is connected with the influence of age and life events. Statistical analysis. Correlation analysis, factor, and regression analysis were employed. Results. Results show a considerably wide scope of stressors that were considered important by our sample of nurses. Stressors from the area of interpersonal relationships, inadequate financial assessment, large work load (or more precisely overburdening) and tiredness connected with it were discovered. As for the results dealing with the sphere of life events, it is obvious that more than one half of the studied sample (55.5 %) show non-risk dynamics of life, filled by life events within the frame of the evaluated period of twelve months and with a resulting score up to 150 points, but 16.2 % nurses fall into the range from 150 - 199 pofints, 19.2 % into the range from 200 - 299 points, which is a very high level, showing the demanding level of lie dynamics of almost one fifth of the studied sample, and 9.1 % of nurses shows the level of this dynamics even in the range over 300 points. The results of further statistical procedures (factor and regression analyses) showed that nurses within our sample are extremely demanding, both from the point of view of the distribution of stressors that are connected with their work, and from the point of view of mutual relations between the influence of stressors, age and life events. Study limitations. The results of the study are restricted by the scope of the studied sample, its demographic features, but also by the methods used.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24a9a9ee06bb358da1e542534354da95",
  "timestamp": "2025-05-15T03:04:22.986052"
}