{
  "id": 4234,
  "title": "Downside risk analysis of returns on the Karachi Stock Exchange",
  "abstract": "Purpose - The purpose of this paper is to analyze the mean-variance capital asset pricing model (CAPM) and downside risk-based CAPM (DR-CAPM) developed by Bawa and Lindenberg (1977), Harlow and Rao (1989), and Estrada (2002) to assess which downside beta better explains expected stock returns. The paper also explores whether investors respond differently to stocks that co-vary with declining market than to those of co-vary with rising market. Design/methodology/approach - The paper uses monthly data of closing prices of stocks listed at the Karachi Stock Exchange (KSE). The data cover the period from January 2000 to December 2012. The standard, downside, and upside betas are estimated for different sub-periods, and then, their validity to quantify the risk premium is tested for subsequent sub-periods in a cross sectional regression framework. Though our empirical methodology is similar to that of Fama and MacBeth (1973) for testing the CAPM and the DR-CAPM, our approach to estimate the downside beta is different from earlier studies. In particular, we follow Estrada's (2002) suggestions and obtain the correct and unbiased estimation of the downside beta by running the time series regression through origin. The authors carry out the two-pass regression analysis using the generalized method of moment (GMM) in the first pass and the generalized least squares (GLS) estimation method in the second pass. Findings - The results indicate that the mean-variance CAPM shows a negative risk premium for monthly returns of selected stocks. However, the results for the DR-CAPM of Bawa and Lindenberg (1977) and Harlow and Rao (1989) provide evidence of a positive risk premium for the downside beta. In contrast, the DR-CAPM of Estrada (2002) shows a negative risk premium in some sub-periods while the positive premium in the others. By comparing the risk premium for both downside and upside risks in a single-equation framework, the authors show that the stocks that co-vary with a declining market are compensated with a positive premium for bearing the downside risk. Yet, the risk premium for stocks that are negatively correlated with declining market returns is negative for all the three-downside betas in all the examined sub- periods. Practical implications - The empirical findings of the paper are of great significance for investors for designing effective investment strategies. Specifically, the results help investors to identify an appropriate measure of risk and to construct well-diversified portfolio. The results are also useful for firm managers in capital budgeting decision-making process as they enable them to cost equities appropriately. The results also suggest that the risk-return relationship implied by mean-variance CAPM is negative and therefore this model is not suitable for gauging the risk associated with stocks traded in KSE. Yet, the authors show that DR-CAPM out performs in quantifying the risk premium. Originality/value - Unlike prior empirical studies, the authors follow Estrada's (2002) suggestions where downside beta is calculated using regression through origin to find correct and unbiased beta. Departing from the existing literature the authors estimate three different versions of DR- CAPM along with the standard CAPM for comparison purpose. Finally, the authors apply sophisticated econometrics methods that help in lessening the problem of non-synchronous trading and the issue of non-normality of returns distribution.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24b332d50529381b14d4efee799bc4be",
  "timestamp": "2025-05-15T01:24:51.540652"
}