{
  "id": 2840,
  "title": "Fund Price Analysis Using Convolutional Neural Networks for Multiple Variables",
  "abstract": "Investing in funds has the effect of indirectly employing asset management professionals with specialized knowledge and experience, which can result in a diversified investment through the use of a portfolio. In this study, we focus on learning the patterns of prices rather than time points to predict Korean fund prices. We convert time-series data into 2-dimensional images and analyze them using a convolutional neural network. To improve the fund price forecasting performance, we consider the following aspects. A Korean fund should be recommended according to the level of risk aversion. The risk level of the fund is determined by the proportion of risky assets. Therefore, when estimating the fund price, the risk level of the fund needs to be considered. In this study, we use 15 additional variables, such as foreign stock indexes, foreign exchange rates, and Korean stock indices, in addition to the fund price data. The appropriate filter size, which plays an important role in this process, is proposed. In addition, types of networks and architectures are selected as suitable for forecasting the fund price. We also demonstrate that the number of output classes can be adjusted to increase the future return of the fund. Through this methodology with multiple variables, we can achieve a 25% cumulative profit for 2 years. This means that multi-variable models have a higher cumulative return than the single-variable model and KOSPI and thus a higher average of all funds for active investors.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24b65204768c20622fb337cbebc3d4b1",
  "timestamp": "2025-05-15T01:11:17.263444"
}