{
  "id": 7466,
  "title": "The Association Between Filial Discrepancy and Depressive Symptoms: Findings From a Community-Dwelling Chinese Aging Population",
  "abstract": "Background: The relationship between filial piety and depressive symptoms has been widely discussed, but limited research focused on the gap between filial expectations and filial receipt. This study aims to investigate the association between filial discrepancy and depressive symptoms. Methods: Data were derived from the Population Study of Chinese Elderly (PINE), a community-engaged, population-based epidemiological study of U.S. Chinese older adults aged 60 and older in the greater Chicago area. Depressive symptoms were measured by the Patient Health Questionnaire-9. Overall filial discrepancy was evaluated by filial receipt minus expectations. Levels of overall filial discrepancy divided older adults into four groups based on the medium value of filial expectations and receipt. Logistic regression analyses were performed. Results: Older adults with greater filial receipt than expectations were more likely to have lower risk of depressive symptoms (odds ratio [OR], 0.95 [0.92-0.97]). The group with high expectations and low receipt has the highest risk of depressive symptoms among the four groups (OR, 1.51 [1.07-2.13]). Greater receipt than expectations in care (OR, 0.83 [0.76-0.92]), make happy (OR, 0.77 [0.69-0.86]), greet (OR, 0.88 [0.79-0.97]), obey (OR, 0.76 [0.68-0.86]), and financial support (OR, 0.80 [0.71-0.89]) was associated with lower risk of depressive symptoms. Conclusions: This study goes beyond previous research by examining the association between filial discrepancy domains and depressive symptoms. Cultural relevancy of health interventions is important in the context of Chinese communities. Health care professionals are suggested to be aware of the depressive symptoms of U.S. Chinese older adults with high filial expectations and low receipt.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24b924cf532545a558e7155393815566",
  "timestamp": "2025-05-15T03:09:07.217146"
}