{
  "id": 8811,
  "title": "Hepatitis B virus: Prevalence, vaccination coverage and immune responses to immunization among healthcare workers at Muhimbili National Hospital",
  "abstract": "Background Healthcare workers (HCWs) are at an increased risk of contracting and transmitting the hepatitis B virus (HBV). Vaccination coverage against HBV a cost- effective prevention, remains low among HCWs in some settings. Objective To determine the prevalence of HBV infection, vaccination coverage, and immune responses to HBV vaccine among HCWs at Muhimbili National Hospital (MNH) in Dar es Salaam. Methodology This cross-sectional study used a proportional probability systematic sampling to recruit HCWs from MNH in Dar es Salaam. A structured questionnaire was used to collect social demographic characteristics, infection prevention and control practices, HBV vaccination status and reasons for not vaccinating. Five mLs of a peripheral venous sample was obtained from each participant, the sample was used to test for HBV surface antigen, HBV surface antibody and HBV core antibody for assessing for infection, and vaccine immunity respectively. A Robust Poisson Regression analysis was used to assess factors associated with not vaccinating. Results The prevalence of HBV infection was 5 (1.2%) among the 415 recruited HCWs. Only 192 (46.3%) HCWs were vaccinated and 169 (96%) had protective immunity against HBV infection among 176 participants who had received at least two vaccine doses. HCWs who were laboratory scientist aPR = 2.01, 95% CI (1.35-3.00) and had < 10 years of employment aPR = 1.62, 95% CI (1.04-2.50) were unlikely to vaccinate against HBV. Vaccine unavailability 114 (51.1%), hesitancy 42 (18.8%), time constraints 41 (18.4%) and financial constraints 26 (11.7%) were factors associated with not vaccinating. Conclusion Vaccine coverage against HBV among HCWs at MNH is alarmingly low. Vaccine access, subsidizing cost, protecting time for vaccination could improve vaccination uptake. Qualitative studies are needed to assess for reasons for vaccine hesitancy among HCWs.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24db20a39cd996683367e2476312f372",
  "timestamp": "2025-05-15T03:22:26.139102"
}