{
  "id": 7748,
  "title": "A retrospective cohort study of factors associated with severity of falls in hospital patients",
  "abstract": "Severity of falls in hospital patients are threat to patient safety which can result in a financial burden on the patient's family and health care services. Both patient specific and environmental and organisational factors are associated with severity of falls in hospital. It is important to continuously analyse the factors associated with severity of fall which can inform the implementation of any fall preventive strategies. This study aims to identify factors associated with the severity of falls in hospitalised adult patients in Western Australia. This study involved a retrospective cohort analysis of inpatient falls records extracted from the hospital's Clinical Incident Database from May 2014 to April 2019. Severity of falls were classified as three Severity Assessment Code (SAC): SAC 1 was high causing serious harm or death; SAC 2 was medium causing moderate or minor harm; and SAC 3 was low indicating no harm. Univariable and multivariable generalised ordinal logistic regression models were used to quantify the magnitude of effects of the potential risk factors on severity of falls at 5% level of significance and reported the crude odds and adjusted odds ratio of falling at a higher severity level. There were 3705 complete reported cases of falls with the average age of the patients was 68.5 +/- 17.0 years, with 40.2% identified as female. The risk of falling at a higher level of severity increased by patient age over 50 years. Females were 15.1% more likely to fall at higher severity level compared to females. Fall incidents occurred during toileting and showering activities and incidents in a communal area were 14.5% and 26% more likely to occur at a higher severity respectively. Similarly, depression (167%), influence of alcohol or illicit drugs (more than 300%), use of medications (86%) and fragile skin (75%) significantly increased the odds of falling at higher level of severity. Identification of underlying risk factors associated with fall severity provides information which can guide nurses and clinicians to design and implement effective interventional strategies that mitigate the risk of serious fall injuries. The results suggest that fall prevention strategies should target patients with these risk factors to avoid severity of falls.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24dc4b1f2e4f84503d2b0e1c63916eb2",
  "timestamp": "2025-05-15T03:11:38.562356"
}