{
  "id": 3722,
  "title": "UTAUT Determinants of Cashless Payment System Adoption in Thailand: A Hybrid SEM-Neural Network Approach",
  "abstract": "Research has been limited on what factors may make customers feel uncomfortable with using electronic payment systems. The purpose of this research study was to develop a model that analyzed the dimensions of the unifiB01;ed theory of acceptance and use of technology (UTAUT) with extra structures to understand how gender can affect whether consumers decide to embrace cashless payment systems in Thailand. Accordingly, 416 valid answers were submitted by banking customers utilizing the survey instrument. Exploratory factor analysis (EFA) and confirmatory factor analysis (CFA) were employed to kick off the process of creating a measurement model. Structural equation modeling (SEM) was then used to pinpoint the most pressing factors that prevent people from embracing online banking systems. The purpose of this research was to develop a technology acceptance model with extra structures to understand how attitudes and perceived risks affect people's decision-making process as to whether they embrace cashless payment systems in Thailand (i.e., innovativeness). In the second stage, we used a neural network model to rank the importance of various SEM-derived predictions. The results demonstrate a robust association between Internet banking and the value barrier, the risk barrier, and the image barrier. The only factor that indicated any kind of negative influence on whether people chose to use Internet banking was the conventional barrier. Remarkably, the image barrier affected Internet banking adoption more than the risk barrier or the no-frills alternative. Furthermore, according to the data, men experienced greater challenges than women. The findings of this study may help financial institutions create offerings that entice customers to conduct financial dealings with them online. The banking industry could immensely benefit from this research since it may lead to changes in the laws that govern banking and could ultimately enhance customer service and online services. The purpose of this research was to develop a model that would examine a study that used the technology acceptance model with extra structures to understand how attitudes and perceived risk affect people's decisions to embrace cashless payment systems in Thailand (i.e., innovativeness). There were 416 valid answers collected from bank customers utilizing the survey instrument. Exploratory factor analysis (EFA) and confirmatory factor analysis (CFA) were employed to kick off the process of creating a measurement model. Then, structural equation modeling (SEM) was used to pinpoint the most pressing factors preventing people from adopting online banking of this research was to develop a model that would examine a study that used the technology acceptance model with extra structures to understand how attitudes and perceived risk affect people's decisions to embrace cashless payment systems in Thailand (i.e., innovativeness). There were 416 valid answers collected from bank customers utilizing the survey instrument. Exploratory factor analysis (EFA) and confirmatory factor analysis (CFA) were employed to kick off the process of creating a measurement model. Then, structural equation modeling (SEM) was used to pinpoint the most pressing factors preventing people from adopting online banking. In the second stage, we used the neural network model to rank the importance of various SEM derived predictions. The results demonstrate a robust association between Internet banking and the value barrier, the risk barrier, and the image barrier.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24e6988d30aaa24452f7cc2f4487f0d5",
  "timestamp": "2025-05-15T02:29:27.949733"
}