{
  "id": 5321,
  "title": "ESG ratings and investment performance: evidence from tech-heavy mutual funds",
  "abstract": "PurposeThis paper aims to the relationship between environmental, social and governance (ESG) ratings and the investment performance of mutual funds with significant exposure to the technology sector. It aims to explore whether ESG-aligned funds deliver superior financial performance, particularly in terms of risk-adjusted returns and if these funds demonstrate better market timing abilities compared to their lower-rated counterparts.Design/methodology/approachThe analysis covers a 10-year period from January 2013 to December 2022, focusing on Eurozone-based mutual funds with more than 40% of their assets under management (AUM) invested in technology firms. The sample includes 912 funds, categorized by their ESG ratings (AAA to CCC), using MSCI ratings as the classification metric. The performance evaluation uses risk-adjusted measures such as the Sharpe ratio, Sortino ratio and Jensen's alpha, along with an assessment of market timing capabilities based on an extended four-factor model.FindingsThe results show that mutual funds with higher ESG ratings consistently outperform their lower-rated peers in both absolute and risk-adjusted returns. These funds also exhibit superior market timing abilities. ESG-aligned funds not only provide a favorable risk-return profile but also enhance the appeal of responsible investment strategies, particularly within the volatile and innovation-driven technology sector. The study reinforces the notion that ESG factors contribute positively to long-term value creation for investors.Practical implicationsThe findings are valuable for investors and policymakers aiming to incorporate ESG factors into investment strategies, especially in sectors characterized by rapid technological advancements. The superior performance of ESG-compliant funds highlights the importance of sustainable investing and its potential to align financial returns with broader environmental and social goals.Originality/valueThis study adds to the growing body of literature on ESG investing by specifically focusing on tech-heavy mutual funds in the Eurozone. It offers new insights into how ESG ratings at the fund level, rather than at the firm level, influence investment performance and market timing within the high-growth, high-risk technology sector.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24ef02f13bf80d8fb404c8013fdff90c",
  "timestamp": "2025-05-15T02:46:44.867322"
}