{
  "id": 8378,
  "title": "Annual Diabetic Eye Examinations in a Managed Care Medicaid Population",
  "abstract": "Objectives: To assess how well a managed care organization performed annual diabetic eye screening in a Medicaid population, and to identify barriers to completion. Study Design: Cross-sectional study. Methods: Healthcare claims data for all Medicaid patients with diabetes covered by Priority Partners Managed Care Organization in 2010 and 2012 were collected, and the annual rates for diabetic eye exams in those years were reported. Predictors of completion of the diabetic eye exam in primary care clinics in 2010 and 2012 were assessed using a logistic regression model. Results: We identified 8902 Medicaid patients with a diagnosis of diabetes using the Healthcare Effectiveness Data and Information Set codes: 3838 patients in 2010 and 5064 patients in 2012. In 2010 and 2012, 46% and 64% of patients, respectively, had completed their annual diabetic eye exam. The increase in participation in annual eye exams from 2010 to 2012 was statistically significant (P <. 001). Among the factors increasing the likelihood of completion of an annual diabetic eye exam among the Medicaid population were access to a nonmydriatic fundoscopic camera in the primary care clinic, compliance with glycated hemoglobin measurement based on the recommended guidelines, incentives offered to primary care offices, and higher resource utilization band score. Financial incentives to patients, however, lowered the completion rate. Conclusions: Annual diabetic eye exam completion is low among the Medicaid population. Detecting high-risk patients and adjusting for factors that play a role in nonadherence both increase the rate of annual diabetic eye exams among underserved populations such as Medicaid patients.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24f03158d43d00847b2556aaeadb9f87",
  "timestamp": "2025-05-15T03:18:19.552245"
}