{
  "id": 5589,
  "title": "Assessment of eHealth literacy to reduce financial toxicity and improve shared decision-making in cancer patients: A cross-sectional study",
  "abstract": "ObjectivesThis study aimed to investigate the associations between eHealth literacy, preferences for financial decision-making, and financial toxicity (FT) in a sample of Chinese cancer patients. MethodsEligible cancer patients were invited to participate in a cross-sectional survey from January to April 2021. Three measures (eHealth literacy scale, control preference scale, and COST) were used to analyze patients' eHealth literacy, decisional preferences, and FT, respectively. Wilcoxon signed-rank test and Kruskal-Wallis H test assessed the differences between population subgroups. Binary logistic and multivariate linear regression models were used to assess the relationships between eHealth literacy, decisional preferences, and FT. ResultsA total of 590 cancer patients completed the questionnaire. We found that high FT was associated with poor ECOG performance, severe cancer stage, and longer cancer duration. Patients who preferred to adopt collaborative attitude toward decision-making showed a significantly higher eHealth literacy. However, there was an inverse relationship between eHealth literacy and a patient-driven attitude toward decision-making in female cancer patients. Regression analysis indicated that patients who were highly educated and actively employed might report a higher eHealth literacy. A significant relationship was found between high eHealth literacy and low FT. However, this relationship became insignificant when the background characteristics of cancer patients were taken into account. ConclusionsA relationship between enhanced eHealth literacy, preference for collaborative decision-making, and low risk of FT is identified. Practical implicationInterventions to improve patients' ability to use quality and reliable web-based information on cancer care should be encouraged.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "24f23897ef74a1907d61d0d4745aa3b5",
  "timestamp": "2025-05-15T02:49:21.698716"
}