{
  "id": 7017,
  "title": "Sleep Quality and Interoception Are Associated with Generalized Anxiety in Baccalaureate Nursing Students: A Cross-Sectional Study",
  "abstract": "Baccalaureate nursing students are at increased risk for anxiety and related mood disorders. We conducted a cross-sectional study to explore the relationships among anxiety symptoms measured by the Generalized Anxiety Disorder (GAD-7) questionnaire and lifestyle behaviors including habitual diet, sleep quality (Pittsburg Sleep Quality Index [PSQI]), and physical activity. Descriptive statistics were obtained for sample characteristics, and Pearson correlations and backward stepwise linear regression explored relationships between the GAD-7 scores, the Multidimensional Assessment of Interoceptive Awareness, version 2 (MAIA-2) subscales, and other variables. Sixty-eight students completed the survey, with 38% having moderate-to-severe anxiety. On average, respondents had moderate diet quality (Healthy Eating Index median 60/100 [range 51-75]), had high sleep quality (PSQI median 7/21 [range 4-10]), and were highly active, with a median of 43 (range 24-78) weekly metabolic equivalent (MET) hours. Sixty-seven out of 68 respondents indicated a willingness to change lifestyle behaviors; the most prevalent time-related factors were school and social commitments, with stress and financial constraints being reported among half or more of respondents. Regression analysis determined that PSQI (beta = 0.446) and the MAIA-2 Not-Worrying subscale (beta = -0.366) were significant (p < 0.001 for both) predictors of anxiety severity. These results indicate that mindfulness and sleep hygiene may be the most actionable foci for interventions to reduce anxiety in baccalaureate nursing students. This study was not registered as a clinical trial.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2503183f57ba8111860d048f42087eea",
  "timestamp": "2025-05-15T03:04:22.971491"
}