{
  "id": 5951,
  "title": "Determining factors affecting flood risk perception among local communities in Iran",
  "abstract": "Although climatic and environmental factors primarily determine the intensity of flood events, their impacts on residents are significantly influenced by human-related elements. Since the most floods are highly variable and unpredictable, it is crucial to enhance the capacity and resilience of residents to withstand and coexist with these disasters. To increase the resilience and adaptability of rural households in the face of floods, it is essential to first address individuals' risk perception as a critical issue. This study was conducted with two primary. Objectives (1) to assess the current status of risk perception and (2) to identify the factors influencing flood risk perception (FRP) among local communities. The research population comprised all rural households in the Shushtar County (Southwest Iran) who had experienced at least one flood event. The primary research tool was a questionnaire, and data analysis was performed using SPSS software. Correlation coefficient results indicated significant relationships between age, frequency of flood occurrence, education, distance of water channels and rivers from properties, flood exposure, housing quality, risk information, flood coping information, and financial incentives for recovery with dimensions of risk perception, namely preparedness, worry, awareness, and experience. Additionally, hierarchical regression results demonstrated that these variables could explain 55.4% of the variance in FRP. Overall, the findings of this study can significantly assist policymakers in designing flood risk reduction programs and facilitating safer living conditions in flood-prone areas.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2519e5eff1b04b747fb52d3f6651153a",
  "timestamp": "2025-05-15T02:53:03.152298"
}