{
  "id": 7312,
  "title": "Risk Factors for Moderate and Severe Microbial Keratitis in Daily Wear Contact Lens Users",
  "abstract": "Objective: To establish risk factors for moderate and severe microbial keratitis among daily contact lens (CL) wearers in Australia. Design: A prospective, 12-month, population-based, case-control study. Participants: New cases of moderate and severe microbial keratitis in daily wear CL users presenting in Australia over a 12-month period were identified through surveillance of all ophthalmic practitioners. Case detection was augmented by record audits at major ophthalmic centers. Controls were users of daily wear CLs in the community identified using a national telephone survey. Testing: Cases and controls were interviewed by telephone to determine subject demographics and CL wear history. Multiple binary logistic regression was used to determine independent risk factors and univariate population attributable risk percentage (PAR%) was estimated for each risk factor. Main Outcome Measures: Independent risk factors, relative risk (with 95% confidence intervals [CIs]), and PAR%. Results: There were 90 eligible moderate and severe cases related to daily wear of CLs reported during the study period. We identified 1090 community controls using daily wear CLs. Independent risk factors for moderate and severe keratitis while adjusting for age, gender, and lens material type included poor storage case hygiene 6.4x (95% CI, 1.9-21.8; PAR, 49%), infrequent storage case replacement 5.4x (95% CI, 1.5-18.9; PAR, 27%), solution type 7.2x (95% CI, 2.3-22.5; PAR, 35%), occasional overnight lens use (<1 night per week) 6.5x (95% CI, 1.3-31.7; PAR, 23%), high socioeconomic status 4.1x (95% CI, 1.2-14.4; PAR, 31%), and smoking 3.7x (95% CI, 1.1-12.8; PAR, 31%). Conclusions: Moderate and severe microbial keratitis associated with daily use of CLs was independently associated with factors likely to cause contamination of CL storage cases (frequency of storage case replacement, hygiene, and solution type). Other factors included occasional overnight use of CLs, smoking, and socioeconomic class. Disease load may be considerably reduced by attention to modifiable risk factors related to CL storage case practice. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2012;119:1516-1521 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "252d9407fe83bd20c2b9cebef98c1864",
  "timestamp": "2025-05-15T03:07:02.743039"
}