{
  "id": 1978,
  "title": "Myocardial perfusion imaging failed to improve patient risk classification compared with the revised cardiac risk index for early cardiac complications after major non-cardiac surgery",
  "abstract": "Background Myocardial perfusion imaging (MPI) is frequently used for cardiac risk assessment before major non-cardiac surgery, but its ability to improve patient risk classification beyond simple clinical assessment is unknown. Aim To explore the prognostic utility of MPI above a simple clinical risk calculator, the revised cardiac risk index (RCRI). Methods A retrospective cohort study of at-risk patients who underwent MPI before major non-cardiac surgery in a tertiary hospital was conducted. Major adverse cardiac events (MACE) was defined as any myocardial infarction, acute pulmonary oedema, ventricular arrhythmia or cardiac death within 30 days of surgery. We analysed the predictive value of MPI for MACE using multivariable logistic regression and categorical net reclassification index. Results MACE occurred in 47 (7.4%) cases from 635 surgical procedures in 629 patients. MPI-identified medium or large-sized reversible perfusion defects (P = 0.02; odds ratio 2.9; 95% confidence interval 1.1-7.1) and RCRI score two or more (P = 0.03; odds ratio 2.3; 95% confidence interval 1.1-4.8) were significantly associated with MACE after adjusting for age, coronary revascularisation, surgical priority, need for general anaesthesia, left ventricular ejection fraction (LVEF) and fixed perfusion defects. MPI risk factors (LVEF, reversible perfusion and fixed perfusion defects) did not improve risk classification above baseline risk factors (age, RCRI and surgical priority). Conclusion MPI risk factors are weak predictors for early cardiac complications after major non-cardiac surgery and failed to improve patient risk classification beyond essential assessment using age, RCRI and surgical priority. Clinicians should consider alternative risk assessment strategies because of MPI's poor prognostic utility and its associated time and financial costs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "253108f261a9a0733705908395cff218",
  "timestamp": "2025-05-15T02:09:48.320953"
}