{
  "id": 4069,
  "title": "Development of Assement Tecnique for Economic Security Threts and Risks in Social Aspect",
  "abstract": "Russia today is dynamically developing state which despite external pressure continues to strengthen its positions timely preventing external and internal threats of economic security. Social stability acts as fundamental guarantee of dynamic development of the state. In this regard a task of the state is to prevent destructive processes in social and economic development using administrative measures and procedures. Social conditions, tendencies and forecasts of their formation were constantly in focus of country leaders, government organizations and scientific communities. This results from the fact that social aspect has a principal value for society development in particular and the state in general. In recent years in the Russian Federation large-scale changes, including development of new public legislation, implementation of target projects, and formation of new concept of public population protection have begun. Many actions for the purpose of granting worthy level of wellbeing and increase in life quality are done. Social problems are key problems in spite the fact that the Government of the Russian Federation makes great efforts for unemployment and poverty reduction. The main factor is sudden change of international situation in the last several years, introduction of financial and restrictive sanctions, implementation of hostile political activity of certain foreign states on the Russian Federation and as a result complication of public and financial situation in the Russian Federation. However successful social and financial development is the supreme goal for Russian state for near future. The purpose of this activity is relevance and complexity of economic security problems and assessment of indicators defining threats to security in public areas. Observation and diagnosing of extent threats to national interests of the state on the basis of social and economic development indicators in public area is a priority task in existing realities. It is possible to develop corresponding plan of economic security measures improvement in social area on the basis of offered classification. It can be done by modeling threats of economic security, i.e. receiving particular indicators of economic security depending on their belonging to this or that class (level) of risk. Monitoring and diagnostics of threats level to national interests of the country on the basis of social and economic development indicators in social area is a task of prime importance in the existing realities. At the same time received results are a worthy basis for strategies development with maintaining social stability. Research objective is in formation of methodical provisions of economic security theory development on the basis of economic security threats defining in social area. It is possible to do using the offered dependence model between key factors exerting impact on safety level in this area. Complex of general scientific approaches (abstract and logical, deductive, complex and system) is used in the research. The realization of research process is made by means of dialectic method predetermining studying of economic events in their interrelation and development. Economical and statistical methods, comparison methods of absolute, relative and average values, graphic and tabular data presentation, correlation and regression analysis, clustering by Ward's method are used.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "254d9d40eb669fa79dbce168c1ee55c8",
  "timestamp": "2025-05-15T02:33:03.363392"
}