{
  "id": 5290,
  "title": "Economic Abuse by An Intimate Partner and Its Associations with Women's Socioeconomic Status and Mental Health",
  "abstract": "What is the prevalence and impact of economic abuse by an intimate partner in the population? Does experience of economic abuse compound the effects of other intimate partner violence (IPV) types on women's mental health and financial wellbeing? This study used a population-based and representative sample of 1,431 ever-partnered New Zealand women to explore associations between their experience of economic abuse and a range of mental health and financial outcomes. Logistic regression was conducted, and Adjusted Odds Ratios (AORs) were reported. Overall, 15% of ever-partnered women experienced any economic abuse, with the most prevalent act refused to give money for household expenses, reported by 8.8% of the sample. Women who experienced economic abuse presented increased risk for poor mental health (AORs ranging from 2.59 for poor mental health to 4.89 for having a diagnosed health mental health condition) and financial insecurity outcomes (AORs ranging from 3.09 for receiving government benefits to 4.72 for experiencing food insecurity) compared with women who experienced no IPV or women who had experienced any IPV (physical, sexual, psychological or controlling behavior) excluding economic abuse. Findings suggest that economic abuse may compound effects of IPV and highlight the importance of acknowledging and addressing economically abusive behaviors and their long-term detrimental impact on women's mental health and financial security. Implementing wider forms of safety planning that address issues of economic independence and security, and social support are needed to augment plans that focus on physical safety.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "255fa28023fb3ec7cb6056ea489fc091",
  "timestamp": "2025-05-15T02:46:16.242236"
}