{
  "id": 9450,
  "title": "Incidence, admission rates, and economic burden of pediatric emergency department visits for urinary tract infection: Data from the nationwide emergency department sample, 2006 to 2011",
  "abstract": "Background The Emergency Department (ED) is being increasingly utilized as a pathway for management of acute conditions such as the urinary tract infections (UTIs). Objective We sought to assess the contemporary trends in pediatric UTI associated ED visits, subsequent hospitalization, and corresponding financial expenditure, using a large nationally representative pediatric cohort. Further, we describe the predictors of admission following a UTI associated ED visit. Methods The Nationwide Emergency Department Sample (NEDS; 2006-2011) was queried to assess temporal-trends in pediatric (age <= 17 years) ED visits for a primary diagnosis of UTI (ICD9 CM code 590. X, 595.0, and 599.0), subsequent hospital admission, and total charges. These trends were examined using the estimated annual percent change (EAPC) method. Multivariable regression models fitted with generalized estimating equations (GEE) identified the predictors of hospital admission. Results Of the 1,904,379 children presenting to the ED for management of UTI, 86 042 (4.7%) underwent hospital admission. Female ED visits accounted for almost 90% of visits and increased significantly (EAPC 3.28%; p = 0.003) from 709 visits per 100 000 in 2006 to 844 visits per 100 000 in 2011. Male UTI incidence remained unchanged over the study-period (p = 0.292). The overall UTI associated ED visits also increased significantly during the study-period (EAPC 3.14%; p = 0.006) because of the increase in female UTI associated ED visits. Overall hospital admissions declined significantly over the study-period (EAPC -5.59%; p = 0.021). Total associated charges increased significantly at an annual rate of 18.26%, increasing from 254 million USD in 2006 to 464 million USD in 2011 (p < 0.001; Figure). This increase in expenditure was likely driven by increased utilization of diagnostic CT scanning in these patients (EAPC 22.86%; p < 0.001). Ultrasonography (p = 0.805), X-ray (p = 0.196), and urine analysis/culture use (p = 0.121) did not change over the study-period. In multivariable analysis, the independent predictors of admission included younger age (p < 0.001), male gender (ORZ2.05, p < 0.001), higher comorbidity status (OR = 14.81, p < 0.001), pyelonephritis (OR = 4.45, p < 0.001) and concurrent hydronephrosis (OR = 49.42, p < 0.001), stone disease (OR = 6.44, p < 0.001), or sepsis (OR = 18.83, p < 0.001). Discussion We show that the incidence of ED visits for pediatric UTI is on the rise. This rise in incidence could be due to several factors, including increasing prevalence of metabolic conditions such as obesity, diabetes and metabolic syndrome in children predisposing them to infections, or could be secondary to increasing sexual activity amongst adolescents and changing patterns of contraceptive use (increased use of OCP in place of condoms), or more simply might just be a reflection of changing practice patterns. Second, we demonstrate that total charges for management of UTI in the ED setting are increasing rapidly; the increase is primarily driven by increasing utilization of diagnostic imaging in the ED setting, as has been demonstrated in other ED based studies as well. Conclusions In children presenting to the ED with a primary diagnosis of UTI, total ED charges are increasing at an alarming rate not commensurate with the increase in overall ED visits. While the preponderance of children presenting to the ED for UTI are treated and discharged, 4.7% of patients were admitted to the hospital for further management. The strongest predictors of inpatient admission were pyelonephritis, younger age, male gender, higher comorbidity status, and concurrent hydronephrosis, stone disease, or sepsis. Managing these at-risk patients more aggressively in the outpatient setting may prevent unnecessary ED visits and subsequent hospitalizations, and reduce associated healthcare costs.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2572cc5837edef59158d2cca0f75ff81",
  "timestamp": "2025-05-15T03:28:46.365476"
}