{
  "id": 8506,
  "title": "Child maltreatment and adult socioeconomic well-being",
  "abstract": "Objective: Little empirical research has examined the impact that child maltreatment may have on victims' long-term socioeconomic well-being. The current study Sought to address this gap by exploring the relationship between childhood experiences of abuse and neglect and several indicators of socioeconomic well-being in adulthood. Method: Data front the nationally representative National Comorbidity Survey (NCS) (n = 5004) were analyzed using logistic regression models to examine whether maltreatment in childhood (any maltreatment, physical abuse, sexual abuse, severe neglect, and multiple types of maltreatment) affected employment status, income, and health care coverage in adulthood. Several potential confounds of this relationship were Included as covariates in the models, including race, sex, age. and several indicators of childhood socioeconomic status (SES) Results: The results show that adults who had experienced maltreatment differed significantly from non-maltreated adults across each of the socioeconomic domains examined. Effects were additionally found to differ depending on the number of types of maltreatment experienced Conclusions: Increased rates Of unemployment, poverty, and Medicaid usage indicate the significant long-term personal impact of early victimization. They also suggest a substantial societal cost from this problem through lost economic productivity and Lax revenue, and increased social spending. Low socioeconomic status among parents has also been identified as a salient risk factor for the perpetration of maltreatment, and, as Such, these results indicate a potential mechanism in the intergenerational transmission of violence. Practice implications: The findings from this Study suggest that victims of child maltreatment are at increased risk for financial and employment-related difficulties in adulthood. Approximately one million children are identified each year by state agencies as victims of maltreatment in the United States. Many maltreated children, furthermore, go undetected by protective service agencies. indicating the high prevalence of this problem, and under scoring its large economic costs to society By highlighting the long-term socioeconomic costs of maltreatment, this research should encourage policy makers to focus on improving prevention, intervention, and treatment efforts for Victims of abuse and neglect Published by Elsevier Ltd.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "257a6bc2fd12f7208500974fb2ed0057",
  "timestamp": "2025-05-15T03:19:21.376988"
}