{
  "id": 5619,
  "title": "Predictive influence of personality traits on retirement anxiety among universities staff in Osun State, Nigeria",
  "abstract": "BACKGROUND: Retirement anxiety may occur in retirement-eligible staff, and their reaction may depend on their personality traits. This study examined the predictive influence of five-factor personality traits on retirement anxiety among non-academic staff in some selected universities in Osun State, Nigeria. MATERIALS AND METHODS: The study utilized a multistage sampling technique. Two self-administered instruments, Redeemer's University Retirement Anxiety Scale and Mini-International Personality Item Pool were completed by 463 non-academic staff in five selected universities in Osun State, Nigeria. Descriptive statistics (frequency and percentages) and inferential statistics (hierarchical regression, two-sample t-test, and one-way ANOVA) were used to analyze data. RESULTS: The study found a high prevalence rate of retirement anxiety (85.1%) among university staff in Nigeria. In all, 13%, 16%, and 12.5% of the participants showed high levels of retirement anxiety dimensions (personal obligation, financial planning, and social detachment), respectively. Sociodemographic and personality traits jointly accounted for statistically significant (16%, 29%, and 22%) changes in personal obligation (R-2=0.16, P <.01), financial planning (R-2=0.29, P <.01), and social detachment (R-2=.22, P <.01), respectively. Personality traits (extraversion, agreeableness, conscientiousness, and neuroticism) and socio-demographic variables (age, educational level, job tenure, and job status) jointly contributed to the prediction of retirement anxiety dimensions (obligation concerns, financial planning, and social detachment). CONCLUSION: The findings highlighted the need for psychosocial interventions targeting the at-risk population was highlighted.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "257b0f71a8285c72cb8470a5cafa33f8",
  "timestamp": "2025-05-15T02:49:50.209903"
}