{
  "id": 544,
  "title": "Supervised learning-based multi-site lean blowout prediction for dry low emission gas turbine",
  "abstract": "Current dry low emission (DLE) gas turbines have extremely low nitrogen oxides (NOx) emissions, allowing them to comply with stringent environmental regulations. The ultra-low temperatures required to achieve such low emissions also increase the risk of a lean blowout (LBO). DLE gas turbines are particularly vulnerable to LBO, which can lead to system instability, higher carbon oxides (CO) emissions, damaged components, substantial financial losses and environmental damages. In this regard, this current study proposes a novel supervised learning-based prediction technique with efficient performance on out-of-distribution data from multiple DLE gas turbine plants (multi-site). The proposed prediction approach exploits the competitive advantages of both adaptive boosting (AdaBoost) and Linear support vector machine (LSVM) to improve the generalization capability as well as prediction accuracy. The proposed algorithm was trained and tested using a real-world DLE gas turbine dataset from six different sites. The result indicates that the proposed model consistently achieving LBO prediction accuracy rates above 99.9% and Mathew's correlation coefficient (MCC) score above 0.9 across all datasets. All lean-premixed gas turbines could benefit from the developed Ada-LSVM, as it is an accurate model with a high generalization performance that can be used across multiple sites.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "257c9093d1f5f6d72142717624891be4",
  "timestamp": "2025-05-15T01:52:12.264570"
}