{
  "id": 294,
  "title": "Big Data-Driven Portfolio Simplification: Leveraging Self-Labeled Clustering to Enhance Decision-Making",
  "abstract": "In the evolving landscape of business analytical practice, big data stands as a pivotal force, steering organizational strategies, particularly in portfolio management across end-to-end businesses. With the surge in data's volume, variety, veracity and velocity, there is a pressing need for sophisticated computational methods to demystify intricate business portfolios, thereby facilitating astute decision-making. Traditional portfolio analysis techniques, although foundational, grapple with the challenges posed by expansive, multifaceted data and volatile market dynamics. To counter these challenges, our research pioneers an innovative approach, harnessing the power of clustering algorithms to refine and consolidate business portfolios. We employ big data techniques to analyze and categorize extensive portfolio datasets, unearthing inherent groupings and patterns. Leveraging clustering algorithms, we categorize business entities by similarity, yielding a streamlined and lucid portfolio blueprint. Our approach not only enhances the clarity of vast business portfolios but also strengthens strategic decision-making capabilities, propelling organizational nimbleness and market competitiveness. Through comparative analyses, our solution showcases significant advantages in portfolio simplification and decision-making efficacy over conventional techniques.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "257edd24bc64265a910695ee32d05fa3",
  "timestamp": "2025-05-15T00:42:00.393045"
}