{
  "id": 248,
  "title": "Pricing European Currency Options with High-Frequency Data",
  "abstract": "Technological innovation has changed the financial market significantly with the increasing application of high-frequency data in research and practice. This study examines the performance of intraday implied volatility (IV) in estimating currency options prices. Options quotations at a different trading time, such as the opening period, midday period and closing period of a trading day with one-month, two months' and three months' maturity, are employed to compute intraday IV for pricing currency options. We use the Mincer-Zarnowitz regression test to analyse the volatility forecast power of IV for three different forecast horizons (within a week, one week and one month). Intraday IV's capability in estimating currency options price is measured by the mean squared error, mean absolute error and mean absolute percentage error measure. The empirical findings show that intraday IV is the key to accurately forecasting volatility and estimating currency options prices precisely. Moreover, IV at the closing period of the beginning of the week contains crucial information for options price estimation. Furthermore, the shorter maturity intraday IV is suitable for pricing options for a shorter horizon. In comparison, the intraday IV based on the longer maturity options subsumes appropriate information to price options with higher accuracy for the longer horizon. Our paper proposes a new approach to accurately pricing currency options using high-frequency data.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2589b6440d716c1a64278b6780361d72",
  "timestamp": "2025-05-15T01:30:18.983277"
}