{
  "id": 3809,
  "title": "A contribution to software service improvement based on LSP method",
  "abstract": "With new technologies and various software solutions readily available for utilization in business environment, the main driver for achieving the competitive business advantage is becoming the quality of service. The quality of service expectations is very often managed by established service level agreement (SLA). Behind SLA, there is a real software, infrastructure, organization, culture, and people that maintain it. Therefore, it is very important to take in consideration the complexity of the software solution that is the basis of the given service, probability of an error occurrence, and all costs, and risks that will be associated with operating the service. In this paper, the important elements of the quality of the software that is considered as a service to a business function are analyzed. The proposal for the classification within specific portfolio of software services is given. The logical scoring of preferences (LSP) method is proposed to be utilized for services elementary preferences estimates and overall services comparison within each rank of services. The main objective is in achieving better quality of service within the given rank by recognizing and then emphasizing elements in the services that positively influence overall estimates of the observed services in comparison to the others in the rank. An example of the method utilization on one selected use case is given as well.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "259d498f380eae8c068a079b3762e562",
  "timestamp": "2025-05-15T01:21:08.211785"
}