{
  "id": 4664,
  "title": "The cost of liver transplant complications",
  "abstract": "Background: Complications after liver transplantation are common and expensive. The incremental costs of adult posttransplantation liver transplantation complications and who pays for these complications (center or payor) is unknown. Study Design: We reviewed the medical and financial records (first 90 postoperative days) of all adult liver transplant recipients at our center between July 1, 2002, and October 30, 2005 (N=214). The association of donor, recipient, and financial data points (total costs, reimbursements, and profits) was assessed using standard univariable analyses. The incremental costs of complications were determined with multiple linear regression models to control for the costs inherent to donor and recipient characteristics. Results: Univariate analyses demonstrated that both total hospital costs and reimbursements were substantially increased in patients with several different complications. Multiple linear regression analysis, controlling for recipient (age, gender, race, and laboratory Model for End-Stage Liver Disease [MELD]) and donor factors (donor risk index), noted that increased hospital costs and hospital reimbursements were independently associated with laboratory MELD (incremental costs of $3,368 and $2,787, respectively, per MELD point) and pneumonia ($83,718 and $68,214, respectively). A negative profit margin for the medical center was independently associated with. peritonitis ($21,760). Commercial insurance was associated with no changes in total costs when compared with public insurer, but it was associated with decreased reimbursement and profit. Conclusions: The incremental costs of complications in liver transplantation are high for both the medical center and payor, but medical center profits are not affected substantially. The payor bears the financial burden for post-liver transplantation complications.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25bb30838f070240957c2ee9a0f92167",
  "timestamp": "2025-05-15T02:39:57.407902"
}