{
  "id": 5717,
  "title": "Major influence of postoperative complications on costs of cytoreductive surgery and HIPEC in patients with colorectal peritoneal metastases",
  "abstract": "Complications after cytoreductive surgery (CRS) and hyperthermic intraperitoneal chemotherapy (HIPEC) result in impaired short- and long-term outcomes. However, financial consequences of complications after CRS and HIPEC in a European health care setting are unknown. This study aims to assess the consequences of complications on hospital costs after CRS and HIPEC.In this prospective observational cohort study, patients with colorectal peritoneal metastases treated with CRS and HIPEC were included. Financial information was collected according to the Dutch manual for costs analyses. Costs were compared between patients without complications (NC), minor complications (MC), or severe complications (SC), according to the Clavien-Dindo classification.One hundred and sixty-one patients were included, of whom 42% experienced NC, 27% MC and 31% SC. Mean hospital costs were Euro9.4062.235 in NC patients, Euro12.471 +/- 3.893 in MC patients, and Euro29.409 +/- 22.340 in SC patients. The 31% of patients with severe complications accounted for 56% of all hospital costs. Hospital admission costs in SC patients were 320% higher compared to NC patients. Costs of complications were estimated to be 43% of all admission costs.Severe postoperative complications have major influence on costs after CRS and HIPEC and result in a threefold increase of hospital costs in affected patients. This finding stresses the need for adequate risk assessment of developing severe complications after CRS and HIPEC.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25cc6e8710c3ddddcaf9df82654b963f",
  "timestamp": "2025-05-15T02:50:53.852299"
}