{
  "id": 1570,
  "title": "Deep Learning-Based Risk Prediction in Power Sector Financial Management Using Transformer and Actor-Critic Reinforcement Learning",
  "abstract": "Precise short-term electricity demand forecasting is crucial for the grid's operation and reliability management, while long-term forecasting is for future energy policymaking. However, the nonlinear and stochastic nature of economic and environmental impact on electricity demand is a great challenge for the forecasting models. Current time series forecasting models work on the historical demand and price data and ignore the driving economic and environmental features. In this study, we developed an Actor-Critic Reinforcement Learning model named Attention Deterministic Policy Gradient (ADPG) that employs the Transformer as a Critic network to leverage the advantage of self-attention to learn complex patterns over longer time horizon information dependencies for forecasting the electricity demand and price. Second, it introduces the multi-step year-ahead and day-ahead forecasting, and one-step hour-ahead forecasting for the long-term and short-term demand and price prediction based on the historical time series electricity demand and price data along with the prices of major electricity sources and economic features which drive the electricity price, and environmental features which impact the electricity demand. A comprehensive comparison between the ADPG and other RL and supervised forecasting models is also provided via different evaluation metrics. Results show that Transformer is better capable of forecasting due to its ability to learn longer dependencies. Against the hour-ahead actual demand and price, forecasting with the ADPG has reduced the demand and price difference between predicted and actual values to 0.17% and 2.06% respectively, as compared to 0.63% demand and 4.21% price difference in day-ahead prediction. In the year-ahead forecast, ADPG shows a 3.84% demand and a 5.99% price difference between the actual demand and price. All the other models remain way behind in year-ahead and day-ahead forecasts but come closer in the hours-ahead forecast, but remain below ADPG.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25d854768bb9bcea3454ff12500f362f",
  "timestamp": "2025-05-15T02:05:08.090985"
}