{
  "id": 5177,
  "title": "An empirical examination of board-related and firm-specific drivers on risk disclosure by listed firms in Kenya: a mixed-methods approach",
  "abstract": "Purpose This study aims to examine the effect of board-related and firm-specific drivers on quality of risk disclosure (RD) by listed firms in Kenya. Design/methodology/approach This study uses explanatory sequential mixed-method. The quantitative approach uses content analysis to measure quality of RD and panel data regression to examine the effect of board-related and firm-specific factors on quality of RD. The results of regression analysis are informed by qualitative analysis through interviews with preparers of the annual report. Findings The results reveal that quality of RD is low but greater in the post-regulation than in the pre-regulation period. Additionally, the results of regression and interview analysis show that board-related (board independence and board gender diversity) and firm-specific factors (firm size and leverage) positively influence the quality of RD. Research limitations/implications This study focused on listed non-financial firms; this may affect the generalisation of the findings among financial firms. Practical implications The findings highlight the effectiveness of the Companies Act in improving RD practice in Kenya. However, the low-quality RD suggests that more consideration should be taken to review the current regulations. This study also suggests that board independence, board gender diversity, leverage and firm size are attributes that require regulatory focus to enhance quality of RD. Social implications This study contributes to the ongoing discussions about RD to improve worldwide. Originality/value This paper adds to the limited studies investigating RD and drivers using mixed methods in developing countries. Specifically, this study develops a novel measure of RD and examines its drivers (board-related and firm-specific) using agency and institutional theories.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25de60c3801a3bdc0e25bfcda45c0f12",
  "timestamp": "2025-05-15T02:45:17.023972"
}