{
  "id": 1275,
  "title": "The Use of Features to Enhance the Capability of Deep Reinforcement Learning for Investment Portfolio Management",
  "abstract": "Reinforcement learning algorithms and neural networks have been widely used in stock market forecasting, image recognition processing and many other fields. In this research, we adopt features based on asset prices and transaction volume to have better description of the current state. This research aims to input new features combination into the neural network to assist agent in analyzing the market environment for 11 cryptocurrencies. The experimental data contains historical data of the price and transaction volume of the sample from 30 days before backtest sets, as well as features (the volume, the rate of change, the moving average, the stochastic oscillator, the Eliot oscillator and the On Balance Volume) calculated using the historical data. The efficacy of our strategy is comparing to that of nine traditional strategies, i.e., Aniticor, Online Moving Average Reversion, Passive Aggressive Mean Reversion, Confidence Weighted Mean Reversion, Robust Median Reversion, Online Newton Step, Universal Portfolios and Exponential Gradient. The experiments result shows the use of features can increase the final profit, which is about 10% more profitable compare with strategy established by Jiang et al. in Jul. 2017. Furthermore, the best combination of our features outperforms all other traditional strategies by at least 7.6%.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25ec9d9f0ed3feb95115b8bc4b2fee7e",
  "timestamp": "2025-05-15T00:53:42.177847"
}