{
  "id": 7311,
  "title": "Evaluation of a nurse practitioner-led post-discharge transitional care program for patients with liver disease: A retrospective cohort study",
  "abstract": "Background: We evaluated an outpatient, nurse practitioner-led transitional care program with respect to its efficacy in reducing unplanned readmission rates for patients with liver disease.Methods: We conducted a retrospective cohort study using data from an academic health system in Toronto, Ontario. The study included all admissions associated with an ICD10 code of R18 (ascites), I85.0 or I98.3 (variceal bleeding), or K70-K77 (diseases of the liver). Patients were selected to receive the transitional care (intervention group) or not (no-intervention group) by discretion of the hepatologists. We used a proportional hazard model to estimate the associations between receiving the intervention and the marginal probability of 30-, 60-, and 90-day readmission in the presence of death as a competing risk. We conducted sensitivity analyses to examine the robustness of our estimates to various sources of bias, including adjusting for propensity of receiving the intervention estimated using a logistic regression model.Results: A total of 803 admissions were included. Receiving transitional care was associated with a reduction in risk of 30-day readmission (HR 0.51; 95% CI 0.30-0.85), 60-day readmission (HR 0.60; 95% CI 0.40-0.91), and 90-day readmission (HR 0.55; 95% CI 0.37-0.83). The negative associations remained statistically significant under the sensitivity analyses, except for the propensity-adjusted estimate for the 60-day outcome.Conclusions: A nurse practitioner-led transitional care program could be effective in reducing the risk of readmission for patients with liver disease. Future studies are needed to standardize the referral process and prospectively measure the effectiveness and financial value of the program.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25f7c103fdd40ea037f23b847c99ca3e",
  "timestamp": "2025-05-15T03:07:02.732525"
}