{
  "id": 1354,
  "title": "The Influence of Risk Factors on the Dynamics of Gross Regional Product in Conditions of Clustering of the Economy (On the Example of the Nizhny Novgorod Region)",
  "abstract": "The purpose of this study is to develop a model of multivariate analysis of regional risk that takes into account both intraregional and global financial and economic determinants. Regional risk as a specific concept that limits the effectiveness of the development of the regional economic system in conditions of clustering is the object of research in this study. Multivariate modeling of regional risk based on correlation-regression analysis is the subject of research. Systematic assessment of risk factors is carried out using an economic-statistical model, which is an extended version of the Cobb-Douglas function. Its arguments include additional factors that determine the pace and risks of development of any region. The most significant deviations of the actual values of the elasticity coefficients of the model from the reference proportions highlight the most significant factors of regional risk. A model for assessing the influence of factors of intraregional and external financial and economic risk on the dynamics of the gross regional product is proposed. The proportions of the elasticity coefficients of the model are reasoned. It was tested on the data of the Nizhny Novgorod Region for 2010-2019, recommendations to minimize the level of risk in the context of clustering the economy of this region were formulated. The model allows highlighting risk factors from the point of view of the dynamics of the gross regional product, ranking them according to the level of significance, and, on this basis, developing recommendations for minimizing the risks of development of the regional economy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "25fb93b5407a070901cb99ee78f3dbc6",
  "timestamp": "2025-05-15T02:01:44.860045"
}