{
  "id": 4929,
  "title": "The association of financial incentives for low density lipoprotein cholesterol reduction with patient activation and motivation",
  "abstract": "There is growing interest in using financial incentives for patients to improve medication adherence, but few studies have evaluated whether financial incentives are associated with patients' activation and motivation. We analyzed survey data collected as part of a randomized clinical trial conducted from 2011 to 2014 of four financial incentive interventions to reduce low density lipoprotein cholesterol (LDL-C) among patients at risk for atherosclerotic cardiovascular disease. The main trial included 1503 patients aged 18-80 and recruited from primary care practices affiliated with three health systems. Participants were randomized into four groups: patient financial incentives, primary care physicians (PCPs) incentives, patients and PCPs shared incentives, or no incentives for LDL-C control. Patient Activation Measure (PAM) and Treatment Self Regulation Questionnaire (TSRQ) surveys were administered at baseline and 12 months. Clinical outcomes were change in LDL-C at 12 and 15 months and average medication adherence as measured by electronic pill bottle opening. Mean changes in PAM and TSRQ scores were compared between patients eligible and not eligible for incentives. Clinical outcomes were tested against baseline and change in psychosocial measures using bivariate and multivariate regression. Change in PAM score and TSRQ autonomous subscore did not differ significantly between patients eligible and not eligible for incentives. Lower baseline and greater increase in TSRQ autonomous subscore were predictive of greater 15-month decrease in LDL-C. A financial incentive intervention to improve LDL-C control was not associated with changes in patients' activation or autonomous motivation. Increases in patient autonomous motivation are predictive of long-term LDL-C control.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "260e1b1acb6d9e93cb25280b8dbd4c46",
  "timestamp": "2025-05-15T02:42:36.133446"
}