{
  "id": 4162,
  "title": "NIH Funding of Researchers in Surgery: Decreased Career Development Awards Over Time",
  "abstract": "Background: Over time, NIH funding has become increasingly competitive. In addition, aca-demic surgeons' research competes with time required for patient care, operating, and ad-ministrative work. Due to these competing interests for surgeons, we hypothesize that the percentage of NIH grants awarded to researchers from departments of surgery is decreasing. Methods: The NIH Research Portfolio Online Reporting Tool was queried for the number and value of new and renewal R01 grants, and career development awards noting which surgery departments received awards from 1998 to-2018. Statistical analysis was performed using univariate and multivariable logistic regression. Results: The number of career development awards granted to researchers from depart-ments of surgery decreased significantly over time ( P = 0.007) while new R01's and R01 re-newal awards were stable. The number of grants awarded to researchers from all procedu-ral departments were compared to non-procedural departments and again, career develop-ment awards decreased significantly ( P = 0.005) over time but new R01's and R01 renewals stayed stable. Looking at the difference in average dollar amount received for new R01, re-newal R01, or career development awards between department of surgery awardees and non-surgery over time, there was no significant difference. Conclusions: NIH funding is becoming increasingly competitive and surgeons have many competing interests. Our study found that there has been a significant decrease in career development awards to department of surgery awardees and procedural specialists. The decrease in receipt of these awards is particularly conceming given that they are meant to provide protected time for developing researchers and thus have potential consequences for future research. (c) 2021 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26100edda8054557f8e9a6ed8e0b7741",
  "timestamp": "2025-05-15T01:24:25.370755"
}