{
  "id": 4937,
  "title": "Cancer-related symptoms predict psychological wellbeing among prostate cancer survivors: results from the PiCTure study",
  "abstract": "BackgroundProstate cancer treatments are associated with a range of symptoms and physical side-effects. Cancer can also adversely impact on psychological wellbeing. Because many prostate cancer-related symptoms and side-effects are potentially modifiable, we investigated associations between symptoms and psychological wellbeing among prostate cancer survivors. MethodsPostal questionnaires were distributed to men diagnosed with prostate cancer 2-18years previously identified through cancer registries. General and prostate cancer-specific symptoms were assessed using the EORTC QLQ-C30 and QLQ-PR25, with higher symptom scores indicating more/worse symptomatology. Psychological wellbeing was assessed by the DASS-21. Associations between symptoms and each outcome were investigated using multivariate logistic regression, controlling for socio-demographic and clinical factors. ResultsA total 3348 men participated (response rate=54%). Seventeen percent (95%CI 15.2%-17.9%), 16% (95%CI 15.1%-17.8%) and 11% (95%CI 9.5%-11.8%) of survivors scored in the range for depression, anxiety and distress on the DASS scales, respectively. In multivariate models, risk of depression on the DASS scale was significantly higher in men with higher urinary and androgen deprivation therapy (ADT)-related symptoms, and higher scores for fatigue, insomnia and financial difficulties. Risk of anxiety on the DASS scale was higher in men with higher scores for urinary, bowel and ADT-related symptoms and fatigue, dyspnoea and financial difficulties. Risk of distress on the DASS scale was positively associated with urinary, bowel and ADT-related symptoms, fatigue, insomnia and financial difficulties. ConclusionsCancer-related symptoms significantly predict psychological wellbeing among prostate cancer survivors. Greater use of interventions and medications and to alleviate symptoms might improve psychological wellbeing of prostate cancer survivors. Copyright (c) 2015 John Wiley & Sons, Ltd.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26120fa36381ad353d865bc84ef417e5",
  "timestamp": "2025-05-15T02:42:36.178369"
}