{
  "id": 7467,
  "title": "Equity and determinants in universal health coverage indicators in Iraq, 2000-2030: a national and subnational study",
  "abstract": "Background Equity is one of three dimensions of universal health coverage (UHC). However, Iraq has had capital-focused health services and successive conflicts and political turmoil have hampered health services around the country. Iraq has embarked on a new reconstruction process since 2018 and it could be time to aim for equitable healthcare access to realise UHC. We aimed to examine inequality and determinants associated with Iraq's progress towards UHC targets. Methods We assessed the progress toward UHC in the context of equity using six nationally representative population-based household surveys in Iraq in 2000-2018. We included 14 health service indicators and two financial risk protection indicators in our UHC progress assessment. Bayesian hierarchical regression model was used to estimate the trend, projection, and determinant analyses. Slope and relative index of inequality were used to assess wealth-based inequality. Results In the national-level health service indicators, inequality indices decreased substantially from 2000 to 2030. However, the wide inequalities are projected to remain in DTP3, measles, full immunisations, and antenatal care in 2030. The pro-rich inequality gap in catastrophic health expenditure increased significantly in all governorates except Sulaimaniya from 2007 to 2012. The higher increases in pro-rich inequality were found in Missan, Karbala, Erbil, and Diala. Mothers' higher education and more antenatal care visits were possible factors for increased coverage of health service indicators. The higher number of children and elderly population in the households were potential risk factors for an increased risk of catastrophic and impoverishing health payment in Iraq. Conclusions To reduce inequality in Iraq, urgent health-system reform is needed, with consideration for vulnerable households having female-heads, less educated mothers, and more children and/or elderly people. Considering varying inequity between and within governorates in Iraq, reconstruction of primary healthcare across the country and cross-sectoral targeted interventions for women should be prioritised.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2619191960175577133e7b249a0e01a0",
  "timestamp": "2025-05-15T03:09:07.221686"
}