{
  "id": 4093,
  "title": "Threshold effects of liquidity risk and credit risk on bank stability in the MENA region",
  "abstract": "This paper studies the relationships between both liquidity and credit risks on bank stability for a panel data set of 75 conventional banks belonging to 11 countries of the MENA region observed during the period 1999-2017. By performing a Panel Smooth Threshold Regression (PSTR) model developed by Gonzalez et al. (2005), estimation results show that the relationships between bank stability-credit risk and bank stability-liquidity risk are non-linear and characterized by the presence of two optimal thresholds which are equal to 13.16% for credit risk and 19.03% for liquidity risk. Contrary to their positive effects below these optimal thresholds, credit risk and liquidity risk become detrimental to bank stability in high regime. To ensure their stability, banks are encouraged to revise the primacy given to credit activity and diversify their activities to improve profitability. They are also recommended to strengthen their own funds and opt for appropriate restructuring to ease their small size. As for the States of the selected countries, they have to deeply reform their financial systems and develop the legal framework relating to new techniques of external management of banking risks including securitization and defeasance. Likewise, these states are fortified to ensure political stability, which is a key factor for banking and financial stability. (C) 2020 The Society for Policy Modeling. Published by Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "262d9ba17318879877a8928eec5ebbdd",
  "timestamp": "2025-05-15T02:33:03.468144"
}