{
  "id": 3248,
  "title": "Investigating the drivers of solid waste generation and disposal: evidence from South Africa",
  "abstract": "With rapid population growth and urbanization, the global annual waste generation is expected to increase to 3.40 billion tonnes by the year 2050, while improper waste disposal poses a potential threat of growing concern. Using a South African nationally representative survey dataset, the General Household Survey, this study unraveled the determinants of solid waste generation and factors influencing payment for its disposal. The estimation approach employed was essentially based on descriptive (percentage, standard deviation, mean) statistics. Additionally, Tobit regression of the composite solid waste were generated from the Principal Component Analysis, while Probit Regression model assessed the factors influencing the household's payment for solid waste. The empirical results revealed that household's socio-economic characteristics contributes to solid waste generation and payment for its disposal. The results of the two models indicated that, although household's asset portfolio (financial, physical, natural, and human assets) appear intangible, they contributed significantly to solid waste generation and payment for its disposal. Therefore, policy incentives targeted at investment in human capital, environmental awareness programmes and clearer solid waste management strategies should be encouraged in South Africa, given that environmental sustainability is key to the households' health and economic prosperity.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "262e1b60b11458ea76a1df374b798fe0",
  "timestamp": "2025-05-15T01:15:26.051818"
}