{
  "id": 5058,
  "title": "Intelligent transformation, fintech, and green Growth:A general equilibrium analysis based on credit allocation perspective",
  "abstract": "This paper conducted an in-depth study to elucidate the impact of corporate intelligence transformation and regional financial technology on green economic growth, particularly the role of credit resource allocation. We developed a multi-sector general equilibrium model, integrating the heterogeneity of intelligent transformation in production sectors and accounting for the influence of Fintech on financial institutions. Within this model framework, panel data from 2011 to 2021 at the provincial, municipal, and micro-enterprise levels in China were used to validate the theoretical model through a mixed regression approach. The findings indicate that as intelligent transformation firms receive more credit resources, their potential for green economic growth increases, contributing to reduced regional carbon emissions. Additionally, the excess productivity of intelligent transformation firms has a significant positive impact on regional carbon reduction efforts. Moreover, the advancement of Fintech reduces financial institutional costs, further optimizing credit allocation and lowering overall market interest rates, thereby promoting green development within the region. However, advancements in Fintech may also redirect more credit resources toward low-risk general enterprises, resulting in a credit crowding-out effect for intelligent transformation firms. These findings indicate that, while promoting intelligent transformation, policy measures should also balance the resource allocation effects of Fintech across different types of enterprises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2633210774099518053c819a7ed6cb93",
  "timestamp": "2025-05-15T02:43:40.284813"
}