{
  "id": 8850,
  "title": "Fourier Approximation for Modeling Limit of Insurance Liability",
  "abstract": "The liability limitation clause is a required element of any insurance policy. Determining such a limit requires an interruption (one or more) in the distribution of the claim process used for estimating the financial balance. These distributions are found in the literature as truncated distributions. This in turn leads to the question how to proceed with such mixed continuous/discrete distributions if one needs comprehensive analysis, including derivatives, mass functions. accurate simulations random variables with such distributions etc. In the present work the process of claiming as a stochastic process is defined by the important properties of the Poisson process. The question about defining models of the claim process, which arise in practice when imposing a limitation on liability for the individual payment of claims by the insurer is considered. There are different approaches for approximating the distribution functions for solving these issues. The focus in this paper is placed on an algorithmic method for approximation of functions of distribution with a trigonometric Fourier series, giving analytical form of these functions and allowing simulations to be made in the area of interruption of the obtained particular distribution. Results for one of the basically used distribution in the insurance practice Gamma distribution are presented. The results are compared with normal approximation. Any approximation leads to errors. For estimating and forecasting some of the most often used errors in the analysis are considered two methods - minimax estimation and the least square method. Considered regression models to predict the error, depending on the distribution parameters, provides an opportunity for comparative analysis when using generators of random variables. The achieved algorithmic method could be applied for estimating and forecasting the process of claiming and classical risk models.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26330df587ded81ae5404f6e60c22f03",
  "timestamp": "2025-05-15T03:22:57.941399"
}