{
  "id": 72,
  "title": "Analysis of early warning of corporate financial risk via deep learning artificial neural network",
  "abstract": "To forecast the financial crisis of manufacturing corporations more accurately, a risk warning model of corporate finance is constructed based on back propagation (BP) neural network to forecast the financial crisis. Firstly, based on the principle of index selection, the forecast indexes are selected and the index system of financial risk early warning is constructed. Then the index system is optimized by factor analysis. Finally, the BP neural network algorithm model is adopted to forecast the financial crisis of 200 manufacturing corporations in 2018 and 2019, and the forecasting results are compared with the traditional method. The results show that the prediction accuracy of the enterprise financial risk early warning model based on the BP neural network for 2018 is above 85%, and the prediction accuracy for 2019 is above 95%, or even 100%. Through comparison with other traditional methods, the prediction accuracy of the BP neural network in 2018 (above 88%) is higher than that of other algorithms (below 87%). In 2019, the prediction accuracy of BP neural network (above 90%) is higher than other algorithms (less than 88%). The accuracy of the proposed financial risk warning model is 95%, and the accuracy is at least 2% higher than traditional method, which prove that the risk early warning model constructed in this study can accurately forecast the financial crisis of the corporation. This study is of important reference value for the establishment of efficient financial crisis forecasting model under deep learning.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26516422e32993a817b7e4e2c2a0f837",
  "timestamp": "2025-05-15T01:46:39.489798"
}