{
  "id": 9122,
  "title": "Appetite and Protein Intake Strata of Older Adults in the European Union: Socio-Demographic and Health Characteristics, Diet-Related and Physical Activity Behaviours",
  "abstract": "Considerable efforts have been directed towards stimulating healthy ageing regarding protein intake and malnutrition, yet large-scale consumer studies are scarce and fragmented. This study aims to profile older adults in the European Union (EU) according to appetite (poor/good) and protein intake (lower/higher) strata, and to identify dietary and physical activity behaviours. A survey with older (aged 65 years or above) adults (n = 1825) in five EU countries (Netherlands, United Kingdom, Finland, Spain and Poland) was conducted in June 2017. Four appetite and protein intake strata were identified based on simplified nutritional appetite questionnaire (SNAQ) scores (14 versus >14) and the probability of a protein intake below 1.0 g/kg adjusted BW/day (0.3 versus <0.3) based on the 14-item Pro55+ screener: appiPoor appetite and lower level of protein intake (12.2%); APpiGood appetite but lower level of protein intake (25.5%); apPIPoor appetite but higher level of protein intake (14.8%); and APPIGood appetite and higher level of protein intake (47.5%). The stratum of older adults with a poor appetite and lower level of protein intake (12.2%) is characterized by a larger share of people aged 70 years or above, living in the UK or Finland, having an education below tertiary level, who reported some or severe financial difficulties, having less knowledge about dietary protein and being fussier about food. This stratum also tends to have a higher risk of malnutrition in general, oral-health related problems, experience more difficulties in mobility and meal preparation, lower confidence in their ability to engage in physical activities in difficult situations, and a lower readiness to follow dietary advice. Two multivariate linear regression models were used to identify the behavioural determinants that might explain the probability of lower protein intake, stratified by appetite status. This study provides an overview and highlights the similarities and differences in the strata profiles. Recommendations for optimal dietary and physical activity strategies to prevent protein malnutrition were derived, discussed and tailored according to older adults' profiles.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2653d5283096970f554fbfabe3483737",
  "timestamp": "2025-05-15T03:25:54.543462"
}