{
  "id": 4301,
  "title": "Eating difficulties in children born late and moderately preterm at 2 y of age: a prospective population-based cohort study",
  "abstract": "Background: Very preterm (<32 Wk of gestation) infants are at increased risk of eating difficulties compared with their term-born peers. Little is known about the impact of late and moderately preterm (LMPT; 32-36 wk of gestation) birth on eating difficulties in early childhood. Objectives: The aims were to assess the prevalence of eating difficulties in infants born LMPT at 2 y corrected age and to explore the impact of neonatal and neurodevelopmental factors. Design: A geographic population-based cohort of 1130 LMPT and 1255 term-born controls was recruited at birth. The parents of 651 (59%) LMPT and 771 (62%) term-born infants completed questionnaires at 2 y corrected age to assess neurodevelopmental outcomes. Parents also completed a validated questionnaire to assess eating behaviors in 4 domains: refusal/picky eating, oral motor problems, oral hypersensitivity, and eating behavior problems. Infants with scores >90th percentile were classified with eating difficulties in each domain. Neonatal data were collected at discharge, and sociodemographic information was collected via maternal interview. Poisson regression was used to assess between-group differences in eating difficulties and to explore associations with neonatal factors and neurodevelopmental outcomes at 2 y of age. Results: In unadjusted analyses, LMPT infants were at increased risk of refusal/picky eating (RR: 1.53; 95% CI: 1.03, 2.25) and oral motor problems (RR: 1.62; 95% CI: 1.06, 2.47). Prolonged nasogastric feeding >2 wk (RR: 1.87; 95% CI: 1.07, 3.25), behavior problems (RR: 2.95; 95% CI: 1.93, 4.52), and delayed social competence (RR: 2.28; 95% CI: 1.49, 3.48) were independently associated with eating difficulties in multivariable analyses. After adjustment for these factors, there was no excess of eating difficulties in LMPT infants. Conclusions: Infants born LMPT are at increased risk of oral motor and picky eating problems at 2 y corrected age. However, these are mediated by other neurobehavioral sequelae in this population. This trial was registered on the UK Clinical Research Network Portfolio at http://public.ukamorg.uldsearch/ as UKCRN Study ID 7441.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2688ff228f887a324b3550cf19b099c5",
  "timestamp": "2025-05-15T01:25:50.495003"
}