{
  "id": 4150,
  "title": "The Long-Term Extreme Price Risk Measure of Portfolio in Inventory Financing: An Application to Dynamic Impawn Rate Interval",
  "abstract": "Different from the short-term risk measure for traditional financial assets (stocks, bonds, etc.), the key to illiquid inventory portfolio traded in the over-the-counter markets is to estimate the long-term extreme price risk with time varying volatility. In this article, a new long-term extreme price risk (value at risk and conditional value at risk) measure method for inventory portfolio and an application to dynamic impawn rate interval are proposed. To realize this, we first establish AutoRegressive Moving Average-Exponential Generalized Autoregressive Conditional Heteroskedasticity-Extreme Value Theory model and multivariatet-Copula to depict the autocorrelation, fat tails, and volatility clustering of returns of inventories and the nonlinear dependence structure of inventories. Furthermore, we obtain the long-term extreme price risk with time varying volatility via Monte Carlo simulation instead of square-root-of time rule. The results show that, first, benefits from risk diversification is significant; second, long-term extreme price risk measure of inventory portfolio via Monte Carlo method outperforms the square-root-of time rule; the last is that the dynamic rate interval based on the long-term price risk is superior to the crude rules of thumb in terms of reducing efficiency loss and improving risk coverage. In summary, this article provides a new quantitative framework for managing the risk of portfolio in inventory financing practice for banks constrained by risk limitation. (c) 2014 Wiley Periodicals, Inc. Complexity 20: 17-34, 2015",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "269413dd84bb086119ef2af9d658915d",
  "timestamp": "2025-05-15T02:33:42.102727"
}