{
  "id": 9105,
  "title": "A Longitudinal Study of the Association of Awareness of Disease Incurability with Patient-Reported Outcomes in Heart Failure",
  "abstract": "Objectives To examine awareness of disease incurability among patients with heart failure over 24 mo and its associations with patient characteristics and patient-reported outcomes (distress, emotional, and spiritual well-being). Methods This study analyzed 24-mo data from a prospective cohort study of 251 patients with heart failure (New York Heart Association class III/IV) recruited from inpatient wards in Singapore General Hospital and National Heart Centre Singapore. Patients were asked to report if their doctor told them they were receiving treatment to cure their condition. No responses were categorized as being aware of disease incurability, while Yes and Uncertain were categorized as being unaware and being uncertain about disease incurability, respectively. We used mixed-effects multinomial logistic regression to investigate the associations between awareness of disease incurability and patient characteristics and mixed-effects linear regressions to investigate associations with patient outcomes. Results The percentage of patients who were aware of disease incurability increased from 51.6% at baseline to 76.4% at 24-mo follow-up (P < 0.001). Compared with being unaware of disease incurability, being aware was associated with older age (relative risk ratio [RRR] = 1.04; P = 0.005), adequate self-care confidence (RRR = 5.06; P < 0.001), participation in treatment decision making (RRR = 2.13; P = 0.006), higher education (RRR = 2.00; P = 0.033), financial difficulty (RRR = 1.18; P = 0.020), symptom burden (RRR = 1.08; P = 0.001), and ethnicity (P < 0.05). Compared with being unaware of disease incurability, being aware was associated with higher emotional well-being (beta = 0.76; P = 0.024), while being uncertain about disease incurability was associated with poorer spiritual well-being (beta = -3.16; P = 0.006). Conclusions Our findings support the importance of being aware of disease incurability, addressing uncertainty around disease incurability among patients with heart failure, and helping patients make informed medical decisions. The findings are important to Asian and other cultures where the prognosis disclosure to terminally ill patients is generally low with an intention to protect patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2697c02972d2ead6aa13dade68af8778",
  "timestamp": "2025-05-15T03:25:27.785799"
}