{
  "id": 8692,
  "title": "Season of Birth, Daylight Hours at Birth, and High Myopia",
  "abstract": "Purpose: Mandel et al recently reported that season of birth and daylight hours (photoperiod) at birth were associated with moderate and high levels of myopia in Israeli conscripts. We sought to investigate whether these associations were evident in subjects from the United Kingdom (UK). Design: Retrospective cross-sectional study. Participants: The study population comprised 74,459 subjects aged 18 to 100 years attending UK optometry practices for an eye examination. Methods: Data comprising non-cycloplegic spectacle prescription, sex, date of birth, and date of eye examination were collected from UK optometry practices. The average refractive error in fellow eyes was used to classify the degree of myopia in diopters (D) for each subject as follows: absent (>-0.75 D), low (-0.75 to -2.99 D), moderate (-3.00 to -5.99 D), or high (<-6.00 D). The average monthly hours of daylight for London, UK, were classified into 1 of 4 photoperiod categories, following Mandel et a[. The odds ratio (OR) for each level of severity of myopia was calculated using multivariate logistic regression with age, sex, and either season of birth or photoperiod category as risk factors. Main Outcome Measures: The OR for season of birth and photoperiod category as potential risk factors for myopia. Results: Season of birth was significantly associated with the presence of high myopia: Subjects born in summer or autumn were more likely to be highly myopic compared with those born in winter (summer OR = 1.17; 95% confidence interval [CI], 1.05-1.30; P = 0.006; autumn OR = 1.16; 95% CI, 1.04-1.30; P = 0.007). However, season of birth was not a significant risk factor for low or moderate myopia. Photoperiod category was weakly associated with low myopia (OR = 0.94; 95% CI, 0.89-0.99; P = 0.019), but with a direction of effect opposite to that observed by Mandel et al. Conclusions: As in Israel, a disproportionate number of UK high myopes were born in summer or autumn rather than in winter. However, unlike the situation in Israel, this association does not seem to be related to daylight hours during the postnatal period, implicating alternative physiologic influences that vary with season, such as birth weight. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:468-473 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2698702a250194f166ba43ba49afc841",
  "timestamp": "2025-05-15T03:21:24.689509"
}