{
  "id": 513,
  "title": "Improvement of Commercial Activities Through a better Identification of Exporting Companies using Unstructured Data",
  "abstract": "This paper is a use case study and aims to investigate the potential added value of unstructured data available on the world wide web for the commercial activity and risk evaluation in a trade credit insurance company. Identification of potential clients, prospects, is a key challenge for every company. In credit insurance we insure the risk of non payment in a transaction between a seller and a buyer. Therefore finding new clients means finding these sellers that have insurable transactions that are perceived as being risky enough to take an insurance. The risk for the credit insurer is on the buyer. More often than not these buyers are active in countries where structured data such as financial statements are hard to find. More than ever companies have websites and use social media channels leaving a lot of digital traces and potential useful information on the web. Although this information might lack objectivity and standardization, when handled in a smart way it can prove to be very useful due to the fact it gives a very recent and qualititave view compared to for example financial statements that give a quantitave view on the performance of last year. As an experiment we decided to look into the potential of website data to increase the effectivenss of our commercial activity in Belgium. We started with a sample of all active Belgian companies with more than 10 FTE and retrieved the words on the first 50 pages of their website. Using seed words and feature selection we were able to structure the information. Unsupervised learning techniques such as hierarchical clustering and supervised learning techniques such as Boosted trees were used to identify similar companies and model for the propensity of being an exporter. The results of the first experiment look promising and have already proven to be useful to identify the clients to approach in marketing campaigns and prospect conferences.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26999fbb262096fb0404576aaac3bf39",
  "timestamp": "2025-05-15T01:52:12.174990"
}