{
  "id": 6565,
  "title": "Gender disparity and post-traumatic stress disorder and elevated psychological distress in humanitarian migrants resettled in Australia: the moderating role of socioeconomic factors",
  "abstract": "Aims. Humanitarian migrants are at increased risk of post-traumatic stress disorder (PTSD) and elevated psychological distress. However, men and women often report varying degrees of stress and experience different challenges during migration. While studies have explored PTSD, psychological distress, gender, and resettlement stressors, they have not explored the interplay between these factors. This study aims to address that gap by investigating gender disparities in PTSD and psychological distress among humanitarian migrants in Australia, with a focus on the moderating role of socioeconomic factors. Methods. This study used data from five waves of the Building a New Life in Australia (BNLA) survey, a longitudinal study of 2,399 humanitarian migrants who arrived in Australia in 2013. PTSD and psychological distress were measured using the PTSD-8 and Kessler-6 (K6) scales, respectively. We conducted generalised linear mixed-effect logistic regression analyses stratified by gender. Results. Female humanitarian migrants exhibited a significantly higher prevalence of PTSD and psychological distress than males over five years of resettlement in Australia. Women facing financial hardship, unemployment, or residing in short-term housing reported greater levels of PTSD and distress compared to men. Conclusions. Women facing financial hardship, inadequate housing, and unemployment exhibit higher rates of PTSD and psychological distress, underscoring the significant impact of socioeconomic factors. Addressing these challenges at both individual and systemic levels is essential for promoting well-being and managing mental health among female humanitarian migrants.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26a904e9f2af884556347d7604d5f1b9",
  "timestamp": "2025-05-15T02:59:36.862057"
}