{
  "id": 5474,
  "title": "The Relationship on Risk Type, Risk Management and Business Performance - Evidence from Korean FDIs in China",
  "abstract": "Purpose - As the well-known Structure-Conduct-Performance paradigm implies, risk structure of a corporation may affect its risk management activity and the activity may in turn determine its performance. Depending on its goal, Foreign Direct Investment (FDI) can shape its risk structure, risk management and its performance. Under this assumption, we investigate the relationship between the goals of FDI and risk management for the first time in academics. Design/methodology - This empirical research uses a survey of 279 current Korean enterprises' FDIs in China with the recently developed business risk quadrant model. Companies are classified into either a market- or an efficiency-seeking group, to identify how each group perceives and manages risks, and values the performance of risk management. Also, we apply integrated risk management method that multinational corporations have introduced in China, then verify the mediating effect between risk factors and performance. Findings - Our research shows the FDIs can expose themselves to differing risk structure although risk management activities simply represent the level of empowerment given to local management by headquarter due to limit of sample size despite diversity of risk and risk management tools. To sum, market seekers are found to have more strategic risk (revenue related risk) than efficiency seekers with financial risk (cost related risk). The market seekers can manage their risk by empowering their local organisation while the efficiency does the opposite ways. The risk management appears to be successful in general. Originality/value - Previous studies on small and medium enterprises' FDIs to China have concentrated on the analysis of entry determinants, withdrawal factors and individual risk management. Meanwhile, this research establishes enterprise-wide risk factors faced by the companies that advance into China, according to the method of the classification by ERM and verifies if they could synthetically improve performance through risk corresponding measures.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26ad38083b22de69e7b7a7ff0f4a2bdd",
  "timestamp": "2025-05-15T02:48:23.590022"
}