{
  "id": 2253,
  "title": "Global impact of geopolitical oil price uncertainty and associated commodity prices on clean energy stocks",
  "abstract": "Theoretically, geopolitical risk and policy uncertainties can directly affect energy markets. Since fluctuations in it lead to cost the of clean energy sources as they compete with traditional energy. Regarding this, our study aims to scrutinize the impact of geopolitical oil price uncertainty on clean energy stocks by controlling the influences of economic policy uncertainty, gold, natural gas, and coal prices. For that purpose, the study utilized monthly data from July 2007 to September 2020 and employed a machine learning method, namely kernel-based regularized least squares approach. Empirical analysis reveals that geopolitical oil price uncertainty and coal prices have a nonlinear positive effect on clean energy stock prices. It is also found that the impact of global economic policy uncertainty, gold, and natural gas prices on clean energy stock prices is nonlinear and negative. The implication signifies that clean energy stock prices are hampered by economic policy uncertainty, and gold, and natural gas prices, thus hindering the development of clean energy sources. Similarly, for the robustness of the study, the quantile regression approach and findings reveal similar outcomes to that of the KRLS model. Based on these findings, policy implications that potentially aid renewable energy investments are put forward. The study also guides investors, financial advisors, and portfolio managers for better decision-making in consideration of uncertainties and associated fluctuations in energy markets and commodity prices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26b04bd4caf3c52a0939942f037ffd6f",
  "timestamp": "2025-05-15T02:12:51.073457"
}