{
  "id": 6614,
  "title": "Joint modeling of the longitudinal student mark and the competing events of degree completion and academic dropout",
  "abstract": "Within educational data mining, it is common to model students' academic performance using a linear regression model or the time to degree completion or dropout using the cause-specific hazard model. Yet to our knowledge, no studies have simultaneously modeled the longitudinal performance and the hazard models. We propose a joint modeling approach in which we estimate the effect of a student's semester longitudinal weighted mark obtained after attempting t credit points, on the hazard of degree completion and academic dropout. Evidence suggests that the joint modeling approach is substantially more efficient compared to the separate modeling of the longitudinal and the time-to-event outcomes. We observe similarities in the parameter estimates of the longitudinal submodels, but smaller standard errors of the estimates in the joint model. However, the parameter estimates of the competing risk models from both analysis methods are different. A unit increase in the average log weighted mark results in a 18.5 fold increase in the hazard associated with degree completion, but reduces the risk of dropout by 49 per cent. Being in a university-type residence, not having financial aid, and having a higher number of high school matriculation points all increase the hazard rate of degree completion.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26bc43227206729226eeab44fa5091c2",
  "timestamp": "2025-05-15T03:00:04.909011"
}