{
  "id": 6273,
  "title": "Prevalence of Nontraumatic Osteonecrosis of the Femoral Head and its Associated Risk Factors in the Chinese Population: Results from a Nationally Representative Survey",
  "abstract": "Background: Nontraumatic osteonecrosis of the femoral head (NONFH) is a debilitating disease that represents a significant financial burden for both individuals and healthcare systems. Despite its significance, however, its prevalence in the Chinese general population remains unknown. This study aimed to investigate the prevalence of NONFH and its associated risk factors in the Chinese population. Methods: A nationally representative survey of 30,030 respondents was undertaken from June 2012 to August 2013. All participants underwent a questionnaire investigation, physical examination of hip, and bilateral hip joint X-ray and/or magnetic resonance imaging examination. Blood samples were taken after overnight fasting to test serum total cholesterol, triglyceride, and high-density lipoprotein (HDL) and low-density lipoprotein (LDL) levels. We then used multivariate logistic regression analysis to investigate the associations between various metabolic, demographic, and lifestyle-related variables and NONFH. Results: NONFH was diagnosed in 218 subjects (0.725%) and the estimated NONFH cases were 8.12 million among Chinese people aged 15 years and over. The prevalence of NONFH was significantly higher in males than in females (1.02% vs. 0.51%, chi(2) = 24.997, P < 0.001). Among NONFH patients, North residents were subjected to higher prevalence of NONFH than that of South residents (0.85% vs. 0.61%, chi(2) = 5.847, P = 0.016). Our multivariate regression analysis showed that high blood levels of triglycerides, total cholesterol, LDL-cholesterol, and non-HDL-cholesterol, male, urban residence, family history of osteonecrosis of the femoral head, heavy smoking, alcohol abuse and glucocorticoid intake, overweight, and obesity were all significantly associated with an increased risk of NONFH. Conclusions: Our findings highlight that NONFH is a significant public health challenge in China and underscore the need for policy measures on the national level. Furthermore, NONFH shares a number of risk factors with atherosclerosis.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26bc620ba671e30001e4d61c150a14de",
  "timestamp": "2025-05-15T02:56:37.280986"
}