{
  "id": 6734,
  "title": "Mental health problems and suicidal behavior from adolescence to young adulthood in college: linking two population-based studies",
  "abstract": "It is well established that mental health problems are highly recurrent and persistent from childhood to adolescence, but less is known to what extent mental health problems also persist from adolescence into young adulthood. The aim of the current study was therefore to examine the chronicity and risk of mental health problems and suicidality from adolescence to young adulthood. Data stem from two Norwegian population-based studies conducted 6 years apart; the youth@hordaland study from 2012 (age 16-19) and the SHoT2018 study (age 22-25). These two data sources were linked to produce a longitudinal sample of 1257 individuals. A wide range of self-reported mental health and suicidality instruments (used both continuously and categorically) were analyzed using log-link binomial regression analysis, adjusting for age, sex, parental education, and financial problems. We found that high levels of mental health problems in late adolescence were a significant risk factor for reporting poor mental health 6 years later. Internalizing and externalizing problems in adolescence were associated with a 2.8-fold and 1.9-fold increased risk, respectively, of reporting a mental disorder 6 years later. Similarly, self-harm in adolescence was associated with a 2.1-fold increased risk of suicidal thoughts 6 years later. The magnitudes of the adjusted risk ratios were generally similar across the various mental health and suicidality measures used at the two assessment points. Adjustment for confounders did not, or only slightly, attenuate the risk ratios, and all associations remained statistically significant in the adjusted analyses. This longitudinal study provides new evidence of the chronicity of mental health problems and suicidality from adolescence to adulthood in Norway. The results emphasize the importance of early identification and timely interventions to reduce the prevalence and impact of mental health problems and suicidality.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26c10d6872648a6facacc9fb5d6ccb80",
  "timestamp": "2025-05-15T03:01:03.588198"
}