{
  "id": 7906,
  "title": "Routine preoperative restaging CTs after neoadjuvant chemoradiation for locally advanced rectal cancer are low yield: A retrospective case study",
  "abstract": "Introduction: Pre-operative restaging CT scans are often performed routinely following neoadjuvant chemoradiotherapy for locally advanced rectal cancer. There is a paucity of data on the utility of this common practice. We sought to determine how often restaging CTs identified disease progression or regression that altered management. Methods: We performed a single-institution retrospective study. From 2007 to 2011, 182 patients had newly-diagnosed, non-metastatic rectal adenocarcinoma, of which 96 were surgical candidates with clinical stage II/III disease. Ninety-one of these patients (95%) completed neoadjuvant chemoradiation. Results: Eighty-three out of 91 patients (91%) had restaging CTs. Four patients (5%) had new lesions suspicious for distant metastasis (2 lung, 2 liver) on restaging CT scan reports (1 of these was present on initial staging CT but not reported). All 4 patients had node-positive disease. In no case did restaging CT result in a change in surgical management. Discussion: Because of the financial costs and established risks of intravenous contrast and cumulative radiation exposure, it may be advisable to take a more selective approach to preoperative imaging. Larger, prospective studies may enable identification of an at-risk cohort who would benefit most from restaging CT. Conclusion: Routine restaging CT scans are low yield in the management of locally advanced rectal cancer. (C) 2014 Surgical Associates Ltd. Published by Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26dde53c123efdae4e553e535f5a2414",
  "timestamp": "2025-05-15T03:13:04.988065"
}