{
  "id": 841,
  "title": "The preventing recurrent vascular events and neurological worsening through intensive organized case-management (PREVENTION) trial protocol [clinicaltrials.gov identifier: NCT00931788]",
  "abstract": "Background: Survivors of transient ischemic attack (TIA) or stroke are at high risk for recurrent vascular events and aggressive treatment of vascular risk factors can reduce this risk. However, vascular risk factors, especially hypertension and high cholesterol, are not managed optimally even in those patients seen in specialized clinics. This gap between the evidence for secondary prevention of stroke and the clinical reality leads to suboptimal patient outcomes. In this study, we will be testing a pharmacist case manager for delivery of stroke prevention services. We hypothesize this new structure will improve processes of care which in turn should lead to improved outcomes. Methods: We will conduct a prospective, randomized, controlled open-label with blinded ascertainment of outcomes (PROBE) trial. Treatment allocation will be concealed from the study personnel, and all outcomes will be collected in an independent and blinded manner by observers who have not been involved in the patient's clinical care or trial participation and who are masked to baseline measurements. Patients will be randomized to control or a pharmacist case manager treating vascular risk factors to guideline-recommended target levels. Eligible patients will include all adult patients seen at stroke prevention clinics in Edmonton, Alberta after an ischemic stroke or TIA who have uncontrolled hypertension (defined as systolic blood pressure (BP) > 140 mm Hg) or dyslipidemia (fasting LDL-cholesterol > 2.00 mmol/L) and who are not cognitively impaired or institutionalized. The primary outcome will be the proportion of subjects who attain 'optimal BP and lipid control'(defined as systolic BP < 140 mm Hg and fasting LDL cholesterol < 2.0 mmol/L) at six months compared to baseline; 12-month data will also be collected for analyses of sustainability of any effects. A variety of secondary outcomes related to vascular risk and health-related quality of life will also be collected. Conclusions: Nearly one-quarter of those who survive a TIA or minor stroke suffer another vascular event within a year. If our intervention improves the provision of secondary prevention therapies in these patients, the clinical (and financial) implications will be enormous.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "26ee86a17c14f4d11bb4a50f6e3eb435",
  "timestamp": "2025-05-15T01:43:20.611222"
}