{
  "id": 6272,
  "title": "The Impact of Socioeconomic Risk Factors on the Survival Outcomes of Patients With Newly Diagnosed Multiple Myeloma: A Cross-analysis of a Population-based Registry and a Tertiary Care Center",
  "abstract": "Background: Multiple myeloma (MM) is a heterogeneous clonal plasma cell disorder leading to differences in clinical outcomes such as overall survival (OS) among patients. We hypothesized that with expensive, novel therapeutic agents and paradigm shifts to maintain continuous therapy and improvement in OS, patients with MM are subject to the pressures of financial toxicity and the need for social support, which may be of prognostic importance. Materials and Methods: In this study, we examined the records of 122,458 patients from the National Cancer Database (NCDB) to determine the significance of socioeconomic factors such as estimated annual household income and education level, which were based on the patient's ZIP Code and the United States Census Bureau's 5-year report from 2008 to 2012. These socioeconomic factors, in addition to marital status, were then assessed individually and as a cumulative socioeconomic score for prognostic significance in a cohort of 2543 patients treated at a tertiary care center utilizing known biologic risk factors, such as cytogenetic risk, International Staging System classification, and serum lactate dehydrogenase levels. Results: Only marital status and estimated annual household income at diagnosis negatively impacted OS in a univariate analysis, but not in the context of a multivariable analysis incorporating known biologic risk factors. Conclusion: Future analyses in other academic and non-academic centers located in urban and rural regions are required to understand the socioeconomic drivers of OS disparity among patients with MM observed nationally. (C) 2021 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2703589d0f9777f69f121914b3dc2986",
  "timestamp": "2025-05-15T02:56:37.276876"
}