{
  "id": 8354,
  "title": "Risk of Acute Angle Closure and Changes in Intraocular Pressure after Pupillary Dilation in Asian Subjects with Narrow Angles",
  "abstract": "Objective: To evaluate the risk of primary acute angle closure (AAC), changes in intraocular pressure (IOP), and associated risk factors after pupil dilation in Asian subjects with narrow angles (primary angle-closure suspects [PACS]). Design: Prospective clinical study. Participants: A total of 471 subjects aged more than 50 years with narrow angles in Singapore. Methods: This study was part of a prospective trial of PACS. Subjects underwent a detailed ophthalmic evaluation including gonioscopy, biometry, pachymetry, and ultrasound biomicroscopy. All subjects underwent pupil dilation with 1% tropicamide eye drops at the baseline visit, before any laser or medical intervention. Intraocular pressure was measured using Goldmann applanation tonometry by the same observer before and 1 hour after pupil dilation. A dose of oral acetazolamide was given before the patient left the clinic. Main Outcome Measures: Intraocular pressure before and after dilation, and an AAC event. Results: The mean age of the 471 subjects was 63.0 +/- 6.9 years (mean +/- standard deviation); 75.4% were women, and 92.8% were Chinese. Of the 471 participants, 3 (0.64%; 95% confidence interval [CI], 0.13-1.85) developed AAC within 6 hours of dilation despite pretreatment with oral acetazolamide. Twenty-two subjects (4.67%; 95% CI, 2.95-6.99) showed a postdilation increase in IOP of >= 5 mmHg in either eye, 6 subjects (1.27%; 95% CI, 0.47-2.75) had an IOP increase of >= 8 mmHg in either eye, and 4 subjects (0.85%; 95% CI, 0.23-2.16) had a postdilation IOP of >25 mmHg in either eye. Narrower gonioscopic angle width, that is, having a lower mean gonioscopic modified Shaffer grading (coefficient beta -0.51; standard error 0.19; P = 0.01), and predilation IOP level (coefficient beta -0.17; standard error 0.04; P = 0.001) were significant risk factors for IOP increase after dilation in multivariate linear regression analysis. Conclusions: The risk of AAC among Asian subjects with narrow angles was low after pupillary dilation with tropicamide and oral acetazolamide prophylaxis. The presence of narrower angle width by gonioscopy was the only clinical parameter identified for a significant IOP increase after pupil dilation. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:474-480 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "271004c44a9fa8ce6b67096ffdb9f91a",
  "timestamp": "2025-05-15T03:17:49.196013"
}