{
  "id": 17,
  "title": "Application of decision tree classification algorithm for financial management and risk early warning in universities",
  "abstract": "In order to improve the effect of financial management and risk (FMAR) early warning in colleges and universities (CAU), this paper combines the decision tree classification algorithm to process financial management data in CAU as well as constructs a four-dimensional dynamic investment decision-making game system. The stability criterion of discrete dynamical system is used to analyze and discuss the stability of each equilibrium point (EP) of nonlinear system. This could be improved to: We utilize the stability criterion of a discrete dynamical system to analyze and discuss the stability of equilibrium points in the nonlinear system. A financial management early warning model for universities was constructed based on actual situations, and the practical effect of the model was verified through experimental analysis methods. The parameter conditions when the EP is asymptotically stable in the system are given. In addition, this paper combines the decision tree algorithm to build a FMAR early warning system for CAU. The experimental analysis shows that the decision tree classification algorithm proposed in this paper has obvious application effect in the FMAR early warning of CAU. This article effectively simulates the nonlinear management mode in financial management of universities and reflects the actual economic activities and related influencing factors of universities through function simulation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2724effc7faa12cbe944e349d6fc98ac",
  "timestamp": "2025-05-15T01:46:03.759333"
}