{
  "id": 9104,
  "title": "Parent-Reported Adverse Childhood Experiences and Food Insecurity Among Children in Non-English-Speaking Households in the United States",
  "abstract": "Adverse childhood experiences (ACEs) are potentially traumatic events associated with the risk of food insecurities in the United States (U.S). However, there is a scarcity of studies investigating this association, particularly for children in non-English-speaking households. Therefore, this study examines the association between individual and cumulative ACEs with food insecurity for children in non-English-speaking households in the U.S. Using data extracted from the 2022 National Survey of Children's Health, the weighted sample of 4,677 children aged 0 to 17 was obtained. The dependent variable was binary food insecurity (food secure vs. food insecure). Independent variables included 11 individual ACEs (i.e., economic hardship, parent/guardian divorce, etc.) and cumulative ACEs (0 ACE, 1 ACE, 2 ACEs, and 3 >= ACEs). Data were analyzed using six sets of multivariate logistic regression models with household food insecurity as an outcome variable across ACEs while controlling for individual, family, and community level characteristics. Of the 4,677 children, 22.4% experienced at least one or more ACEs, and 4.5% experienced food insecurity. After controlling for other factors, individual ACEs, including family economic hardships (adjusted odds ratios [aOR] = 13.2), parents/guardians divorced (aOR = 2.65), and parents/guardians died (aOR = 3.59) were associated with higher odds of food insecurity among children. After covariates adjustment, children with at least one ACEs (aOR = 1.98), two ACEs (aOR = 3.51), and three or more ACEs (aOR = 2.25) were associated with higher odds of food insecurity compared to children with no ACEs. Therefore, preventing ACEs is crucial to mitigate their negative impact on food insecurity for children and families in low income households. Interventions should focus on preventing ACEs and increasing financial resources needed for economic support, which can be strengthened through public assistance programs such as Supplemental Nutrition Assistance Programs and Women and Infant programs and supplemented by existing social support systems so that low-income non-English-speaking families can afford food to support their children.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "273ac71c654ed3dd61b0d6819e9bf087",
  "timestamp": "2025-05-15T03:25:27.784272"
}