{
  "id": 5770,
  "title": "A Multi-Criteria Approach to Sustainable Risk Management of Supplier Portfolio: A Case Study at Defense Industry",
  "abstract": "Supply Chain Management plays an important role in the success and performance of businesses. Supply chains have to adapt to changes in technological advancements and customer expectations to maintain competitive advantage. On the other hand, driving factors such as risk reduction, increasing the financial performance of the supply chain, societal influence, governmental requirements and attracting customers who give importance to sustainability have been influential in the increasing interest in the concept of Sustainable Supply Chain. Therefore, businesses maintain their supply chain operations while focusing on economic, environmental and social dimensions. Additionally, the risk evaluation methods employed in supply chain management are considered to be more qualitative rather than quantitative. This study conducted in a Turkish defense industry company introduces a quantitative framework that allows the evaluation of risks and risk management practices required for sustainable supplier performance with the help of a Multi Criteria Decision Making (MCDM) approach. In this study, Analytical Hierarchy Process (AHP) and Rating Methods are applied together in order to evaluate risks through classification of critical suppliers with respect to business volume, capabilities and schedule certainty. Using this framework, Sustainable Supplier Risk Scores (SSRS) of each class of suppliers have been calculated and specific risk management practices have been determined for each class. The objective is to establish effective supply chain risk management practices, which provide long term partnership with suppliers in a business with strategic customers, high cost of production, high expectations in terms of quality and high level of supply chain risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27458561ce9daa0534943f2c84b7b803",
  "timestamp": "2025-05-15T02:51:29.973370"
}