{
  "id": 1081,
  "title": "The impact of risk spillover network-based multidimensional systemic risks on the real economy",
  "abstract": "Multidimensional systemic risk measures are constructed based on dynamic risk spillover networks to quantify the level, transmission speed, and transmission breadth. To investigate the significance, direction, magnitude, and persistence of the impacts of systemic risks on future real economic distribution, we combine the quantile regression model and Bootstrap quantile t test method. Finally, the heterogeneity of the impacts of systemic risks and SIFIs (systemically important financial institutions) risks is analysed. Our empirical results find that 1) most bank companies take the role of risk drivers in the financial system, while most security, insurance, trust, and real estate companies take the role of risk distributors and risk receivers. 2) the total spillover index, average shortest path length, and average clustering coefficient have significant impacts on the left tail and central tendency of future real economy, and the latter two measures also have significant impacts on the right tail. 3) SIFIs risks have earlier and greater impacts than Non-SIFIs (non-systemically important financial institutions) risks. Multidimensional systemic risks contain additional information to identify financial risks earlier than single institutions risks. 4) the impacts of financial risks on the real economy are persistent. The superimposition of impacts may trigger extreme risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2759c878788c53432a4c0f3747b6b42d",
  "timestamp": "2025-05-15T01:58:43.380140"
}