{
  "id": 3907,
  "title": "Effect of Financial Stress and Positive Financial Behaviors on Cost-Related Nonadherence to Health Regimens Among Adults in a Community-Based Setting",
  "abstract": "Introduction Little is known about the role of positive financial behaviors (behaviors that allow maintenance of financial stability with financial resources) in mitigating cost-related nonadherence (CRN) to health regimens. This study examined the relationships between positive financial behaviors, financial stress, and CRN. Methods Data came from the 2011 Speak to Your Health! Community Survey (n = 1,234). Descriptive statistics were computed to examine financial stress and CRN, by chronic condition and health insurance status. We used multivariate logistic regression models to examine the relationship between positive financial behaviors and financial stress and their interaction on a composite score of CRN, controlling for health insurance status, educational level, age, marital status, number of chronic conditions, and employment status. Results Thirty percent of the sample engaged in CRN. Participants reported moderate financial stress (mean, 13.85; standard deviation [SD] = 6.97), and moderate positive financial behavior (mean, 8.84; SD = 3.24). Participants with employer-sponsored insurance, Medicaid, Medicare, the Genesee Health Plan, high blood pressure, asthma, and diabetes had the highest proportion of CRN. The relationship between financial stress and CRN was not significantly different between those who reported lower versus higher levels of positive financial behavior (P = .32). Greater financial stress was associated with a greater likelihood of CRN (odds ratio [OR] = 2.49; 95% confidence interval [CI], 2.08-2.99). Higher level of positive financial behavior was associated with a lower likelihood of CRN (OR = 0.80; 95% CI, 0.67-0.94). Conclusion Financial literacy as a means of promoting positive financial behavior may help reduce CRN. An intervention strategy focused on improving financial literacy may be relevant for high-risk groups who report high levels of financial stress.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "275b07abf722738244236018d1bdc7bf",
  "timestamp": "2025-05-15T02:30:58.388903"
}