{
  "id": 8620,
  "title": "Determinants of Operating Efficiency for the Jordanian Banks: A Panel Data Econometric Approach",
  "abstract": "This paper presents a comprehensive analysis of key financial indicators influencing the operational efficiency of banks in Jordan over the period 2006 to 2021. The study, focusing on fifteen commercial banks, employs seven regression models to assess the impact of selected variables on bank operating efficiency. Our findings reveal novel insights with substantial contributions to banking practice. We identify a statistically significant influence of both bank-specific factors and temporal effects, demonstrating the nuanced dynamics shaping the operational efficiency of Jordanian banks. Notably, a positive and significant correlation is established between the operating efficiency ratio and return on assets, bank size, and the ratio of loan loss provisions to net interest income, providing valuable strategic guidance for effective management. Conversely, a significant negative relationship is observed between the operating efficiency ratio and the total expense ratio, underscoring the critical importance of careful cost management. No significant associations are found between the operating efficiency ratio and credit risk, the equity-to-asset ratio, the deposit-to-liability ratio, and the equity-to-liability ratio. This study makes a unique contribution by shedding light on these previously unexplored correlations, offering actionable insights for enhancing operational efficiency in the banking sector. Additionally, our research advocates for the Central Bank of Jordan (CBJ) to persist in adaptive policy measures, which are crucial for ongoing banking reforms and improved monitoring practices. Based on our empirical findings, these recommendations aim to fortify the resilience and adaptability of Jordan's banking sector, contributing both academically and practically. Importantly, they reinforce the symbiotic link between a stable banking sector and sustained economic development in Jordan.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27768195f6b30e4cc53b3400afa3319d",
  "timestamp": "2025-05-15T03:20:55.844297"
}