{
  "id": 474,
  "title": "Harnessing the power of intersection for pattern recognition: a novel unsupervised learning method and its application to financial engineering",
  "abstract": "In the present paper a data-driven hard cluster analysis derived from a novel similarity measure is proposed to support financial investors in their portfolio management decision-making process. The main objective of the proposed method is to provide a less arbitrary learning procedure to quantify similarity levels between investment alternatives (pairwise) as well as revealing clustering patterns (whole sample). This is especially useful during periods of high volatility, when investment alternatives tend to become more similar and, therefore, harder to distinguish between themselves. The method dynamics may be readily interpreted through a clear data visualisation. The advantages and caveats of the proposed method is compared to the most popular class of cluster analysis, applied to the well-known Fisher's Iris dataset. Such results show a slightly superior performance of the proposed method but, most importantly, through remarkably different clustering allocation approaches. Moreover, further empirical results applied to daily data reflecting a period of 15 years of time series of economies/stock markets of the Group of Seven (G7) illustrate the potential practical usefulness of the proposed unsupervised learning method, particularly, for portfolio strategy, asset allocation, and investment diversification.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27841ff8e89bd85c930c99a73b2ba53a",
  "timestamp": "2025-05-15T00:43:47.404581"
}