{
  "id": 3901,
  "title": "State distributed PV policies: Can low cost (to government) policies have a market impact?",
  "abstract": "This analysis examines the use of state policy as a tool to support the development of distributed generation photovoltaic (PV) markets. The focus is on low-cost market opening policies instead of various forms of government subsidies aimed at reducing installation costs. The ideas tested in this work are: (1) low-cost market opening policies can be effective in facilitating PV market growth without subsidizing projects, and (2) policies can be made more effective if states and localities stage their enactment in a particular order. The policies selected for evaluation emerge from a policy stacking theory outlined in Doris (2012), NREL/CP-7A30-54801, Golden, CO: National Renewable Energy Laboratory. A cross-section econometric analysis that takes into account the quality of interconnection standards, net metering standards, Renewable Portfolio Standards (RPS), RPS set-asides, and a non-policy determinant (population) explains about 70% of the variation in newly installed PV capacity across states and indicates that all of the selected policies are significant. Nonparametric statistical tests confirm the regression results. Qualitative evidence is also presented indicating that effective policy ordering starts with improving interconnection standards, closely followed by improvements in net metering standards, and eventually strengthened by the enactment of an RPS and set-asides. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "279f58fbe12e480a735435aa233eac3a",
  "timestamp": "2025-05-15T01:22:11.809920"
}