{
  "id": 7571,
  "title": "The impact of social determinants of health on chronic kidney disease risk: evidence from the CHARLS study",
  "abstract": "Background: Empirical evidence regarding the relationship between social determinants of health (SDH) and renal outcomes remains limited. Consequently, the objective of this study was to investigate the potential association between SDH and the development of chronic kidney disease (CKD) across various levels. Methods: Data were sourced from the 2011 China Health and Retirement Longitudinal Study (CHARLS), which included 6,290 Chinese participants aged 40 years and older. Among these participants, 4,115 underwent a follow-up assessment in the 2015 survey. The primary outcome measure was the incidence of CKD, operationally defined as a reduction in estimated glomerular filtration rate to <60 ml/min/1.73 m(2). To analyze the association between varying levels of SDH and renal outcomes, a Cox proportional hazards regression model was employed. Results: The findings indicate that, in comparison to individuals with a pension, higher education, and no need for family support, the risk of developing CKD increased by 43, 49, and 52%, respectively. Furthermore, the combination of requiring family support, being unmarried, and lacking medical insurance was associated with an elevated incidence of CKD. Utilizing the counting model of adverse SDH indicators, it was observed that when the number of adverse SDH was equal to or greater than four, there was a significant increase in the risk of CKD. The incidence density of CKD was found to rise in correlation with the severity of adverse SDH, with the incidence density in the adverse SDH group being 0.06 per person-year higher than that in the favorable SDH group. After adjusting for multiple variables, the hazard ratio (HR) for incident CKD was 2.47 [95% confidence interval (CI): 1.46-4.16] in the adverse SDH group compared to the favorable SDH group, a finding that persisted across various subgroups. Conclusion: Research indicates that financial support, pensions, education, marital status, and health insurance significantly impact CKD risk. Higher income, pension coverage, education, marital stability, and insurance lower this risk. Evaluating adverse SDH indicators helps assess individual SDH levels and CKD risk, with four or more indicators suggesting high risk. Therefore, adverse SDH measures can predict CKD.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27a8e6f4d696284b19b892cc60624bae",
  "timestamp": "2025-05-15T03:10:05.521245"
}