{
  "id": 6503,
  "title": "Suicidal Ideation in Iraq and Afghanistan Veterans With Mental Health Conditions at Risk for Homelessness",
  "abstract": "Suicide prevention among Veterans is a national priority. Overlap exists between conditions that may increase risk for suicide (e.g., mental health conditions, financial stressors, lack of social support) and homelessness among Veterans. We examined predictors of variance in suicidal ideation (SI) among 58 Iraq/Afghanistan Veterans at risk for homelessness who were receiving residential mental health treatment. Participants were classified as SI nonendorsers (n = 36) or SI endorsers (n = 22), based on their Patient Health Questionnaire-9 (PHQ-9) responses. Independent t tests and chi-square tests were used to examine group differences on baseline demographic variables, neuropsychological measures, and emotional/physical health symptom measures. Compared to nonendorsers, SI endorsers were significantly younger and reported less Veterans Affairs (VA) disability income, less total monthly income, less physical pain, lower quality of life overall and in the psychological health domain, lower community reintegration satisfaction, and more severe anxiety. Groups did not significantly differ on cognitive measures. A subsequent logistic regression revealed that only younger age uniquely predicted variance in SI endorsement. Younger age may be a particularly important factor to consider when assessing suicide risk in Veterans at risk for homelessness. Identifying predictors of variance in SI may help inform future treatment and suicide prevention efforts for Veterans at risk for homelessness. Future longitudinal research examining predictors of suicidality is warranted. Public Policy Relevance Statement Veteran homelessness and Veteran suicide are major public health concerns and priorities of the Department of Veteran Affairs. Veterans at risk for homelessness may be particularly vulnerable for increased suicide risk. We studied 58 Veterans who were at risk for homelessness and receiving residential mental health treatment and found that in the presence of multiple predictor variables, younger age predicted variance in suicidal ideation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27aa21e1b793c0a1f18fd872c51cd289",
  "timestamp": "2025-05-15T02:58:34.292629"
}