{
  "id": 8655,
  "title": "Common mental disorders and subsequent work disability: A population-based Health 2000 Study",
  "abstract": "Background: Work disability due to common mental disorders has increased in Western countries during the past decade. The contribution of depressive, anxiety, and alcohol use disorders to all disability pensions at the population level is not known. Methods: Epidemiological health data from the Finnish Health 2000 Study, gathered in 20002001, was linked to the national register on disability pensions granted due to the ICD-10 diagnoses up to December 2007. Mental health at baseline was assessed using the Composite International Diagnostic Interview (CIDI). Sociodemographic, clinical, and work-related factors, health behaviors, and treatment setting were used as covariates in the logistic regression analyses among the 3164 participants aged 30-58 years. Results: Anxiety, depressive, and comorbid common mental disorders predicted disability pension when adjusted for sex and age. In the fully adjusted multivariate model, comorbid common mental disorders, as well as physical illnesses, age over 45 years, short education, high job strain, and previous long-term sickness absence predicted disability pension. Limitations: The study population included persons aged 30 or over. Sub groups according to mental disorders were quite small which may have diminished statistical power in some sub groups. Baseline predictors were measured only once and the length of exposure could not be determined. The systems regarding financial compensation to employees differ between countries. Conclusions: Comorbid mental disorders pose a high risk for disability pension. Other independent predictors of work disability include socio-demographic, clinical, work-related, and treatment factors, but not health behavior. More attention should be paid to work-related factors in order to prevent chronic work disability. (C) 2011 Elsevier B.V. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27b75a5438fd3d21ae653157d30184e6",
  "timestamp": "2025-05-15T03:20:55.992501"
}