{
  "id": 2437,
  "title": "An improved sparrow search algorithm optimized LightGBM approach for credit risk prediction of SMEs in supply chain finance",
  "abstract": "Predicting the credit risk of small and medium-sized enterprises (SMEs) in supply chain finance accurately is critical to the sustainability of the entire supply chain and supply chain participants (e.g., core enterprises and financial service providers). Previous studies apply a series of machine learning algorithms to address this issue. However, these methods are inadequate in terms of prediction efficiency and accuracy. Therefore, we propose a novel approach based on the Improved Sparrow Search Algorithm (ISSA) and Light Gradient Boosting Machine (LightGBM). ISSA is an enhanced Sparrow Search Algorithm (SSA), which combines original SSA with fractional calculus concepts and Cauchy-Gaussian mutation, to accelerate convergence and reinforce global search capability. Then ISSA is used to search the global optimal hyper- parameters of LightGBM since the prediction performance of LightGBM is determined by numerous hyper-parameters. The experimental results show that the proposed ISSA-LightGBM approach has a superior prediction performance compared with the other five models and the ISSA possesses better convergence speed and global search capability over the other four swarm intelligence optimization algorithms. DeLong's test results show that ISSA-LightGBM is statistically significant in terms of AUC score compared to other models. Finally, machine learning model is interpreted using the Shapley-Lorenz tool to comply with the requirements of industry practitioners and policy makers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27bf15b0ee1dcf1a3b08c49539b34445",
  "timestamp": "2025-05-15T02:15:27.014562"
}