{
  "id": 7500,
  "title": "Physical Disability and Older Adults' Perceived Food and Economic Insecurity During the COVID-19 Pandemic",
  "abstract": "Objectives We examined whether older adults with physical disability were vulnerable to three types of perceived economic insecurity (difficulty paying regular bills, difficulty paying medical bills, and income loss) and two types of perceived food insecurity (economic obstacles and logistical obstacles) during the early months of the coronavirus disease 2019 (COVID-19) pandemic. We evaluated the extent to which associations are moderated by three personal characteristics (age, sex, and race/ethnicity) and two pandemic-specific risk factors (job loss and COVID-19 diagnosis). Method Data are from a random 25% subsample of Health and Retirement Study participants who completed a COVID-19 module introduced in June 2020. We estimated logistic regression models to predict each of five self-reported hardships during the pandemic. Results Bivariate analyses showed that persons with three or more functional limitations were more likely to report both types of food insecurity, and difficulty paying regular and medical bills since the start of the pandemic, relative to those with no limitations. After controlling for health conditions, effects were no longer significant for paying medical bills, and attenuated yet remained statistically significant for other outcomes. Patterns did not differ significantly on the basis of the moderator variables. Job loss substantially increased the risk of economic insecurity but not food insecurity. Discussion Older adults with more functional limitations were vulnerable to economic and food insecurity during the pandemic, potentially exacerbating the physical and emotional health threats imposed by COVID-19. Supports for older adults with disability should focus on logistical as well as financial support for ensuring their food security.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27d1eab1981316063d04f79e5b6955c2",
  "timestamp": "2025-05-15T03:09:07.344886"
}