{
  "id": 8450,
  "title": "Factors influencing investment attraction in road infrastructure BOT projects: A comprehensive analysis in the southern key economic zone of Vietnam",
  "abstract": "Over the course of the last two decades, Vietnam has demonstrated a growing interest in public-private partnership (PPP) investments within the domain of road transport infrastructure. However, the overall success rate of these endeavors has remined constrained and, in fact, has displayed a propensity for decline. Understanding the primary determinants behind this phenomenon, particularly the internal factors within the management system, has been a perplexing and protracted process, hindering the development of viable solutions. This research employs a qualitative analysis approach, leveraging in-depth interviews conducted with 250 road traffic infrastructure PPP project managers and experts. The objective is to discern the factors that exert influence over the investment attractiveness of build operate-transfer (BOT) projects in the vital Southern Key Economic Zone of Vietnam. Subsequently, utilizing the collated data, this study employs a quantitative methodology to measure the impact of these factors via a derived multivariate regression equation. The findings reveal the existence of five distinct groups of factors that affect the investment attractiveness of BOT projects in the Southern Key Economic Zone, classified by their respective levels of influence. These groups encompass factors relating to the role of the state, the legal framework, human resources engagement in PPP ventures, supportive financial instruments, and the allocation of risk. Notably, these outcomes align with previous research efforts, further substantiating the robustness and reliability of the findings presented within this study.(c) 2023 The Authors. Published by IASE. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27dac270a2ec6e0235adf7afd8373b2a",
  "timestamp": "2025-05-15T03:18:51.684334"
}