{
  "id": 894,
  "title": "Effective Return Rate Prediction of Blockchain Financial Products Using Machine Learning",
  "abstract": "In recent times, financial globalization has drastically increased in different ways to improve the quality of services with advanced resources. The successful applications of bitcoin Blockchain (BC) techniques enable the stockholders to worry about the return and risk of financial products. The stockholders focused on the prediction of return rate and risk rate of financial products. Therefore, an automatic return rate bitcoin prediction model becomes essential for BC financial products. The newly designed machine learning (ML) and deep learning (DL) approaches pave the way for return rate predictive method. This study introduces a novel Jellyfish search optimization based extreme learning machine with autoencoder (JSO-ELMAE) for return rate prediction of BC financial products. The presented JSO-ELMAE model designs a new ELMAE model for predicting the return rate of financial products. Besides, the JSO algorithm is exploited to tune the parameters related to the ELMAE model which in turn boosts the classification results. The application of JSO technique assists in optimal parameter adjustment of the ELMAE model to predict the bitcoin return rates. The experimental validation of the JSO-ELMAE model was executed and the outcomes are inspected in many aspects. The experimental values demonstrated the enhanced performance of the JSO-ELMAE model over recent state of art approaches with minimal RMSE of 0.1562.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "27e35170d8958be35ebf52def54b38f6",
  "timestamp": "2025-05-15T01:56:17.580501"
}