{
  "id": 7004,
  "title": "Life-course socioeconomic factors are associated with markers of epigenetic aging in a population-based study",
  "abstract": "Adverse socioeconomic circumstances negatively affect the functioning of biological systems, but the underlying mechanisms remain only partially understood. Here, we explore the associations between life-course socioeco-nomic factors and four markers of epigenetic aging in a population-based setting. We included 684 participants (52 % women, mean age 52.6 +/- 15.5 years) from a population and family-based Swiss study. We used nine life-course socioeconomic indicators as the main exposure variables, and four blood -derived, second generation markers of epigenetic aging as the outcome variables (Levine's DNAmPhenoAge, DunedinPoAm38, GrimAge epigenetic age acceleration (EAA), and the mortality risk score (MS)). First, we investigated the associations between socioeconomic indicators and markers of epigenetic aging via mixed-effect linear regression models, adjusting for age, sex, participant's recruitment center, familial structure (random -effect covariate), seasonality of blood sampling, and technical covariates. Second, we implemented counter-factual mediation analysis to investigate life-course and intermediate mechanisms underlying the socioeconomic gradient in epigenetic aging. Effect-size estimates were assessed using regression coefficients and counterfactual mediation parameters, along with their respective 95 % confidence intervals. Individuals reporting a low father's occupation, adverse financial conditions in childhood, a low income, having financial difficulties, or experiencing unfavorable socioeconomic trajectories were epigenetically older and had a higher mortality risk score than their more advantaged counterparts. Specifically, this corresponded to an average increase of 1.1-1.5 years for Levine's epigenetic age (beta and 95 %CI range, beta (minimum and maximum): 1.1-1.5 95 %CI[0.0-0.2; 2.3-3.0]), 1.1-1.5 additional years for GrimAge (beta: 1.1-1.5 95 %CI[0.2-0.6; 1.9-3.0]), a 1-3 % higher DunedinPoAm38 age acceleration (beta: 0.01-0.03 95 %CI[0.00; 0.03-0.04]), and a 10-50 % higher MS score (beta: 0.1-0.4 95 %CI[0.0-0.2; 0.3-0.4]) for the aforementioned socioeconomic indicators. By exploring the life-course mechanisms underlying the socioeconomic gradient in epigenetic aging, we found that both childhood and adulthood socioeconomic factors contributed to epigenetic aging, and that detrimental lifestyle factors mediated the relation between socioeconomic circumstances in adulthood and EAA (31-89 % mediated proportion). This study provides emerging evidence for an association between disadvantaged life-course socioeconomic circumstances and detrimental epigenetic aging patterns, supporting the sensitive-period life-course model. Counterfactual mediation analyses further indicated that the effect of socioeconomic factors in adulthood operates through detrimental lifestyle factors, whereas associations involving early-life socioeconomic factors were less clear.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2804adeb2bf6511c0e5b3810371a098b",
  "timestamp": "2025-05-15T03:03:55.852764"
}