{
  "id": 8384,
  "title": "Factors affecting the market value of junior mining companies listed on the Alternative Investment Market (AIM) London",
  "abstract": "The exploration of mineral resources is an area of strategic importance for the pace of further development of all industries. The results of companies deciding to carry out exploration work depend on further investments of mining companies, i.e. the entities purchasing full deposit documentation. Being at the beginning of the entire mining process, junior mines assume a high risk related to investments enabling the commencement of works without providing high guarantees of the project's success. Companies running these types of projects must seek funding in a variety of ways. One of these is to try to raise capital from the stock trading markets. However, the specificity of junior companies does not allow them to start on the main trading floors, hence the decision to enter alternative markets. In considering the broader context of the activities of junior mines, research was conducted on companies listed on the London Alternative Investment Market (AIM). In the first part, this concerned the market characteristics - the market value added values were determined for selected ranges of market capitalization. In the second part, which is a statistical study, factors that may affect their market value was checked. The analysis covered both traditional value drivers - related to revenues, the demand for net working capital, investment expenses and the cost of equity - and their supplementation with selected values of financial statements. The result of the analysis is a regression equation indicating the factors that have a statistically significant impact on the market value of junior mines listed on ATM London.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "281661ee6db2c03fb57e679acab3b52b",
  "timestamp": "2025-05-15T03:18:19.568079"
}