{
  "id": 8634,
  "title": "Implementation of a new strategy to improve the peri-operative management of neuromuscular blockade and its effects on postoperative pulmonary complications",
  "abstract": "Inappropriate dosing of neostigmine for antagonism of neuromuscular blockade has been associated with postoperative pulmonary complications. We evaluated the effects of a quality improvement initiative tailored to optimise the use of neostigmine in antagonising neuromuscular blockade on postoperative pulmonary complications, costs and duration of hospital stay. The quality improvement initiative consisted of: a reduction in available neostigmine aliquot sizes; a cognitive aid; an educational component; and a financial incentive for the intra-operative documentation of train-of-four measurement before administration of neostigmine. We conducted a pre-specified analysis of data obtained in our quality improvement study. Additional analyses were conducted in a propensity-matched cohort. An interrupted time series design was used to discriminate between the intervention and a counterfactual scenario. We analysed 12,025 consecutive surgical cases performed in 2015. Postoperative pulmonary complications occurred in 220 (7.5%) of 2937 cases pre-intervention and 568 (6.3%) of 9088 cases post-intervention. Adjusted regression analyses showed significantly a lower risk of postoperative pulmonary complications (OR 0.73 (95%CI 0.61-0.88); p = 0.001), lower costs (incidence rate ratio 0.95 (95%CI 0.93-0.97); p < 0.001) and shorter duration of hospital stay (incidence rate ratio 0.91 (95%CI 0.87-0.94); p < 0.001) after implementation of the quality improvement initiative. Analyses in a propensity-matched sample (n = 2936 per group) and interrupted time series analysis (n = 27,202 cases) confirmed the findings. Our data show that a local, multifaceted quality improvement initiative can enhance the quality of intra-operative neuromuscular blocking agent utilisation, thereby reducing the incidence of postoperative pulmonary complications.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2818c89fd53e9ae61a7a1312f0bedc2c",
  "timestamp": "2025-05-15T03:20:55.899745"
}