{
  "id": 3986,
  "title": "The operational risk disclosure practices of banks: evidence from India and Romania",
  "abstract": "The disclosure of information by banks is beneficial to several categories of the public as well as to the stability of the financial system. Operational risk disclosures are particularly important, since operational losses may impact both the financial condition and the reputation of banks. This paper compares the levels of operational risk disclosure in the banking industries of India and Romania. We develop an unweighted disclosure index with forty-three items, with data collected from the 2015 annual reports of all commercial banks in India and Romania. We then perform a regression analysis to investigate the extent to which banks' characteristics impact the level of operational risk disclosure in these two countries. First, our results reveal a similarly low level of disclosure, namely an overall index average of 27% in the case of India and of 29% in the case of Romania. These results are surprising, as India's culture appears to be more inclined toward transparency than Romania's. Second, our results point toward a positive association between bank size and the level of operational risk disclosure. This paper contributes to the existing body of research, which comprises few empirical studies on the particular topic of operational risk disclosure in banks.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "282196f0ea4aed30ebc62ecd5dda57f3",
  "timestamp": "2025-05-15T02:31:58.638811"
}