{
  "id": 3681,
  "title": "A New Program in Pain Medicine for Medical Students: Integrating Core Curriculum Knowledge with Emotional and Reflective Development",
  "abstract": "Objective. Improvements in clinical pain care have not matched advances in scientific knowledge, and innovations in medical education are needed. Several streams of evidence indicate that pain education needs to address both the affective and cognitive dimensions of pain. Our aim was to design and deliver a new course in pain establishing foundation-level knowledge while comprehensively addressing the emotional development needs in this area. Setting. One hundred eighteen first-year medical students at Johns Hopkins School of Medicine. Outcome Measures. Performance was measured by multiple-choice tests of pain knowledge, attendance, reflective pain portfolios, and satisfaction measures. Results. Domains of competence in pain knowledge included central and peripheral pain signalling, pharmacological management of pain with standard analgesic medications, neuromodulating agents, and opioids; cancer pain, musculoskeletal pain, nociceptive, inflammatory, neuropathic, geriatric, and pediatric pain. Socio-emotional development (portfolio) work focused on increasing awareness of pain affect in self and others, and on enhancing the commitment to excellence in pain care. Reflections included observations on a brief pain experience (cold pressor test), the multidimensionality of pain, the role of empathy and compassion in medical care, the positive characteristics of pain-care role models, the complex feelings engendered by pain and addiction including frustration and disappointment, and aspirations and commitments in clinical medicine. The students completing feedback expressed high levels of interest in pain medicine as a result of the course. Discussion. We conclude that a 4-day pain course incorporating sessions with pain specialists, pain medicine knowledge, and design-built elements to strengthen emotional skills is an effective educational approach. Summary. Innovations in medical education about pain are needed. Our aim was to design and deliver a new course for medical students addressing both the affective and cognitive dimensions of pain. Combining small-group sessions with pain specialists, active-learning approaches to pain knowledge, and design-built elements to strengthen emotional skills was highly effective.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "283055f9b6d4a926bec4ef0a23377c92",
  "timestamp": "2025-05-15T01:19:26.265136"
}