{
  "id": 86,
  "title": "The extent of the teacher academic development from the accreditation evaluation system perspective using machine learning",
  "abstract": "The purpose of this study to utilising Machine learning to discover knowledge which is called supervised and unsupervised learning when it is taught the actual outcome for the training instances like progressed or non-progressed performance and investigate the impact of the quality assurance process on the teacher's academic performance utilising teaching methods, student feedback, teacher portfolio, and academic benchmarks. Moreover, it aims to assess and improve the academic staff members performing the Accreditation Evaluation System (AES) that involves Student Feedback System (SFS), Teacher Portfolio Assessment (TPA), as well as Continuous Academic Development (CAD) for the academic year (2016-2017) which compiled of (1556) academic staff at the University of Sulaimani. Overall, the conclusions of this study confirmed that the quality assurance has progressed, and enhanced the quality of the teacher performance, also reinforces all dimensions of the teaching, academic, and research performance of teachers by applying the K-Means Clustering Algorithm methodology to analyse and assemble a big data according to the teacher academic titles. In addition, the binary logistic regression analysis was executed to reveal and prophesy the significant influences of academic titles on the teacher progression of the Accreditation Evaluation System performance. The K-Means Clustering Algorithm showed better results than Logistic regression by having 90% testing accuracy. In the future, Un-Supervised Learning can be used for better accuracy.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28369cf861b6b938d92c99ab5b880f58",
  "timestamp": "2025-05-15T00:38:57.110059"
}