{
  "id": 1427,
  "title": "A self-adaptive hyper-heuristic based multi-objective optimisation approach for integrated supply chain scheduling problems",
  "abstract": "Recent global changes have prompted manufacturers to shift their production systems to make-to -order (MTO) supply chain (SC), enabling them to adapt customised customer requirements with their rapidly changing behaviours, reduce inventory costs, and obtain competitive advantages in the market. However, traditional MTO-based scheduling approaches fail to consider all the SC stages required for optimal schedules. This study proposes an integrated SC scheduling problem (ISCSP), where supplier, manufacturer and batching decisions are simultaneously optimised in response to heterogeneous customer requirements with time window constraints. Both economic and environmental sustain -ability for the supply portfolio is considered while the manufacturer is modelled using the flexible job shop scheduling (FJS) problem. Since the proposed ISCSP is an extension of the FJS problem, this can also be considered an NP-hard problem, which cannot be solved by traditional optimisation techniques, particularly for larger instances. Thus, a self-adaptive multi-operator and multi-objective hyper-heuristic (SA(MO)(2)H) is designed, where the low-level heuristic utilises strengths of four solution updating heuristics and is intelligently guided by the reinforcement learning, to address the problem. The proposed SA(MO)(2)H integrates environmental sustainability into the evolutionary process to achieve the best possible supply portfolio, adopting the VIKORSORT approach. Finally, a rigorous experimental study on solving a wide range of instances is conducted to evaluate the performance of SA(MO)(2)H against its non-intelligent versions and five existing algorithms. Overall, the most beneficial facet of the developed ISCSP and SA(MO)(2)H is the visibility and meaningful managerial insights provided by the multi-portfolio solutions fostering the responsive relationship among SC stages. (C) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "283fb8ce4f04e2b4579fae3fe237d1be",
  "timestamp": "2025-05-15T00:55:28.567844"
}