{
  "id": 8983,
  "title": "Risk Factors for Strabismus Surgery after Pediatric Cataract Surgery in the United States",
  "abstract": "Purpose: To determine the cumulative incidence of strabismus surgery after pediatric cataract surgery and identify the associated risk factors. Design: US population-based insurance claims retrospective cohort study. Participants: Patients < 18 years old who underwent cataract surgery in 2 large databases: Optum Clin-formatics Data Mart (2003-2021) and IBM MarketScan (2007-2016). Methods: Individuals with at least 6 months of prior enrollment were included, and those with a history of strabismus surgery were excluded. The primary outcome was strabismus surgery within 5 years of cataract surgery. The risk factors investigated included age, sex, persistent fetal vasculature (PFV), intraocular lens (IOL) placement, nystagmus and strabismus diagnoses before cataract surgery, and cataract surgery laterality. Main Outcome Measures: Kaplan-Meier estimated cumulative incidence of strabismus surgery 5 years after cataract surgery and hazard ratios (HRs) with 95% confidence intervals (CIs) from multivariable Cox pro-portional hazards regression models. Results: Strabismus surgery was performed on 271/5822 children included in this study. The cumulative incidence of strabismus surgery within 5 years after cataract surgery was 9.6% (95% CI, 8.3%-10.9%). Children who underwent strabismus surgery were more likely to be of younger age at the time of cataract surgery, of female sex, have a history of PFV or nystagmus, have a pre-existing strabismus diagnosis, and less likely to have an IOL placed (all P < 0.001). Factors associated with strabismus surgery in the multivariable analysis included age 1 to 4 years (HR, 0.50; 95% CI, 0.36-0.69; P < 0.001) and age > 5 years (HR, 0.13; 95% CI, 0.09-0.18; P < 0.001) compared with age < 1 year at time of cataract surgery, male sex (HR, 0.75; 95% CI, 0.59-0.95; P < 0.001), IOL placement (HR, 0.71; 95% CI, 0.54-0.94; P = 0.016), and strabismus diagnosis before cataract surgery (HR, 4.13; 95% CI, 3.17-5.38; P < 0.001). Among patients with strabismus diagnosis before cataract surgery, younger age at cataract surgery was the only factor associated with increased risk of strabismus surgery. Conclusions: Approximately 10% of patients will undergo strabismus surgery within 5 years after pediatric cataract surgery. Children of younger age, female sex, and with a pre-existing strabismus diagnosis undergoing cataract surgery without IOL placement are at greater risk. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Science 2023;3:100271 & COPY; 2023 Published by Elsevier Inc. on behalf of the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http:// creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2840601003355e642ca1b0116c0ef840",
  "timestamp": "2025-05-15T03:24:26.319640"
}