{
  "id": 1281,
  "title": "Structure plane interpretation of rockfall and early identification of potential hazards based on UAV photogrammetry",
  "abstract": "Effective identification of structural planes is the basis of rockfall hazard research. Traditional solutions for interpreting the structural plane of rockfalls and the early identification of potential hazards have a high-risk coefficient, which makes it difficult to comprehensively extract and collect needed information. Existing methods also suffer from limitations due to technological and financial constraints, resulting in occasional and limited research data acquisition. In this paper, a method for interpreting rock mass structural planes and early identification of potential risks based on unmanned aerial vehicle (UAV) photogrammetry was proposed. First, a high-precision three-dimensional (3D) model of the research area was constructed using UAV oblique photography technology. Based on this model, the scanline survey method was used to extract and statistically analyze the dominant structural planes, spatial distribution characteristics, and related parameters of the slope system. Subsequently, the possibility of various failure modes of unstable rock masses and their controlling joints were determined by kinematic analysis and stereographic projection method, while typical rock masses on the slope were identified through the extraction and analysis of the structural planes. Second, machine learning technique was utilized to process the two-dimensional images of the rockfall source zones. The K-means clustering algorithm and color quantization based on unsupervised machine learning technique were used to identify and segment pixel colors in the image, including the identification of potential structural planes and boundaries of hazardous rock masses within the specified area. Finally, stability evaluations were conducted on both the typical rock masses identified based on the 3D model and the potential unstable rock masses, which were identified using machine learning algorithms. The accuracy of the identification results was also verified. The study reveals that the rockfall source area in the research area is approximately 4.98 x 104 m2. Based on the scanline survey combined with the stereographic projection, the research area was divided into three source zones for rockfall, S1, S2 and S3, with a total of seven typical rock masses primarily characterized by toppling failure identified across these three zones. Additionally, three other potential risk rock blocks were identified using machine learning techniques. Stability evaluations conducted on these 10 rock masses collectively indicate an unstable state under heavy rainfall condition. The proposed workflow and relevant techniques presented in this study provide valuable scientific insights and a comprehensive solution for the early identification of potential risks associated with rockfall hazards. Furthermore, the feasibility of applying machine learning in the detection of geological hazard risks is validated.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28470d493595a9dfd0e5c621e5b0ac6e",
  "timestamp": "2025-05-15T02:01:11.840879"
}