{
  "id": 6736,
  "title": "An empirical analysis of the behavioral influences and information sources affecting the cyber insurance decisions of German SMEs",
  "abstract": "PurposeThe cyber insurance market in Germany shows a notable gap: while many large corporations are already demanding cyber insurance, small and medium-sized enterprises (SMEs) are still reluctant, despite its benefits. This study aims to analyze the behavioral and informational factors that influence cyber insurance decision-making and uncover the determinants that may inhibit demand among German SMEs.Design/methodology/approachUsing the data from a questionnaire survey of 1,248 German SME executives, the influence of behavioral and informational factors on cyber insurance demand is assessed utilizing logistic regression.FindingsThe results reveal that the estimated financial impact and anxiety about a potential cyberattack significantly increase the likelihood of SMEs purchasing cyber insurance. Conversely, the perceived probability of future cyberattacks and prior experience do not significantly influence insurance decisions, probably due to challenges in probability estimation. In addition, confidence in the organization's cyber risk management has a positive but insignificant influence on cyber insurance demand. External cybersecurity specialists positively impact cyber insurance demand, while internal cyber risk assessment has no significant influence, highlighting the challenges SMEs face in cyber risk assessment. Independent Internet research negatively impacts the purchase of cyber insurance, probably due to information overload.Originality/valueThis study significantly contributes to the literature on corporate (cyber) insurance purchasing by primarily focusing on behavioral influences on SMEs' insurance decision-making. It is also the first empirical analysis of the key information sources used by SMEs in their insurance decision-making, thereby providing various academic and practical implications.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28517e037fca20728a1f1eeffa45ece4",
  "timestamp": "2025-05-15T03:01:03.595693"
}