{
  "id": 8604,
  "title": "National health insurance and surgical care for injured people, Ghana",
  "abstract": "Objective To determine the association between having government health insurance and the timeliness and outcome of care, and catastrophic health expenditure in injured patients requiring surgery at a tertiary hospital in Ghana. Methods We reviewed the medical records of injured patients who required surgery at Komfo Anokye Teaching Hospital in 2015-2016 and extracted data on sociodemographic and injury characteristics, outcomes and out-of-pocket payments. We defined catastrophic health expenditure as >= 10% of the ratio of patients' out-of-pocket payments to household annual income. We used multivariable regression analyses to assess the association between having insurance through the national health insurance scheme compared with no insurance and time to surgery, in-hospital mortality and experience of catastrophic health expenditure, adjusted for potentially confounding variables. Findings Of 1396 patients included in our study, 834 (60%) were insured through the national health insurance scheme. Time to surgery and mortality were not statistically different between insured and uninsured patients. Insured patients made smaller median out-of-pocket payments (309 United States dollars, US$) than uninsured patients (US$ 503; P < 0.001). Overall, 45% (443/993) of patients faced catastrophic health expenditure. A smaller proportion of insured patients (33%, 184/558) experienced catastrophic health expenditure than uninsured patients (60%, 259/435; P < 0.001). Insurance through the national health insurance scheme reduced the likelihood of catastrophic health expenditure (adjusted odds ratio: 0.27; 95% confidence interval: 0.20 to 0.35). Conclusion The national health insurance scheme needs strengthening to provide better financial risk protection and improve quality of care for patients presenting with injuries that require surgery.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2861e384fce4b7116b97ba0d2d7071a6",
  "timestamp": "2025-05-15T03:20:22.381672"
}