{
  "id": 4002,
  "title": "Decarbonization under green growth strategies? The case of South Korea",
  "abstract": "The win win opportunities connected to green growth are appealing to academics and policy makers alike, but empirical evaluations about the effectiveness of green growth policies are still scattered. Taking South Korea as case study, which set up a highly ambitious green growth program in 2009, our research casts light on the extent to which the Korean Green Growth Strategy has been effective in decarbonizing the economy. Our methodology combines decomposition analysis and econometrics with a review of energy and climate policies, including related structural changes. On the short term (2008-2012), most of the drivers displayed an enhancing effect on CO2 emissions from fuel combustion, with GDP per capita being the strongest driver. From a historical perspective (1971-2012), findings reveal that important drivers, such as energy and CO2 intensity even worsened their effects during the first years under the Green Growth Strategy. Regression statistics revealed that GDP per capita was in fact the driver with the most explanatory power for CO2 emissions, followed by energy intensity. The Korean policy mix of modest government support to low-carbon energy technologies and a lack of complementary pricing policies did not deliver the targeted emissions reduction, at least in the short-term. Despite recent policy developments, i.e. the introduction of a renewable portfolio standard in 2012 and an emissions trading system in 2015, several key policy challenges for decarbonization remain. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2861263f0682e727f8c790fcba844012",
  "timestamp": "2025-05-15T01:23:07.276519"
}