{
  "id": 9190,
  "title": "Assessment of Risk Factors for Suicide Among US Health Care Professionals",
  "abstract": "This cohort study uses data from the National Violent Death Reporting System to identify individuals who died by suicide in the United States between 2003 and 2016 and to assess suicide risk factors among health care professionals compared with the general population. Importance Burnout among health care professionals has been increasingly associated with suicide risk. An examination of possible risk factors may help in the prevention of suicide among health care professionals. Objective To assess suicide risk factors for 3 categories of health care professionals (surgeons, nonsurgeon physicians, and dentists) compared with non-health care professionals. Design, Setting, and Participants Data from the National Violent Death Reporting System were reviewed to identify all individuals who died by suicide in the United States between January 1, 2003, and December 31, 2016. Individuals were divided into health care professionals and non-health care professionals (general population), with the health care professionals further categorized into surgeons, nonsurgeon physicians, and dentists. The covariates of suicide decedents included demographic characteristics (age, sex, race, and marital status), medical history (mental illness, substance use, and physical health), and documented factors associated with the suicide death (job, intimate partner, financial, legal, and other problems). Data were analyzed from October 2 to December 17, 2019. Main Outcomes and Measures In this analysis, the outcome variable was occupation, with health care professionals overall and by category compared with the general population. Multiple logistic regression analyses with backward stepwise selection were performed. Results A total of 170.030 individuals who died by suicide between 2003 and 2016 were identified. Of those, 767 individuals (0.5%) were health care professionals (mean [SD] age, 59.6 [15.6] years; 675 men [88.0%]; 688 white [89.7%]), with the remainder of the sample (95.5%) comprising the general population (mean [SD] age, 46.8 [31.5] years; 77.7% men; 87.8% white). A total of 485 health care professionals (63.2%) were nonsurgeon physicians, 179 professionals (23.3%) were dentists, and 103 professionals (13.4%) were surgeons. Compared with the general population, risk factors for suicide among health care professionals included having Asian or Pacific Islander ancestry (odds ratio [OR], 2.80; 95% CI, 1.96-3.99; P < .001), job problems (OR, 1.79; 95% CI, 1.49-2.17; P < .001), civil legal problems (OR, 1.61; 95% CI, 1.15-2.26; P = .006), and physical health problems (OR, 1.40; 95% CI, 1.19-1.64; P < .001) and currently receiving treatment for mental illness (OR, 1.45; 95% CI, 1.24-1.69; P < .001). Compared with the general population, health care professionals had a lower risk of suicide if they had black ancestry (OR, 0.55; 95% CI, 0.36-0.84; P < .001) or were female (OR, 0.44; 95% CI, 0.35-0.55; P < .001) or unmarried (OR, 0.36; 95% CI, 0.31-0.42; P < .001). Health care professionals who died by suicide were also less likely to have problems with intimate partners (OR, 0.71; 95% CI, 0.60-0.86; P < .001) or alcohol use (OR, 0.58; 95% CI, 0.45-0.73; P < .001) compared with the general population. Surgeons had a higher risk of suicide compared with the general population if they were older, male, married, had Asian or Pacific Islander ancestry, were currently receiving treatment for mental illness, or had problems with their job or alcohol use. Compared with their nonsurgeon physician colleagues, surgeons had a higher risk of suicide if they were male, older, married, or currently receiving treatment for mental illness. Conclusions and Relevance This study highlights risk factors for suicide among health care professionals, with additional analyses of surgeon-specific risk factors. The results may be useful in improving the detection of burnout and the development of suicide prevention interventions among health care professionals. Question Are there differences in risk factors for suicide among health care professionals (surgeons, nonsurgeon physicians, and dentists) compared with the general population? Findings In this cohort study of 170.030 individuals who died by suicide, health care professionals who died by suicide were more likely to have problems with their jobs, physical health, and civil legal issues and to have Asian or Pacific Islander ancestry compared with individuals in the general population who died by suicide. A direct comparison between surgeons and nonsurgeon physicians revealed that surgeons had a higher risk of suicide if they were older, male, married, or currently receiving treatment for mental illness. Meaning Results of this study suggest that, of those who died by suicide, health care professionals have a higher likelihood of experiencing problems with their jobs and physical health compared with the general population.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "286ae482d327b22dcdf752103929a546",
  "timestamp": "2025-05-15T03:26:25.989494"
}