{
  "id": 3286,
  "title": "Creation of New Forms of Bond Taxonomies, Allowing to Obtain the Required Quality of Guarantees and Profitability",
  "abstract": "The purpose of this article is to consider the debt market, namely the management of the market for interest-bearing instruments, the yield and risk of securities based on taxonomies of bonds. The existing problem is caused by the lack of sources of investment, which is acutely felt at the meso level. Regional companies and credit organizations have less financial entropy compared to market entities in the central region. Due to ongoing structural changes in the global and national economy and the uncertainty of the future, sources of investment are transformed and factors that determine profitability and risks change. The problem of achieving the required quality of borrowers is constantly exacerbated, despite the ever-improving scoring technology. One of the tools to estimate future risk and return is the zero-coupon yield curve (ZCYC) curve. Benchmarking of this tool traditionally is government securities, which allows you to set goals and restrictions on investments. When analyzing the need for a loan, regional organizations should be able to choose among the sources and conditions of financing. A good option would be a structured product, the price of which should push off from the yield of the respective bonds and which should be traded in the stock exchange of corporate and municipal bonds. Such structured products will create opportunities for regional banking organizations to manage credit risk. The main method of studying the pricing issues of structured products is based on taxonomies, G-curve factors and clustering processes. To overcome the financial contradictions, the shortage of working capital and risks for credit organizations, the authors propose to supplement the investment portfolio with structured products, with pricing based on ZCYC. The clustering of organizations and the inclusion of bond taxonomies in the cluster will expand the boundaries of organizations' cash management models and improve risk management. The proposed approach allows to solve the current problem situations in the field of lending, which affect the investment demand of companies.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "288039d12831ef282b5a20f94d4b580d",
  "timestamp": "2025-05-15T02:24:39.682733"
}