{
  "id": 3440,
  "title": "Geopolitical risk and economic security: Exploring natural resources extraction from BRICS region",
  "abstract": "In the economic security and development race, industrialized and emerging economies target different economic and non-economic instruments to achieve higher economic growth and sustainable performance. Emerging economies are paying more attention to the extraction/utilization of natural resources to boost their economic growth. Therefore, the present study evaluates the influence of natural resources, geopolitical risk, and financial development on the economic growth of BRICS economies during 1991-2022. The panel cointegration tests asserted that the study variables are cointegrated in the long run. Using parametric and non-parametric approaches, the empirical results revealed that geopolitical risk and financial development are significant economic security factors boosting regional income. On the other hand, natural resources asymmetrically affect economic growth, where natural gas rents positively, while oil rents adversely affect economic growth. The robustness of the results is tested via augmented mean group and quantile regression approaches. Besides, there exists a two-way causal association between the variables. This study suggests the efficient extraction and use of natural resources, further reduction of the geopolitical risk, and improvement in the financial sector to attain sustainable development and secure economic growth.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28842cfbb96802fb994961945fa93270",
  "timestamp": "2025-05-15T02:26:09.178124"
}