{
  "id": 8031,
  "title": "Research on Correlation among the Interests of the Elderly in Community, Social Support and Negative Living Events",
  "abstract": "Objective: Investigate the relationship among the elderly people's interest, social support and negative living events in the community in order to provide reference for promoting public health service in the elderly community. Methods: Utilizing health conditions of the elderly, MDS, and the investigating questionnaires of related factors. Meanwhile using convenience sampling method combined with an questionnaire survey by taking the form of concentration and family interview together to investigate 500 elder people over 60 years old. SPSS18.0 software was used for statistical analysis. In the analysis, we adopt descriptive statistical methods to analyze the basic information of the participants. Using Chi-Square tests and bivariate correlation to analyze the relationship among the interests of the elderly in community, social support and negative living events and applying the Multiple Logistic regression analysis to explore the influencing factors of negative living events and the degree of the influence. Results: The frequency of health exacerbation, economic difficulty, painful thing all have statistical significance (P<0.05) in the elderly who have differences living attitudes. The Multiple Logistic regression is used to analyze related factors which have influence on negative living events. The spouse cohabit (OR = 0.409, 95% CI(0.214-0.784), P=0.007), receiving support (OR = 0.349, 95% CI(0.171-0.711), P=0.004), worrying about children (OR=1.695, 95% CI(1.005-2.857), P=0.048), playing the cards frequently (OR=0.589, 95% CI(0.354-0.979), P=0.041) are selected into regression equation in the result. Conclusions: The negative living event with high frequency are health exacerbation, economic difficulty, painful thing, accidence, confliction between relatives, financial loss. The spouse cohabit, receiving support, playing the cards frequently are protective factors in the occurrence of negative living events, worrying about children is risk factor. According to the results and conclusions, the targeted proposals are proposed. From the perspective of community members, they should cultivate elderly people's interest, increase social support to elderly people, reduce the frequency of negative living events, and improve elder people's quality of life, thereby promoting the life extension and reflecting social progress.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28917334179a095a9c790c7aa44dcaf4",
  "timestamp": "2025-05-15T03:14:37.315449"
}