{
  "id": 1644,
  "title": "Solvency Risk and Corporate Performance: A Case Study on European Retailers",
  "abstract": "This paper proposes a new approach toward understanding the financial performance dynamics in the EU retail sector (pre-pandemic); we focus on the connection between indebtedness and solvency risk and other areas of corporate performance (e.g., liquidity, assets efficiency, and profitability). Its contribution resides in identifying the drivers behind solvency risk in a sector that went through significant transformations in recent decades, as well as the links between the various areas of performance of retailers, and their impacts on solvency risk, using the machine-learning random forest methodology. The results indicate a declining trend for solvency risk of EU food retailers after the global financial crisis and up until the beginning of the pandemic, which may reflect their maturity on the market, but also an adjustment to legal changes in the EU, meant to equalize the tax advantages of debt versus equity financing. Solvency risk accompanied by liquidity risk is a mark of the retail sector, and our results indicate that the most critical trade that EU retailers face is between solvency risk and liquidity, but is fading over time. The volatility of liquidity levels is an important predictor of solvency risk; hence, sustaining a stable and good level of liquidity supports lower risks of financial distress, and may mitigate the shock impacts for EU retailers. A higher solvency risk was accompanied by increased efficiency of asset use, but reduced profitability levels, which led to higher returns available to shareholders for high solvency risk retailers. Overall, retailers should focus on operational performance evidenced by financial indicator levels than on the volatility of these indicators as predictors of solvency risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2899c01ee2dc0153ed4e77e634107bfb",
  "timestamp": "2025-05-15T02:05:42.603905"
}