{
  "id": 988,
  "title": "Machine Learning-Based Seismic Damage Assessment of Residential Buildings Considering Multiple Earthquake and Structure Uncertainties",
  "abstract": "Wood-frame structures are used in almost 90% of residential buildings in the United States. It is thus imperative to rapidly and accurately assess the damage of wood-frame structures in the wake of an earthquake event. This study aims to develop a machine-learning-based seismic classifier for a portfolio of 6,113 wood-frame structures near the New Madrid Seismic Zone (NMSZ) in which synthesized ground motions are adopted to characterize potential earthquakes. This seismic classifier, based on a multilayer perceptron (MLP), is compared with existing fragility curves developed for the same wood-frame buildings near the NMSZ. This comparative study indicates that the MLP seismic classifier and fragility curves perform equally well when predicting minor damage. However, the MLP classifier is more accurate than the fragility curves in prediction of moderate and severe damage. Compared with the existing fragility curves with earthquake intensity measures as inputs, machine-learning-based seismic classifiers can incorporate multiple parameters of earthquakes and structures as input features, thus providing a promising tool for accurate seismic damage assessment in a portfolio scale. Once trained, the MLP classifier can predict damage classes of the 6,113 structures within 0.07 s on a general-purpose computer.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28ad19a597c20f5b6e1b4a548bc3b551",
  "timestamp": "2025-05-15T00:50:08.802835"
}