{
  "id": 7440,
  "title": "Credit rating of sustainable agricultural supply chain finance by integrating heterogeneous evaluation information and misclassification risk",
  "abstract": "Supply chain finance (SCF) is a financial service that provides convenient loan transactions for small- and medium-sized enterprises (SMEs) upstream and downstream of the supply chain. SCF can help to smooth the capital flow of many SMEs. However, it is difficult for agricultural SMEs to participate in SCF because this kind of SME usually has various risks. Objectively, evaluating the credit rating of agricultural SMEs is difficult for commercial banks. Furthermore, unlike general manufacturing enterprises, agricultural enterprises produce directly based on nature. Sustainable development based on the natural environment is very important for agricultural enterprises. In this paper, considering sustainability, we construct a criteria system to evaluate the credit ratings of agricultural SMEs for SCF. Moreover, we study a method for processing the hybrid heterogeneous evaluation information of SMEs. A co-decision method is proposed to classify the credit ratings of agricultural SMEs with the help of three-way decisions. Agricultural SMEs are evaluated by both criteria evaluation information and misclassification loss. Finally, a credit rating evaluation example is presented to demonstrate the application of our method. The results show that our proposed method can be used to fully evaluate agricultural SMEs with fine classification effects. It can also provide a reference for commercial banks to determine the credit of agricultural SMEs with a low decision risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28b2ae4f099e503648755fdda7766489",
  "timestamp": "2025-05-15T03:08:37.862468"
}