{
  "id": 7210,
  "title": "Exploring the effectiveness of demand-side retail pharmaceutical expenditure reforms Cross-country evidence from weighted-average least squares estimation",
  "abstract": "Increasing expenditures on retail pharmaceuticals bring a critical challenge to the financial stability of healthcare systems worldwide. Policy makers have reacted by introducing a range of measures to control the growth of public pharmaceutical expenditure (PPE). Using panel data on European and non-European OECD member countries from 1990 to 2015, we evaluate the effectiveness of six types of demand-side expenditure control measures including physician-level behaviour measures, system-level price-control measures and substitution measures, alongside a proxy for cost-sharing and add a new dimension to the existing empirical evidence hitherto based on national-level and meta-studies. We use the weighted-average least squares regression framework adapted for estimation with panel-corrected standard errors. Our empirical analysis suggests that direct patient cost-sharing and some-but not all-demand-side measures successfully dampened PPE growth in the past. Cost-sharing schemes stand out as a powerful mechanism to curb PPE growth, but bear a high risk of adverse effects. Other demand-side measures are more limited in effect, though may be more equitable. Due to limitations inherent in the study approach and the data, the results are only explorative.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28b3ba23d2f39ea614e6c0e80de7559b",
  "timestamp": "2025-05-15T03:06:01.326163"
}