{
  "id": 6238,
  "title": "The Natural Catastrophe Protection Gap: Measurement, Root Causes and Ways of Addressing Underinsurance for Extreme Events",
  "abstract": "The global property protection gap in natural catastrophe risk has widened steadily over the past 40 years. In historical terms, we find that most underinsurance of extreme events is for climate-related events such as flood and windstorm, but in expected terms, earthquakes comprise the largest share of underinsurance. Using a framework to define the protection gap in historical and expected terms, this paper breaks down the gap by geography and risk type and presents an empirical analysis of the key drivers of the gap. First, uninsured expected Cat losses are estimated using models that combine geophysical vulnerability maps, economic exposure data and insurance market information. Second, each country's expected (or optimal) property insurance penetration is modelled and compared to actual penetration to derive a measure of property underinsurance. Third, we explore the factors that affect property insurance demand, applying regression analysis to an unbalanced panel data set that includes 53 countries observed over a 15-year period. Several significant economic, financial market, sociodemographic, cultural and institutional variables are identified. The results lead to a taxonomy of the root causes of underinsurance and a set of proposed measures to narrow the protection gap.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28bf0c85dae1ea4e203672168287abaa",
  "timestamp": "2025-05-15T02:56:10.951968"
}