{
  "id": 6528,
  "title": "Does chief executive compensation predict financial performance or inaccurate financial reporting in listed companies: A systematic review",
  "abstract": "BackgroundFinancial incentives for chief executive officers (CEOs) are thought to motivate them to lead their company toward achieving important business objectives. Based on the Rousseau et al. (2019) protocol, this systematic review assesses the predictive effects of CEO incentives on certain business outcomes.ObjectivesThis review addresses whether CEO financial incentives predict: (1) firm financial performance and (2) financial restatement due to misreporting.Search methodsWe searched nine research databases for published peer-reviewed literature (to July 23-26, 2021 and an attenuated search from those dates to July 27-31, 2023) and thirteen professional association websites for non-published gray literature (to August 2021). We also hand-searched selected relevant journals.Selection criteriaWe reviewed peer-reviewed and unpublished studies available in English since 1980. Eligible studies regarding our first question assessed CEO financial incentives (1) 1 year or more before the measurement of outcomes, (2) controlled for pre-incentive firm performance or market conditions, and (3) analyzed CEO financial incentives as predictors of firm outcomes. Eligible studies regarding our second question assessed whether financial restatement had occurred and analyzed effects of CEO incentives on this outcome.Data collection and analysisWe extracted standardized regression coefficients for each effect or converted unstandardized regressions to standardized. Analyses were conducted using STATA. All studies were assessed to have moderate risk of bias.Main resultsFor our first question, 20 studies (15,398 firms) met our criteria for meta-analysis of effects. Bonuses, the most commonly studied incentive, had a small positive effect on next year's accounting performance metric Return on Assets (ROA, 0.046 [k = 7, 95% confidence interval (CI) = 0.014, 0.078]). The bonus effect in the market-related metric of Stock Returns (-0.026 [k = 5, 95% CI = -0.119, 0.067]) fell within a CI including 0, as did its effect on another market-related metric, Market-to-Book value (Tobin's Q, 0.028 [k = 3, 95% CI = -0.024, 0.08]). We conclude that Bonuses show no predictive effect on the following year's market-related metrics but do affect ROA. Stock Options had no effect on next year's ROA (0.027 [k = 5, 0.95% CI = 0.000, 0.052]), nor on Market-to-Book Value (Tobin's Q, 0.097 [k = 5, 95% CI = -0.027, 0.220]) or Stock Return (0.042 [k = 6, -0.033, 0.117]), indicating no predictive effect for Stock Options on either accounting or market-related performance. We sought but found too few studies to report on effects of incentives on other financial outcomes or for lags greater than 1 year. For our second question, three studies (n = 2044 firms) met our criteria. The overall effect size for CEO Incentives on Restatement (-0.09 [k = 3, 95% CI = -0.363, 0.184) fell within a CI including zero. We conclude that current evidence does not support a direct relationship between CEO financial incentives and Restatement.Authors' conclusionsThis review affirms a small effect of CEO Bonuses, but no effect of Stock Options, on the accounting performance metric ROA. In contrast, neither Bonuses nor Stock Options predict a firm's market-related metrics. CEO incentives also are unrelated to Financial Restatement. Despite widespread use of CEO financial incentives, lack of evidence supporting their use, beyond the bonus-ROA effect we identify, suggests caution regarding current CEO financial incentive practice and greater consideration of alternative arrangements to enhance firm performance.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28eeaaf92e0b002234a3a0d5f13bbfd4",
  "timestamp": "2025-05-15T02:59:07.478941"
}