{
  "id": 3648,
  "title": "Do patients with haematological malignancies suffer financial burden? A cross-sectional study of patients seeking care through a publicly funded healthcare system",
  "abstract": "Background: It is increasingly appreciated that some patients with cancer will experience financial burden due to their disease but little is known specifically about patients with haematological malignancies. Therefore, this study aimed to measure financial toxicity experienced by patients with haematological malignancies in the context of a publicly funded health care system. Method: All current patients diagnosed with leukaemia, lymphoma or multiple myeloma, from two major metropolitan health services in Melbourne, Australia were invited to complete a survey capturing; patient demographics, employment status, income sources, financial coping and insurances, OOP expenses and selfreported financial toxicity using a validated measure. Results: Of the 240 people approached, 113 (47 %) participated and most had leukaemia (62 %). Forty-seven (42 %) participants experienced some degree of financial toxicity using the Comprehensive Score for financial toxicity (COST) instrument. On multivariate linear regression, older age (>65 years, p = 0.007), higher monthly income (>$8000, p = 0.008), not having and being forced into unemployment or early retirement (p < 0.001) remained significantly associated with less financial toxicity. Conclusion: Financial toxicity is present in Australian haematology patients and those at higher risk may be patients of working age, those without private health insurance and patients that have been forced to retire early or have become unemployed due to their diagnosis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28f522293201494052f132c98e2d52b5",
  "timestamp": "2025-05-15T02:28:29.393340"
}