{
  "id": 7095,
  "title": "How Do Islamic Stock Markets React to Country-based and Global Financial Factors in BRIC and G7? Evidence from a Novel MMQR Approach",
  "abstract": "The purpose of the study is to compare the effect of country-based and global financial factors on Islamic stock market returns of BRIC (developing) and G7 (developed) country groups covering data from March 26, 2015, to March 31, 2021, for BRIC countries and July 27, 2015, to March 31, 2021, for G7 countries. A newly developed method of moment quantile regression (MMQR) is used to detect the asymmetric effects on Islamic stock market return across bullish, bearish, and normal market conditions, which is essential to better analyzing the stock market return. The outcome demonstrates that exchange rates have a significantly positive effect on stock market returns while CDS has a significant negative impact on the stock market return in G7 countries in both bearish and normal markets. On the contrary, we observe that the link between CDS and Islamic stock returns is negative but statistically insignificant in the case of BRIC. Additionally, we consider the Morgan Stanley Capital International (MSCI) world index and the CBOE Volatility Index (VIX) as the global financial factors. We find that the estimatedcoefficients of the MSCI world index have significant and positive effects on the stock market return in the case of both BRIC and G7 countries at all quantile levels. VIX has a significant negative impact on the Islamic stock return of the G7 across all quantiles. On the other hand, it has significant negative impacts only in transition (Q6) and a bullish period in the case of BRIC. The outcomes of the research will assist portfolio risk managers, international investors, and policymakers in building diversified portfolios and making investment decisions throughout the market's busts and booms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "28ffb9e02c4e37f170e12b3bc9b094ea",
  "timestamp": "2025-05-15T03:05:03.525557"
}