{
  "id": 5650,
  "title": "Multiscale downside risk interdependence between the major agricultural commodities",
  "abstract": "This paper measures pairwise multiscale extreme risk interdependence between the five major agricultural futures. This topic has economic importance for agricultural market participants because potentially high losses might occur due to the cross-market extreme risk transmissions. Downside risk is observed via time-varying Value-at-Risk time-series, while the multiscale analysis is conducted using several wavelet approaches. Results of wavelet coherence show an absence of high interdependence in the short-term horizons, while at higher wavelet scales, we find stronger connection only in some cases-corn-wheat, corn-soybean, wheat-soybean and somewhat corn-rice. High coherence islands are detected around the global financial crisis, but only in a few cases, which means that commodity financialization could play an important role when it comes to extreme risk. Wavelet correlations and wavelet-based quantile regression support the wavelet coherence findings in great deal, adding to the robustness of the overall results. Phase difference indicates that bigger markets, such as corn, wheat, and soybean, mostly lead two smaller markets-rice and oats in the midterm and long-term horizons, but a consistent and long-lasting pattern is evident only between corn and soybean. An absence of a clear-cut downside interdependence means that agricultural agents do not need to worry too much about the damaging extreme risk spillover effects from other neighboring agricultural markets. [EconLit Citations: C63, G32, Q14].",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2900c7fad93a2cf1dc7f820d8b7f373e",
  "timestamp": "2025-05-15T02:49:50.375514"
}