{
  "id": 8633,
  "title": "Income generating activities of people who inject drugs",
  "abstract": "Background: Injection drug users (IDU) commonly generate income through prohibited activities, such as drug dealing and sex trade work, which carry significant risk. However, little is known about the IDU who engage in such activities and the role of active drug use in perpetuating this behavior. Methods: We evaluated factors associated with prohibited income generation among participants enrolled in the Vancouver Injection Drug Users Study (VIDUS) using logistic and linear regression. We also examined which sources of income respondents would eliminate if they did not require money to pay for drugs. Results: Among 275 IDU, 145 (53%) reported engaging in prohibited income generating activities in the past 30 days. Sex work and drug dealing accounted for the greatest amount of income generated. Non-aboriginal females were the group most likely to report prohibited income generation. Other variables independently associated with prohibited income generation include daily heroin injection (AOR = 2.3) and daily use of crack cocaine (AOR = 3.5). Among these individuals, 68 (47%) indicated they would forgo these earnings if they did not require money for illegal drugs, with those engaged in sex trade work (62%) being most willing to give up their illegal source of income. Conclusion: These findings suggest that the costs associated with illicit drugs are compelling IDU, particularly those possessing markers of higher intensity addiction, to engage in prohibited income generating activities. These findings also point to an opportunity to explore interventions that relieve the financial pressure of purchasing illegal drugs and reduce engagement in such activities, such as low threshold employment and expansion of prescription and substitution therapies. (C) 2007 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "291023b9aad89bc578b29535aede84cc",
  "timestamp": "2025-05-15T03:20:55.889250"
}