{
  "id": 9124,
  "title": "The economic impact of international travel measures used during the COVID-19 pandemic: a scoping review",
  "abstract": "Introduction Assessment of the use of travel measures during COVID-19 has focused on their effectiveness in achieving public health objectives. However, the prolonged use of highly varied and frequently changing measures by governments, and their unintended consequences caused, has been controversial. This has led to a call for coordinated decision-making focused on risk-based approaches, which requires better understanding of the broader impacts of international travel measures (ITMs) on individuals and societies.Methods Our scoping review investigates the literature on the economic impact of COVID-19 ITMs. We searched health, social science and COVID-19-specific databases for empirical studies preprinted or published between 1 January 2020 and 31 October 2023. Evidence was charted using a narrative approach and included jurisdiction of study, ITMs studied, study design, outcome categories, and main findings.Results Twenty-six studies met the inclusion criteria and were included for data extraction. Twelve of them focused on the international travel restrictions implemented in early 2020. Limited attention was given to measures such as entry/exit screening and vaccination requirements. Eight studies focused on high-income countries, 6 on low-income and middle-income countries and 10 studies were comparative although did not select countries by income. Economic outcomes assessed included financial markets (n=13), economic growth (n=4), economic activities (n=1), performance of industries central to international travel (n=9), household-level economic status (n=3) and consumer behaviour (n=1). Empirical methods employed included linear regression (n=17), mathematical modelling (n=3) and mixed strategies (n=6).Conclusion Existing studies have begun to provide evidence of the wide-ranging economic impacts resulting from ITMs. However, the small body of research combined with difficulties in isolating the effects of such measures and limitations in available data mean that it is challenging to draw general and robust conclusions. Future research using rigorous empirical methods and high-quality data is needed on this topic.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2912c073ce59c4af70a1b775602b606a",
  "timestamp": "2025-05-15T03:25:54.546533"
}