{
  "id": 7771,
  "title": "Analyzing Performance in Wholesale Trade Romanian SMEs: Framing Circular Economy Business Scenarios",
  "abstract": "The study analyzes the performance levels achieved by Romanian wholesaler SMEs from Hunedoara County and to advance some practical courses of action designed to support local entrepreneurs in improving efficiency and in embracing circular economy (CE) practices. We employed cluster and discriminant analyses with a focus on providing an accurate classification of trade SMEs, according to their performance. Three distinct classifications of SMEs resulted in: (i) a class of enterprises displaying high levels of the rates of return, whose business owners exhibited an increased risk appetite and applied investment policies focusing on future development by means of incorporating digital instruments; (ii) a class of SMEs displaying average levels of rates of return, which manage to survive in situations of crisis through maintaining the position previously gained on the market; and (iii) a class of SMEs exhibiting a precarious financial position and employing defensive strategies, with managers who are reluctant to take risks in the innovation processes. Furthermore, we present a cloud computing solution which was tailored for one of the companies from our sample that appeared to be the most likely to carry out the transition from the average SME performance class to the higher class. The main advantages that are brought about by the IT solution in terms of environmental sustainability consist of: improvements in energy efficiency, the decrease in carbon footprints, the lowering of operational costs and the diminishing of the amount of e-waste.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "291afc9cf9cfb2db43c2dca21216b0e6",
  "timestamp": "2025-05-15T03:12:11.491495"
}