{
  "id": 3420,
  "title": "Geo-political risks, uncertainty, financial development, renewable energy, and carbon intensity: Empirical evidence from countries at high geo-political risks",
  "abstract": "Geopolitical risks and uncertainty negatively affect the economy and environmental quality. High geopolitical risks and high uncertainty increase carbon emission intensity by increasing dependence on fossil fuels. However, research in this area is still in its infancy and more empirical evidence is needed to justify the causal link. This research examines the causal mechanism linking geopolitical risk, uncertainty, financial development, renewable energy, and carbon intensity in a sample of eighteen countries with high geopolitical risk between 1985 and 2021. The selected countries have a high intensity of geopolitical risks due to internal and external conflicts that have worsened in recent years. We employ cointegration techniques from Hatemi-J [1] and Maki [2] in the presence of structural breaks, fully modified ordinary least squares (FMOLS), canonical cointegration regression (CCR) models, and static time-variant Granger causality (1969) test. We find robust empirical evidence that geopolitical risk, financial development, renewable energy, uncertainty, and carbon intensity have a cointegrating relationship in the presence of structural breaks. Results from FMOLS and CCR models indicate that carbon intensity responds differently to changes in geopolitical risk, renewable energy, uncertainty, and financial development. Environmental and energy policymakers should mitigate carbon intensity through long-run rather than short-run mechanisms to achieve SDG12 and SDG13.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "291cf1b243801e9d7621a152422c82d9",
  "timestamp": "2025-05-15T02:26:09.124490"
}