{
  "id": 9250,
  "title": "A mixed methods descriptive study of a diverse cohort of African American/Black and Latine young and emerging adults living with HIV: Sociodemographic, background, and contextual factors",
  "abstract": "BackgroundAmerican/Black and Latine (AABL) young/emerging adults living with HIV in the United States (US) have consistently failed to meet targets for HIV care/medication engagement. Among this population, those with non-suppressed HIV viral load are understudied, along with immigrants and those with serious socioeconomic deprivation. Guided by social action theory, we took a mixed methods approach (sequential explanatory design) to describe sociodemographic, background, and contextual factors, and their relationships to HIV management, among a diverse cohort.MethodsParticipants (N = 271) received structured baseline assessments and HIV viral load testing. Primary outcomes were being well-engaged in HIV care and HIV viral suppression. A subset (N = 41) was purposively sampled for maximum variability for in-depth interviews. Quantitative data were analyzed with descriptive statistics and logistic regression, and used to develop a research question about life contexts. Qualitative data were analyzed with directed content analysis, and the joint display method was used to integrate results.ResultsParticipants were 25 years old, on average (SD = 2). The majority (59%) were Latine/Hispanic and the reminder African American/Black. Almost all were assigned male sex at birth (96%) and sexual minorities (93%). Half (49%) were born outside the US and 33% spoke primarily Spanish. They were diagnosed with HIV four years prior on average (SD = 3). Most were well-engaged in HIV care (72%) and evidenced viral suppression (81%). Speaking Spanish was associated with a higher odds of care engagement, and adverse childhood experiences and income from federal benefits were associated with a lower odds. None of the factors predicted viral suppression. Qualitative results highlighted both developmentally typical (insufficient financial resources, unstable housing) and atypical challenges (struggles with large bureaucracies, HIV disclosure, daily medication use). Federal benefits and the local HIV social services administration were critical to survival. Immigrant participants came to the US to escape persecution and receive HIV care, but HIV management was often disrupted. Overall qualitative results highlighted both risk and protective factors, and resilience. Qualitative results added detail, nuance, and richness to the quantitative findings.ConclusionsThe present study advances what is known about the backgrounds and contexts of diverse and understudied AABL young/emerging adults living with HIV.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "291c053816689f43bdf944fa0e76906e",
  "timestamp": "2025-05-15T03:26:54.602080"
}