{
  "id": 7680,
  "title": "Socioeconomic status and other factors associated with HIV status among OVC in Democratic Republic of Congo (DRC)",
  "abstract": "Background: Orphans and vulnerable children (OVC) are a high-risk group for HIV infection, particularly in Sub-Saharan Africa. Purpose: This study aims to portray the socioeconomic profile of OVC and examine the association of household and parent/guardian characteristics with the HIV status of OVC. Methods: For this quantitative retrospective study, we obtained data from ICAP/DRC for a total of 1,624 OVC from households enrolled for social, financial, and clinical services between January 2017 and April 2020 in two provinces of the Democratic Republic of Congo, Haut-Katanga and Kinshasa. We computed descriptive statistics for OVC and their parents' or guardians' characteristics. We used the chi-square test to determine bivariate associations of the predictor variables with the dichotomous dependent variable, HIV positivity status. To analyze the association between these independent variables and the dichotomous dependent variable HIV status after controlling for other covariates, we performed firth's logistic regression. Results: Of the OVC included in this study, 18% were orphans, and 10.9% were HIV+. The chi-square analysis showed that among parents/guardians that were HIV+, a significantly lower proportion of OVC (11.7%) were HIV+ rather than HIV- (26.3%). In contrast, for parents/guardians with HIV- status, 9.0% of OVC were HIV-negative, and 11.7% of OVC were OVC+. The firth's logistic regression also showed the adjusted odds of HIV+ status were significantly lower for OVC with parents/guardians having HIV+ status themselves (AOR, 0.335; 95% CI, 0.171-0.656) compared with HIV-negative parents/guardians. The adjusted odds of HIV+ status were significantly lower for OVC with a monthly household income of < $30 (AOR, 0.421; 95% CI, 0.202-0.877) compared with OVC with a monthly household income > $30. Conclusions: Our results suggest that, with the exception of a few household and parent/guardian characteristics, the risk of HIV+ status is prevalent across all groups of OVC within this study, which is consistent with the existing body of evidence showing that OVC are in general vulnerable to HIV infection. With a notable proportion of children who are single or double orphans in DRC, HIV+ OVC constitute a high-risk group that merits customized HIV services. The findings of this study provide data-driven scientific evidence to guide such customization of HIV services.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "292daedfaa090cbb8b3f564fa4973cb6",
  "timestamp": "2025-05-15T03:11:04.523225"
}