{
  "id": 6121,
  "title": "THE INFLUENCE OF THE CLASSIFICATION OF NON-CURRENT ASSETS AS HELD FOR SALES ON THE LIQUIDITY OF THE COMPANY'S BALANCE SHEET",
  "abstract": "Enterprises are in constant search for additional sources of financing their activities and increasing the liquidity of their balance. One of these methods is the classification of non-current assets as held for sale, which causes changes in the structure of assets of the company, affects its liquidity and solvency. At the same time, users of information should be sure of the reality of such operations for the classification of non-current assets. It is important to avoid manipulating balance sheets and artificially enhancing their liquidity by changing the structure of assets. The results of a study of the impact of operations on classification of non-current assets as held for sale on the liquidity of the company's balance sheet are presented in this article. The impact of non-current assets held for sale on liquidity is shown separately provided that they are included in the groups of fast-selling assets and slow-selling assets. The impact of such groupings on the liquidity indicators is shown by means of coefficient analysis. The nature and level of the impact of non-current assets held for sale on the liquidity of the balance sheet is identified by modelling a consistent change in their volume relative to the value of non-current assets and capital of the company. For the purpose of effective asset management, the optimal indicator of non-current assets held for sale in the company's balance sheet has been proposed, which avoids the risk of lowering the productivity of the existing equipment while ensuring the release of financial resources due to the sale of assets.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29326d8ca8e35145499ab3efa20bf661",
  "timestamp": "2025-05-15T02:55:12.831372"
}