{
  "id": 7263,
  "title": "Strategic factors and the use of risk analysis techniques in strategic investment decisions",
  "abstract": "Risk analysis techniques (RATs) greatly support managers in obtaining a more comprehensive view of the threats and opportunities of strategic investment proposals. Our study investigates what strategic factors influence the use of RATs. Specifically, we address the frequency of use of the most common RATs, such as sensitivity, scenario, simulation, and CAPM analyses. We investigate firms' strategic factors, such as corporate strategy, business strategy, and financial strategy. We test our hypotheses using multiple linear regression and data from 105 structured interviews from among the 150 largest Finnish manufacturing companies. We contribute to prior literature by showing that corporate strategy (parenting style) moderates the effect between business strategy and the use of RATs. Previous literature suggests that RATs are likely less useful in prospector-type business strategies entailing high external uncertainty. Nevertheless, we show that prospectors using the strategic planning style - a style suggested to suit corporations with high synergy potential between business units - employ RATs more frequently than the prospectors using the other parenting styles. We also provide clear evidence that difficulties in the availability of funding encourage companies to use RATs more frequently.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2936bca58d6f6d3e85a4cabdb1ec5bec",
  "timestamp": "2025-05-15T03:07:02.521629"
}