{
  "id": 7348,
  "title": "Impostor phenomenon and self- reported satisfaction among medical and surgical postgraduate trainees in Sri Lanka",
  "abstract": "Background Psychological phenomena such as impostor phenomenon (IP) and low work-related satisfaction increase the risk of burnout among medical professionals. The prevalence of these contributory risk factors among South Asian medical professionals has not been examined thus far. This study aims to assess the prevalence, severity and associations of IP, including self-reported satisfaction with training, in a cohort of postgraduate doctors in Sri Lanka. Methods This cross-sectional study was conducted among medical and surgical postgraduate trainees enrolled at Post Graduate Institute of Medicine, University of Colombo. A self-administered questionnaire including the Clance Impostor Phenomenon Scale was used for data collection. SPSS version 26 was used for analysis, and associations were analysed using Chi Square and logistic regression. Results The response rate was 75.3% (n = 201). Of the study population, 9% (n = 18) experienced few impostor characteristics, 51.7% (n = 104) experienced moderate impostor characteristics, 38.8% (n = 78) experienced frequent impostor characteristics and 0.5% (n = 1) experienced intense impostor characteristics. The mean IP value was 55.55 (SD-12.03), in the category of moderate IP. Significant associations were seen between IP and sociodemographic factors of being single, lack of friendships outside medicine and improvement in financial status related to medical profession (p < 0.05); academic factors such as satisfaction with pursuing postgraduate training and satisfaction with academic performance (p < 0.05); work-related factors such as early stages of postgraduate training, lack of confidence in communicating with superiors and other specialties, receiving criticism from the team and sense of guilt regarding patient outcomes (p < 0.05). Self-reported satisfaction with postgraduate training was expressed by 79.1% (n = 159) of trainees, with 59.2% (n = 119) self-reporting poor work-life balance. Self-reported satisfaction with training was associated with satisfaction with chosen specialty, self-reported satisfaction with academic performance, good work-life balance, confidence in interpersonal interactions, financial stability and family support (p < 0.05). Conclusions A significant number of Sri Lankan medical and surgical postgraduate trainees experienced IP. This phenomenon is significantly associated with sociodemographic, academic and work-related factors. Self-reported trainee satisfaction with postgraduate training was high and associated with positive psychosocial factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "293676cddb448e846c38d7c2620afc17",
  "timestamp": "2025-05-15T03:07:31.948207"
}