{
  "id": 1150,
  "title": "Enhancing weather index insurance through surrogate models: leveraging machine learning techniques and remote sensing data",
  "abstract": "The agricultural industry's crop yield production is highly vulnerable to extreme weather events, heightened by the impacts of climate change. Weather Index Insurance (WII) presents an innovative solution for insurers to protect farmers from significant yield losses. The objective of this study is to develop an index that is highly correlated with crop yield while ensuring transparency for policyholders. WII products often rely on a single weather index, which fails to encompass the complex nature of weather events. While machine learning models offer the potential to model the multifaceted nature of factors influencing crop growth, their adoption in WII products has been limited due to their lack of transparency, often perceived as 'black box models'. This research examines soybean yield in the Corn Belt region of the USA. This study proposes a novel framework to develop a highly predictive multi-weather index based on a neural network model, and then applying a surrogate model to ensure transparency whilst maintaining predictive power. A generalised linear model (GLM) is implemented as the surrogate model in this study. The GLM achieved a mean absolute error (MAE) of 8.2%, which is comparable to the neural network model's MAE of 7.6%. The weather index derived from the simplified approximation of the surrogate model incorporates multiple remote sensing indexes and weather variables: Potential Evapotranspiration (PET), Evapotranspiration (ET), Land Surface Temperature (LST), Vegetation Condition Index (VCI) and minimum temperature. The proposed methodology achieved a substantial hedging efficiency of 21% downside risk reduction, thereby demonstrating the effectiveness of the proposed WII product. The development of an index that closely aligns with crop yield losses is crucial for the financial viability of WII.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2936dac902803edd253898ce8e58ba59",
  "timestamp": "2025-05-15T01:59:21.706462"
}