{
  "id": 5807,
  "title": "Agri-food supply chain performance: an empirical impact of risk",
  "abstract": "Purpose - The purpose of this paper is to examine the key risk components (probability and consequence) and their respective thresholds affecting agri-food supply chain operations in Ghana. In addition, it seeks to understand the relationship between the major risk sources and to fathom the risk/disruption impact on agri-food supply chain performance in Ghana. Design/methodology/approach - Cross-sectional survey data were collected using a structured questionnaire. The risks threshold associated with agri-food supply chain were categorized using the risk matrix scale and classification described in the Project Management Body of Knowledge (Project Management Institute, 2013). Next, the Pearson correlation was used to understand the relationship between the various risks and agri-food chain performance. Lastly, to investigate how firms' supply chain operations have been affected by risks/disruptions, an ordinary least square regression model was employed to quantify the impact of some major risk sources on agri-food chain performance in Ghana. Findings - The results in this paper show variations in risks' probability, impact and threshold in agri-food supply chain. While risk sources such as periodic change in interest/exchange rate policies and volatility in customer demand are high-rated risks, uncertain land policies/tenure and poor quality control are low rated risks in the operations of the chain. The performance of the agri-food chain significantly but negatively correlates with all the major risks studied. Whereas demand, supply, weather, logistics/infrastructure and financial risk sources significantly undermined the chain's performance, risks emerging from biological/environmental, management/operational, policy/regulations and political-related issues insignificantly affect the performance of agri-food supply chain in Ghana. Research limitations/implications - This research is an area biased. However, some insightful managerial implications can be drawn from this paper to manage agri-food chain operations in a similar unstable environment. The result implies that risks are inevitable in agri-food chain but they differ in terms of menace to the chain's operation. Therefore, tomanage agri-food supply chain risks effectively, managers should periodically identify, quantify and categorize risk sources before making risk response decisions. In addition, the results show that risks account for about half of the overall agri-food chain performance in Ghana. This infers that managers/practitioners could improve the performance of the agri-food chain if limited resources are allocated to plan and effectively respond to major risks sources (such as demand, supply, finance, weather and logistical/infrastructural services-related risks) undermining the performance of the chain. Originality/value - This research contributes to the agri-food chain risk literature and provides managers/practitioners with empirical evidence of risk thresholds and their corresponding major impact on agri-food chain's performance. Since risks explained about half of agri-food chain performance in Ghana, this research would prompt decision makers to improve on their risk assessment and responds (e.g. by employing efficient demand, supply and weather forecasting systems, logistic/infrastructure services, hedge to finance, etc.) to improve the chain's performance.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "293b90dec545a58099a3ceccdb95f633",
  "timestamp": "2025-05-15T02:51:30.128211"
}