{
  "id": 5398,
  "title": "Impact of Islamic Bank Boards and Risk Management Committee (RMC) Attributes on Credit Ratings: An Evidence from Pakistan",
  "abstract": "Shariah compliance is the most important feature distinguishing Islamic financial institutions from traditional ones. Shariah governance is the mechanism to monitor and imply compliance in Islamic banks. This study aims to investigate the Risk Management Committee, shariah governance and corporate governance attributes on credit ratings of Islamic banks in Pakistan. The investigation period from 2013 to 2020 develops the six paradigms of Islamic banks' governance with credit rating. Long-term and short-term credit rating scales were applied, and the Ordered Logistic Regression model implied a suitable technique for the ordinal dependent variable. Findings suggest that the Risk management committee's existence, size and independence improve Islamic banks' credit ratings. Islamic bank's board and Shariah board characteristics also significantly affect credit ratings. Shariah compliance can be enhanced if credit rating firms give Shariah governance traits more weight in the credit rating process. The presence of effective and independent risk management oversees the Islamic bank risks and evaluates the Islamic banks' risk-taking activities within the given framework. Further, high shariah compliance not only gains the confidence of investors and depositors, but Islamic banks can also access more funds at a low cost.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2941fa31b442b5daa16eeb810b48d8b0",
  "timestamp": "2025-05-15T02:47:14.038192"
}