{
  "id": 3893,
  "title": "Does increased water efficiency improve financial performance? The important role of operational efficiency",
  "abstract": "Purpose The purpose of this study is to examine the relationships between changes in water efficiency, profit and risk for firms in the global Consumer Packaged Goods industry. This study also aims to consider the moderating effect of operational efficiency on those relationships. Design/methodology/approach Using a sample of 155 firms with annual corporate social performance and financial performance data from Bloomberg for the years 2010-2019, this study employs first-differencing panel regression models to obtain our results. Findings This study finds strong evidence that operational efficiency moderates the relationships between water efficiency, profit and risk. For operationally efficient firms, increasing water efficiency increases profit and reduces risk. But for firms that are not operationally efficient, this study finds the opposite effects. These findings suggest a threshold level of operational efficiency that firms should achieve before they can reap financial benefits from increases in water efficiency. Originality/value Despite the increasing importance of water efficiency as a measure of corporate social performance, its effects on financial performance are not well studied. The relationship between operational efficiency and water efficiency has also not been examined. This work provides empirical evidence to better understand these important relationships. The major implication for managers is that operational efficiency is a foundational capability that should be developed before focusing on efforts to improve water efficiency. For operationally efficient firms, improvements in water efficiency can be an important mechanism to increase profitability and reduce risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29537a5366f0bd7ff93ba6a6cc23f226",
  "timestamp": "2025-05-15T02:30:58.365511"
}