{
  "id": 2923,
  "title": "The Impact of Environmental Social and Governance Performance on Systematic Tail Risk of Chinese Corporations",
  "abstract": "Based on the perspective of systematic tail risk, this study aims to explore the impact of environmental social and governance (ESG) performance on financial performance. At the same time, it also explores the mediating effects of financing constraints, information transparency, and corporate reputation in this relationship. This study uses the data from Chinese A-share listed companies from 2009 to 2022 as samples, uses two-way fixed-effect regression to test the benchmark model and mechanism model, and conducts a series of robustness tests and heterogeneity tests. The findings show that the following: (1) ESG performance significantly reduces systematic tail risk, with individual tail risk driving this negative relationship. (2) ESG performance lowers systematic tail risk through alleviating financing constraints, improving information transparency, and enhancing corporate reputation. (3) The inhibitory effect of ESG on systematic tail risk is more pronounced in the non-state-owned, low-pollution, high-liquidity, and high-information-efficiency samples. (4) Among the three dimensions of ESG, governance (G) has the most substantial impact in reducing systematic tail risk, compared to environmental (E) and social (S). This study is the first to explore the role of ESG performance on financial performance from the perspective of systematic tai risk. At the same time, we discuss for the first time how ESG performance affects tail system risk. This study contributes to an in-depth exploration of ESG's role in financial performance, providing insights for preventing financial risk and achieving sustainable development.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "295c188f8563f9aa8d3cd1d82bf042ae",
  "timestamp": "2025-05-15T02:20:48.120928"
}