{
  "id": 7590,
  "title": "Political Connections and CSR Disclosures in Indonesia",
  "abstract": "This research seeks to provide evidence about how political connections, proxied by govenunent ownership and the existence of politically connected board members, affect the extent of corporate social responsibility (CSR) disclosures in Indonesian listed companies. This research uses the legitimacy theory as a basis for explaining management's motivation for disclosing its CSR. The sample consists of 131 firm-year observations from 38 non-financial public companies that published sustainability reports from 2013 to 2017. We measured the CSR disclosures using a disclosure checklist on the sustainability reports. We subsequently processed the data using a random effect (RE) linear regression. The result shows that CSR disclosures were greater in government-owned companies but lower in companies that have politically connected board members. The results support the legitimacy theory that the government intends to demonstrate legitimate national economic and political conditions by showing that government-owned companies are sustainable. However, CSR disclosures seem to have a substitutive relationship with the existence of politically connected board members, since those political connections may protect the company from public pressure and/or the risk of litigation, reducing the need for CSR disclosures. This research provides evidence that different types of political connections may have different impacts on corporate disclosures.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "295d95187313121dd24dd8aa2c88aa57",
  "timestamp": "2025-05-15T03:10:05.600202"
}