{
  "id": 7707,
  "title": "How much do development partners invest in disaster risk reduction? A data analysis",
  "abstract": "Motivation: Most weather-related disasters occur in the world's poorest countries, which have the least capacity to cope. Due to the absence of a clear classification of DRR aid, donors and recipient countries have not known the amount of DRR aid flowing or its effectiveness in terms of supporting disaster risk management in developing countries.Purpose: In 2018, the OECD DAC created a new policy marker for DRR to help donor countries to monitor and report the progress made on mainstreaming DRR into their development activities. Drawing on this DRR marker, this study identifies trends and patterns as well as limitations in the DRR mainstreaming process to guide donor countries to successfully deliver the DRR goals.Methods and approach: When reporting to the OECD DAC, donors are asked to provide information on the purpose of individual projects/programmes, and screen against all policy markers in the reporting system. Using this data, this study conducted an in-depth analysis of donor countries' development portfolios to provide a comprehensive and granular picture of the funding streams and practices concerning DRR.Findings: This study revealed that current spending on DRR remains a tiny fraction of total development aid. Even after the creation of the DRR marker, which raised donors' awareness of the importance of integrating DRR into development planning, no substantial increase in DRR funding has been made. This implies that most official development assistance from DAC members still fails to consider DRR in any meaningful way.Policy implications: Important areas for improvement include a more comprehensive understanding of disaster risk, increased funding for activities that principally target DRR, financial stability, and further integration of DRR and climate change adaptation into development projects.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29703ee289cb44e29041aeaec287dba7",
  "timestamp": "2025-05-15T03:11:04.644482"
}