{
  "id": 6547,
  "title": "Assessing extreme values in political risk estimates",
  "abstract": "With the increasing integration of world markets, it is important to understand the impact of political risk on financial portfolios. Current research on the influence of political risk on portfolio returns has focused on the mean portfolio outcome, but has failed to address extreme outcomes. Existing literature on the topic has employed the International Country Risk Guide (ICRG) as measures of political risk to address diverse topics such as asset prices, market returns, and real-asset valuation. Findings include that portfolio diversification in politically risky countries is actually beneficial, political risk is an important factor in explaining market returns of equity, and that the impact of political risk factors is more pronounced in emerging as opposed to developed markets. We hypothesize that there exist different underlying variables of political risk causing extreme portfolio outcomes as opposed to mean portfolio outcomes. We explore the correlation between political risk and portfolio outcomes in 21 developed and 27 emerging countries. To this end, we employ a portfolio strategy and form three portfolio strategies, forming separate portfolios for emerging and developed markets. The first is a simple portfolio based on the market type, emerging or developed; the second follows an upgrade-downgrade strategy, and the third portfolio is a random portfolio, which includes 100 randomly selected sub-portfolios of size five. In order to assess the impact of political risk indicators on various portfolio return levels, we employ quantile regression analysis, enabling us to focus on the underlying political risk factors influencing extreme portfolio returns. Some risk variables-- especially investment profile, corruption, and socio economic conditions-- exhibit variability in lower quantiles and impact the tails of the distribution differentially, which is not visible using ordinary least squares analysis. Our findings imply that while investing, it is important for one to disaggregate political risk components. Furthermore, it is not enough to simply consider mean performance of portfolios. It is important to analyze the effects of the individual political risk components on extreme portfolio outcomes, as each component will have a different effect on different types of portfolios.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "297cf29e8b47b7f65919eb786bcdfd35",
  "timestamp": "2025-05-15T02:59:07.544846"
}