{
  "id": 586,
  "title": "Financial Time Series Forecasting: A Comprehensive Review of Signal Processing and Optimization-Driven Intelligent Models",
  "abstract": "Financial time series forecasting is pivotal in various sectors such as portfolio management investment allocation and risk assessment. However, traditional methods are not suitable to provide acceptable forecasting attributes of financial data. In response, intelligent algorithms like artificial neural networks, fuzzy logic, machine and deep learning techniques have emerged as promising tools for improving forecasting accuracy. This article provides a comprehensive review of different intelligent forecasting models, highlighting their advantages and limitations. Directly feeding historical data into these models is not reliable due to the volatile, nonlinear, and non-stationary nature of financial information, along with uncertainties in numerous independent parameters. Therefore, additional feature engineering and optimal parameter selection techniques are necessary. Integrating signal processing techniques enables the extraction of useful features from noisy financial data, while optimization algorithms aid in model refinement and parameter tuning. The article also discusses performance indicators, which are crucial for identifying optimal features and parameters in forecasting models. These integrated approaches not only enhances forecasting accuracy but also provides new possibilities in decision-making processes across various sectors.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "298224920a840a1e7a38a32fb1457eee",
  "timestamp": "2025-05-15T01:40:14.262373"
}