{
  "id": 2982,
  "title": "Cancer-related financial hardship among head and neck cancer survivors: Risk factors and associations with health-related quality of life",
  "abstract": "Objective Cancer survivors are susceptible to financial hardship. In head and neck cancer (HNC) survivors, we investigated (a) predictors for cancer-related financial hardship and (b) associations between financial hardship and health-related quality of life (HRQoL). Methods We conducted a cross-sectional study in HNC survivors identified from the National Cancer Registry Ireland. HRQoL was based on the Functional Assessment for Cancer Therapy General (FACT-G) plus Head and Neck Module (FACT-HN). Objective cancer-related financial hardship (financial stress) was assessed as household ability to make ends meet due to cancer and subjective financial hardship (financial strain) as feelings about household financial situation due to cancer. Modified Poisson regression was used to identify predictors for financial hardship. Bootstrap linear regression was used to estimate associations between hardship and FACT domain scores. Results Pre-diagnosis retirement (relative risk [RR] 0.50, 95% confidence interval [CI] 0.37-0.67), pre-diagnosis financial stress (RR 1.85, 95% CI 1.58-2.15), and treatment were significantly associated with objective financial hardship. Predictors of subjective financial hardship were similar: aged greater than or equal to 65 years, pre-diagnosis financial stress, and treatment. Participants with objective financial hardship reported significantly lower physical (coefficient -3.45, 95% CI -4.39 to -2.44), emotional (-2.01, 95% CI -2.83 to -1.24), functional (-2.56, 95% CI -3.77 to -1.33) and HN-specific HRQoL (-3.55, 95% CI -5.04 to -2.23). Physical, emotional, and functional HN-specific HRQoL were also significantly lower in participants with subjective financial hardship. Conclusion Cancer-related financial hardship is common and associated with worse HRQoL among HNC survivors. This supports the need for services and supports to address financial concerns among HNC survivors.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2985eb817042899fdec0a8bebfa083bd",
  "timestamp": "2025-05-15T02:21:19.234581"
}