{
  "id": 9078,
  "title": "Longitudinal investigation of the presence of different trajectories and associated health and socio-economic determinants, for participants who report suicidal ideation within a community-based public health survey",
  "abstract": "Objective Given the paucity of evidence-based research investigating different suicidal ideation profiles and trajectories, this project sought to investigate health and socio-economic factors associated with the presence of suicidal ideation and changes in ideation over time. Design Longitudinal cohort design, using logistic regression analysis. Setting A public health survey was administered at two timepoints in a community setting across the North West of England. In the 2015/2016 survey, participants were recruited from high (n=20) and low (n=8) deprivation neighbourhoods. In the 2018 survey, only the 20 high-deprivation neighbourhoods were included. Participants 4287 people were recruited in 2015/2016 and 3361 were recruited in 2018. The 2018 sample was subdivided into those who responded only in 2018 (n=2494: replication sample) and those who responded at both timepoints (n=867: longitudinal sample). Primary outcome measures Suicide ideation was the dependent variable which was assessed using item 9 of the Patient Health Questionnaire instrument. Results The prevalence of suicidal ideation was 11% (n=454/4319) at 2015/2016 and 16% (n=546/3361) at 2018. Replication study results highlighted: persistent debilitation from physical ill health and/or medication side effects; demographic factors (ie, middle-aged, single or never married); and personal coping strategies (ie, smoking) as risk factors for suicidal ideation. A static/improved financial position and high levels of empathy were protective factors.Longitudinal study results confirmed three suicidal ideation trajectories: 'onset', 'remission' and 'persistence'. Similar findings to the replication study were evidenced for the onset and persistence trajectories. Persistent suicidal ideation was synonymous with higher levels of practical support which may correspond to the higher levels of debilitation and functional disability reported within this group. Remission was characterised by fewer debilitating factors and higher levels of self-agency. Conclusion A greater appreciation of the heterogeneity of suicidal trajectories should lead to the implementation of broad clinical assessments and targeted interventions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "298693a7f0e0d41e38f676f4b0610700",
  "timestamp": "2025-05-15T03:25:27.674199"
}