{
  "id": 8723,
  "title": "Risk Models for Progression to Advanced Age-Related Macular Degeneration Using Demographic, Environmental, Genetic, and Ocular Factors",
  "abstract": "Purpose: To expand our predictive models for progression to advanced stages of age-related macular degeneration (AMD) based on demographic, environmental, genetic, and ocular factors, using longer follow-up, time varying analyses, calculation of absolute risks, adjustment for competing risks, and detailed baseline AMD and drusen status. Design: Prospective, longitudinal study. Participants: We included 2937 individuals in the Age-Related Eye Disease Study, of which 819 subjects progressed to advanced AMD during 12 years of follow-up. Methods: Cox proportional hazards regression analyses were performed to calculate hazard ratios for progression. Covariates included demographic and environmental factors, 6 variants in 5 genes, baseline macular drusen size, and presence and type of advanced AMD in 1 eye at baseline. To assess the ability of risk scores based on all covariates to discriminate between progressors and nonprogressors, an algorithm was developed and the area under the receiver operating characteristic curve (AUC) was calculated. To validate the overall model, the total sample was randomly subdivided into derivation and test samples. Another model was built based on the derivation sample and assessed for calibration and discrimination in the test sample. Sample sizes needed for testing new treatments in clinical trials were estimated based on models with and without genetic variables. Main Outcome Measures: Progression to advanced AMD, including geographic atrophy and neovascular disease. Results: In multivariate models, age, smoking, body mass index, single nucleotide polymorphisms in the CFH, ARMS2/HTRA1, C3, C2, and CFB genes, as well as presence of advanced AMD in 1 eye and drusen size in both eyes were all independently associated with progression. The AUC for progression at 10 years in the model with genetic factors, drusen size, and environmental covariates was 0.915 in the total sample. In the test sample, based on a model estimated from the derivation sample, the AUC was 0.908. The sample sizes needed for clinical trials were estimated to be lower when genetic susceptibility was considered. Conclusions: Factors reflective of nature and nurture were incorporated into an expanded algorithm for risk prediction, which performed very well in both derivation and test samples. Risk scores and predicted progression rates will be useful for AMD surveillance and for designing clinical trials. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2011;118:2203-2211 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "298a2ddbc2b2e217b64916d2f73b4313",
  "timestamp": "2025-05-15T03:21:56.593018"
}