{
  "id": 8463,
  "title": "Factors Affecting the Capital Allocation into Fixed Assets of Slovak Enterprises",
  "abstract": "The main idea of our paper and the goals were to analyze and quantify the impact of selected external macro-environment and internal corporate factors on the capital allocation into fixed assets of enterprises and to examine whether there were differences between the factors within the individual sectors in which these companies operate. We set three basic hypotheses: (1) factors of external macro-environment have a significant impact on the allocation of capital into fixed assets; (2) internal corporate factors do considerably affect the corporate decisions about investments into fixed assets; (3) industry in which the company operates does significantly influences decisions on the capital allocation into fixed assets. We have analyzed 250 companies operating in six sectors and been examining the years 2009 - 2018. Due to the pandemic situation, it was not possible to extend the analysis to the following years. The methods of correlation and multiple regression analysis were used as the main research methods. Our research results suggest that the investment activity of companies is influenced both by external factors of the macro-environment (economic cycle, inflation, interest rate and tax rate) and by internal corporate factors (especially by financial structure, non-debt tax shield and risk). We found out that for enterprises operating in different sectors there were not just differences in the significance of selected factors but for some of them we found even a different direction of the effect (as for the investment activity and capital allocation into fixed assets of the company).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "299ddc9e3222ff749f031c6151ab8af1",
  "timestamp": "2025-05-15T03:19:21.235041"
}