{
  "id": 6163,
  "title": "Balance rather than critical mass or tokenism Gender diversity, leadership and performance in financial firms",
  "abstract": "Purpose The purpose of this paper is to analyzes how board's gender diversity, and more specifically a gender-balanced configuration - i.e. a proportion of women in the boardroom ranging between 40 and 60 percent - affects economic and risk-oriented performance in financial firms. Design/methodology/approach The empirical application uses a rich data set that includes detailed accounting and organizational information for all financial firms in the Costa Rican industry during the period 2000-2012. The proposed hypotheses are tested using panel data (fixed-effects) regression models that emphasize that bank performance is affected by various dimensions of the banks' gender diversity. Findings The longitudinal analysis of the Costa Rican banking industry reveals that, unlike a proportion indicating a particular critical mass of women on the board, a balanced gender configuration yields superior economic performance (ROA and net intermediation margin). Additionally, the findings show that the performance benefits of gender diversity only exists in the presence of a gender-balanced board configuration, and that this positive effect is not conditioned by the presence of women leadership in the corporate hierarchy (Chair or CEO). Originality/value The paper further explores the influence of board gender diversity on organizational performance by adopting an approach to the gender diversity-performance relationship that goes beyond the mere representation of women within the corporate hierarchy.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29a36158b9345a46849ed382eba9fb82",
  "timestamp": "2025-05-15T02:55:44.427587"
}