{
  "id": 7559,
  "title": "Healthcare Costs and Health Status: Insights from the SHARE Survey",
  "abstract": "The substantial rise in hospital costs over recent years is associated with the rapid increase in the older age population. This study addresses an empirical gap in the literature concerning the determinants of high hospital costs in a group of older patients in Europe. The objective of the study is to examine the association of patient health status with in-hospital costs among older people across European countries. We used the data from the Survey of Health, Ageing and Retirement in Europe (SHARE) database. The analysis included 9671 patients from 18 European countries. We considered socio-demographic, lifestyle and clinical variables as possible factors influencing in-hospital costs. Univariate and multivariable logistic regression analyses were used to determine the determinants of in-hospital costs. To benchmark the hospital costs across European countries, we used the cost-outlier methodology. Rates of hospital cost outliers among older people varies from 5.80 to 12.65% across Europe. Factors associated with extremely high in-patient costs differ among European countries. In most countries, they include the length of stay in the hospital, comorbidities, functional mobility and physical activity. The treatment of older people reporting heart attack, diabetes, chronic lung disease and cancer are more often connected with cost outliers. The risk of being a cost outlier increased by 20% with each day spent in the hospital. We advocate that including patient characteristics in the reimbursement system could provide a relatively simple strategy for reducing hospitals' financial risk connected with exceptionally costly cases.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29a68bc30d00295648eed1146ae97ee4",
  "timestamp": "2025-05-15T03:09:36.981770"
}