{
  "id": 8000,
  "title": "Injecting drug use & HIV prevalence among female sex workers: Evidence from the National Integrated Biological & Behavioural Surveillance, India",
  "abstract": "Background & objectives: Female sex workers (FSWs) who inject drugs (FSW-IDs) have a higher risk of HIV infection and transmission. Understanding the socio-demographic characteristics and other risk behaviours among FSW-IDs will help in strengthening targeted interventions for HIV prevention and management. In the present study, the HIV prevalence, associated socio-demographic characteristics and risk behaviours among FSWs who injected drugs (FSW-IDs) and those who did not ID (FSW-NIDs) was determined in India. Methods: The national cross-sectional, community-based, integrated biological and behavioural surveillance was conducted in 2014-2015 at 73 randomly selected FSW domains across 28 States and Union Territories in India. The sample size was fixed at 400 for each domain, and a probability-based sampling method was followed. The data were analyzed by logistic regression methods. Results: Data from 27,007 FSWs were included in the analysis, of which 802 (3%) were FSW-IDs. HIV prevalence among FSW-IDs was significantly higher than that in FSW-NIDs (4.5 vs. 1.9%). Univariate analysis showed that factors significantly associated with higher HIV prevalence among FSW-IDs were older age, sex work as the only source of income, dissolved marriage, living with a sex worker, urban locality of sex work and consumption of alcohol or oral drugs. In multivariable analysis, factors such as older age of FSW-IDs (35 yr and above), having a dissolved marriage and sex work being the only source of income were observed to be independently and significantly associated with higher HIV prevalence. Interpretation & conclusions: Scaling up the HIV preventive interventions for FSW-IDs, such as facilitating awareness and improved access to needle and syringe exchange programme (NSEP) and opioid substitution therapy (OST), encouraging safe sex and injecting practices, educating on the harmful effects of alcohol and drugs and providing alternative vocation options to secure their financial needs are several strategies that may reduce HIV transmission among FSWs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29adc39cb5cac8e96ba66e64383dbed5",
  "timestamp": "2025-05-15T03:14:07.300429"
}