{
  "id": 6917,
  "title": "Return to work after cancer. A multi-regional population-based study from Germany",
  "abstract": "Background: With improving prognosis, the ability to return to work after cancer has become a realistic goal but only little is known regarding details such as sustainability, financial consequences, and potential determinants of return to work in long-term survivors in Germany.Methods: We studied return to work in a population-based sample of 1558 long-term cancer survivors, diagnosed in 1994-2004 with breast, colorectal or prostate cancer before age 60 (mean 50.1). Information regarding employment status and financial difficulties was obtained via mailed questionnaires from patients who were identified by six population-based cancer registries in Germany. Cumulative incidence of return to work was determined by time-to-event analysis with consideration of competing events. Chi(2) tests and multiple logistic regression modeling were employed to identify potential sociodemographic and clinical determinants of return to work.Results: Within a mean period since diagnosis of 8.3 years, 63% of all working-age cancer survivors initially returned to their old job and another 7% took up a new job. Seventeen percent were granted a disability pension, 6% were early retired (not cancer-related), 4% became unemployed, and 1% left the job market for other reasons. Resumption of work occurred within the first 2 years after diagnosis in 90% of all returnees. Cancer-related reduction of working hours was reported by 17% among all returnees and 6% quit their job due to cancer within 5 years past return to work. The probability of return to work was strongly related with age at diagnosis, tumor stage, education, and occupational class but did not differ with respect to the tumor site, gender nor marital status.Conclusions: Most long-term survivors after breast, colorectal, or prostate cancer of working-age are able to return to work. However, financial problems might arise due to a reduction in working hours. An additional provision of targeted interventions for high-risk groups should be discussed.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29bb21586498602f0e4b27a32dfcb4e3",
  "timestamp": "2025-05-15T03:03:13.401163"
}