{
  "id": 7224,
  "title": "Parental acceptance of brain health programs for preschool children: a mixed-methods study exploring barriers, facilitators and future approaches",
  "abstract": "Background Recent research proposes that as much as 40% of dementia risk is amendable. Promoting healthy lifestyle behaviors in early life through educational methods can cultivate habits that may decrease dementia risk in later life. This study explores parental acceptance of brain health programs tailored for preschool children, aiming to identify barriers and facilitators affecting parental and child engagement.Methods Mixed-methods cross-sectional study. Urban and suburban parents (N = 187, Mage = 37.3 SD = 5.53, range = 29) of children aged three to five years across Australia. Parents participated in an online survey containing both open and closed questions exploring their personal views and opinions on brain health programs for their preschool children. Descriptive statistics, multiple linear regression analyses, and thematic analysis were used to explore sociodemographic factors associated with parental program acceptance.Results Most participants accepted a brain health program with over 98% agreeing a program would be useful for their child(ren). Participants with younger aged children were more likely to exhibit acceptance of a program (beta = -0.209, p = 0.007). Three main categories emerged: dual home and preschool environments, the need for engaging brain health programs that were hands-on and screen-free, and addressing key barriers such as time and financial constraints to support implementation.Conclusion Participants valued educating their children for a healthy life and viewed brain health programs favorably. This study contributes to early childhood education discussions, offering guidance for future generations' brain health and wellbeing.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29be0b88a7ac049b881ab204f5f3d860",
  "timestamp": "2025-05-15T03:06:35.314064"
}