{
  "id": 9292,
  "title": "The impact of internal and external corporate governance mechanisms on tax aggressiveness: evidence from Tunisia",
  "abstract": "Purpose The purpose of this study is to examine the impact of internal and external corporate governance mechanisms on the probability of engaging in tax aggressiveness. Design/methodology/approach This study uses a sample of 52 firms listed on the Tunis stock exchange observed over the 2003-2016 period (The authors had to stop sampling in 2016 because the measurement of tax aggressiveness requires 4 years after the year of study. Therefore, the data on the measurement of tax aggressiveness were collected until 2020). This paper uses the logistic regression technique. Findings The results of the first logistic regression show that ownership structure and the supervision role of the tax authorities are determining factors that explain tax aggressiveness; while, the attributes of the board of directors does not seem to explain the probability of engaging in aggressive tax strategies. To further probe this question, the authors carried out additional analyses that examine the moderating effect of controlling shareholders on the relationship between the attributes of the board and tax aggressiveness. The results of our additional regressions indicate that the effect of these attributes improves in cases of non-presence of a controlling shareholder. This implies that the role that the board of directors can play in controlling management is possibly conditioned by the presence or no of control block holders. Research limitations/implications The major limitation of this study is that it concentrates only on Tunisian listed companies because they are the only companies the financial statements of which are publicly available in Tunisia. Although the sample is relatively small due to the problem of data availability, it appears to be satisfactory given the 15-year sampling period (i.e. from 2003 to 2016). Practical implications The results of the study may help Tunisian regulators create requirements for corporate governance (such as the size of the board of directors and audit committee or the concentration of ownership). Moreover, this study not only focuses on the effect of corporate governance mechanisms on tax aggressiveness but also provides shareholders with information on the governance mechanisms to which they should pay more attention in their desire to obtain more efficient tax results. Social implications The findings are also useful for tax policymakers seeking to identify the circumstances that give rise to an increased risk of tax aggressiveness, as tax aggressive behavior and the resulting non-payment of taxes also have societal implications. In fact, taxes also play an important role in financing the provision of public goods, making corporation tax a matter of public concern. Originality/value The present study differs from others in the existing literature by designing a more precise measure of tax aggressiveness and examining the interaction between two internal governance mechanisms; the presence of a controlling shareholder and the attributes of the board of directors. This study also examines the impact of the control exercised by the tax authorities on the behavior of firms in terms of tax aggressiveness.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29c0c41f54e3a540a40779d52111952e",
  "timestamp": "2025-05-15T03:27:25.005543"
}