{
  "id": 7309,
  "title": "Association between food insecurity status, campus food initiative use and diet quality in Australian university students",
  "abstract": "AimsUniversity students may experience food insecurity due to financial constraints, reducing the quality of their diet. This study aimed to identify students at higher risk of food insecurity, their engagement with on-campus food initiatives and evaluate the relationship between food insecurity and a validated index of diet quality.MethodsA cross-sectional online survey used the six-item Household Food Security Survey Module to assess food insecurity. Total diet quality and subscale scores for eight food groups were measured using the Australian Recommended Food Score (range 0-73). Univariate and multivariate regression identified groups at risk of food insecurity, their engagement with campus food initiatives and relationship with diet quality scores.ResultsOf student respondents (n = 197), over half (54%) experienced food insecurity (14% mild, 23% moderate and 18% severe food insecurity). Male students and students not living with parents were at significantly higher risk. Food-insecure students were significantly more likely to use the campus food pantry (odds ratio = 2.3 [95% confidence interval = 1.286-4.142]; p = 0.005) but not a campus community garden. The mean diet quality score was 32.9 (standard deviation = 8.9). Food-insecure students reported a mean diet quality score over three points lower than food-secure respondents (B = -3.5 [95% confidence interval = -6.0 to -1.0]; p = 0.006), with significantly lower fruit and vegetable subscale scores.ConclusionsResults suggest a high occurrence of food insecurity and poor dietary quality in university students. Despite high levels of engagement with the campus food pantry, the poor diet quality of food-insecure students suggests an urgent need for greater university-led interventions to improve students' dietary intake.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29cc28caccc0c17c1489d1671963a17b",
  "timestamp": "2025-05-15T03:07:02.716059"
}