{
  "id": 6921,
  "title": "Socioeconomic inequalities in catastrophic health expenditure and impoverishment associated with non-communicable diseases in urban Hanoi, Vietnam",
  "abstract": "Background: The catastrophic health expenditure and impoverishment indices offer guidance for developing appropriate health policies and intervention programs to decrease financial inequity. This study assesses socioeconomic inequalities in catastrophic health expenditure and impoverishment in relation to self-reported non-communicable diseases (NCD) in urban Hanoi, Vietnam. Methods: A cross-sectional survey was conducted from February to March 2013 in Hanoi, the capital city of Vietnam. We estimated catastrophic health expenditure and impoverishment using information from 492 slum household and 528 non-slum households. We calculated concentration indexes to assess socioeconomic inequalities in catastrophic health expenditure and impoverishment. Factors associated with catastrophic health expenditure and impoverishment were modelled using logistic regression analysis. Results: The poor households in both slum and non-slum areas were at higher risk of experiencing catastrophic health expenditure, while only the poor households in slum areas were at higher risk of impoverishment because of healthcare spending. Households with at least one member reporting an NCD were significantly more likely to face catastrophic health expenditure (odds ratio [OR] = 2.4; 95 % confidence interval [CI], 1.8-4.0) and impoverishment (OR = 2.3; 95 % CI, 1.1-6.3) compared to households without NCDs. In addition, households in slum areas, with people age 60 years and above, and belonging to the poorest socioeconomic group were significantly associated with increased catastrophic health expenditure, while only households that lived in slum areas, and belonging to the poor or poorest socioeconomic groups were significantly associated with increased impoverishment because of healthcare spending. Conclusion: Financial interventions to prevent catastrophic health expenditure and impoverishment should target poor households, especially those with family members suffering from NCDs, with older members and those located in slum areas in Hanoi Vietnam. Potential interventions derived from this study include targeting and monitoring of health insurance enrolment, and developing a specialized NCD service package for Vietnam's social health insurance program.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29e7f5b010c57e9d1746dbabfa336e3a",
  "timestamp": "2025-05-15T03:03:13.416784"
}