{
  "id": 4306,
  "title": "Association of cardiovascular risk factor profile and financial hardship from medical bills among non-elderly adults in the United States",
  "abstract": "Background: While optimal cardiovascular risk factor (CRF) profile is associated with lower mortality, morbidity, and healthcare expenditures among individuals with atherosclerotic cardiovascular disease (ASCVD), less is known regarding its impact on financial hardship from medical bills. Therefore, we assessed whether an optimal CRF profile is associated with a lower burden of financial hardship from medical bills and a reduction in cost-related barriers to health. Methods: We used a nationally representative sample of adults between 18 and 64 years from the National Health Interview Survey between 2013 and 2017. We assessed ASCVD status and the number of risk factors to categorize the study population into 4 mutually exclusive categories: ASCVD (irrespective of CRF profile) and non-ASCVD with poor, average, and optimal CRF profile. Adjusted logistic regression model was used to determine the association of ASCVD/CRF profile with financial hardship from medical bills and cost-related barriers to health (cost-related medication non-adherence (CRN), foregone/delayed care, and high financial distress). Results: We included 119,388 non-elderly adults, representing 189 million individuals annually across the United States. Non-ASCVD/optimal CRF profile individuals had a lower prevalence of financial hardship and an inability paying medical bills when compared with individuals with ASCVD (24% vs 45% and 6% vs 19%, respectively). Among individuals without ASCVD and an optimal CRF profile, the prevalence of each cost-related barrier to health was <50% compared with individuals with ASCVD. Poor/low income and uninsured individuals within non-ASCVD/average CRF profile strata had a lower prevalence of financial hardship and an inability paying medical bills when compared with middle/high income and insured individuals with ASCVD. Non-ASCVD individuals with optimal CRF profile had the lowest odds of all barriers to health. Conclusion: Optimal CRF profile is associated with a lower prevalence of financial hardship from medical bills and cost-related barriers to health despite lower income and lack of insurance.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29f056dfa8889db5fb23f0ccd5b9b1a7",
  "timestamp": "2025-05-15T02:35:26.356000"
}