{
  "id": 6129,
  "title": "Effect of household and village characteristics on financial catastrophe and impoverishment due to health care spending in Western and Central Rural China: A multilevel analysis",
  "abstract": "Objective: The study aimed to examine the effect of household and community characteristics on financial catastrophe and impoverishment due to health payment in Western and Central Rural China. Methods: A household survey was conducted in 2008 in Hebei and Shaanxi provinces and the Inner Mongolia Autonomous Region using a multi-stage sampling technique. Independent variables included village characteristics, household income, chronic illness status, health care use and health spending. A composite contextual variable, named village deprivation, was derived from socio-economic status and availability of health care facilities in each village using factor analysis. Dependent variables were whether household health payment was more than 40% of household's capacity to pay (catastrophic health payment) and whether household per capita income was put under Chinese national poverty line (1067 Yuan income per year) after health spending (impoverishment). Mixed effects logistic regression was used to assess the effect of the independent variables on the two outcomes. Results: Households with low per capita income, having elderly, hospitalized or chronically ill members, and whose head was unemployed were more likely to incur financial catastrophe and impoverishment due to health expenditure. Both catastrophic and impoverishing health payments increased with increased village deprivation. However, the presence of a village health clinic had no effect on the two outcomes, nor did household enrollment in the New Rural Cooperative Medical Scheme (national health insurance). Conclusions: Village deprivation independently increases the risk for financial hardship due to health payment after adjusting for known household-level factors. This suggests that policy makers need to view the individual, household and village as separate units for policy targeting.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29f3edf4d39a3d868a716f24abee38d6",
  "timestamp": "2025-05-15T02:55:12.871769"
}