{
  "id": 635,
  "title": "Application of new deep genetic cascade ensemble of SVM classifiers to predict the Australian credit scoring",
  "abstract": "In the recent decades, credit scoring has become a very important analytical resource for researchers and financial institutions around the world. It helps to boost both profitability and risk control since bank credits plays a significant role in the banking industry. In this study, a novel approach based on deep genetic cascade ensemble of different support vector machine (SVM) classifiers (called Deep Genetic Cascade Ensembles of Classifiers (DGCEC)) is applied to the Statlog Australian data. The proposed approach is a hybrid model which merges the benefits of: (a) evolutionary computation, (b) ensemble learning, and (c) deep learning. The proposed approach comprises of a novel 16-layer genetic cascade ensemble of classifiers, having: two types of SVM classifiers, normalization techniques, feature extraction methods, three types of kernel functions, parameter optimizations, and stratified 10-fold cross-validation method. The general architecture of the proposed approach consists of ensemble learning, deep learning, layered learning, supervised training, feature (attributes) selection using genetic algorithm, optimization of parameters for all classifiers by using genetic algorithm, and a new genetic layered training technique (for selection of classifiers). Our developed model achieved the highest prediction accuracy of 97.39%. Hence, our proposed approach can be employed in the banking system to evaluate the bank credits of the applicants and aid the bank managers in making correct decisions. (C) 2019 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29f76b1776bcfa1c9aad85fdc8cab5eb",
  "timestamp": "2025-05-15T01:53:24.853295"
}