{
  "id": 9263,
  "title": "Sex disparities in non-small cell lung cancer: mechanistic insights from a cRaf transgenic disease model",
  "abstract": "Background Women are at greater risk of developing non-small cell lung cancer (NSCLC), yet the underlying causes remain unclear. Methods We performed whole genome scans in lung tumours of cRaf transgenic mice and identified miRNA, transcription factor and hormone receptor dependent gene regulations. We confirmed hormone receptors by immunohistochemistry and constructed regulatory gene networks by considering experimentally validated miRNA-gene and transcription factor-miRNA/gene targets. Bioinformatics, genomic foot-printing and gene enrichment analysis established sex-specific circuits of lung tumour growth. Translational research involved a large cohort of NSCLC patients. We evaluated commonalities in sex-specific NSCLC gene regulations between mice and humans and determined their prognostic value in Kaplan-Meier survival statistics and COX proportional hazard regression analysis. Findings Overexpression of the cRaf kinase elicited an extraordinary 8-fold increase in tumour growth among females, and nearly 70% of the 112 differentially expressed genes (DEGs) were female specific. We identified oncogenes, oncomirs, tumour suppressors, cell cycle regulators and MAPK/EGFR signalling molecules, which prompted sex-based differences in NSCLC, and we deciphered a regulatory gene-network, which protected males from accelerated tumour growth. Strikingly, 41% of DEGs are targets of hormone receptors, and the majority (85%) are oestrogen receptor (ER) dependent. We confirmed the role of ER in a large cohort of NSCLC patients and validated 40% of DEGs induced by cRaf in clinical tumour samples. Interpretation We report the molecular wiring that prompted sex disparities in tumour growth. This allowed us to propose the development of molecular targeted therapies by jointly blocking ER, CDK1 and arginase 2 in NSCLC. Funding We gratefully acknowledge the financial support of the Lower Saxony Ministry of Culture and Sciences and Volkswagen Foundation, Germany to JB (25A.5-7251-99-3/00) and of the Chinese Scholarship Council to SZ (202008080022). This publication is funded by the Deutsche Forschungsgemeinschaft (DFG) as part of the Open Access Publikationskosten program. Copyright (c) 2023 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "29f718e6e49a1b6f94e8c32e2680efad",
  "timestamp": "2025-05-15T03:27:24.898553"
}