{
  "id": 9241,
  "title": "Negative and positive experiences of caregiving among family caregivers of older blunt trauma patients",
  "abstract": "Objectives Family caregivers play a fundamental role in the care of the older blunt trauma patient. We aim to identify risk factors for negative and positive experiences of caregiving among family caregivers. Design Prospective, nationwide, multi-center cohort study. Setting and participants 110 family caregivers of Singaporeans aged >= 55 admitted for unintentional blunt trauma with an Injury Severity Score (ISS) or New Injury Severity Score (NISS)>= 10 were assessed for caregiving-related negative (disturbed schedule and poor health, lack of family support, lack of finances) and positive (esteem) experiences using the modified-Caregiver Reaction Assessment (m-CRA) three months post-injury. Methods The association between caregiver and patient factors, and the four m-CRA domains were evaluated via linear regression. Results Caregivers of retired patients and caregivers of functionally dependent patients (post-injury Barthel score <80) reported a worse experience in terms of disturbed schedule and poor health (beta-coefficient 0.42 [95% Confidence Interval 0.10, 0.75], p = .01; 0.77 [0.33, 1.21], p = .001), while male caregivers and caregivers who had more people in the household reported a better experience (-0.39 [-0.73, -0.06], p = .02; -0.16 [-0.25, -0.07], p = .001). Caregivers of male patients, retired patients, and patients living in lower socioeconomic housing were more likely to experience lack of family support (0.28, [0.03, -0.53], p = .03; 0.26, [0.01, 0.52], p = .05; 0.34, [0.05, -0.66], p = .02). In the context of lack of finances, caregivers of male patients and caregivers of functionally dependent patients reported higher financial strain (0.74 [0.31, 1.17], p = .001; 0.84 [0.26, 1.43], p = .01). Finally, caregivers of male patients reported higher caregiver esteem (0.36 [0.15, 0.57], p = .001). Conclusions and implications Negative and positive experiences of caregiving among caregivers of older blunt trauma patients are associated with pre-injury disability and certain patient and caregiver demographics. These factors should be considered when planning the post-discharge support of older blunt trauma patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a03a88d5c66a7407494d7fa2a32042c",
  "timestamp": "2025-05-15T03:26:54.582708"
}