{
  "id": 6531,
  "title": "Could Religiosity and Religion Influence the Tax Morale of Individuals? An Empirical Analysis Based on Variable Selection Methods",
  "abstract": "When people who adhere to tax morality act in a situation where there is no sense of risk, no acceptance of the government, or no environment conducive to tax compliance, it is easier to see how they are motivated to do so. Tax morality is also known as the ethics of compliance. It is the independent cause that motivates a positive tax behaviour. Employees' religious beliefs may impact their ideas and actions in organizational life, just as individuals' attitudes, values, emotions, abilities, and behaviours influence their thoughts and actions at work. Religion can positively influence a worker's loyalty, morale, and communication. In this context, the research seeks to determine whether religiosity and religion may have an effect on tax morale, examining whether an individual's religiosity reduces tax evasion and increases the degree of tax morale. Using machine learning variable selection techniques appropriate for categorical variables, we have used the dataset of the Joint EVS/WVS 2017-2020 (European Value Survey/World Value Survey), allowing for comparisons of tax morality in more than 79 nations globally (chi-squared and mutual information). The empirical findings showed that the most important aspects of religiosity, such as religious denomination, belief in God, and the significance of God, along with the degree of trust placed in other religions and churches, have a considerable positive impact on the level of tax morale. Another significant conclusion relates to how much people feel the government is responsible, how much they care about their nation, and how satisfied they are with the political system-findings that have been shown to boost employee morale. The following are a person's primary traits that indicate their financial morale: an adult above the age of 25, a full-time worker or retired person, married, and living alone. Therefore, employees that are morally upright, trustworthy, diligent, and committed to the workplace values of justice and decency raise morale generally and improve an organisation's success. A business may enhance its reputation and help to secure its long-term success by establishing behavioural policies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a03ff19076c18c5383173af00c094e6",
  "timestamp": "2025-05-15T02:59:07.495599"
}