{
  "id": 2245,
  "title": "Monitoring Spatial Changes in Manufacturing Firms in Seoul Metropolitan Area Using Firm Life Cycle and Locational Factors",
  "abstract": "This paper diagnoses the development of the manufacturing industry in the Seoul Metropolitan Area (SMA) using portfolio and regression analyses. Following the life-cycle perspective, four types of spatial changes of firms have been identified, namely firm formation, inflow, outflow, and dissolution, which are applied to analyze the manufacturing development in SMA. For portfolio analysis, we propose the Net Formation Index and Net Inflow Index to measure the spatial changes of firms at the city level. The two indices facilitate horizontal comparison among cities in SMA in terms of firm growth from new opening and relocation. Using spatial regression analysis, we identify significant location factors that contribute to firm change patterns. Our tests show that a high level of industrial specialization (measured by location quotient) has a dual effect. On the one hand, high level specialization attracts new or inflow firms, particularly in the light and high-tech manufacturing industries. On the other hand, it leads to an increased number of closed or outflow firms, plausibly due to increased competition among local firms. The proposed methods can be applied to diagnose industrial development in clusters of inter-connected cities and design policy tools to boost the local industry.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a04f97ebe2a271c6af30ce5e0912623",
  "timestamp": "2025-05-15T01:05:04.390117"
}