{
  "id": 7337,
  "title": "Factors associated with elder abuse and neglect in rural Uganda: A cross-sectional study of community older adults attending an outpatient clinic",
  "abstract": "BackgroundElderlies are vulnerable to abuse, and evidence suggests that one in three elderlies experience abuse. Abuse can impact the well-being of older persons, decreasing their quality of life, leading to mental health challenges, and increasing morbidity and mortality rates. Evidence on older person/elder abuse and neglect is vital to facilitate initiatives, but there are fewer studies on elder abuse and neglect in Africa, particularly in Uganda. Thus, this study aimed to determine the prevalence of different types of abuse and neglect, and their associated factors among older persons (aged 60 years and above) attending an outpatient clinic. MethodsIn this cross-sectional study, information on sociodemographic characteristics, functional impairment using the Barthel Index, and elder abuse severity using the Hwalek-Sengstock Elder Abuse Screening Test were collected. In addition, types of abuse were assessed using questions adapted from the US National Research Council on elder mistreatment monograph. Linear and logistic regression analyses were used to determine the factors associated with elder abuse severity and the different types of abuse, respectively. ResultsOverall, the prevalence of elder abuse was 89.0%. Neglect was the most common type of elder abuse (86%), followed by emotional abuse (49%), financial abuse (46.8%), physical mistreatment (25%), and sexual abuse (6.8%). About 30.4% of the abused elders experienced at least two forms of abuse. Factors associated with elder abuse severity were having a secondary level of education and physical impairment. Moderate to severe functional dependence was associated with almost all forms of abuse. Individuals who reported the presence of a perpetrator were likely to experience neglect, emotional, and physical mistreatment. However, those who reported their perpetrators to the police had a higher likelihood of experiencing emotional abuse but were less likely to experience financial abuse. Emotional abuse was also associated with age above 80 years and attaining education (primary and secondary). Physical impairment and chronic medical conditions reduced the likelihood of experiencing neglect and financial abuse, and physical abuse, respectively. ConclusionsUganda has a high prevalence of elder abuse and neglect. There is a need to design interventions for older adults at risk to prevent elder abuse from escalating further, where the present findings can be worthy of help.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a046c3e005d06b09e5aa6644058075f",
  "timestamp": "2025-05-15T03:07:31.890756"
}