{
  "id": 4762,
  "title": "The Temporal Pattern of Repeat Intimate Partner Violence Incidents Among High-Risk Survivors in Taiwan: A Survival Analysis",
  "abstract": "Intimate partner violence (IPV) is rarely an isolated incident, with survivors often experiencing repeat violence. Few studies, however, have been conducted to investigate the temporal pattern of IPV revictimization using a validated risk assessment instrument. In Taiwan, service professionals are mandated to report any known IPV incidents using the Taiwan Intimate Partner Violence Danger Assessment (TIPVDA), a validated risk assessment designed to assess the level of lethality faced by IPV survivors. The mandatory reporting policy and the universal use of the TIPVDA provide a unique opportunity to investigate the time course of repeat IPV victimization. This study analyzes high-risk IPV incidents (n = 18,740) reported in Taiwan from 2017 to 2019 using Cox regression analysis. Analysis results suggested three main findings: (a) The time interval between IPV victimizations shortened and the severity of violence increased; (b) the TIPVDA score was consistently associated with repeat victimization, unlike self-assessed dangerousness; (c) specific TIPVDA items, such as IPV history and financial stress, predicted the rate of repeat victimization. Those who reported ever being hurt by their partner during pregnancy, an escalation in physical violence during the past year, their partner threatening to kill them, and their partner being stressed about their financial situation were likely to have a faster rate of reporting the second and third high-risk victimization reports. These findings highlight the importance of using validated risk assessments in practice, not only for predicting reassault, severe reassault, or homicide but also for estimating the timing of revictimization. This can significantly inform intervention strategies and policy decisions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a08efd07fb402993ea5cedef4781276",
  "timestamp": "2025-05-15T02:40:28.012722"
}