{
  "id": 3754,
  "title": "Effects of wildlife resources on community welfare in Southern Africa",
  "abstract": "This paper demonstrates the importance of wildlife in the portfolio of environmental income in the livelihoods of poor rural communities living adjacent to a national park. The results show that wealthier households use more wildlife resources in total than do relatively poor households. However, poorer households derive greater proportional benefit than wealthier households from the use of wildlife resources. Excluding wildlife understates the relative contribution of environmental resources while at the same time overstating the relative contribution of farm and wage income. Wildlife income alone accounts for about a 5.5% reduction in the proportion of people living below the poverty line. Furthermore, wildlife income has an equalizing effect, bringing about a 5.4% reduction in measured inequality. Regression analysis suggests that the likelihood of belonging to a wealthier category of income increases with an increase in environmental income. As expected, household wealth significantly and positively affects environmental income generated by households. This seems to suggest that wildlife-based land reform also needs to empower poor households in the area of capital accumulation while imposing restraints on the use of capital investments by well-off households to harvest wildlife. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a0d3516088bb9d22f5d19bb2c4fc9ae",
  "timestamp": "2025-05-15T01:20:35.989219"
}