{
  "id": 3926,
  "title": "The potential of Islamic financing in making financial development more entrepreneurship friendly",
  "abstract": "PurposeLiterature has pointed that conventional financial development theories have inconclusive role on motivating new businesses. New ventures often consider the conventional system that passes through risk and provides fixed-interest lending as a burden. Comparatively, Islamic finance contributes using participative and equitable substitute for startups and has a potential in promoting new businesses. This study aims to investigate the holistic financial development index quadratic effect on entrepreneurship and include the moderating role of Islamic financing at national level.Design/methodology/approachIslamic banks of 21 nations constitute the unbalanced panel data. Financial development and entrepreneurship indices were developed using factor analysis and panel median regression to estimate the nonlinear financial market development effects and Islamic financing moderation model.FindingsThe results indicated that low financial market development is entrepreneurship deterring because of interest burden effect, which could be eased with a proportional increase in the Islamic financing, which is participative. The moderating effect has led to the categorization of the sample countries into entrepreneurship promoting and entrepreneurship discouraging with respect to the current incidence of financial market development and Islamic financing, which can help policymakers in understanding the entrepreneurship promoting combination of financial development and Islamic financing.Research limitations/implicationsCentral banks and Shari'ah advisory councils can adopt Islamic financing transition in the national financial inclusion policy for new business facilitation.Originality/valueThis study is instrumental in exploring the assessment of introducing Islamic financing while developing the financial sector on multidimensional entrepreneurship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a13df470c01a44082bad1aec5c47bb2",
  "timestamp": "2025-05-15T02:31:28.355918"
}