{
  "id": 590,
  "title": "An application of principal components analysis to portfolio optimization under the sharpe multiple index framework",
  "abstract": "Efficient frontier is a concept of a critical importance in optimal portfolio selection because it reveals a decomposition of the expected efficient return of a portfolio into that of minimum risk and that of investing in the self-financing return-generating portfolio. Whether the empirically constructed efficient frontier of a given portfolio is an adequately accurate reflection of the true efficient frontier of the given portfolio depends upon the quality of the risk evaluation for the given portfolio. Our previous studies, for example, Hossain et al [12], showed that under the Sharpe Multiple Index framework, the risk of an investor's financial portfolio in the presence of positive correlation contained in modeling residuals is under-estimated. Such empirical evidences are consistent from the investigations in terms of the following four statistical estimation methodologies: (i) GARCH (Genral Autoregressive Conditional Heteroscedastic) model, (ii) ARMA (Autoregressive Moving Average) model, (iii) Least squares model, and (iv) State Space (Kalman Filter) model. In this chapter, we will investigate the behaviors of efficient frontiers under two multiple index portfolio frameworks, the Sharpe Multiple Index (abbreviated as SMI) and the Improved Sharpe Multiple Index (abbreviated as ISMI) initiated by Troskie, (Hossain et al [12]) in terms of Principal Component Approach, Abbreviated as PC). The fundamental idea of PC used here is to construct significant orthogonal components of indices in order to perform the empirical evaluation of portfolio risk with minimal twist (i.e., bias) and finally to reveal the true efficient frontiers for a given portfolio. We illustrate the PC approach via a portfolio of stocks on the South African stock exchange under the SMI and ISMI formulations. The empirical evidence shows that the application of PC in efficient frontier construction supports the risk-return structure estimated under the ISMI formulation as well as confirms that the risk is under-estimated under the SMI formulation. We believe that the empirical evidence and discoveries of this chapter are of colossal importance and will be greatly beneficial to the investment community.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a1477c4e3beec3576d2603b7f50a034",
  "timestamp": "2025-05-15T00:45:39.029388"
}