{
  "id": 858,
  "title": "Cross-border spillovers in G20 sovereign CDS markets: cluster analysis based on K-means machine learning algorithm and TVP-VAR models",
  "abstract": "This paper investigates cross-border spillovers between G20 sovereign credit default swap (CDS) markets over the period 2009-2023. First, using the unsupervised K-means machine learning algorithm, we cluster G20 countries into four groups based on similarities in the characteristics of sovereign CDS time series. We then structure our analysis around these identified clusters. Next, we use the TVP-VAR-DY and TVP-VAR-BK models to examine spillover indices from both a static and dynamic perspective. In addition, we use spatial and network visualization tools to elucidate the spillover effects across time and frequency domains. Finally, we examine the correlation of spillover structures between high and low frequency domains. Our main findings suggest that: (1) from a dynamic perspective, sovereign risk spillovers exhibit significant volatility during global extreme events, with continuous effects over time; (2) from a static perspective, developing countries are primarily net exporters of sovereign risk, while most developed countries act as net importers. Moreover, there is evidence of spatial clustering and country development clustering effects in net sovereign risk spillovers; (3) sovereign risk has significant spillover effects, with low-frequency risk spillovers driven by high-frequency spillovers. The results contribute to the current understanding of global financial interconnectedness and risk transmission mechanisms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a3aa16de2a81ca4e3a4d6782988a9e1",
  "timestamp": "2025-05-15T01:55:41.734265"
}