{
  "id": 3311,
  "title": "Predicting the impact of population level risk reduction in cardio-vascular disease and stroke on acute hospital admission rates over a 5 year period - a pilot study",
  "abstract": "The brief for this study was to produce a practical, evidence based, financial planning tool., which could be used to present an economic argument for funding a public health-based prevention programme in coronary heart disease (CHD) related illness on the same basis as treatment interventions. Objectives: To explore the possibility of using multivariate risk prediction equations, derived from the Framingham and other studies, to estimate how many people in a population are likely to be admitted to hospital in the next 5-10 years with cardio vascular disease (CVD) related events such as heart attacks, strokes, heart failure and kidney disease To estimate the potential financial impact of reductions in hospital admissions, on an 'invest to save' basis, if primary care trusts (PCTs) were to invest in public health based interventions to reduce cardiovascular risk at a population level. Study design: The populations of five UK PCTs were entered into a spreadsheet based decision tree model, in terms of age and sex (this equated to around 620,000 adults). An estimation was made to determine how many people, in each age group, were likely to be diabetic. Population risk factors such as smoking rates, mean body mass index (BMI), mean total cholesterol and mean systolic blood pressure were entered by age group. The spreadsheet then used a variant of the Framingham equation to calculate how many non-diabetic people in each age group were likely to have a heart attack or stroke in the next 5 years. In addition heart failure and dialysis admission rates were estimated based upon risk factors for incidence. The United Kingdom Prospective Diabetes Study (UKPDS) risk engines 56 and 60 were used to calculate the risk of CHD and stroke, respectively, in people with type 2 diabetes. The spreadsheet deducted the number of people likely to die before reaching hospital and produced a predicted number of hospital admissions for each category over a 5-year period. The final part of the calculation attached a cost to the hospital activity using the UK Health Resource Grouping (HRG) tariffs. The predicted number of events in each of the primary care trusts was then compared with the actual number of events the previous year (2004/2005). Methodology: The study used a decision tree type model, which was populated with data from the research literature. The model applied the risk equations to population data from five primary care trusts to estimate how many people would suffer from an acute CVD related event over the next 5 years. The predicted number of events was then compared with the actual number of acute admissions for heart attacks, strokes, heart failure, acute hypoglycaemic attacks, renal failure and coronary bypass surgery the previous year. Results: The first outcome of the model. was to compare the estimated number of people in each PCT Likely to suffer from a heart attack, a stroke, heart failure or chronic kidney failure with the actual number the previous year 2004/2005. The predicted number was remarkably accurate in the case of heart attack and stroke. There was some over-prediction of chronic kidney disease (CKD) which could be accounted for by known under-diagnosis in this illness group and the inability of the model to pick up, at this stage, the fact that many CKD patients die of a CHD related event before they reach the stage of requiring renal replacement. The second outcome of the model was to estimate the financial consequence of risk reduction. Moderate reductions in risk in the order of around 2-4% were estimated to lead to saving in acute admission costs or around 5.4 pound million over 5 years. More ambitious targets of risk reduction in the order of 5-6% led to estimated savings of around 8.7 pound million. Conclusions: This study is not presented as the definitive approach to predicting the economic consequences of investment in public health on the cost of secondary care. It is simply a Logical, systematic approach to quantifying these issues in order to present a business case for such investment. The research team do not know if the predicted savings would accrue from such investments; it is theoretical at this stage. The point is, however, that if the predictions are correct then the savings will accrue from over 4000 people, from an adult population of around 185,000 not having a heart attack or a stroke or an acute exacerbation of heart failure. (c) 2006 The Royal Institute of Public Health. Published by Elsevier Ltd. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a3eb2a83b951ca2228d1072136ff048",
  "timestamp": "2025-05-15T02:24:39.783445"
}