{
  "id": 4158,
  "title": "The Impact of Sustainability Considerations on Investment Intentions-The Case of Generation Y",
  "abstract": "When investing, the investment motives of return, liquidity, and risk play a role in decision-making. However, due to the increasing relevance of environmental and social issues and the higher availability of sustainable investments, sustainability is an additional investment motive. The attitude of an individual toward sustainability has implications for other investment motives. This paper examines the interplay between the established financial investment motives of return, liquidity, and risk on the one hand and sustainability considerations on the other hand, with a view to the Generation Y cohort. A questionnaire approach was used to collect data from randomly selected Generation Y retail banking customers from Germany. The data were analyzed using correlation and regression methods. The findings of the paper confirm that there is a negatively directed relationship between the profit maximization motive and the green tradeoff intention. Furthermore, education moderates the relationship between the risk minimization motive and the green tradeoff intention. The paper contributes to different stakeholders. Practical implications result for retail banks and investment firms, which could continue to motivate Generation Y customers for sustainable investments and generate stronger financial education through targeted marketing and information campaigns.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a433ca58984323e5e89e9d4be0dd8ea",
  "timestamp": "2025-05-15T02:33:42.151584"
}