{
  "id": 6228,
  "title": "Earnings string breaks, accounting litigation risk and audit fees",
  "abstract": "PurposeThis study aims to investigate whether accounting-related litigation is associated with a break in the client's earnings string and the auditor's response to a break in the earnings string. Design/methodology/approachThe authors use regression models on a sample of publicly-traded USA companies with earnings strings. FindingsThe authors find that clients' earnings string breaks are associated with increased accounting litigation risk and audit fees. The results are more prevalent for larger breaks. Research limitations/implicationsThe findings suggest auditors anticipate string breaks by clients which implies that audit fee research should consider earnings string characteristics in the fee models. Practical implicationsThe auditor's access to private information allows them to anticipate string breaks and potential increase in litigation risk. Originality/valueAn earnings string break represents a convergence of concerns highly relevant to the auditor: more users relying on the financial statements with greater expectations, increased likelihood of losses to those users, an environment where the likelihood of misstatement may increase, and explicitly stated professional responsibilities in response to the latter. Despite that, and a rich earnings string literature, prior studies have not directly examined auditors' response to a client's string break.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a4daef57591c3b9f2bdf01e4499c418",
  "timestamp": "2025-05-15T02:56:10.866053"
}