{
  "id": 4257,
  "title": "Rural self-efficacy measuring intent for rural practice among Japanese medical students",
  "abstract": "Introduction: In Japan, the community medicine clerkship was introduced in order to foster positive attitudes towards rural practice and encourage rural recruitment The purpose of the present research was to elucidate self-efficacy for rural practice. Method: Medical students comprised 166 women aged 22 +/- 2 (mean +/- standard deviation) (range 19-34) years and 243 men aged 23 +/- 3 (range 18-41) years. The participants were from academic years 1-3 (60.9%) and 4-6 (39.1%). The authors conducted a cross-sectional survey to identify questionnaire items that measure self efficacy of intent for rural practice based on the portfolio of students who experienced community medicine clerkships. Results: Using factor analysis, a rural self-efficacy scale of four factors consisting of 15 items was identified. The factors extracted were work preferences, evaluation of rural practice, evaluation of rural living and personal character. The Cronbach's alpha coefficient for the questionnaire was 0.849, acceptable for newly developed scales. The scree plot indicated for factors explained 45.8% of the total variance. The average score was 43 +/- 6 for women and 44 +/- 6 for men, and was significantly increased with stronger intent for rural practice in each gender. The factors of work preferences, evaluation of rural practice and evaluation of rural living showed a significant and independently positive correlation with the intent for rural practice. Moreover, multiple linear regression analysis using rural self-efficacy score as an objective variable, adjusted for confounding factors as explanatory variables, showed that the following were also significantly and independently associated with rural self-efficacy score: encounter with a doctor as a role model and general medicine orientation, for both men and women; and lower grade academic year, graduation from public high school and not failed entrance exam, for men. Conclusions: The present study suggests that medical schools might recruit medical students with higher rural self-efficacy score and have to foster their rural-oriented attitudes in order to provide physicians to rural areas.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a5542df023d93b635c51a479895cac3",
  "timestamp": "2025-05-15T01:25:23.253477"
}