{
  "id": 5437,
  "title": "Extracting Cluster-Level Uncertainty from K-Means Clustering-An Example of Analysis of Uncertainty Inherent to Valuation Methodologies for Multiple Construction Projects",
  "abstract": "In this research investigation, we first propose a concept of extracting cluster-level uncertainty of any coordinate of a univariate dataset from K-means clustering of the dataset of concern. We also parallelly propose the notions of upper bound uncertainty and lower bound uncertainty to the afore-extracted cluster-level uncertainty of any coordinate of the dataset of concern. We then apply this concept on the rote uncertainties of some construction projects (already finished) of concern and compute their cluster-level uncertainties and also the lower bound uncertainty and upper bound uncertainty for each construction project. A scheme is also detailed as to how to compute the cluster-level uncertainty, the lower bound uncertainty and upper bound uncertainty to the uncertainty of a new unfinished or in the offing construction project. Valuation is essential for a wide variety of purposes. However, it plays a major role in the construction sector to ensure reliable project expense assessments and to minimize risk to financial institutions and firms. Valuation of infrastructure projects focused on a general approach without understanding the uncertainty of project depending on diverse building designs, and construction techniques lead to additional costs or underestimate. Valuation methods like income approach method, cost approach method, and market approach method are generally used for the valuation of projects. Cluster-level uncertainty is helpful since most of the building projects have some resemblance to present or previous projects, and thus, the proposed cluster-level uncertainty can be used to identify the financial or economic haziness of any building project in progress.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a59019e55a984ff98cc99928de60c57",
  "timestamp": "2025-05-15T02:47:43.013406"
}