{
  "id": 673,
  "title": "Digitalization as a double-edged sword: A deep learning analysis of risk management in Chinese banks",
  "abstract": "Digitalization presents both opportunities and formidable challenges for risk management in commercial banks. This study addresses the critical question of how digitalization influences banks' risk-taking behaviors. Applying an InstructGPT-inspired deep learning model, we developed a multidimensional bank digitalization index to analyze its effects on risk-taking, using data from 149 Chinese commercial banks from 2011 to 2020. The empirical results show that (1) digitalization significantly curtails risk-taking on the balance sheet, while concurrently escalating off-balance sheet risk exposure; (2) digitalization diminishes on-balance sheet risk by lessening distortions in competition due to government guarantees, manifested as a competition effect of onbalance sheet guarantee; (3) digitalization increases the upper limit of expected returns on bank financial products, thereby elevating off-balance sheet risk-taking, evident as an off-balance sheet price competition effect; (4) bank digitalization has a more obvious boosting effect on off-balance sheet risk-taking of banks with a longer average maturiy of wealth management products. This paper enriches the measurement of the digitalization of banks and provides a reference for banks to deepen digital applications and strengthen risk management, which has important practical significance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a75c3448d173b07d245c3ad37edfeec",
  "timestamp": "2025-05-15T01:41:29.785620"
}