{
  "id": 5924,
  "title": "Childlessness and psychological well-being in Chinese older adults",
  "abstract": "Background: Childless older adults will increase rapidly in the coming future due to delayed marriage, infertility, and high divorce rate. We examined whether childlessness is significantly related to loneliness and depression and whether the effect of childlessness persisted even when other factors including gender, marital status, age, education, self-rated health status and financial strain were controlled for. Method: This article analyzes cross-sectional data collected from a representative community sample of 2003 Chinese elderly people aged 60 or above in Hong Kong. Respondents were interviewed in face-to-face format and data including socio-demographic variables, health indicators, loneliness and depression were obtained. Result: Logistic regression analyses revealed that childlessness was significantly related to loneliness and depression even after marital status, gender, age, education, self-reported health status, and financial strain were controlled for. Conclusion: The impact of childlessness on psychological well-being among elderly Chinese is more robust than that found in older Americans. Moreover, consistent with the findings of previous studies, we found that the effect of childlessness on psychological well-being has to be investigated in the context of marital status. Therefore, aged care service practitioners must take this risk factor into consideration in their preventive intervention and treatment for psychological well-being. Copyright (C) 2004 John Wiley Sons, Ltd.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a7a84e6f9da2e5adb6339e0d2c95677",
  "timestamp": "2025-05-15T02:53:03.052067"
}