{
  "id": 3612,
  "title": "Sustainable financial risk, resources abundance and technological innovation: Evidence from resources abundance economies",
  "abstract": "The present study explores the intricate relationship between financial risk and various economic factors in the BRICS economies from 1989 to 2021. This research looks at the effects of resource abundance (RA), technological innovation (TI), energy efficiency (ENEF), and GDP on the financial risk index (FRI) to provide valuable insights into the underlying mechanisms that drive financial risk in these rapidly developing economies. Sophisticated panel data methodologies were employed to analyze the chosen panel's cross-section dependence and residual heterogeneity. Moment's quantile regression (MMQR) was used because the normality tests divulged that all covariates follow non-normal or non-parametric distributions. The study's findings revealed that RA has a symmetrical and significantly detrimental impact on FRI across all quantiles for the BRICS nations. Furthermore, it was found that at the 25th quantile, RA has a more damaging impact on FRI than at the 90th quantile. The study also discovered that TI and ENEF are positively related to FRI. Except for TI at the 25th quintile, which was not statistically significant, these results were all statistically significant at 1%. Additionally, the empirical results revealed that ENEF positively affects FRI, but the relationship does not become more pronounced as one moves up the quantile scale. The inverse relationship between GDP and FRI refutes the demand-side theory. The robustness of the findings was confirmed through the use of Bootstrap quantile regression. Based on the study findings, pertinent policies were recommended to decision-makers about the efficient use of RA, encouragement of ENEF, and developments in technological innovation. Overall, this study represents a rigorous and cuttingedge examination of a critical issue with far-reaching implications for the global economy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a89e2e6104d35ce898d31babacaf3da",
  "timestamp": "2025-05-15T02:27:54.158738"
}