{
  "id": 9036,
  "title": "Quality of life and well-being during the COVID-19 pandemic: associations with loneliness and social isolation in a cross-sectional, online survey of 2,207 community-dwelling older Canadians",
  "abstract": "BackgroundThe far-reaching health and social sequelae of the COVID-19 pandemic among older adults have the potential to negatively impact both quality of life (QoL) and well-being, in part because of increased risks of loneliness and social isolation. The aim of this study was to examine predictors of QoL and well-being among Canadian older adults within the context of the pandemic, including loneliness and social isolation.MethodsThis cross-sectional, online survey recruited older adult participants through community organizations and research participant panels. Measures included the: Older People's Quality of Life Scale-B, WHO-5, DeJong Gierveld Loneliness Scale, Lubben Social Network Scale and five COVID-19 specific items assessing impact on loneliness and social isolation. Multiple linear regression models were used to adjust for potential confounders.ResultsA total of 2,207 older Canadians (55.7% female, with a mean age of 69.4 years) responded to the survey. Over one-third strongly disagreed that the pandemic had had a significant effect on either their mental (35.0%) or physical health (37.6%). Different patterns of predictors were apparent for QoL and well-being. After adjusting for all variables in the models, the ability of income to meet needs emerged as the strongest predictor of higher QoL, but was not associated with well-being, except for those who chose not to disclose their income adequacy. Age was not associated with either QoL or well-being. Females were more likely to experience lower well-being (& beta;=-2.0, 95% C.I. =-4.0,-0.03), but not QoL. Reporting three or more chronic health conditions and that the COVID-19 pandemic had a negative impact on mental health was associated with lower QoL and well-being. Loneliness was a predictor of reduced QoL (& beta;=-1.4, 95% C.I. =--1.6, -1.2) and poor well-being (& beta;=-3.7, 95% C.I. =-4.3,-3.0). A weak association was noted between QoL and social isolation.ConclusionsThe COVID-19 pandemic is associated with differential effects among older adults. In particular, those with limited financial resources and those with multiple chronic conditions may be at more risk to suffer adverse QoL and well-being consequences. Loneliness may be a modifiable risk factor for decreased QoL and well-being amenable to targeted interventions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a8b7a7e213e500393216af432a82f6b",
  "timestamp": "2025-05-15T03:24:54.905719"
}