{
  "id": 5061,
  "title": "Does financial cycle affect corporate bond ratings? - Evidence from macro and micro interaction effects",
  "abstract": "In recent years, China's bond market defaults frequently, and the credibility of credit rating agencies needs to be tested. The disorganized bond market increases the systemic risk in China, which is not conducive to the smooth operation of the social economy. This paper studies effects of financial cycle on credit rating by constructing a game model between enterprises and credit rating agencies. Regression test results of A-share listed companies from 2010 to 2019 show that the financial cycle can promote the willingness of enterprises to hold bonds, which affects the further game between enterprises and rating agencies and promotes the pro-cyclical upgrade of ratings. Further exploration shows that large-scale, non-listed and non-industrial companies are more sensitive to financial cycles. The contributions of this paper are as follows: First, this paper discusses the mechanism by which financial cycle affects credit rating through the influence of corporate bond financing behaviour, and expands a new research perspective for the study of how macroeconomic factors affect credit rating; Second, it clarifies the logic of credit rating changes. In the modelling process of this paper, the influence of complex endogeneity is fully taken into account, and it is verified that when the external credit supply changes, corporate financing decisions will be affected first, and credit ratings will be affected later. The research conclusions of this paper have important implications for how to regulate the behaviour of rating agencies and improve the quality of ratings.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2a9dfd5bbdc6307e39a36b8781dcde52",
  "timestamp": "2025-05-15T02:43:40.303475"
}