{
  "id": 7037,
  "title": "Risk factors for loneliness among older informal caregivers in regions of Finland and Sweden: a longitudinal study",
  "abstract": "Aims: This longitudinal study investigated the prevalence of and risk factors for loneliness among older new informal caregivers, long-term informal caregivers, former informal caregivers and non-caregivers in selected regions of Finland and Sweden over 5 years.Methods: A longitudinal sample of 5083 respondents from the Gerontological Regional Database (GERDA) survey data in 2016 and 2021 was used. Bivariate correlation tests and multivariate logistic regression analyses were performed.Results: Loneliness prevalence rates varied between 6% and 8% in 2016 and increased in all groups, although not significantly among new informal caregivers. In 2021, the prevalence of loneliness varied between 8% and 14%. Among the baseline variables, reporting loneliness, single/unmarried/bereaved civil status, infrequent contact with friends and neighbours, poor self-rated health, depressive symptoms, living in Finland and financial strain increased the likelihood of reporting loneliness in 2021. Among the change variables, being a long-term caregiver, a negative change in civil status, a reduced number of confidants, a negative change in self-rated health and depressive symptoms increased the likelihood of reporting loneliness.Conclusions: Loneliness increased among all four groups of comparison. Being a long-term caregiver was a significant risk factor for reporting loneliness over time (odds ratio 2.00, 95% confidence interval 1.20-3.35), when controlling for several other social and health-related variables. To develop effective support, future research could address risk factors for loneliness among distinct groups of informal caregivers based on whether the care recipients have neurological or functional health limitations and examine the availability of support measures.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2aa20b0514b51dab28d9364396d03084",
  "timestamp": "2025-05-15T03:04:23.018914"
}