{
  "id": 7711,
  "title": "Geotechnical data analysis to select a feasible method for development of a long axis, large diameter vertical ventilation shaft",
  "abstract": "In selecting a suitable method to sink a vertical shaft for underground access, a number of constraints influence the ultimate decision of where and how to develop the shaft, not least among these being safety, development and construction time, and cost. Two additional considerations stand out: these being geotechnical conditions and technology, the latter taking into account existing underground access. Assuming a project for which an existing underground excavation is available, it is tempting to build a shaft sinking project from the outset based on the raiseboring method, which has the potential to be the safest, fastest, and least expensive method provided that geotechnical conditions permit. And therein lies the rub: regardless of project time or cost constraints, when it comes to raiseboring a long (say, greater than 500 m), large diameter (greater than 4.5 m) shaft, the rock mass conditions ultimately dictate what method of shaft sinking will be feasible. Over the course of several studies for a particular project, several geotechnical analyses were carried out specifically for the purpose of developing a shaft by raiseboring. Risk analysis and experience showed that where the rock mass conditions indicated an unacceptably high risk potential, an alternative method needed to be considered, even if this meant increasing both the time and financial requirements. In this paper we present an overview of geotechnical investigation practices for shaft sinking. Decision-making thresholds for raiseboring or other methods of shaft sinking are discussed, including probabilities of failure, empirical rock mass classification, basic wedge failure, and back-analysis of a failed case. The design of appropriate support, and analysis of relative safety benefits for various shaft sinking methods, falls outside the scope of this work, and will be presented in a separate paper.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2aa39c2bb09db41adfefc84cd3f48db2",
  "timestamp": "2025-05-15T03:11:04.657448"
}