{
  "id": 912,
  "title": "Advancing the Reliability of Ultra-Low Field MRI Brain Volume Analysis Using CycleGAN",
  "abstract": "The increasing prevalence of neurodegenerative diseases poses a significant threat to the well-being of the growing elderly population, with biological age being a major risk factor. This has increased the demand for cost-effective and informative neuroimaging modalities and analysis tools. Specifically, measuring brain volume is of critical importance as abnormal atrophy patterns are strong indicators of disease onset. Ultra-low field (ULF) MRI provides an innovative pathway to more accessible neuroimaging by mitigating various logistical, financial, and safety considerations associated with clinical MRI. However, the image quality of ULF-MRI impacts the reliability of brain volume analysis. Advancements in deep learning (DL) have proven capable of enhancing the image quality and analysis of medical images. Yet, these tools have not been fully realized for ULF-MRI, largely due to data scarcity as the technology is still relatively new. As a result, existing DL techniques for ULF image enhancement are trained with synthetically generated images, leading to potential domain shift issues when applied to real images. Here, we introduce a CycleGAN framework that learns with real ULF and high-field (HF) MRIs to improve the image enhancement process compared to existing methods. We demonstrate that this approach increases the accuracy of brain volume measurements based on improved correlations with paired clinical data and higher test-retest reliability across repeat measurements. Ultimately, our proposal has the potential to enhance clinical and research workflows through the increased accessibility and reliability of ULF-MRI.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2aa5fe7beeb7b7ffb5bda692e0d372bf",
  "timestamp": "2025-05-15T01:43:54.730303"
}