{
  "id": 3657,
  "title": "A novel communication-efficient heterogeneous federated positive and unlabeled learning method for credit scoring",
  "abstract": "Customer records include only customers in default (positive samples) and rejected customers (unlabeled samples), or positive and unlabeled (PU) data, which is a common scenario in emerging financial institutions. However, building credit scoring models using multiple small sample PU datasets with high dimensionality poses significant challenges, especially in light of the privacy constraints associated with transferring raw data. To tackle these challenges, this paper introduces a novel methodology called heterogeneous federated PU learning. This approach utilizes a fused penalty function to automatically divide coefficients into multiple clusters, while an efficient proximal gradient descent algorithm is introduced for model training, relying solely on gradients from local servers. Theoretical analysis establishes the oracle property of our proposed estimator. The simulation results show that, in terms of variable selection, parameter estimation, and prediction performance, our method is close to the Oracle estimator and outperforms the other alternatives. Empirical results indicate that our method can improve prediction performance and facilitate the identification of heterogeneity across datasets. Moreover, the estimated clustering structures further reveal that provinces that are geographically closer exhibit greater similarity in credit risk. This implies that the proposed methodology can effectively assist nascent financial institutions in identifying differences in risk factors across datasets and enhancing predictive accuracy.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2abcc6ceec65f6ba93dbd39724816984",
  "timestamp": "2025-05-15T02:28:29.435872"
}