{
  "id": 3996,
  "title": "Risk Management Functions and Audit Report Lag among Listed Saudi Manufacturing Companies",
  "abstract": "This paper examines whether the combination of risk management and audit committee functions are associated with audit report lag. Audit report lag is considered an important aspect of the financial reporting. The financial reports are the main source of information for shareholders through which they make their decisions and it assists in reducing the information asymmetry. As the internal control mechanisms substitute the external ones, the internal board committees formed by the board of directors can reduce the audit work and, consequently, reduces the audit report lag. A key committee is the risk management committee. This paper examines whether the combination of risk management and audit committee functions are associated with audit report lag. We posit that a combination of such functions in one committee refereed as audit committee affects the audit report delay. Data were obtained from 198 manufacturing companies listed on the Saudi Stock Exchange (Tadawul) for the years 2016-2018. A pooled OLS regression analysis shows that a combination of risk management and audit committee functions in a stand-alone committee named audit committee is associated with longer audit report lag. The outcomes suggest companies should prioritize the establishment of standalone risk management committee with activities separated from those of audit committees.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2abc24987789395739b0a91c4f2fd844",
  "timestamp": "2025-05-15T02:31:58.668556"
}