{
  "id": 2512,
  "title": "Algorithmic trading strategy based on the integration of deep learning models and natural language processing",
  "abstract": "The most important goal for people trading in stock markets is to earn a profit. This profit can be obtained from price increases or decreases in a two-sided market, where stockholders gain profit from the difference in purchase and sale prices. This research aims to provide an integrated algorithmic trading system to improve the Sharpe ratio performance index for selecting stocks and maximizing returns during market ups and downs. The proposed strategy utilizes word2vector, autoencoder, and long short-term memory-artificial neural network (LSTM-ANN) methods. We assume that as the markets interact with the news, an internal connection is created between economic and political news and forecasting the market's price trend. The trading system is developed based on price and news to extract features that predict negative or positive market reactions. The tests show that the proposed Price and Price&News trading systems are superior to the Buy&Hold strategy in the S&P500 market. This research studies price data and portfolio news consisting of 15 stocks. The Price&News strategy yielded a 23% higher return than the Buy&Hold strategy, accompanied by a 2.6 improvement in the Sharpe ratio. Additionally, it outperformed the Price algorithm with an 8% higher return and a 0.82 improvement in the Sharpe ratio.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ac558c94c738f0bc1681d4ea0dd41ef",
  "timestamp": "2025-05-15T01:07:35.718428"
}