{
  "id": 7722,
  "title": "Exploring the Association Between Immune Cell Phenotypes and Osteoporosis Mediated by Inflammatory Cytokines: Insights from GWAS and Single-Cell Transcriptomics",
  "abstract": "Background: Patients with osteoporosis experience increased fracture risk and decreased quality of life, which pose significant health burdens and financial challenges. Despite established links between immune cell phenotypes and inflammatory cytokines and osteoporosis, the exact mechanism involved remains unclear, and further understanding is needed for effective prevention and treatment. Methods: Here, we performed a two-sample Mendelian randomization (MR) study to estimate the causal effects between 731 immune cell types, 91 and 41 inflammatory factors (which may have some overlap), and 5 types of osteoporosis. In subsequent mediation MR analysis, we assessed whether these inflammatory cytokines mediate the causal relationship between immune cell phenotypes and osteoporosis. Additionally, colo- calization analysis was performed using Bayesian colocalization. Single-cell transcriptomic analysis was performed using datasets from osteoporosis patients available in the Gene Expression Omnibus (GEO) database. Subsequently, single-cell sequencing analysis was performed, including dimensionality reduction, clustering, and pathway enrichment, to investigate the underlying mechanisms. Finally, to confirm the critical role of IgD'CD24'B cells and IL-17C in osteoporosis, we established vivo dexamethasone-induced osteoporosis model. Micro-CT was used to assess the effectiveness of model establishment. Flow cytometry was performed to determine the proportion of IgD'CD24' B cells within lymphocytes in the blood. ELISA and Western blotting were used to measure IL-17C levels in serum and bone tissue. Immunohistochemistry was conducted to evaluate the expression of IL-17C in bone tissue. Results: This study found that 32 immune cell phenotypes and 38 inflammatory cytokines were significantly associated with osteoporosis. Mediation analysis indicated that IgD+ CD24+ B cells exacerbated the risk of osteoporosis by influencing the levels of interleukin-17C (IL-17C). The mediated effect was 0.07837, accounting for 15.5% of the total effect. Single-cell transcriptome analysis supported that IgD+ CD24+ B cells play a key role in musculoskeletal-related pathways in osteoporosis patients. Additionally, we have demonstrated the significant involvement of IgD'CD24' B cells and IL-17C in the osteoporosis disease model. Conclusion: Inflammatory cytokines play a crucial role in the pathogenesis of immunity-related osteoporosis. In particular, IgD+ CD24+ B cell %lymphocyte increase the risk of osteoporosis by modulating the levels of interleukin-17C. Our results provide evidence to support the link between immunity and osteoporosis and offer new therapeutic strategies for targeting inflammatory pathways in immune-mediated osteoporosis.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ac68b9e9dac94bd0277dccc1a3ba170",
  "timestamp": "2025-05-15T03:11:38.438142"
}