{
  "id": 754,
  "title": "A Comparative Lens on Econometric Standards and Fusion-Based Models",
  "abstract": "A clear understanding and subsequent prediction of volatility has become a topic of paramount importance for investors, policy makers and market regulators in financial markets. The said understanding and prediction of volatility enables the investors to take informed decisions and reducing risk exposures. Thus said, this study aims to estimate volatility in the IT enabled services industry, which plays an important role in security markets. The methodology of comparative approach between traditional models and a newly blended model named as fuse model has been applied to assess volatility for effective risk management and guided investment decisions for investors. The methodology collects information on the historical share prices of ITES companies with a special focus on HCL Technologies listed on Indian stock exchanges. This research work delves into the comparative approach between traditional models and fuse models which may be termed as a blended model. The objective of this study approaches towards the concept of best suited model for ITES industry by using four different fuse models namely being: 1. LSTM in conjunction with Fuzzy Logic, 2. Stochastic Process (Markov Decision Process) in conjunction with Fuzzy Logic, 3. Denoising the discrete time series with Discrete Fourier Transform (DFT) followed by Inverse Fourier Transform to obtain the denoised time series which can be treated as an input to LSTM or Time Series Model and finally 4. Ensemble Learning. It is worth mentioning that this type of study is It's a first attempt that this research advocates for a paradigm shift in volatility estimation practices within the Indian ITES sector",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2acd177675110008c4dcb6c9f3a027b6",
  "timestamp": "2025-05-15T01:42:05.431718"
}