{
  "id": 470,
  "title": "Forecasting price in a new hybrid neural network model with machine learning",
  "abstract": "A key aspect of asset investment and risk management is the study of forecasting stock prices. We investigate the machine learning stock price prediction in a new hybrid neural network model and put forth a forecasting method based on machine learning, composite data preprocessing method and the proposed new neural network model. To address the challenge of predicting stock prices in the face of market complexity and noise, we use the complete ensemble empirical mode decomposition with adaptive noise (CEEMDAN) algorithm and the Savitzky-Golay (SG) filter to de -noise and enhance the data, and employ a neural network with three convolutional layers and a long short-term memory (LSTM) layer that enables it to capture complex temporal patterns in the data. We propose a new hybrid neural network prediction model (CEEMDAN-SC-LSTM) and adopt a machine learning approach to compare it with the benchmark model using CSI 300 index data. The empirical results validate the effectiveness of the frequency decomposition algorithm and the convolutional layer, and demonstrate that our proposed model outperforms the benchmark model. Compared to the best benchmark model, the CEEMDAN-S-C-LSTM model proposed in this study demonstrates a significant improvement in performance. Specifically, it shows a 45.33% reduction in mean absolute error (MAE), 43.44% reduction in root mean square error (RMSE), 45.01% reduction in mean absolute percentage error (MAPE), and 3.90% improvement in coefficient of determination (R 2 ). The study also explores the effect of different numbers of convolution layers and SG filters on the hybrid model. Our research expands on the use of neural networks and machine learning, offering a novel technical approach to making investment decisions and managing risks in financial systems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2acff30430ae8a7ecc8d599578f304f4",
  "timestamp": "2025-05-15T01:51:31.198954"
}