{
  "id": 2278,
  "title": "Bank accounting conservatism and capital management",
  "abstract": "PurposeThe aim of this paper is to investigate if and how conditional conservatism influences capital management practices in the context of European listed banks.Design/methodology/approachWe use multiple fixed effects regression models with robust standard errors to test the research hypotheses on a sample of 2,883 bank-year observations for EU-listed banks from 2010 to 2020.FindingsThe study provides evidence that the adoption of conditional conservatism policies constrains upward capital management. In addition, this study shows that such influence is mediated by two channels: earnings management and loan portfolio quality. Regarding the first channel, this study shows that the adoption of conditional conservatism hinders upward earning management which, in turn, negatively impacts upward capital management, all else being equal. For the second channel, this study shows that the adoption of conditional conservatism improves the quality of the loan portfolio, which hinders upward capital management because of less risky assets in the portfolio.Research limitations/implicationsThis study contributes to banking literature by shedding light on the factors that may favor or obstruct capital management.Practical implicationsThis study can be useful for bank regulators and standard setters to define new regulatory policies and standards that can hinder the use of manipulative accounting practices.Originality/valueThis is the first study exploring the association between bank accounting conservatism and capital management, thus asking whether some factors like earnings management and loan portfolio quality may act as mediating channels in this relationship.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ad958eaf154d81af39f842b40763332",
  "timestamp": "2025-05-15T01:05:04.510982"
}