{
  "id": 6073,
  "title": "Relationship between Risk and Expected Returns: Evidence from the Dhaka Stock Exchange",
  "abstract": "In this study we examine a risk-return association within the Capital Asset Pricing Model (CAPM) structure in Dhaka Stock Exchange (DSE) market. The study also aims at exploring whether the CAPM is applicable in DSE. For this study we have been used monthly stock returns from 80 non-financial companies for the period of January 2005 to December 2009. In order to examine the risk-return trade off in a sample of individual stocks, we apply the usual two stages regression. From the CAPM empirical analysis for individual stocks, it is observed that intercept term is significantly different from zero and slope is not equal to the excess return on the market portfolio. But, the CAPM's prediction for the intercept is that it should equal zero and the slope should equal the excess returns on the market portfolio. So, the results of the study refute the above hypothesis and offer evidence against the CAPM. Thus, it can be concluded that CAPM is not a suitable indicator of asset prices in Bangladesh over the chosen sample period. The securities market line shows linearity which means that the CAPM linear relationship is enough to express the returns generating process. Moreover, the investors are rewarded for market risk but not for unique risk because unique risk shows insignificancy during the period. (C) 2012 The Authors. Published by Elsevier Ltd. Selection and/or peer-review under responsibility of Global Science and Technology Forum",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ade65d205c3a13338e225551e5c4c62",
  "timestamp": "2025-05-15T02:54:38.742400"
}