{
  "id": 2166,
  "title": "Decision Support System for Management Decision in High-Risk Business Environment",
  "abstract": "As a result of substantial variations in global financial markets, constructing an enterprise risk prewarning mechanism is essential. A vast amount of related studies have implemented monetary-related indicators to depict the full spectrum of an enterprise's operating performance. Merely considering monetary-related indicators is unable to produce an in-depth understanding of an enterprise. To fill this gap, the balanced scorecard (BSC), with the advantages of being able to capture both monetary and nonmonetary indicators, was introduced. Unfortunately, the BSC also has its own challenges, one of which is the lack of consideration given to risk exposure, which affects an enterprise's profit variation. Thus, this study extends the original BSC by considering risk exposure and introduces an artificial intelligence-based decision support system for management decision. The inherent decision logic embedded into neural network-based mechanisms is opaque and hard to comprehend by users. To handle the challenge, this study further incorporates fit theory with a knowledge visualization technique to handle the opaque nature of the model so as to decrease the cognitive load and mental burden. The empirical results show that the introduced model is a promising alternative for management decisions in highly fluctuating financial markets.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2adf31792745e6d78d70cd7bfb37b568",
  "timestamp": "2025-05-15T02:12:17.344904"
}