{
  "id": 4041,
  "title": "The behavior of Sovereign Credit Default Swaps (CDS) spread: evidence from Turkey with the effect of Covid-19 pandemic",
  "abstract": "This study examines how sovereign CDS spreads of Turkey behave in Covid-19 pandemic times by considering that CDS spreads reflect the riskiness, vulnerability, financial stability, and macroeconomic stability of countries and CDS spreads of most of the emerging countries have increased with the emergence of Covid-19 pandemic. Therefore, the study focuses on the year 2020 which includes before Covid-19 and Covid-19 pandemic times periods. In this context, daily data between 12.06.2019 and 06.16.2020, 6 independent variables, and 6 Covid-19 situations are analyzed by employing Multivariate Adaptive Regression Splines (MARS) method. The findings reveal that (i) influential factors on Turkey's CDS spreads are BIST100 index, VIX index, MSCI Turkey index, and USD/TL foreign exchange rates for the period which is before Covid-19 pandemic times; (ii) MSCI emerging market index, number of new deaths from Covid-19, USD/TL foreign exchange rates, weighted average cost of funds, number of new cases from Covid-19, and VIX index have effect on Turkey's CDS spreads in Covid-19 pandemic times, respectively; (iii) on the other hand, number of cumulative cases, number of cumulative deaths, and measures do not have effect on Turkey's CDS spreads in any period. Taking precautions to decrease negative effects on Turkey's CDS spreads by considering the importance of deaths number from Covid-19 pandemic is very important. Hence, Turkey could stimulate foreign portfolio investment inflows with decreasing CDS spreads.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b042b15569eab84d4ee5b99fc67d0de",
  "timestamp": "2025-05-15T01:23:27.264088"
}