{
  "id": 8995,
  "title": "Factors affecting farmers' participation in China's group guarantee lending program",
  "abstract": "Purpose - Based on a survey of 897 farm households, the purpose of this paper is to build a framework using cluster analysis to explain how farmers make decisions on joining group guarantee, and analyzes factors influencing their decisions using multinomial and binary Logit regressions. Design/methodology/approach - The approach of combining cluster analysis with Logit regression is an innovative approach to survey assessment. In addition, by design the authors have identified the four mutually exclusive groups of borrowers combining Group Guarantee membership and actual formal borrowing. Findings - An extremely important observation according to the data is that most farmers appear to be part of group guarantees only because they have to in order to get access to formal credit products. 87.21 percent of the people who belong to groups and utilize the formal credit products belong to this category because their lenders have made participation in groups compulsory for access to credit. This may ration farmers' willingness to even apply for credit. It also indicates a preference on the part of older and more risk-averse respondents to avoid participation in group guarantees. Out of financial characteristics the total loan holdings appears to be the only significant indicator of participation in group guarantees. Furthermore the results indicate that informal and formal credit appear to be replaceable for farmers. Research limitations/implications - The survey is confined only to the counties investigated. China is very diverse in its agricultural economies and many RCCs operate under different guidance and rules from those investigated here. Hence, while the authors can claim that the results are indicative, the authors cannot claim that they will hold generally. Practical implications - Based on group guarantee loan mechanism and survey data analysis of 897 farm households, this paper analyzes influencing factors affecting farmers' participation in group guarantees from microcosmic level, so as to provide some reference to further perfect micro credit operation mode and mechanism. Social implications - The results indicate that the Group Guarantee mechanism, while beneficial to some, may not hold global appeal for Chinese farmers. In the future RCCs may want to consider alternative approaches to loan security than placing the burden of guarantee on farmers' family and friends. Originality/value - The approach of combining cluster analysis with Logit regression is an innovative approach to survey assessment. In addition, by design the authors have identified the four mutually exclusive groups of borrowers combining Group Guarantee membership and actual formal borrowing.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b1449a85c5c7afdba2225de3d8d770e",
  "timestamp": "2025-05-15T03:24:26.386606"
}