{
  "id": 305,
  "title": "Decision-making in formation of mean-VaR optimal portfolio by selecting stocks using K-means and average linkage clustering",
  "abstract": "Stock is one of the investment assets that has its charm for investors. It is very liquid and has a high rate of return, but it has a high risk. The strategy commonly used to minimize investment risk is to diversify through portfolio formation. A good allocation of funds must be determined in forming an optimal portfolio. In addition, the method of stock selection needs to be considered so the stocks are well diversified and the portfolio developed has good performance. This study aims to compare stock selection between K-Means and Average Linkage clustering approaches in forming an investment portfolio. Clustering analysis is used to group IDX80 stocks based on their attributes. In forming a portfolio with the Mean-VaR model, the stock selection decision criteria used are by selecting stocks with the highest positive returns from each cluster. As a result, the two clustering techniques show the superiority of the Silhouette score for a certain number of clusters, but there are still more advantages in Average Linkage. The portfolio approached by Average Linkage resulted in a better performance than the portfolio approached by K-Means. Therefore, Average Linkage clustering can be used as a better recommendation in decision-making to select stocks so as to produce optimal portfolio performance. (c) 2022 by the authors; licensee Growing Science, Canada.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b15ff99576a0f5e37eee1309c21f10e",
  "timestamp": "2025-05-15T00:42:00.407432"
}