{
  "id": 8377,
  "title": "Psychiatric-related Revisits to the Emergency Department Following Rapid Expansion of Community Mental Health Services",
  "abstract": "Objectives Repeat visits (revisits) to emergency departments (EDs) for psychiatric care reflect poor continuity of care and impose a high financial cost. We test whether rapid expansion of community health centers (CHCs)-which provide regional, low-cost primary care-correspond with fewer repeat psychiatric-related ED visits (PREDVs). Methods We obtained repeated cross-sectional time-series data for 7.8 million PREDVs from the State Emergency Department Database for four populous U.S. states (California, Florida, North Carolina, and New York) from 2006 to 2011. We specified as the outcome variable the count of repeat visits per ED visitor with a psychiatric diagnosis. We retrieved aggregate-level mental health visits at CHCs from the Uniform Data System. Negative binomial regression methods controlled for individual-level confounders, county health system and sociodemographic attributes, year fixed effects, and county fixed effects. Results The risk of a repeat PREDV decreased with a county-level increase in mental health patients seen at CHCs (incidence rate ratio = 0.986, 95% confidence interval = 0.98 to 0.99). Conversion of this rate ratio to the number of revisits averted indicated 34,000 fewer repeat PREDVs in these four states statistically associated with a 1% expansion in CHC mental health visits. Exploratory analyses found that revisits decline for relatively mild/moderate illnesses (e.g., mood, anxiety disorders) but not for severe illnesses (e.g., schizophrenia/psychoses). Conclusion An increase in mental health services at CHCs corresponds with a modest decline in repeat PREDVs. This decline concentrates among those with less severe mental illnesses.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b27aa7325be23c4e675b530ce79435e",
  "timestamp": "2025-05-15T03:18:19.549373"
}