{
  "id": 9011,
  "title": "Potentially inappropriate among elderly home medication use care patients in Europe",
  "abstract": "Context Criteria for potentially inappropriate medication use among elderly patients have been used in the past decade in large US epidemiological surveys to identify populations at risk and specifically target risk-management strategies. In contrast, in Europe little information is available about potentially inappropriate medication use and is based on small studies with uncertain generalizability. Objective To estimate the prevalence and associated factors of potentially inappropriate medication use among elderly home care patients in European countries. Design, Setting, and Participants Retrospective cross-sectional study of 2707 elderly patients receiving home care (mean [SDI age, 82.2 [7.2] years) representatively enrolled in metropolitan areas of the Czech Republic, Denmark, Finland, Iceland, Italy, the Netherlands, Norway, and the United Kingdom. Patients were prospectively assessed between September 2001 and January 2002 using the Minimum Data Set in Home Care instrument. Main Outcome Measures Prevalence of potentially inappropriate medication use was documented using all expert panels criteria for community-living elderly persons (Beers and McLeod). Patient-related characteristics independently associated with inappropriate medication use were identified with a multiple logistic regression model. Results Combining all 3 sets of criteria, we found that 19.8% of patients in the total sample used at least 1 inappropriate medication; using older 1997 criteria it was 9.8% to 10.9%. Substantial differences were documented between Eastern Europe (41.1% in the Czech Republic) and Western Europe (mean 15.8%, ranging from 5.8% in Denmark to 26.5% in Italy). Potentially inappropriate medication use was associated with patient's poor economic situation (adjusted relative risk [RR], 1.96; 95% confidence interval [CI], 1.58-2.36), polypharmacy (RR, 1.91; 95% Cl, 1.62-2.22), anxiolytic drug use (RR, 1.82; 95% Cl, 1.51-2.15), and depression (RR, 1.29; 95% Cl, 1.06-1.55). Negatively associated factors were age 85 years and older (RR, 0.78; 95% Cl, 0.65-0.92) and living alone (RR, 0.76; 95% Cl, 0.64-0.89). The odds of potentially inappropriate medication use significantly increased with the number of associated factors (P<.001). Conclusions Substantial differences in potentially inappropriate medication use exist between European countries and might be a consequence of different regulatory measures, clinical practices, or inequalities in socioeconomic background. Since financial resources and selected patient-related characteristics are associated with such prescribing, specific educational strategies and regulations should reflect these factors to improve prescribing quality in elderly individuals in Europe.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b2767b644e3317c26bcda82994d2367",
  "timestamp": "2025-05-15T03:24:26.424091"
}