{
  "id": 5065,
  "title": "Depression in Chinese men undergoing different assisted reproductive technique treatments: prevalence and risk factors",
  "abstract": "To explore the prevalence and risk factors for depression in men undergoing different assisted reproductive technique (ART) treatments in Chinese population. This was a prospective study of 844 men undergoing ART treatments. All men were distributed to four groups, according to they received treatments. The treatments included IUI (intrauterine insemination), IVF(in vitro fertilization), ICSI(intra cytoplasmatic sperm injection) and TESA/PESA (percutaneous epididymal sperm aspiration/testicular sperm aspiration). Their symptoms of depression were measured with use of the Center for Epidemiologic Studies of Depression scale(CES-D). Data were collected about age, BMI, education, duration of marriage, duration of infertility, smoking, type of infertility, infertility causes, history of ejaculation failure, and financial burden of the treatment. We estimated the prevalence of depressive symptom in men undergoing different ART and used logistic regression models to identify risk factors for depression in different groups. The overall prevalence of depression was 13.3 % for men undergoing ART treatments: 14.5 % of IUI group, 12.4 % of IVF group, 19.2 % of ICSI group and 6.2 % of TESA/PESA group. Prevalence of depression among IUI group, IVF group and ICSI group were not significantly different. For IUI group, the factors were found to increase depression risk were treatment financial burden and duration of marriage, to decrease depression risk was age. For IVF group, the risk factors independently associated with depression were both male and female infertility, unexplained infertility, and history of ejaculation failure. In a sample of Chinese men undergoing ART treatments, the prevalence of depression was higher than other country. The risk factors for depression varied in different ART treatments groups. when routine screening to identify the sub-group of vulnerable men which need counselling before ART treatments, we should also consider which pattern of ART treatments the man underwent.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b331658cce0b48faaa45ac3d5b8a219",
  "timestamp": "2025-05-15T02:44:10.960880"
}