{
  "id": 4324,
  "title": "The Dual-Beta Model: Evidence from the New Zealand Stock Market",
  "abstract": "Fama and French (1992) show conclusively that the relationship between cross-sectional stock return and beta is flat. Following Fama and French's cross-sectional framework but allowing for up and down market conditions, Pettengill et al.'s (1995) constant-beta model and Howton and Peterson's (1998) dual-beta model both find that beta is significantly positive (negative) in the up (down) markets. Recently, Tang and Shum (2004), using the time-series regression approach with the constant-beta model, find that the beta-return relationship is significantly positive (negative) in the Singapore up (down) markets. This study extends Tang and Shum's study in examining the dual-beta model in the New Zealand stock market when the market is segmented into up and down markets. Bartholdy and Riding (1994) find that both the Dimson and Scholes and Williams methods previously used on NZ data to correct for beta have no incremental efficiency over the standard OLS estimators. Their study concludes that OLS estimators are most efficient and are closer to those based on synchronous data. We therefore adopt the simple OLS beta estimation in this paper. Pinfold et al. (2001) argue that the fewer number of NZ stocks and high-volatility of stock prices restrain investors to hold a well-diversified portfolio in the New Zealand stock market. This study thus examines the effect of total risk together with dual betas on stock realized returns. Consistent with previous studies, our empirical results show that the unconditional beta is flat. While Pinfold et al. (2001) suggest that NZ investors do not hold well-diversified portfolios, we find that total risk does contribute to explaining stock realized returns. The empirical results of the conditional constant-beta model show that there is a significantly positive (negative) relation between stock realized return and beta in the up (down) markets. However, after we segment the data into up and down market sub-samples (using the dual-beta model), we identify that there exists only a significantly negative relationship between realized return and beta in the down markets; the relationship in the up markets is flat. Although the only significant beta-return relationship in the down markets reveals a special characteristic of the New Zealand stock market, we note that Hodoshima et al. (2000), using the dual-beta model with cross-sectional tests, find that the beta-return relationship in the Japanese market is also significant only in the down markets.",
  "year": 2005,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b38743ab3beb997dbedb18c37a41cbe",
  "timestamp": "2025-05-15T01:25:50.588785"
}