{
  "id": 9125,
  "title": "Association for Academic Surgery Safety-Net Hospital Status Is Associated With Coronary Artery Bypass Grafting Outcomes at an Urban Academic Medical Center",
  "abstract": "Introduction: Socioeconomic disparities impact outcomes after cardiac surgery. At our institution, cardiac surgery cases from the safety-net, county funded hospital (CH), which primarily provides care for underserved patients, are performed at the affiliated university hospital. We aimed to investigate the association of socioeconomic factors and CH referral status with outcomes after coronary artery bypass grafting (CABG). Methods: The institutional Adult Cardiac Surgery database was queried for perioperative and demographic data from patients who underwent isolated CABG between January 2014 and June 2020. The primary outcome was major adverse cardiovascular event (MACE), a composite of postoperative myocardial infarction, stroke, or death. Secondary outcomes included individual complications. Chi-square, Wilcoxon rank-sum, and logistic regression analyses were used to compare differences between CH and non-CH cohorts. Results: We included 836 patients with 472 (56.5%) from CH. Compared to the non-CH cohort, CH patients were younger, more likely to be Hispanic, non-English speaking, and be completely uninsured or require state-specific financial assistance. CH patients were more likely to have a history of tobacco and drug use, liver disease, diabetes, prior myocardial infarction, and greater degrees of left main coronary and left anterior descending artery stenosis. CH cases were less likely to be elective. The incidence of MACE was significantly higher in the CH cohort (16.3% versus 8.2%, P 1/4 0.001). There were no significant differences in 30-d mortality, home discharge, prolonged mechanical ventilation, bleeding, sepsis, pneumonia, new dialysis requirement, cardiac arrest, or multiorgan system failure between cohorts. CH patients were more likely to develop renal failure and less likely to develop atrial fibrillation. On multivariable analysis, CH status (odds ratio 2.39, 95% confidence interval 1.25-4.55, P 1/4 0.008) was independently associated with MACE. Conclusions: CH patients undergoing CABG presented with greater comorbidity burden, more frequently required nonelective surgery, and are at significantly higher risk of postoperative MACE.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b3c78c58e0f9125d91d71ef71ae5caa",
  "timestamp": "2025-05-15T03:25:54.550560"
}