{
  "id": 1799,
  "title": "Mechanical Selection System of stock portfolio based on Grey relational analysis attribute reduction mechanism",
  "abstract": "A stock portfolio selection system based on a Grey Relational Analysis (GRA) model, a Fuzzy C-Means (FCM) clustering scheme and Rough Set (RS) theory is proposed. In the proposed approach, 53 financial indices are collected automatically for each stock item every quarter and a GRA model is used to consolidate these indices into six predetermined financial ratios (Grey Relational Grades (GRGs)). The GRGs of the stock items are then clustered using a FCM scheme and the resulting cluster indices are processed using RS theory to identify the lower approximate set within the stock system. The stock items within the lower approximate set are filtered in accordance with established investment principles and the six GRGs of each surviving stock item are then consolidated to a single GRG indicating the overall merit of the corresponding stock item in terms of its ability to maximize the rate of return on the investment portfolio. The validity of the proposed approach is demonstrated using electronic stock data extracted from the financial database maintained by the Taiwan Economic Journal (TEJ). It is shown that the rate of return on the investment portfolio selected using the proposed GRA/FCM/RS system is higher than the average rate of return predicted by the variation in the Taiwan Stock Exchange Capitalization Weighted Stock Index (TAIEX) over the same period. Thus, the feasibility of the GRA-based attribute reduction mechanism and the overall viability of the proposed portfolio selection system are confirmed.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b52c846749794e8158c5d3211abbdd7",
  "timestamp": "2025-05-15T00:59:53.138891"
}