{
  "id": 1368,
  "title": "Holistic modelling and optimisation of thermal load forecasting, heat generation and plant dispatch for a district heating network",
  "abstract": "Efficient operation of district heating networks requires a precise forecasting of the thermal loads and an optimised dispatch strategy for the available generation and storage portfolio. This paper presents a holistic modelling and optimisation approach: first, detailed process modelling and optimisation of power plants and thermal storages; second, a numerical model for dispatch optimisation; and third, machine-learning-based load forecasting. The work is based on operating data from the district heating network of the city of Ulm in Germany. The paper presents the modelling, validation and simulation results of stationary and instationary process simulation for a biomass-fired combined heat and power plant. The analysis identifies a potential to integrate additional renewable power by power-to-heat technologies into different parts of the process. The economic benefit is quantified by mixed-integer linear programming optimisation applied to the district heating network. In order to allow for real -time dispatch optimisation, a machine-learning-based thermal load forecasting method was devel-oped and evaluated, based on a 72-h forecast horizon. In addition, the economic impact of prediction uncertainties is analysed with the numerical dispatch optimisation tool.(c) 2022 Published by Elsevier Ltd.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b74eddad62a9b6fab30a9b65339df61",
  "timestamp": "2025-05-15T00:54:56.461076"
}