{
  "id": 9409,
  "title": "Factors Associated With Unmet Supportive Care Needs and Emergency Department Visits and Hospitalizations in Ambulatory Oncology",
  "abstract": "IMPORTANCE Patients with cancer experience multiple supportive care needs (eg, coping and financial counseling) that, if not addressed, may result in poor clinical outcomes. Limited work has assessed the factors associated with unmet needs in large and diverse samples of ambulatory oncology patients. OBJECTIVE To characterize the factors associated with unmet supportive care needs among ambulatory oncology patients and to assess whether such needs were associated with emergency department (ED) visits and hospitalizations. DESIGN, SETTING, AND PARTICIPANTS Between October 1, 2019, and June 30, 2022, cross-sectional retrospective analyses were performed in a large and diverse ambulatory cancer population via My Wellness Check, an electronic health record (EHR)-based supportive care needs and patient-reported outcomes (PROs) screening and referral program. MAIN OUTCOMES AND MEASURES Demographic characteristics, clinical characteristics, and clinical outcomes were extracted from EHRs. Data on PROs (ie, anxiety, depression, fatigue, pain, and physical function), health-related quality of life (HRQOL), and supportive care needs were also collected. Logistic regressions examined factors associated with unmet needs. Cumulative incidence of ED visits and hospitalizations were assessed by Cox proportional hazards regression models adjusting for covariates. RESULTS The 5236 patients in the study had a mean (SD) age of 62.6 (13.1) years and included 2949 women (56.3%), 2506 Hispanic or Latino patients (47.9%), and 4618 White patients (88.2%); 1370 patients (26.2%) indicated Spanish as their preferred language, according to their EHR. A total of 940 patients (18.0%) reported 1 or more unmet needs. Black race (adjusted odds ratio [AOR], 1.97 [95% CI, 1.49-2.60]), Hispanic ethnicity (AOR, 1.31 [95% CI, 1.10-1.55]), 1 to 5 years after diagnosis (AOR, 0.64 [95% CI, 0.54-0.77]), more than 5 years after diagnosis (AOR, 0.60 [95% CI, 0.48-0.76]), anxiety (AOR, 2.25 [95% CI, 1.71-2.95]), depression (AOR, 2.07 [95% CI, 1.58-2.70]), poor physical function (AOR, 1.38 [95% CI, 1.07-1.79]), and low HRQOL scores (AOR, 1.89 [95% CI, 1.50-2.39]) were associated with greater unmet needs. Patients with unmet needs had a significantly higher risk of ED visits (adjusted hazard ratio [AHR], 1.45 [95% CI, 1.20-1.74]) and hospitalizations (AHR, 1.36 [95% CI, 1.13-1.63]) relative to patients without unmet needs. CONCLUSIONS AND RELEVANCE In this cohort study of ambulatory oncology patients, unmet supportive care needs were associated with worse clinical outcomes. Patients from racial and ethnic minority groups and those with greater emotional or physical burden were more likely to have 1 or more unmet needs. Results suggest that addressing unmet supportive care needs may be crucial for improving clinical outcomes, and targeted efforts should focus on specific populations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b753463babe46f51fe7af72045b990f",
  "timestamp": "2025-05-15T03:28:17.671111"
}