{
  "id": 4408,
  "title": "Competitiveness of nations: A knowledge discovery examination",
  "abstract": "This paper presents the insights gained from the use of data mining and multivariate statistical techniques to identify important factors associated with a country's competitiveness and the development of knowledge discovery in databases (KDD) models to predict it. In addition to stepwise regression and weighted non-linear programming techniques, intelligent learning techniques (artificial neural networks), and inferential techniques (classification and regression trees), were applied to a dataset of 43 countries from the World Competitiveness Yearbook (WCY). The dataset included 55 variables on economic, internationalization, governmental, financial, infrastructure, management, science and technology, as well as demographic and cultural characteristics. Exploratory data analysis and parameter calibration of the intelligent method architectures preceded the development and evaluation of reasonably accurate models (mean absolute error < 5.5%), and subsequent out-of-sample validations. The strengths and weaknesses of each of the KDD techniques were assessed, along with their relative performance and the primary input variables influencing a country's competitiveness. Our analysis reveals that the primary drivers of competitiveness are lower country risk rating and higher computer usage, in entrepreneurial urbanized societies with less male dominance and basic infrastructure, with higher gross domestic investment, savings and private consumption, more imports of goods and services than exports, increased purchase power parity GDP, larger and more productive but not less expensive labor force, and higher R&D expenditures. Without diminishing the role and importance of WCY reports, our approach can be useful to estimate the competitiveness of many countries not included in WCY, while our findings may benefit policy makers and international agencies to expand their own abilities, insights and establish priorities for improving country competitiveness. (c) 2004 Elsevier B.V. All rights reserved.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b7c5f9fddc51b0e60dbc4f452217c19",
  "timestamp": "2025-05-15T02:36:38.563005"
}