{
  "id": 942,
  "title": "Energy financial risk early warning model based on Bayesian network",
  "abstract": "Oil is a global, non-renewable energy source, which plays a pivotal role in the development of the global economy and the strategic reserve system. With the expansion of crude oil futures trading scale, crude oil is no longer a pure energy commodity, but is increasingly controlled by the financial market. Based on Bayesian network, this paper studies and analyzes the financial risks of non renewable energy such as oil. Finally, the prediction models of BP neural network and Bayesian network are given. Neural network is a mathematical model based on neurons, a nonlinear adaptive dynamic system formed by the connection between neurons, and based on these two models, discusses the financial risk early warning method of petroleum in non-renewable energy. The test results of this paper show that the Bayesian network and BP neural network are used for early warning analysis based on the comprehensive oil financial risk data from 1987 to 2015. The prediction results of neural network show that there is 65% correlation between the two. From the fitting results of the prediction results and real data, the fitting effect of Bayesian network is better than that of BP neural network, and the fitting success rate is as high as 80%. The Bayesian network prediction model is analyzed by using the autoregressive movement of the model itself and the time series measurement results of the data itself. The results show that the prediction model is highly reliable. Therefore, it is very necessary to adopt Bayesian network prediction model in the risk early warning of petroleum finance.(c) 2023 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b9b7cb8e06703ca8b61779f297ff6e7",
  "timestamp": "2025-05-15T01:56:49.644083"
}