{
  "id": 3898,
  "title": "Relative validity of a glycemic index extended food-frequency questionnaire",
  "abstract": "Background and aims: The dietary glycemic index (GI) and glycemic load (GL) are increasingly recognized as important for the prevention and management of diabetes mellitus. To extend the portfolio of assessment methods for large-scale epidemiological studies, we propose a GI-specific addition to an already established FFQ. Methods and results: The German version of the EPIC-FFQ was extended by GI-specific questions for major carbohydrate sources varying notably in GI (breakfast cereals, bread, pasta, rice, potato etc.). We performed relative validation analyses comparing the GI-extended FFQ to three to four 3-day weighted dietary records (3-d WDR) in 100 middle-aged individuals with diabetes mellitus participating in the German Diabetes Study (GDS). Level of agreement between the two methods was assessed by correlation and cross-classification analyses as well as BlandAltman-Plots, conducted separately for women and men. Spearman correlation analysis for female participants suggested good agreement between the GI-extended FFQ and 3-d WDRs for energy adjusted dietary GL (r = 0.52, p = 0.0004). For both women and men, agreement with the estimations of dietary GI, GL (for men) and carbohydrates from low and higher-GI food sources from the GI-extended FFQ was acceptable (r: 0.28-0.45). Classification of the dietary GI and GL in the opposite quartile was <10% comparing the GIextended FFQ and 3-d WDR. Bland-Altman plots suggested a tendency for an overestimation of the dietary GI from the GI-extended FFQ in the lower GI-ranges, particularly for men.Conclusion: Compared to the 3-d WDR, the GI-extended FFQ showed a moderate to good relative validity for parameters of carbohydrate quality.(c) 2022 Published by Elsevier B.V. on behalf of The Italian Diabetes Society, the Italian Society for the Study of Atherosclerosis, the Italian Society of Human Nutrition and the Department of Clin-ical Medicine and Surgery, Federico II University.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2b9e9bb6cdb9124b4d929ad5d3fe2626",
  "timestamp": "2025-05-15T01:22:11.801385"
}