{
  "id": 4847,
  "title": "Public hospitals in financial distress: Is privatization a strategic choice?",
  "abstract": "Background: As safety net providers, public hospitals operate in more challenging environments than private hospitals. Such environments put public hospitals at greater risk of financial distress, which may result in privatization and deterioration of the safety net. Purpose: The purpose of this study was to investigate whether financial distress is associated with privatization among public hospitals. Methodology/Approach: We used panel data merged from the American Hospital Association Annual Survey, Medicare Cost Reports, Area Resource File, and Local Area Unemployment Statistics. Our study population consisted of all U.S. nonfederal acute care public hospitals in 1997 tracked through 2009, resulting in 6,426 hospital-year observations. The dependent variable privatization was defined as conversion from public status to either private not-for-profit or private for-profit status. The main independent variable, financial distress, was based on the Altman Z-score methodology. Control variables included market and organizational factors. Two random-effects logistic regression models with state and year fixed-effects were constructed. The independent and control variables were lagged by 1 year and 2 years for Models 1 and 2, respectively. Findings: Public hospitals in financial distress had greater odds of being privatized than public hospitals not in financial distress: (OR = 4.53, p < .001) for Model 1 and (OR = 3.05, p = .001) for Model 2. Practice Implications: Privatization eases access to resources and may provide financial relief to government entities from the burden of continuously funding a hospital operating at a loss, which in turn may help keep the hospital open and preserve access to care for the community. Privatizing a financially distressed public hospital may be a better strategic alternative than closure. The Altman Z-score could be used as a managerial tool to monitor hospitals' financial condition and take corrective actions.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ba7b6332ff88de3cc34c42c182ea860",
  "timestamp": "2025-05-15T02:41:32.797883"
}