{
  "id": 7829,
  "title": "From macro to micro: The health of Swedish lone mothers during changing economic and social circumstances",
  "abstract": "The deep recession in Sweden in the early 1990s led to high unemployment levels. In addition, policy changes and reductions in welfare benefits increased costs of living. These changes may have affected lone mothers to a greater extent than other groups. How have these changes in the social context and policy context impacted on the health of lone mothers in comparison with couple mothers in Sweden between 1983 and 2001? Survey data on 19,192 mothers over the period of 1983-2001 were used to study changes in individual economic and social circumstances and self-rated health (SRH) with multivariate logistic regression. In addition, all-cause mortality, cause-specific mortality and severe morbidity were studied using registers for the whole population. Three cohorts of mothers aged 20-54 years (starting 1985, 1990 and 1996) were formed. Age-adjusted risk ratios were calculated using Poisson regression. The employment rate among lone mothers declined from 1983 to 2001. At the same time, prevalence of self-reported financial problems and exposure to violence increased. Lone mothers reported worse SRH and had higher risks of hospitalisation and mortality than couple mothers in all time periods. Despite changes in social context and policy context causing an increase of health detrimental exposures, and deteriorated levels of SRH 1980-2001 for lone mothers, there was no evidence of increased differentials over time between lone and couple mothers in less than good SRH, hospitalisation or mortality. Three alternative explanations are discussed: the Swedish welfare state still acts as a buffer for ill health; latency makes the follow-up time too short; and finally, the lack of increased differentials is due to methodological reasons. (C) 2007 Elsevier Ltd. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ba8b7aba591680005d659c3a64e4b56",
  "timestamp": "2025-05-15T03:12:36.428812"
}