{
  "id": 9091,
  "title": "Are the early predictors of long-term work absence following injury time dependent? Results from the Prospective Outcomes of Injury Study",
  "abstract": "Objectives Few studies examine the influence of early predictors of work absence beyond 12 months following injury or the time-dependent relative importance of these factors. This study aimed to identify the most important sociodemographic, occupational, health, lifestyle and injury predictors of work absence at 12 and 24 months following injury and to examine changes in the relative importance of these over time. Design Prospective cohort study. Setting The Prospective Outcomes of Injury Study, New Zealand. Participants 2626 injured New Zealand workers aged 18-64 years were identified from the Prospective Outcomes of Injury Study recruited form New Zealand's monopoly injury compensation provider injury claims register: 2092 completed the 12-month interview (80% follow-up) and 2082 completed the 24-month interview (79% follow-up). Primary and secondary outcomes measures The primary outcomes of interest was absence from work at the time of the 12-month and 24-month follow-up interviews. Results Using modified Poisson regression to estimate relative risks, important groups of workers were identified at increased risk of work absence at both 12 and 24 months: males, low-income workers, trade/manual workers, temporary employees, those reporting two or more comorbidities and those experiencing a work-related injury. Important factors unique to predicting work absence at 12 months included financial insecurity, fixed-term employment and long weekly hours worked; unique factors at 24 months included job dissatisfaction, long weekly days worked, a prior injury and sustaining an injury that was perceived to be a threat to life. Conclusions Important early predictors of work absence at 12 or 24 months following injury are multidimensional and have a time dependent pattern. A consistent set of predictors was, however, present at both time periods that are prime for early intervention. Understanding the multidimensional, time-dependent patterns of early predictors of long-term disability is important to optimally target timely interventions to prevent long-term work disability.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bba23f47a0408aac63dd55a6bf2b7ad",
  "timestamp": "2025-05-15T03:25:27.749562"
}