{
  "id": 4846,
  "title": "Predicting the Onset of Anxiety Syndromes at 12 Months in Primary Care Attendees. The PredictA-Spain Study",
  "abstract": "Background: There are no risk algorithms for the onset of anxiety syndromes at 12 months in primary care. We aimed to develop and validate internally a risk algorithm to predict the onset of anxiety syndromes at 12 months. Methods: A prospective cohort study with evaluations at baseline, 6 and 12 months. We measured 39 known risk factors and used multilevel logistic regression and inverse probability weighting to build the risk algorithm. Our main outcome was generalized anxiety, panic and other non-specific anxiety syndromes as measured by the Primary Care Evaluation of Mental Disorders, Patient Health Questionnaire (PRIME-MD-PHQ). We recruited 3,564 adult primary care attendees without anxiety syndromes from 174 family physicians and 32 health centers in 6 Spanish provinces. Results: The cumulative 12-month incidence of anxiety syndromes was 12.2%. The predictA-Spain risk algorithm included the following predictors of anxiety syndromes: province; sex (female); younger age; taking medicines for anxiety, depression or stress; worse physical and mental quality of life (SF-12); dissatisfaction with paid and unpaid work; perception of financial strain; and the interactions sex*age, sex*perception of financial strain, and age*dissatisfaction with paid work. The C-index was 0.80 (95% confidence interval = 0.78-0.83) and the Hedges' g = 1.17 (95% confidence interval = 1.04-1.29). The Copas shrinkage factor was 0.98 and calibration plots showed an accurate goodness of fit. Conclusions: The predictA-Spain risk algorithm is valid to predict anxiety syndromes at 12 months. Although external validation is required, the predictA-Spain is available for use as a predictive tool in the prevention of anxiety syndromes in primary care.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bbe067ef64b657a1ba6850e99e9ecd0",
  "timestamp": "2025-05-15T02:41:32.795397"
}