{
  "id": 4458,
  "title": "RETRACTED: Influence of enterprise cloud computing database application and enterprise debt financing based on SVM algorithm: internal control quality analysis (Retracted Article)",
  "abstract": "The continuous deepening of the development of my country's market economy has brought more development opportunities to Chinese enterprises, which has made the development of Chinese enterprises more rapid. A financial crisis in an enterprise will bring about disastrous consequences such as investment loss, unemployment of employees, and unrecoverable credit, which will further affect the country's economic development, financial security and social stability. Therefore, the impact of corporate cloud computing database applications and corporate debt financing has attracted widespread attention, and the impact of corporate debt financing capabilities and debt financing costs have become the main issues studied in this article. This article uses scientific methods to establish an effective financial crisis early warning model, conducts an empirical analysis of the financial data of listed companies in my country, selects indicators that have a significant impact on the financial status of the enterprise, and obtains an accurate early warning classification of the financial status of the enterprise, which verifies this article The feasibility and effectiveness of the proposed early warning ideas, early warning index system and early warning methods. This article also focuses on the internal risk management methods of enterprises, and makes an in-depth study on whether high-quality internal control can weaken creditors' expectations of risks caused by corporate strategic differences, thereby weakening the relationship between strategic differences and corporate debt financing. Based on the conclusions obtained, this article puts forward a number of constructive suggestions for Chinese enterprises to optimize their strategic positioning and control operating risks to alleviate financing difficulties, which have certain theoretical significance and practical value.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bc71a11dbda5aed7d2dc057ed86826b",
  "timestamp": "2025-05-15T02:37:16.986778"
}