{
  "id": 1695,
  "title": "Practical forecasting of risk boundaries for industrial metals and critical minerals via statistical machine",
  "abstract": "This study examines the application of machine learning in predicting price risk boundaries for industrial metals and critical minerals, emphasizing the role of statistical dependencies among their yields. Given these commodities' pivotal role in various industries and their influence on the global economy, accurate forecasting of their price boundaries is critical. Our research employs statistical dependencies as key features to uncover meaningful correlations essential for effective forecasting, underscoring the value of analyzing rate -based statistical dependencies alongside price fluctuations. Applying explainable artificial intelligence (xAI) techniques validates the effectiveness of combining these approaches for price boundary prediction. Our findings indicate variations in effectiveness between the Pearson correlation coefficient and normalized mutual information, challenging the Pearson coefficient's dominance in financial analysis. The study demonstrates that the relevance of each statistical dependency varies across different machine learning models, necessitating a comprehensive analytical approach incorporating information -theoretic methods. Our analysis improves the accuracy and interpretability of price predictions by pinpointing critical relationships among selected industrial metals and critical minerals.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bcc673ba35372b002a843be6753e851",
  "timestamp": "2025-05-15T02:06:22.490801"
}