{
  "id": 8933,
  "title": "Gender Differences in Adolescent Opioid Misuse and Major Depressive Episodes",
  "abstract": "The opioid crisis is a public health emergency in the United States, with staggering financial and social costs to society. Nonmedical prescription opioid use (NMPOU) disproportionately impacts adolescents, with opioid-related mortality rates increasing for female adolescents. Past research has linked opioid misuse to mental health problems, and adolescents have the highest prevalence of substance use and mental health disorders compared with other age cohorts. This study examined the relationship of adolescent NMPOU with having a major depressive episode (MDE), stratified by gender. This study used data from the 2016 National Survey on Drug Use and Health (NSDUH), and included 11,489 respondents aged 12 to 17. Multivariate logistic regression analyses using survey design weights were used to examine the effect of past-year NMPOU with the odds of having a past-year major depressive episode. Results indicated a higher prevalence of past-year MDE among adolescents who used NMPOU (34.0%), compared to those who did not (12.7%). Adolescent opioid misuse was associated with increased 60% higher odds for having a past-year MDE (OR = 1.60, 95% CI [1.11, 2.32], p < 0.05). Subgroup analysis found that NMPOU was associated with increased odds for having a past-year MDE for adolescent females (OR = 1.99, 95% CI [1.24, 3.17], p < 0.01), while the association of NMPOU with past-year MDE was not statistically observed for adolescent males. Results indicated that opioid misuse is a leading factor associated with having a major depressive episode among adolescent females. Adolescent females were at a higher risk for poor mental health outcomes compared to adolescent males. Social workers in collaboration with other professionals can play a central role by coordinating substance use and mental health prevention and recovery services.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bd966d3c56ad03d6c26e3bb7e1eb962",
  "timestamp": "2025-05-15T03:23:56.067246"
}