{
  "id": 7085,
  "title": "Does social capital protect mental health among migrants in Sweden?",
  "abstract": "Poor mental health is common among migrants. This has been explained by migration-related and socio-economic factors. Weak social capital has also been related to poor mental health. Few studies have explored factors that protect mental health of migrants in the post-migration phase. Such knowledge could be useful for health promotion purposes. Therefore, this study aimed to analyse associations between financial difficulties, housing problems and experience of discrimination and poor mental health; and to detect possible effect modification by social capital, among recently settled Iraqi migrants in Sweden. A postal questionnaire in Arabic was sent to recently settled Iraqi citizens. The response rate was 51% (n = 617). Mental health was measured by the GHQ-12 instrument and social capital was defined as social participation and trust in others. Data were analysed by means of logistic regression. Poor mental health was associated with experience of discrimination (OR 2.88, 95% CI 1.73-4.79), housing problems (OR 2.79, 95% CI 1.84-4.22), and financial difficulties (OR 2.14, 95% CI 1.44-3.19), after adjustments. Trust in others seemed to have a protective effect for mental health when exposed to these factors. Social participation had a protective effect when exposed to experience of discrimination. Social determinants and social capital in the host country play important roles in the mental health of migrants. Social capital modifies the effect of risk factors and might be a fruitful way to promote resilience to factors harmful to mental health among migrants, but must be combined with policy efforts to reduce social inequities.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bdb240f7beb8b1c454b80c52d1a95c9",
  "timestamp": "2025-05-15T03:05:03.448038"
}