{
  "id": 6781,
  "title": "Transactional sex and its associated factors among gay, bisexual and other men who have sex with men in Nepal",
  "abstract": "Background Transactional sex, which involves the exchange of sex for money, goods or other items of value, has been associated with adverse health outcomes, such as HIV and other sexually transmitted infections, mental health challenges, and substance use. Although transactional sex has been extensively studied globally among cisgender and transgender women, there is a lack of comprehensive understanding regarding its prevalence and correlates among gay, bisexual and other men who have sex with men (GBMSM), particularly in Nepal. Thus, this study aimed to examine the prevalence of transactional sex and its associated factors among GBMSM in Nepal.Methods A cross-sectional survey was conducted among GBMSM in Kathmandu Valley, Nepal, between October and December 2022 (N = 250). We collected information on participants' sociodemographic characteristics, sexual and other behavioural characteristics, and their engagement in transactional sex. Bivariate and multivariate logistic regression analyses were performed to determine the factors associated with transactional sex.Results The average age of participants was 27.5 years (s.d. 8.9). Overall, 16.4% reported engaging in transactional sex within the past 6 months. Participants with more financial dependants (aOR: 1.2, 95% CI: 1.0-1.5) and those who had experienced police detention (aOR: 4.8, 95% CI: 1.1-19.6) were more likely to engage in transactional sex. In contrast, GBMSM who reported engaging in condomless sex were less likely to engage in transactional sex (aOR: 0.02, 95% CI: 0.06-0.1).Conclusions The study findings underscore a noteworthy prevalence of transactional sex and associated socioeconomic and behavioural factors among GBMSM in Nepal. These results underscore the need for targeted interventions addressing both economic vulnerabilities and legal interactions to reduce transactional sex and its associated risks in this high-risk group. Globally, gay, bisexual and other men who have sex with men (GBMSM) are at higher risk for HIV and STIs due to behaviours such as condomless sex and multiple sexual partners. GBMSM engaging in transactional sex heightens the risk of these occurrences. The study examines the prevalence and factors associated with transactional sex among GBMSM in Kathmandu Valley, Nepal, revealing that 16.4% of participants engaged in transactional sex in the past 6 months. Key factors include financial dependants and police detention, whereas condomless sex was less likely among those engaging in transactional sex. The findings underscore the need for targeted sexual health interventions and policies tailored to the specific needs of this high-risk group.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2bdd16408dd5850e0fee91171e2184be",
  "timestamp": "2025-05-15T03:01:31.410482"
}