{
  "id": 9396,
  "title": "Long-term healthcare utilization and costs of babies bornafter assisted reproductive technologies (ART): a record linkage study with 10-years' follow-up in England",
  "abstract": "STUDY QUESTION Is the long-term health care utilization of children born after ART more costly to the healthcare system in England than children born to mothers with no fertility problems?SUMMARY ANSWER Children born after ART had significantly more general practitioner (GP) consultations and higher primary care costs up to 10 years after birth, and significantly higher hospital admission costs in the first year after birth, compared to childrenborn to mothers with no fertility problems.WHAT IS KNOWN ALREADY There is evidence that children born after ART are at an increased risk of adverse birth outcomes and a small increased risk of rare adverse outcomes in childhood.STUDY DESIGN, SIZE, DURATION We conducted a longitudinal study of 368 088 mother and baby pairs in England using a bespoke linked dataset. Singleton babies born 1997-2018, and their mothers, who were registered at GP practices in England contributing data to the Clinical Practice Research Datalink (CPRD), were identified through the CPRD GOLD mother-baby dataset; this data was augmentedwith further linkage to the mothers' Human Fertilisation and Embryology Authority (HFEA) Register data. Four groups of babies were identified through the mothers' records: a 'fertile' comparison group, an 'untreated sub-fertile' group, an 'ovulation induction'group, and an ART group. Babies were followed-up from birth to 28 February 2021, unless censored due to loss to follow-up (e.g. leaving GP practice, emigration) or death.PARTICIPANTS/MATERIALS, SETTING, METHODS The CPRD collects anonymized coded patient electronic health records from a network of GPs in the UK. We estimated primary care costs and hospital admission costs for babies in the four fertility groups using the CPRD GOLD data and the linked Hospital Episode Statistics (HES) Admitted Patient Care (APC) data. Linear regression was used to compare the care costs in the different groups. Inverse probability weights were generated and applied to adjust for potential bias caused by attrition due to loss to follow-up.MAIN RESULTS AND THE ROLE OF CHANCE Children born to mothers with no fertility problems had significantly fewer consultations and lower primary care costs compared to the other groups throughout the 10-years' follow up. Regarding hospital costs, childrenborn after ART had significantly higher hospital admission costs in the first year after birth compared to those born to motherswith no fertility problems (difference = 307 pound (95% CI: 153, 477)). The same pattern was observed in children born after untreated subfertility and ovulation induction.LIMITATIONS, REASONS FOR CAUTION HFEA linkage uses non-donor data cycles only, and the introduction of consent for data use reduced the availability of HFEA records after 2009. The fertility groups were derived by augmenting HFEA data with evidence from primary care records; however, there remains some potential misclassification of exposure groups. The cost of neonatal critical care is not captured in the HES APC data, which may cause underestimation of the cost differences between the comparison group and the infertility groups.WIDER IMPLICATIONS OF THE FINDINGS The findings can help anticipate the financial impact on the healthcare system associatedwith subfertility and ART, particularly as the demand for these treatments grows.STUDY FUNDING/COMPETING INTEREST(S) C.C. and this work were funded by a UK Medical Research Council Career Development Award [MR/L019671/1] and a UK MRC Transition Support Award [MR/W029286/1]. X.H. is an Australia National Health and Medical Research Council (NHMRC) Emerging Leadership Fellow [grant number 2009253]. The authors declare no competing interest.TRIAL REGISTRATION NUMBER N/A.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2be87cb9fc1cb26e508467a936c506b5",
  "timestamp": "2025-05-15T03:28:17.617204"
}