{
  "id": 6265,
  "title": "Spatial linkage of volatility spillovers and its explanation across G20 stock markets: A network framework",
  "abstract": "This paper empirically estimates the spatial correlation relationship of volatility spillovers and its influencing factors across G20 stock market. We apply GARCH-BEKK model to estimate volatility spillover and construct dynamic volatility networks. The connectedness analysis shows that the spatial linkage of volatility spillover is time varying and has obvious multiple superposition phenomena. As somewhat innovation results, we use the factor analysis method to obtain centrality comprehensive indicators that can clearly depict the risk contagion intensity and risk acceptance intensity. In general, the developed markets are more influential than the emerging markets during periods of turbulence, and the emerging markets are more sensitive to volatility shocks than developed markets during any period. Finally, this paper introduces quadratic assignment procedure (QAP) method to identify the major factors that influence the spatial linkage of volatility spillovers. Results show that geography influences the volatility spatial correlation differently across economic cycles, and the centrality structure factors have greater impact on the spatial correlation than the external economic factors. The QAP regression analysis shows that these influencing factors can explain about 50% of the spatial correlation variation of international financial markets' volatility spillovers.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c048375e8f55b3168b0234bcb43704b",
  "timestamp": "2025-05-15T02:56:37.259560"
}