{
  "id": 533,
  "title": "University rankings disclosure and efficiency in higher education: A bibliometric and systematic analysis",
  "abstract": "Whereas new public management models urge universities to manage available resources more efficiently and effectively, the pressure exerted by the phenomenon of university rankings - referents of the quality and excellence of higher education institutions-has driven universities to strive for better positions in these rankings with the aim of maximizing their reputation. While the effects of the disclosure of university rankings on the one hand and the measurement of efficiency in universities on the other have been widely analysed, little is known about the variables involved in university rankings and their relationship with the efficiency levels of higher education institutions. Therefore, this study aims to identify evidence and/or disagreements within the relevant scientific literature regarding universities' efficiency levels and their position in the rankings as a causal relationship between efficiency, reputation and market perception. Given this approach, the present study has the objective of exploring what the scientific literature offers regarding these two areas, with the aim of increasing our knowledge on the topic and presenting research opportunities. To this end, a structured intervention process known as the Knowledge Development Process - Constructivist (Proknow-c) is used. As a result, an BP Bibliographic Portfolio is obtained from the most relevant scientific publications, composed of 77 items covering the period of 1995-2016. This portfolio is achieved through a bibliometric and systematic analysis that presents gaps and research opportunities relevant to the proposed subject of interest.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c06f70cbf03b1e8eb07ed511bb04bf6",
  "timestamp": "2025-05-15T00:37:01.809204"
}