{
  "id": 2830,
  "title": "Six Sigma project selections: a critical review",
  "abstract": "Purpose - The paper aims to review the literature on Six Sigma projects through a broad framework of Six Sigma project selection process. It proposes a process framework approach of six sigma project selection and enumerates various recent tools and methods required for each stage. The review aims to expand the domain of Six Sigma project selection by identifying the importance of project portfolio approach. Design/methodology/approach - The study used a process framework approach and systematic literature review to identify and classify various literature pertaining six sigma projects and its associated tools and methods Findings - The paper provides broad insights about the opportunity and direction to future research in the area of Six Sigma project. Emerging research opportunities exist in the area of Six Sigma project risk management and selecting portfolio of projects. Research limitations/implications - The study has its own limitations because of its chosen research approach. The process framework developed for classification of literature is based on expert opinion. Further research can be carried out to validate it. Practical implications - This study will benefit new researchers entering the field of Six Sigma to identify new research opportunities and issues for their research interest. Second, industry practitioners and consultants working in the area of Six Sigma may work towards more successful implementation of Six Sigma. Originality/value - The paper fulfils an identified gap of review of Six Sigma project selection.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c243c365228ee5896d916f3133578bf",
  "timestamp": "2025-05-15T01:10:49.609592"
}