{
  "id": 7798,
  "title": "As I dropped the phone, she slapped me for the first time: experiences of intimate partner violence among Nigerian men during COVID-19 restrictions",
  "abstract": "Limited literature exists on men's experiences with intimate partner violence (IPV) during the COVID-19 lockdown, especially in resource-constrained settings such as Nigeria. We investigated the prevalence, risk factors, and lifetime experiences of IPV among men in Nigeria during COVID-19 restrictions. Using a mixed methods design, we interviewed 420 married men with a structured questionnaire and conducted 20 in-depth interviews. Logistic regression and a framework approach were used for data analysis. Approximately 86.4% of respondents (n = 363) experienced IPV at some point in their lifetime. The prevalence of IPV during the COVID-19 restrictions was 76.2% (n = 320). Over a lifetime, verbal (67.4%), physical (78.1%), and sexual coercion (81.0%) were the most common forms of IPV. During the COVID-19 lockdown, the corresponding proportions were 48.6%, 69.5%, and 57.4%, respectively. Male- and female-perpetrated IPV over a lifetime (88.3% vs 87.6%) and during COVID-19 restrictions (88.3% vs 81.4%) were similar (p > 0.05). Older age, non-Muslim religion, longer marital duration, partner's profession, and no formal education were associated with higher IPV risk. Home confinement, financial stress, childbirth, disrespect toward spouse's parents, emotional detachment, disputes about child discipline, and suspected infidelity contributed to IPV. Men's active involvement in family life, improved communication, and increased transparency emerged as protective factors. Our findings highlight the high rates of IPV during the pandemic, with men as both perpetrators and victims. Future epidemic preparedness plans should prioritize IPV prevention strategies that enhance partner communication, promote male involvement in family life, address the gender education gap, and provide support services.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c36b878e240c569826346f89db028e8",
  "timestamp": "2025-05-15T03:12:11.671500"
}