{
  "id": 6035,
  "title": "Examining the Implementation of Conditional Financial Incentives Using the Reach, Effectiveness, Adoption, Implementation, and Maintenance (RE-AIM) Framework to Improve HIV Outcomes among Persons Living with HIV (PLWH) in Louisiana",
  "abstract": "Economic strengthening interventions are needed to support HIV outcomes among persons living with HIV (PLWH). The Baton Rouge Positive Pathway Study (BRPPS), a mixed method implementation science study, was conducted to assess key RE-AIM components tied to the provision of conditional financial incentives among PLWH in Baton Rouge, Louisiana. Seven hundred and eighty-one (781) PLWH enrolled at four HIV clinic sites were included in the final analyses. Participants completed an initial baseline survey, viral load test, and were contacted at 6 and 12 months (+/- 1 month) post-enrollment for follow-up labs to monitor viral load levels. Participants received up to USD140 in conditional financial incentives. The primary analyses assessed whether participation in the BRPPS was associated with an increase in the proportion of participants who were: (a) engaged in care, (b) retained in care and (c) virally suppressed at baseline to 6 and 12 months post-baseline. We constructed a longitudinal regression model where participant-level outcomes at times t(0) (baseline) and t(1) (6- or 12-month follow-up) were modeled as a function of time. A secondary analysis was conducted using single-level regression to examine which baseline characteristics were associated with the outcomes of interest at 12-month follow-up. Cost analyses were also conducted with three of the participating clinics. Most participants identified as Black/African American (89%). Fewer than half of participants reported that they were unemployed or made less than USD5000 annually (43%). Over time, the proportion of participants engaged in care and retained in care significantly increased (70% to 93% and 32% to 64%, p < 0.00). However, the proportion of virally suppressed participants decreased over time (59% to 34%, p < 0.00). Implementation costs across the three sites ranged from USD17,198.05 to USD396,910.00 and were associated with between 0.37 and 1.34 HIV transmissions averted at each site. Study findings provide promising evidence to suggest that conditional financial incentives could help support engagement and retention in HIV care for a high need and at risk for falling out of HIV care population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c3da2ff0b1aba84c19174c6a4fc890c",
  "timestamp": "2025-05-15T02:54:03.412587"
}