{
  "id": 2755,
  "title": "Complementary level of financial and tax aggressiveness and the impact on cost of debt: A cross-country study",
  "abstract": "Managers can take advantage of the flexibility of accounting choices to act opportunistically through financial aggressiveness and/or tax aggressiveness. The higher the complementary level of financial and tax aggressiveness, the higher the risk arising from the levels of error or fraudulent reporting carried out by such firms (fraud risk). This study aims to examine the impacts of the complementary level of financial and tax aggressiveness on the cost of debt. We estimate these relationships with a two-stage estimator method using 7 200 firm-year samples from East Asia and Europe for the period 2014 to 2016. In the first stage, a binary logistics model is used to examine the factors that influence the complementary level of financial and tax aggressiveness. Then in the second stage, we use a regression model to examine the effect of the complementary level of financial and tax aggressiveness on the cost of debt. We find that the complementary level of financial and tax aggressiveness has a positive and significant effect on the cost of debt, meaning that the higher the complementary level of financial and tax aggressiveness, the higher the cost of debt faced by firms. Creditors perceive the practice of financial and tax aggressiveness as a significant firm risk, thus tending to increase the cost of the debt they provide.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c4b35a5403bb57152d841e828a0ef25",
  "timestamp": "2025-05-15T02:18:37.215453"
}