{
  "id": 7837,
  "title": "Do auditors react to market behaviour?",
  "abstract": "Purpose: The purpose of the study is to determine whether auditors react to market information - stock price volatility and market value fluctuations - and to what extent this has an effect on their propensity to issue a modified opinion or include emphasis of matter paragraphs in their audit reports. Methodology: The empirical tests were based on estimates of logistic regression with data from 338 non-financial companies listed in the B3 [Brazilian Stock Exchange] during the period 2009-2020 and obtained directly from the Securities and Exchange Commission (CVM) and the database of the Economatica platform. Results: The results revealed that the entities which recorded greater volatility in stock returns, were more likely to include changes of opinion and emphasis of matter paragraphs in their audit reports. This suggests that the auditor regards this market risk as a sign of an audit risk for the entity that will lead to stricter judgments and even act as kind of self-protection. However, no link was found between market value fluctuations or emphasis of matter paragraphs, which contradicted the expectation that the greater the losses in market values, the greater the probability of the auditor's opinion being modified. Research Contributions: The empirical evidence fills a gap in the literature in this area. What is usually examined is the effects of the content on the marketing audit report, whereas this study concentrates on exploring an inverse relationship - the effect of information in the market on operational audits. In addition, the findings help to obtain a better understanding of the work of the auditors and provide valuable assistance to professionals and regulators in the area.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c4e0edff324fc4c884c75f9dd07c8d0",
  "timestamp": "2025-05-15T03:12:36.487159"
}