{
  "id": 6981,
  "title": "Determinants of new firm survival across Russian manufacturing industry",
  "abstract": "The current situation in the Russian economy brings forth the issue of the successful survival of young companies. I analyze the impact of the initial regional and sectoral conditions on young firms' prospects for survival. The sample includes more than 27 thousand companies of Russian manufacturing industry emerged in 2017. Given an overall downward trend in the number of liquidated companies per 1,000 operating companies since 2019, high variability between the groups of companies withing the manufacturing industry from 2017 to 2022 is identified, both in terms of absolute values and the dynamics of liquidation. Using the Kaplan- Meier non -parametric estimator of the survival function for a six -year period, I found that manufacturing sectors with a lower share of companies that survive are featured by both a shift in the highest numbers of company liquidations to the earlier periods and higher risk values. The estimates in the Cox regression model indicate a significant and multidirectional impact of institutional, competitive, financial and consumer factors on firm survival, but do not confirm the effect of regional labor markets. In summary, the findings of this study suggest that nowadays, despite the current government policies, the emergence of new firms may be associated with increased survival risk, due to highly uncertain perspectives related to bank loans access, consumer price inflation, as well as the challenges of import substitution.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c71f85ef2481acc4deea4b0689a77b0",
  "timestamp": "2025-05-15T03:03:55.701383"
}