{
  "id": 4388,
  "title": "Use of Evidence-Based Prostate Cancer Imaging in a Nongovernmental Integrated Health Care System",
  "abstract": "Purpose The overuse of imaging, particularly for staging of low-risk prostate cancer, is well documented and widespread. The existing literature, which focuses on the elderly in fee-for-service settings, points to financial incentives as a driver of overuse and may not identify factors relevant to policy solutions within integrated health care systems, where physicians are salaried. Methods Imaging rates were analyzed among men with incident prostate cancer diagnosed between 2004 and 2011 within the Colorado and Northwest regions of Kaiser Permanente. The sample was stratified according to indication for imaging, ie, high risk for whom imaging was necessary versus low risk for whom imaging was discouraged. Logistic regression was used to model the association between imaging receipt and clinical/demographic patient characteristics by risk strata. Results Of the men with low-risk prostate cancer, 35% received nonindicated imaging at diagnosis, whereas 42% of men with high-risk prostate cancer did not receive indicated imaging. Compared with men diagnosed in 2004, those diagnosed in subsequent years were less likely to receive imaging across both risk groups. Men with high-risk cancer diagnosed at >= 65 years of age and those with clinical stage >= T2 were more likely to receive indicated imaging. Men with comorbidities were more likely to receive imaging across both risk groups. Men with low-risk prostate cancer who had higher median household incomes were less likely to receive nonindicated imaging. Conclusion Nonindicated imaging for diagnostic staging of patients with low-risk prostate cancer was common, but has decreased over the past decade. These findings suggest that factors other than financial incentives may be driving overuse of imaging.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c7bcc8564c18e83c89eb711dc982296",
  "timestamp": "2025-05-15T02:36:38.475253"
}