{
  "id": 2680,
  "title": "RETURN DISPERSION AND PRICE VOLATILITY: A MODERATED ANALYSIS ON PORTFOLIO MANAGEMENT STRATEGIES",
  "abstract": "The is study aims to analyze the effect of return dispersion on price return volatility and to analyze the moderator role of book-to-market that can weaken the causal effect based on the portfolio management framework. This paper specifically examines the causal effect at sub-group level of value and growth stocks portfolios. The sample observed are stocks KLCI-30 in Malaysia. The observation period was during the covid-19 pandemic from 1 April 2020 to 30 March 2021. The analytical approaches applied are the GARCH(p,q) model, the hierarchical moderated regression analysis (HMRA) procedure, and the ordinary leastsquared technique. The findings of the investigation show that when the estimation models are not separated into sub-groups, return dispersion positively influences return volatility. However, when the return dispersion is grouped based on the magnitude of BMR, the estimation results on the causality effect from dispersion of return to price return volatility show an insignificant effect for all sub-groups of value, neutral, and growth stocks. Specifically, when a company has a higher BMR, increased dispersion of return on such value stock does not change in its return volatility. As an implication, portfolio managers and market participants could minimize the uncertainty of price movements and eliminate share trading delays by implementing a strategy of style investing and selecting shares to form a value-type portfolio. Moreover, the companies should manage the position of their book value to remain classified as the value stocks segment, which could maintain the interest of market participants and lower the cost of capital.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c83b215d0fb2515ace1e2aae547d1e6",
  "timestamp": "2025-05-15T01:09:14.960960"
}