{
  "id": 2938,
  "title": "LSTM based Algorithmic Trading model for Bitcoin",
  "abstract": "Cryptocurrencies have emerged as an alternative financial asset in the last decade, with their market growing exponentially in recent years. The price of cryptocurrencies is highly volatile and is prone to rapid swings within short periods of time. This behaviour makes them a high-risk and high-return financial asset. The efficacy of neural networks in forecasting the high frequency financial time series has become widely accepted in the research community. This work explored the use of Long Short Term Memory (LSTM), a neural network based non-linear sequence model, to propose a novel algorithmic trading strategy for cryptocurrencies. The proposed novel high frequency algorithmic trading strategy built over an LSTM based short-term price forecasting is used for Bitcoin and Ethereum. This simple, yet effective trading algorithm uses the network's price forecasts to make buy and short selling decisions for cryptocurrency based on certain set criteria. The proposed trading strategy gives positive returns when backtested on Bitcoin hourly prices taken from yahoo! finance. We also verified the effectiveness of the trading strategy for Ethereum, the second largest cryptocurrency, based on the positive backtesting returns. As an extension to the study, the proposed strategy is applied on an even higher frequency (minute by minute) Bitcoin price data, and the strategy gives positive backtesting returns in this extended study. We also provide fuzzy intervals for the algorithmic return of our strategy and compare those with corresponding intervals on a simple buy and hold strategy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c8e77361bbfa8b44887d5f7d7651a31",
  "timestamp": "2025-05-15T02:20:48.221557"
}