{
  "id": 6994,
  "title": "Perceived stress and secondary traumatization in social workers during coronavirus disease 2019: The moderating effect of psychological capital and social work supervision",
  "abstract": "center dot Summary: Social workers have had a pivotal role in handling the challenges faced by people dealing with the coronavirus disease 2019 (COVID-19) pandemic. Supporting clients who have undergone traumatic experiences during a global pandemic may increase the risk of experiencing secondary traumatic stress. This study examined two protective factors that may be key in the association between stress and social workers' secondary traumatic stress: Psychological capital (internal protective factor) and satisfaction with supervision (external factor). The study sample included 104 Israeli social workers who worked in their profession during the first year of the COVID-19 pandemic. A regression-based path analysis was conducted to test the moderation model with the PROCESS software. center dot Findings: Self-efficacy significantly moderated the association between perceived stress and intrusion; increasing self-efficacy decreases perceived stress's effect on intrusion. Although no significant moderating effect was found for the existence of supervision, the interaction between perceived stress and satisfaction with supervision was significant in predicting secondary trauma. center dot Applications: Social workers' unions must work to improve the quality of supervision and raise awareness of the importance of supervision in general and particularly during times of crisis. Manageable workloads, a reasonable balance between work and home, and verbal and financial encouragement to seek professional psychological assistance would all be to the advantage of social workers at risk for secondary trauma.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c92552f39024d71dffaa9fe791726fc",
  "timestamp": "2025-05-15T03:03:55.809597"
}