{
  "id": 9269,
  "title": "Why are simple control options for Toxocara vitulorum not being implemented by cattle and buffalo smallholder farmers in South-East Asia?",
  "abstract": "Toxocara vitulorum infection in large ruminants is endemic in many tropical countries and particularly in South-East Asia. A single treatment of calves with pyrantel at 14-21 days of age effectively controls the parasite. Despite this treatment being readily available, T. vitulorum infection remains common and widespread. To understand drivers of effective control of T. vitulorum infection, we examined treatment practices and knowledge of smallholder farmers of this parasite plus determined annual calf morbidity and mortality and identified potential risk factors for these estimates. Interviews were conducted with 273 smallholder farmers who had calves tested for T. vitulorum 4-6 months earlier. Reproductive rates of 0.6 and 0.4 calf per annum in cattle and buffalo respectively, and annual calf morbidity and mortality of 42.6% (CI 0.38-0.47) and 37.3% (CI 0.33-0.42) respectively, were identified. Interviewed farmers had either none (80.6%) or only minimal (19.4%) knowledge about T. vitulorum and only 2.5% of the farmers treated their calves for T. vitulorum using the recommended control regime. Multivariable logistic regression analyses with random effects showed that the number of adult cattle per household, T. vitulorum infection status of the household herd and farmer knowledge of T. vitulorum were significantly associated with calf morbidity and mortality. Financial analysis using partial budgeting showed a net benefit of USD 3.69, 7.46, 11.09 or 14.86 per calf when treating calves with pyrantel and attributing 25%, 50%, 75% or 100% of morbidity and mortality to T. vitulorum infection. The study identified that poor reproduction, high calf morbidity and mortality combined with very limited farmer knowledge and effective control of endemic Toxocariasis, contribute to suboptimal large ruminant production in mixed smallholder farming systems in South-East Asia. The large net benefit per calf achievable by a single pyrantel treatment should drive implementation of this intervention by smallholder farmers, especially as demand for livestock products continues to increase in this region and forces a change to more production oriented farming. To support this, continued capacity building that ensures knowledge transfer of best practice T. vitulorum control to smallholder farmers is required. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2c93e6e6645f30923289680cd4dbd18d",
  "timestamp": "2025-05-15T03:27:24.929014"
}