{
  "id": 8062,
  "title": "Prenatal Negative Life Events and Childhood Allergies: The Japan Environment and Children's Study (JECS)",
  "abstract": "Background: It is inconclusive whether prenatal negative life events are a risk for the development of allergic diseases in children or whether social capital modifies the association. The objective of this study was to examine whether women's experiences of such events during pregnancy were associated with the development of allergic diseases in their offspring at 3 years old and whether social capital moderated this association. Methods: We used data from 81,337 mother-child pairs who participated in the Japan Environment and Children's Study. This is a prospective birth cohort recruited between January 2011 and March 2014. We examined the associations between prenatal maternal negative life events (e.g., bereavement, financial, and marital problems) during pregnancy and allergic diseases (asthma, eczema, and food allergies) in children after adjustment for covariates using multivariate logistic regression. We also examined interactions between these life events and social capital, measured as two items, social cohesion and social support. Results: Prenatal negative life events were significantly associated with doctor-diagnosed asthma at 3 years old with a dose-response relationship (one life event vs. none: adjusted odds ratio 1.13, 95% confidence interval [CI]: 1.07-1.20; two life events vs. none: adjusted odds ratio 1.24, 95% CI: 1.13-1.36; three or more life events vs. none: adjusted odds ratio 1.26, 95% CI: 1.10-1.46; p for trend <0.01). Similar results were observed for eczema and food allergies. There were no interactions between life events and social capital. Conclusion: Prenatal negative life events may be a risk factor for allergies in children. There was no modification of the effect of these events by social capital.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ca8d2edabe28d419040b105d3170011",
  "timestamp": "2025-05-15T03:14:37.430551"
}