{
  "id": 4258,
  "title": "Is Carbon Neutrality Attainable with Financial Sector Expansion in Various Economies? An Intrinsic Analysis of Economic Activity on CO2 Emissions",
  "abstract": "The severe effects of climate change and its anticipated negative influence on the future of the globe has prompted more research into the attainment of carbon neutrality. While carbon neutrality is a paramount issue, human socio-economic well-being which is mostly influenced by economic activities cannot be overlooked. This study investigates the effect of financial sector activities on CO2 emission in five economic sectors and three economic bodies. The financial sector variables utilized are derived from the undertakings of institutions such as banks, stock exchanges, and insurance companies. Using a sample of 39 countries between 1989 and 2018, this paper provides a global perspective of the profound impact financial sector activities have in different economies on CO2 emission reduction. The feasible generalized least squares (FGLS) regression model, as well as the random and fixed effects model with regards to Durbin-Wu-Hausman, are used to analyze the data. The generalized method of moments (GMM) is also adopted as the robustness method. Our findings show that for emerging economies, all major activities of the financial sector aggravated CO2 emission levels in all major CO2 emitting economic sectors. The developing and developed economies also show a similar trend. In the emerging economies, virtually all activities carried out by the financial sector have a significant negative impact on CO2 emissions at the 1% or 5% significance level, thereby hampering CO2 emission mitigation efforts. However, increased long-term bank lending to non-major economic sectors is found to alleviate CO2 emissions in developing economies. This is also the situation with increased numbers of import insurance. Meanwhile, CO2 emissions are found to decrease with increased net portfolio investments and numbers of insurance on exports. These findings not only imply that financial sector activities play a fundamental role in CO2 emission mitigation but also serve as a reminder for financial policymakers that the decisions they make have an inevitable impact on the attainment of carbon neutrality in their economies.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2cb87ad78a429f207ef96440ff5dfc66",
  "timestamp": "2025-05-15T01:25:23.255278"
}