{
  "id": 9042,
  "title": "Predictors of persistent sleep problems among older disaster survivors: a natural experiment from the 2011 Great East Japan earthquake and tsunami",
  "abstract": "Study Objectives: To examine prospectively the associations of disaster experiences and social support with sleep problems in older adults. Methods: Data came from a natural experiment caused by the 2011 Great East Japan earthquake and tsunami. Participants in an ongoing prospective cohort (3547 Japanese individuals aged 65 years or older) were inadvertently exposed to the disaster due to their residential location (Iwanuma city) after the 2010 baseline survey. We conducted a follow-up survey in 2013 to inquire about disaster-related experiences and short sleep duration, sleep insufficiency, poor sleep quality, insomnia symptoms, and sleep medication use. Poisson regression models adjusted for baseline socio-demographic and lifestyle covariates. Results: Financial hardship predicted increased risks of short sleep duration (relative risk [RR] = 1.40; 95% confidence interval [CI] [1.03, 1.90]), sleep insufficiency (RR = 1.29; 95% CI [1.01, 1.66]), poor sleep quality (RR = 1.47; 95% CI [1.26, 1.70]), and insomnia symptoms (RR = 1.13; 95% CI [1.01, 1.28]). Home destruction predicted sleep medication use while health care disruption predicted poor sleep quality. Loss of close relatives or friends did not predict any sustained sleep problems. Additionally, having instrumental support reduced risks of all sleep problems while having emotional support reduced risk of poor sleep quality. Conclusions: Approximately 2.5 years after the disaster, older survivors' sleep problems were more durably linked to material aspects of disaster damage than to loss of loved ones. Findings could inform targeted recovery efforts for groups with greatest need to promote older survivors' sleep health and overall well-being. Statement of Significance Sleep problems are among the most prevalent, yet understudied, health concerns of disaster survivors. We investigated prospective determinants of sleep problems among older survivors. Data from a natural experiment in Japan allowed us to evaluate the unique associations of different types of disaster damage and social support with several dimensions of sleep. Sleep problems were predicted by material impacts of disaster damage, but not loss of close relatives or friends (from which survivors seemed to have recovered). Instrumental support was more relevant to sleep problems than emotional support. Findings could inform interventions to alleviate survivors' sleep problems and subsequent health outcomes, which could assist in disaster preparedness and recovery. Future research should explore the associations using objective measures of sleep.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2cf08289816de504f555fdcd3321dc7d",
  "timestamp": "2025-05-15T03:24:54.929215"
}