{
  "id": 8852,
  "title": "Short-term air pollution exposure is associated with hospital length of stay and hospitalization costs among inpatients with type 2 diabetes: a hospital-based study",
  "abstract": "Air pollution is a risk factor for type 2 diabetes (T2D), exerting heavy economic burden on both individuals and societies. However, there is no apparent report regarding the influence of air pollutants such as particulate matter (PM2.5 and PM10), sulfur dioxide (SO2), carbon monoxide (CO), nitrogen dioxide (NO2), and ozone (O-3) on financial burden to individuals and societies suffering from T2D. This study aimed to determine whether short-term (no more than 16d) air pollution exposure was associated with T2D-related length of stay (LOS) and hospitalization expenses incurred by patients. This investigation examined 2840 T2D patients hospitalized from December 17, 2013 to May 31, 2016 in China. Multiple linear regression analysis was applied to determine the association between short-term (no more than 16d) ambient air pollution, LOS, and hospitalization expenses, controlling for age, gender, ethnicity, marital status, and weather conditions. Sulfur dioxide (SO2) and carbon monoxide (CO) were significantly positively while nitrogen dioxide (NO2) was negatively associated with presence of T2D, LOS, and expenses. A 10-g/m(3) rise in 16-d (lag 0-15) average concentrations of SO2 and CO prior to hospitalization was correlated with a significant elevation in LOS and elevation in expenses in T2D patients. However, a 10-g/m(3) rise in 16-d average NO2 was associated with marked negative alterations in LOS and hospital costs in T2D patients. Taken together, data demonstrate that exposure to air pollutants impacts differently on LOS and hospitalization costs for T2D patients. This is the first apparent report regarding the correlation between air pollution exposure and clinical costs of T2D in China. It is of interest that air pollutants affected T2D patients differently as evidenced by LOS and clinical expenses where SO2 and CO exhibited a positive adverse relationship in contrast to NO2.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d03af42559a11507e447e3cba1a1f39",
  "timestamp": "2025-05-15T03:22:57.944854"
}