{
  "id": 6357,
  "title": "The effect of psychosocial stress on single mothers' smoking",
  "abstract": "Background: Evidence suggests an increased risk of smoking among single mothers as compared to their cohabitating counterparts. This article examines the role of psychosocial stress in mediating the relationship between single motherhood and smoking. Methods: Data were derived from a cross-sectional population based sample of German women (n = 3129) with underage children (0-18 years of age). Perceived stress was measured with 13 items covering socioeconomic as well as family-and parenting-related stressors. According to Baron and Kenny (1986) a series of logistic regression models was applied to investigate the role of psychosocial stress as a mediator on the relationship between single motherhood and smoking. Results: About 44.0% of single mothers smoked daily, whereas only 26.2% of cohabitating mothers did. Single mothers reported more stress related to their economic situation, occupation and family than partnered mothers. Out of the original 13 stressors only 'conflicts with the partner or ex-partner' and 'financial worries' remained significant in explaining single mothers' higher risk of smoking. Against expectation, stress due to household requirements and family demands was associated with lower odds of single mothers' smoking. After controlling for psychosocial stress, the odds ratio of single mothers' moderate smoking (< 20 cig./day) decreased slightly from 1.75 to 1.66 (explained fraction XF = 12.0%) and with respect to heavy smoking (>= 20 cig./day) more pronounced from 2.56 to 2.01 (XF = 35.3%). Conclusions: It can be stated that single mothers' heavy more than moderate smoking appeared to be mediated by perceived psychosocial stress. Out of all stressors considered, financial worries were of paramount significance in explaining single mothers' heavy smoking while some family-related stressors rather appeared to keep single mothers from smoking. Overall, a higher stress exposure explains partly but not sufficiently single mothers' increased smoking rates.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d05dcdc13bf6a3edfd068f1210b74d6",
  "timestamp": "2025-05-15T02:57:07.780739"
}