{
  "id": 5329,
  "title": "The performance generating limitations of the relationship-banking model in the digital era - effects of customers' trust, satisfaction, and loyalty on client-level performance",
  "abstract": "Purpose - This paper investigates the viability of the relationship-oriented business model. Specifically, it examines the effects of bank customers' satisfaction, loyalty, and trust in bank advisors on two client-level performance measures; client-level non-interest revenue, and client-level revenue on net interest spread. It further investigates how effects are moderated by differences in clients' risk tolerance and financial literacy. Design/methodology/approach - The findings are based on analyses of a data set that combines survey data (collected from 13,525 bank clients in 2013) with bank record data from each respondent. The cross sectional data is analyzed using OLS-regression and structural equation modeling. Findings - Overall, the findings are that the relationship banking model generates non-interest revenue, but not revenue on net interest spread. In more detail, findings show that trust has a positive direct effect on client-level non-interest revenue. Furthermore, trust mediates the entire effect of satisfaction and loyalty on client-level non-interest revenue. Customer satisfaction and loyalty do not lead to enhanced client-level non-interest revenue if there is little trust in bank advisors. Findings further show that the relevance of trust for non-interest revenue is higher for clients with high risk tolerance and high financial literacy. Satisfaction, loyalty, and trust have no effect, however, on client-level revenue on net interest spread. Originality/value - While previous literature mainly has used subjective intentions (e.g., repurchase behavior) as operationalization of performance, this paper combines subjective survey data and objective performance data, allowing the investigation of how the customer relationship model affects actual performance. Furthermore, the paper investigates the relational banking model's effect on non-interest and net interest spread revenue, and we show that the relational banking model generates only non-interest revenue, and not net interest spread revenue. The fine-grained client-level data also allows the investigation on how the effect of trust on client-level performance differs among client groups with different cognitive characteristics (i.e., risk tolerance and financial literacy).",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d06540cab3b2c1e43f475d85aa98dc5",
  "timestamp": "2025-05-15T02:46:44.879835"
}