{
  "id": 1675,
  "title": "Prediction of credit card defaults through data analysis and machine learning techniques",
  "abstract": "Bank of recent year plays a significant role in the development of the nation. The bank offers a few things that are directly dependent on any nation's general economic and financial condition. Banking efficiency leads to the business, growth in the industry, economic growth, and support for the common man with savings, improving financial security. Bank Loan has been one of the fastest-growing financial services banks in recent years. However, with the increasing number of bank loan users, banks face an everincreasing rate of bank loan decline. This program is offered primarily to a person or company of higher value than another. Under this scheme, a small amount can be provided as a cash transfer or electronic transfer to the debtor when they can be in demand. Few of them have not returned a set amount in time, so sometimes they do not. This situation creates a problem for the bank. Then with the help of historical data, the need to predict bank loan error can be determined. As such, machine learning may offer options for addressing the current issue and handling credit risk. This analysis has the function of forecasting the inability to pay the bank loan. The study found more than 10 million Bank of Taiwan records. Analysis of the logistic regression hits the relation between the class variable and the set of independent variables. The primary analysis produces exploratory views of data correctly. Further, this paper used ML algorithms to get predictions with accuracy to detect the default users based on transactional data.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d0e8b4a1e3d33c03d03d939a5702dbd",
  "timestamp": "2025-05-15T02:06:22.411382"
}