{
  "id": 4572,
  "title": "How Did Employment and Financial Strain Affect the Self-rated Health of Lone Mothers Around the Time of the Economic Crisis? A Cross-sectional Comparison of the United Kingdom and Sweden",
  "abstract": "Lone mothers face higher risk of poor self-rated health (SRH) than coupled mothers, partly explained by financial strain, non-employment, and welfare context. Comparing the United Kingdom and Sweden, we sought to determine how the economic crisis of 2008 affected the inequality in lone and coupled mothers SRH and what socioeconomic factors impacted this. Survey data was divided into periods corresponding to before, during, and after the economic crisis. Logistic regression was used to evaluate the impact of socioeconomic factors. Financial strain explained 70%-80% of the excess risk for poor health among Swedish lone mothers and 40% of those in the United Kingdom. Controlling for background and socioeconomic factors eliminated the health inequality among Swedish mothers. In the United Kingdom this inequality remained and may reflect the impact of social mechanisms such as stigma. Converse to what was expected, we did not observe significant variation over time in factors affecting SRH, nor did we find conclusive evidence of the impact of the economic crisis on the SRH of lone mothers. Factors that may account for these counterintuitive results, including retrenchment of the Swedish welfare state, economic lag, and reduction in overall inequality in health, are discussed.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d27dd8853459a0713f94a042fd9f2ad",
  "timestamp": "2025-05-15T02:38:56.235712"
}