{
  "id": 8294,
  "title": "Nationwide secondary overtriage in level 3 and level 4 trauma centers: are these transfers necessary?",
  "abstract": "Background: Secondary overtriage (SO) refers to the interfacility transfer of trauma patients who are rapidly discharged home without surgical intervention by the receiving institution. SO imposes a financial hardship on patients and strains trauma center resources. Most studies on SO have been conducted from the perspective of the receiving hospital, which is usually a level 1 trauma center. Having previously studied SO from the referring rural hospital's perspective, we sought to identify variables contributing to SO at the national level. Methods: Using data from the 2008-2012 National Trauma Data Bank, we isolated patients transferred to level 1 trauma centers who were: (1) discharged home within 48 h and (2) did not undergo any surgical procedure. This population was subsequently compared with similar patients treated at and discharged directly from level 3 and 4 centers. Multivariate logistic regression analysis was used to isolate variables that independently influenced a patient's risk of undergoing SO. Injury patterns were characterized by use of subspecialty consultants. Results: A total of 99,114 patients met inclusion criteria, of which 13.2% were discharged directly from level 3 or 4 traumacenters, and 86.8% of them were transferredtoa level 1 trauma center before discharge. The mean Injury Severity Score of the nontransfer and transfer groups was 5.4 perpendicular to 4.5 and 7.3 perpendicular to 5.7, respectively. Multivariate regression analysis showed that Injury Severity Score > 15, alcoholism, smoking, drug use, and certain injury patterns involving the head, vertebra, and face were associated with being transferred. In this minimally injured population, factors protective against transfers were: age > 65 y, female gender, systolic blood pressure <80, a head computed tomography scan and orthopedic injuries. Conclusions: SO results from the complex interplay of variables including patient demographics, facility characteristics, and injury type. The inability to exclude a potentially devastating neurologic injury seems to drive SO. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d2776ba2eb78f7ad16194cc73297c13",
  "timestamp": "2025-05-15T03:17:21.559953"
}