{
  "id": 7469,
  "title": "Self-reported depression among migrant and native populations in Greece in times of crisis",
  "abstract": "Background: Recent evidence indicates to the alarming increase of depression, especially in Southern European countries. According to the literature, depressive symptoms are strongly associated with socioeconomic factors, while the prevalence of depression significantly differs by gender. Several scholars point out that many of the risk factors for self-reported depression increase during an economic crisis. These studies, however, mostly overlook the fact that the impact of these factors may vary between natives and migrants. Methods: Using data from the MIGHEAL study, we examine the variation of self-reported depression by migrant status and gender in Greece during the crisis. We also investigate the association of socioeconomic status, family-related factors, social trust and perceived discrimination with self-reported depression. Separate multiple linear regression models are fitted across three examined groups (Greeks, Albanians and migrants from other countries) as well as for Greek males and females. Results: Our findings indicate the mixture of the determinants of self-reported depression by both migrant status and gender. Women report higher rates of self-reported depression than men, as do natives compared to migrants, while getting older is associated with higher levels of depression in both genders and all three citizenship groups. Further, higher socioeconomic position is associated with lower levels of depression, especially in the case of Greek males, while financial strain appears to be a significant determinant of self-reported depression for both native and migrant populations. Conclusions: Our analysis does not confirm previous evidence that migrants are at an increased risk for depression. Age, gender, perceived discrimination and subjective general health appear to be more decisive determinants of self-reported depression than migrant background. Low socioeconomic status seems to be a risk factor for depression only in the case of Greeks.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d46e1828dd1990ea160bc582d7ef3bc",
  "timestamp": "2025-05-15T03:09:07.225191"
}