{
  "id": 850,
  "title": "Fusing Sell-Side Analyst Bidirectional Forecasts Using Machine Learning",
  "abstract": "Sell-side analysts' recommendations are primarily targeted at institutional investors mandated to invest across many companies within client-mandated equity benchmarks, such as the FTSE/JSE All-Share index. Given the numerous sell-side recommendations for a single stock, making unbiased investment decisions is not often straightforward for portfolio managers. This study explores the use of historical sell-side recommendations to create an unbiased fusion of analyst forecasts such that bidirectional accuracy is optimised using random forest, extreme gradient boosting, deep neural networks, and logistic regression. We introduced 12-month rolling features generated from standard sell-side recommendations, such as analyst coverage, point and directional accuracy, while avoiding forward-looking biases. We introduce a novel AI analyst by fusing forecast features from numerous analysts using machine learning algorithms. We observed the added benefits of using these features from more than one analyst by systematically generating unbiased and incrementally better prediction accuracy from publicly available sell-side recommendations, with the Random forest algorithm showing the highest relative performance. In highly volatile sectors, like resources, the machine learning algorithms perform better than in low volatility sectors, suggesting the importance of rolling features in bi-directional prediction in the presence of high volatility. Using feature importance, we observe the incremental contribution of rolling features, showing the relationships between analyst coverage, volatility, and bidirectional forecast accuracy. Furthermore, parameters from logistic regression identify volatility features and initial and target price as some of the essential features when modelling analysts' directional predictions.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d5c7af1a5375a2ea6a39b32f1972879",
  "timestamp": "2025-05-15T00:49:03.104146"
}