{
  "id": 701,
  "title": "Harnessing the power of machine learning analytics to understand food systems dynamics across development projects",
  "abstract": "Advances in machine learning and Big Data research offer great potential for international development agencies to leverage the vast information generated from accountability mechanisms to gain new insights, providing analytics that can improve decision-making. From a knowledge management perspective, project operational reports are crucial historical records as they tell the story of a project, compile data generated throughout the project cycle, discuss achievements of intended development objectives, and provide learning that can inform future operations. Taking the International Fund for Agricultural Development (IFAD) as a case study, this paper explores how machine learning can harness existing project data to uncover latent information about food systems dynamics, which is already present in documentation but has not yet been investigated. Specifically, we aim to provide evidence on the evolution of food system dimensions within IFAD-funded projects through the application of supervised text mining, network analysis and LASSO regression to project documents collected from hundreds of projects spanning the whole of IFAD's investment portfolio in the 1981-2019 interval. Findings show an increase in reporting against food system dimensions and consolidate the applicability of machine learning analytics to uncover historical trends about international agencies' activities and accelerate knowledge generation around strategic themes.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d5e3a77a015ee713d8a8ecb476ce478",
  "timestamp": "2025-05-15T00:47:18.484094"
}