{
  "id": 6267,
  "title": "Domestic and Global Causes for Exchange Rate Volatility: Evidence From Turkey",
  "abstract": "Understanding which factors influence exchange rate movements is important for understanding economic development, trade patterns, investment decisions, and for designing economic policies. In this study, we allow for monetary, domestic and global financial variables to assess the relevant importance of each of the variables to exchange rate volatility in the case of Turkey. The paper investigates the dynamics of exchange rate volatility of the Turkish lira in a complementary perspective by employing both Generalized autoregressive conditional heteroskedasticity (GARCH) method and Lyapunov exponents over the period from March 1, 2019 to November 11, 2021. Firstly, decomposing the impact of domestic and global financial variables, the results of the GARCH model indicate that the exchange rate volatility is affected by Volatility index (VIX) and Credit default swaps (CDS). This result suggests that the exchange rate shocks experienced are mainly caused by global factors, therefore policymakers should focus on volatility spillovers caused by global financial markets. Secondly, detected positive maximal Lyapunov exponent shows that complexity in foreign exchange markets has been increased, market expectations lead to multiple-equilibria and diverging volatility eventually will generate recurrent spikes in currency value. These complementary findings have important implications for interventions of Central banks and preventing systemic risks, as well as portfolio and risk management.JEL Classification: C32, G14, G15. The paper investigates the dynamics of exchange rate volatility of Turkish Lira in a complementary perspective by employing both Generalized autoregressive conditional heteroskedasticity (GARCH) method and Lyapunov exponents over the period from March 1, 2019 to November 11, 2021. Firstly, decomposing the impact of domestic and global financial variables, the results of the GARCH model indicate that the exchange rate volatility is affected by Volatility index (VIX) and Credit default swaps (CDS).The importance of the subject: The exchange rate dynamics are known to influence financial stability, which has been targeted as a policy implication simultaneous to macroeconomic stability. Moreover, the exchange rate volatility stands out as the main source of financial vulnerability and the loss of macroprudential stability. Especially in emerging markets, the exchange rate movements affect sustainability of many other macroeconomic parameters, such as interest rates, trade balance, output and asset prices.Contribution: Domestic and global financial causes for exchange rate volatility are identified. Volatility dynamics were decomposed by GARCH (1,1) method and global effects were identified. Chaotic dynamics are shown in Turkish foreign exchange rate markets, violating Efficient market hypothesis.Methods: Stochastic time series analysis methods are applied. First, GARCH (1,1) is used. Second, we reconstruct phase space in order to observe multiple equilibria embedded in financial time series. We obtain multidimensional embedded space and then we compute the Lyapunov exponents (LE) of the associated dynamical system. The Tisean Package introduced by Hegger et al. and R programme is used for computations.This result suggests that the exchange rate shocks experienced are mainly caused by global fact.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d75e1f9e9f2f7d7e5d0d131b01f0260",
  "timestamp": "2025-05-15T02:56:37.263198"
}