{
  "id": 3858,
  "title": "A multiobjective optimization approach for threshold determination in extreme value analysis for financial time series",
  "abstract": "The literature on the extreme value theory threshold optimization problem for multiple time series analysis does not consider determining a single optimal tail probability for all marginal distributions. With multiple tail probabilities, their discrepancy results in a differing number of exceedances, which may favour a particular marginal series. In this study, we propose a single optimal tail probability by integrating trade-offs among multiple time series within an MOO framework. Mathematically, our approach links the peaks-over-threshold technique and goal programming technique by developing a set of regression functions, which represent continuous paths of possible tail areas for multiple time series, and we formulate them at the desired levels within a multiobjective optimization framework. The optimal solution is found as the minimum Chebyshev variant weighted value. Our approach advances the development of the peaks-over-threshold method by considering the characteristics of a group of time series collectively instead of independently. The proposed optimal tail probability can be considered an optimal reference point for practical risk investment portfolio analysis that employs an identical tail size across multiple time series data. The daily log returns of four U.S. stock market indices, namely, S&P 500, NASDAQ Composite, NYSE Composite, and Russell 2000, from 1 July 1992 to 30 June 2022 are studied empirically.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d750e8ce480b51e866d8dbb95bab595",
  "timestamp": "2025-05-15T01:21:41.323637"
}