{
  "id": 7087,
  "title": "The Role of Incentive Design, Incentive Value, Communications Strategy, and Worksite Culture on Health Risk Assessment Participation",
  "abstract": "Purpose. To examine the impact of financial incentives, communications strategy, and worksite culture on health risk assessment (HRA) participation, rates. Design. A cross-sectional study design was used to examine factors that influence employee participation, including incentive Value, incentive design, strategy, and worksite culture. Setting. Large private sector and public-sector employers. Participants. Thirty-six employers (n = 559,988 employees) that provided financial incentives to promote employee HRA participation. Intervention. Organizations implemented the HRA as part of a mort comprehensive worksite health promotion strategy that included follow-up interventions and a variety of other components. The primary outcome of interest was employee HRA participation. Measures. Information on program design and structure, as well as on HRA eligibility and participation, was collected for each organization. via. standard client report and semi-structured interviews with, account managers. General linear regression model were used to examine the extent. to which factors influence HRA participation, independently and when controlled for other factors. Results. Incentive value (r(2) = .433; p < .000), benefits-integrated incentive design design (r(2) = .184; p =.009), culture (r(2)= .113; p =.045), and communications strategy (r(2) = .300; p = .001) had positive bivariate associations with HRA participation rates. When all factors were included in the model, incentive value (p = .001) and communications strategy (p = .023) were significantly associaled with HRA participation. Variance accounted for by all factors combined was R-2 =.584. Conclusion. This study suggests that incentive value, incentive type, supportive worksite culture, and comprehensive communications strategy may all play a role in increasing HIM participation. (Am J Health Proniot 2009,-23[5]:343-352.)",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d80f264118cd1fe9713f621bcad4050",
  "timestamp": "2025-05-15T03:05:03.470851"
}