{
  "id": 13,
  "title": "An Ensemble Learning-Enhanced Smart Prediction Model for Financial Credit Risks",
  "abstract": "The credit risk assessment acts as an important part in daily affairs for financial institutions. But in the era of big data, the growing business volume makes it an urgent demand to develop digital ways of credit risk assessment. Currently, the machine learning is universally employed to establish various data-driven models for this purpose. However, machine learning models generally suffer from limited ability of feature representation and robustness, and cannot deal with more complex financial security scenarios. To deal with this issue, this work introduces ensemble learning to construct a stronger credit risk prediction model via integration of several basic machine learning models. Thus, an ensemble learning-enhanced smart prediction model for financial credit risk is proposed in this paper. Three classification-based machine learning models (support vector machine, artificial neural network and radial basis function) are selected as the basic classifiers, and voting strategy is utilized to integrate them into a novel strong classifier. A real-world financial credit dataset released by a Chinese commercial bank was selected as the experimental scenario. The obtained results show that the proposal has better prediction accuracy compared with basic machine learning models without ensemble learning.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d84f6615838ce17d8058cb4b8ee4675",
  "timestamp": "2025-05-15T01:46:03.754242"
}