{
  "id": 303,
  "title": "Data-driven application of MEMS-based accelerometers for leak detection in water distribution networks",
  "abstract": "Water scarcity is a global concern; 68 countries are facing extremely-high to medium-high risk of water stress. In this era of crisis, where water conservation is an absolute necessity, the water distribution networks (WDNs) globally are experiencing significant leaks. These leaks cause tremendous financial loss and unacceptable environmental hazards, thus further aggravating the water scarcity situation. To minimize such damage, the adoption of advanced technologies and methodologies for leak detection in the WDNs is absolutely necessary. In this regard, we have investigated the application of cost-effective MEMS-based accelerometers. Experiments were conducted on real networks (metal and non-metal pipes), over the course of ten months, and the acquired acceleration signals were analyzed using a monitoring algorithm. Monitoring index efficiencies and standard deviations for every leak and no-leak case was extracted. Two individual [KNN and Decision Tree] and two ensembles [Random Forest and Adaboost (Decision Tree)] based machine learning models were developed for the accurate classification of the leak and no-leak cases using extracted features; and separate models were developed for metal and non-metal pipes. Random Forest outperformed the other machine learning models and the overall accuracy reached 100% for metal pipes and 94.93% for non-metal pipes. The machine learning models were further validated using unseen/unlabeled cases and were highly effective in detecting leaks. This study demonstrated the applicability of MEMS-based accelerometers for leak detection and established real network-based machine learning models thereby contributing to the research scarcity in this important area. (C) 2021 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d87387e47150c49952c52ec23daa258",
  "timestamp": "2025-05-15T01:49:04.681202"
}