{
  "id": 2010,
  "title": "An integrated Bayesian-Game theoretic approach for product portfolio planning of a multi-attributed product in a duopolistic market",
  "abstract": "The focus of this paper is to develop a Bayesian-Game theoretic framework for product portfolio planning problem thereby aiding the manufacturers operating across variety of product industries to offer the right product portfolio set. The problem is modelled for a duopolistic market and the product type considered is characterised by multiple product attributes having varying attribute levels. Initially, feasible product portfolio candidates are generated in terms of combinations of different product attributes and their attribute levels employing the attribute compatibility constraint. Different product portfolio sets thus generated function as different product offering strategies of the two manufacturers. Thereafter, employing the function-based cost-estimating framework and multi-linear regression methodology, manufacturing costs and product premiums, respectively, are estimated for different product portfolios. Utilising the Bayesian risk network, the purchase probabilities are estimated in high, medium and low-risk states for various product portfolios. The purchase probability is made a function of price and functionality. The purchase probabilities thus obtained acts as an input to the final pay-off calculation. Finally, employing these pay-off values, product offering scenarios are populated for the two manufacturers both in equilibrium and non-equilibrium state.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2d9fdd5ca9d8b161db3c1636b77df97d",
  "timestamp": "2025-05-15T01:02:10.197566"
}