{
  "id": 5328,
  "title": "Care-Seeking Patterns and Direct Economic Burden of Injuries in Bangladesh",
  "abstract": "This study provides a comprehensive review of the care-seeking patterns and direct economic burden of injuries from the victims' perspective in rural Bangladesh using a 2013 household survey covering 1.17 million people. Descriptive statistics and bivariate analyses were used to derive rates and test the association between variables. An analytic model was used to estimate total injury out-of-pocket (OOP) payments and a multivariate probit regression model assessed the relationship between financial distress and injury type. Results show non-fatal injuries occur to 1 in 5 people in our sample per year. With average household size of 4.5 in Bangladesh-every household has an injury every year. Most non-fatally injured patients sought healthcare from drug sellers. Less than half of fatal injuries sought healthcare and half of those with care were hospitalized. Average OOP payments varied significantly (range: $8-$830) by injury type and outcome (fatal vs. non-fatal). Total injury OOP expenditure was $355,795 and $5000 for non-fatal and fatal injuries, respectively, per 100,000 people. The majority of household heads with injuries reported financial distress. This study can inform injury prevention advocates on disparities in healthcare usage, OOP costs and financial distress. Reallocation of resources to the most at risk populations can accelerate reduction of preventable injuries and prevent injury related catastrophic payments and impoverishment.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2da4755b75d4d616b8bca8916130758a",
  "timestamp": "2025-05-15T02:46:44.876352"
}