{
  "id": 4193,
  "title": "Examining the relations between science attitudes, logical thinking ability, information literacy and academic achievement through internet assisted chemistry education",
  "abstract": "Homework is often assigned in Chemistry classes to facilitate students' learning. The main purpose of this study is to investigate the relations between students' science teaching attitude, logical thinking ability, information literacy self efficacy and academic achievement through internet assisted chemistry education. The study was carried out in the spring term of the 2006-2007 academic years for 10 weeks and 61 prospective science teachers enrolled in the science teacher education program at Marmara University constituted the study groups of the research. For this purpose, the students were randomly split into two groups. Group-1 (N=30) developed a teaching website for electrochemistry and Group-2 (N=31) prepared teaching portfolio for the same subject as homework. Data were collected by the Test of Academic Achievement, the Turkish version of the Science Teaching Attitude Scale II (STAS-II) revised by Moore and Foy, logical thinking ability test and information literacy self efficacy scale. Pearson Moments Correlation coefficient was used for the analysis of the data to specify the relations between the students' science teaching attitude, logical thinking ability, information literacy self efficacy and chemistry achievement. In addition to that, to obtain the most suitable regression equivalent in explaining the students' chemistry achievement, multiple regression analysis was used. At the end of the study for the first group; it was revealed that the students' chemistry achievement significantly correlates with their science teaching attitude (r=0.663; p<0.01) and logical thinking ability (r=0.817; p 0.01). But there is no correlation between the students' chemistry achievement and information literacy self efficacy (r=-0.128; p>0.05). Also, these variables significantly predict the students' chemistry achievement. The independent variables (science teaching attitude and logical thinking ability) explain about 78.4% of the total variance of the chemistry achievement. On the other hand for the second group, the students' chemistry achievement significantly correlates with their information literacy self efficacy (r=0.480; p<0.01). But there is no correlation between the students' chemistry achievement and science teaching attitude (r=0.181; p>0.05) and logical thinking ability (r=0.293; p>0.05). Also, information literacy self efficacy significantly predict the students' chemistry achievement and explains about 20.3% of the total variance of the chemistry achievement. Acknowledgement: This study was supported by Marmara University Scientific Research Projects Commission. Project no: EGT-DKR-250405-0102 (C) 2009 Elsevier Ltd. All rights reserved",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dadb6c716ac7031b557c8f470c85406",
  "timestamp": "2025-05-15T01:24:51.392062"
}