{
  "id": 7100,
  "title": "Prevalence of psychological symptoms and their correlates among physiotherapy clinical students: A cross-sectional study",
  "abstract": "Background: Mental health in medical students is well researched, with physiotherapy students receiving less attention even though psychiatry is a recognised specialty within physiotherapy.Objectives: To assess the prevalence and correlates of depression, anxiety and stress among physiotherapy clinical students.Methods: A descriptive cross-sectional study design was employed on 402 physiotherapy clinical students aged 17-40 years using a convenience sampling method. The data were collected using the self-administered 42-items Depression, Anxiety and Stress scale (DASS) and the data were analysed using a Chi-square test and binary logistic regression analysis.Results: The prevalence of depression, anxiety and stress among these students was 79.9%, 85.6% and 81.6%, respectively. The results indicate that financial status and social life influenced depression by 20.6% (odds ratio [OR] [95%] = 1.206 [1.110, 1.311]) and 36% (OR [95%] = 1.360 [1.050, 1.764]), respectively. Fear of repeating a class influenced anxiety by eight times (OR [95%] = 8.330 [6.643, 10.422]). Fear of repeating a class, financial status and Conclusion: Our study concluded that there was a high prevalence of depression, anxiety and stress among physiotherapy clinical students. These outcomes suggest that more attention needs to be given to improving physiotherapy clinical students' mental health, which will ultimately improve learning outcomes. Clinical implications: The long-term effects of psychological distress could potentially impact students' academic performance. It may also have long-lasting effects after graduation. Therefore, students who are at risk of developing psychological symptoms are needed to be thoroughly examined and then receive early required interventions. Keywords: prevalence; psychological symptoms; depression; anxiety; stress; physiotherapy students.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2db74efdc81944644b7618f41f4903e9",
  "timestamp": "2025-05-15T03:05:03.542859"
}