{
  "id": 4098,
  "title": "Association of patient-reported financial barriers with healthcare utilization among Medicare beneficiaries with a history of cancer",
  "abstract": "PurposeWe examined characteristics associated with financial barriers to healthcare and the association of financial barriers with adverse healthcare events among US adult cancer survivors enrolled in Medicare.MethodsWe used nationally representative Medicare Current Beneficiary Survey data (2011-2013, 2015-2017) to identify adults with a history of non-skin cancer. We defined financial barriers as cost-related trouble accessing and/or delayed care in the prior year. Using propensity-weighted multivariable logistic regression, we examined associations between financial barriers and adverse healthcare events (any ED visits, any inpatient hospitalizations).ResultsOverall, 11.0% of adult Medicare beneficiaries with a history of cancer reported financial barriers in the prior year, with higher burden among beneficiaries < 65 years of age vs. >= 65 (32.5% vs. 8.2%, p < 0.0001) and with annual income < $25,000 vs. >= $25,000 (18.1% vs. 6.9%, p < 0.0001). In bivariate models, financial barriers were associated with a 7.8 percentage point (95% CI: 1.5-14.0) increase in the probability of ED visits. In propensity-weighted models, this association was not statistically significant. The association between financial barriers and hospitalizations was not significant in the overall population; however, financial barriers were associated with a decreased probability of hospitalization among Black/African American beneficiaries.ConclusionsDespite Medicare coverage, beneficiaries with a history of cancer are at risk for experiencing financial barriers to healthcare. In the overall population, financial barriers were not associated with ED visits or hospitalizations.Implications for Cancer SurvivorsPolicies limiting Medicare patient out-of-pocket spending and care models addressing health-related social needs are needed to reduce financial barriers experienced.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2db81e983be2910572deb7a270226c94",
  "timestamp": "2025-05-15T02:33:03.500684"
}