{
  "id": 8095,
  "title": "Prognostic Significance of Blood Parameters in COVID-19 Pneumonia",
  "abstract": "Objective: We aimed to predict disease severity by studying the admission blood parameters of patients diagnosed with novel coronavirus disease 2019 (COVID-19). Materials and Methods: We retrospectively reviewed the medical data of 217 patients diagnosed with COVID-19 infection and 86 sex-matched and age-matched healthy controls without this infection. The patient group was divided into the following two subgroups: the severe (n=93) group and the non-severe (n=124) group. We compared the demographic characteristics, admission complaints, and admission blood parameters of the patient group with those of the control group. We also compared the above-mentioned parameters of the two patient subgroups. Results: The patient group had a significantly lower white blood cell count, lymphocyte count, monocyte count, and platelet count (p=0.002, p<0.001, p<0.001, and p<0.001, respectively) and a significantly higher C-reactive protein level (p<0.001) than the control group did. The leucocyte count, neutrophil count, neutrophil to lymphocyte ratio (NLR), platelet to lymphocyte ratio (PLR), and ferritin level were significantly higher in the severe disease subgroup than those in the non-severe subgroup (p<0.001). The lymphocyte count and lymphocyte to monocyte ratio (LMR) were significantly lower in the severe disease subgroup than those in the non-severe subgroup (p<0.001). We performed a logistic regression analysis and obtained the odds ratios (OR) of several factors. This analysis showed that NLR was positively correlated with the COVID-19 risk (adjusted OR 1.438, p=0.012). However, the association of PLR and LMR with COVID-19 risk remained unclear. Conclusion: The ability to predict prognosis using blood parameters that are routinely assessed at admission can save considerable time and financial resources. We believe that we can predict the prognosis of COVID-19 patients using the admission NLR levels.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dc2895147fd1bce5b30b20ac1e5b6cc",
  "timestamp": "2025-05-15T03:15:09.387564"
}