{
  "id": 3959,
  "title": "Determinants of income diversification in flood-prone rural Pakistan",
  "abstract": "Pakistan is one of the most vulnerable countries to climate change. The households in rural Pakistan predominantly rely on the agriculture sector which is why their livelihood is threatened by floods. Considering income diversification as a risk-spreading livelihood strategy, this study examines the determinants of income diversification in the flood-prone district Dadu in Sindh province of Pakistan. The analysis is based on the data from a primary survey of 350 randomly selected households. The list of determinants is taken from the literature and the Ordinary Least Squares method is used for estimation of the regression coefficients. The results show that households with a relatively higher number of earning members and those headed by male or educated members are more likely to have a diversified income portfolio. The moderation analysis shows that households headed by educated male members and educated older members are more likely to diversify than the uneducated ones. Contradicting the findings of the literature, poverty is not a significant determinant of income diversification in Dadu which suggests that lack of economic opportunities and awareness might be more important determinants of diversification than wealth in Dadu and requires further research. The development policy in rural Pakistan should focus on increasing access to economic opportunities, creating awareness about income diversification strategies, and investing in the human capital of the rural population to improve the sustainability of their livelihood.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dc3a4e6ac46318cf2b1fe36c9a8d681",
  "timestamp": "2025-05-15T01:22:39.349041"
}