{
  "id": 9403,
  "title": "Relationships between Frailty and the Risk of Glaucoma in Middle-aged and Older Adults",
  "abstract": "Purpose Increased frailty in older individuals increases health risks, but its relationship with glaucoma, the leading cause of irreversible blindness in middle-aged and older adults, is unclear. We investigated the association between frailty and glaucoma in a large-scale representative sample and explored possible causal relationships. Design Combined cross-sectional and Mendelian randomization (MR) study. Participants In the cross-sectional analysis, we included 5744 participants of the US National Health and Nutrition Examination Surveys 2005 to 2008 >= 40 years of age. For the MR analysis, frailty genome-wide association study (GWAS) data were sourced from a UK Biobank and TwinGen meta-analysis, and GWAS data on glaucoma subtypes were derived from FinnGen. Methods According to the 49-item frailty index, we classified participants into nonfrail (<= 0.10), prefrail (0.10-0.21), and frail (> 0.21) groups. Using survey-weighted logistic regression models adjusted for multiple covariates, we explored the association between frailty and glaucoma. We further assessed causation using MR. Main Outcome Measures The associations between different levels of frailty (nonfrail, prefrail, and frail) and glaucoma, as well as causal relationships between genetically predicted frailty and various subtypes of glaucoma (primary open-angle glaucoma [POAG], primary angle-closure glaucoma [PACG], normotensive glaucoma [NTG], exfoliation glaucoma, and suspected glaucoma). Results After adjusting for covariates, higher frailty levels were significantly associated with glaucoma in frail individuals (odds ratio [OR] = 1.83, 95% confidence interval [CI] = 1.05-3.19, P = 0.036) but not prefrail (OR = 1.90, 95% CI = 0.99-3.64, P = 0.052). The association was significantly stronger among male participants (P interaction = 0.042). The variation in the association between frailty and glaucoma did not reach statistical significance across age groups (P interaction = 0.575) or race groups (P interaction = 0.092). Mendelian randomization revealed that genetically predicted frailty was linked to greater risks for POAG (OR = 1.67, 95% CI = 1.24-2.25, P = 0.001), PACG (OR = 2.78, 95% CI = 1.48-5.20, P = 0.001), exfoliation glaucoma (OR = 1.70, 95% CI = 1.18-2.43, P = 0.004), and suspected glaucoma (OR = 1.74, 95% CI = 1.30-2.34, P < 0.001) but not for NTG (OR = 1.01, 95% CI = 0.61-1.68, P = 0.956). Conclusions Our study revealed an association between frailty and increased glaucoma risk and emphasized the significance of glaucoma screening in frail individuals. Targeted health-care strategies can help prevent or delay irreversible blindness among middle-aged and older adults. Financial Disclosure(s) Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dc87342a8690c78a4cc23d37bb6d4ac",
  "timestamp": "2025-05-15T03:28:17.650277"
}