{
  "id": 6257,
  "title": "Can social capital help explain enrolment (or lack thereof) in community-based health insurance? Results of an exploratory mixed methods study from Senegal",
  "abstract": "CBHI has achieved low population coverage in West Africa and elsewhere. Studies which seek to explain this point to inequitable enrolment, adverse selection, lack of trust in scheme management and information and low quality of health care. Interventions to address these problems have been proposed yet enrolment rates remain low. This exploratory study proposes that an under-researched determinant of CBHI enrolment is social capital. Fieldwork comprising a household survey and qualitative interviews was conducted in Senegal in 2009. Levels of bonding and bridging social capital among 720 members and non-members of CBHI across three case study schemes are compared. The results of the logistic regression suggest that, controlling for age and gender, in all three case studies members were significantly more likely than non-members to be enrolled in another community association, to have borrowed money from sources other than friends and relatives and to report having control over all community decisions affecting daily life. In two case studies, having privileged social relationships was also positively correlated with enrolment. After controlling for additional socioeconomic and health variables, the results for borrowing money remained significant. Additionally, in two case studies, reporting having control over community decisions and believing that the community would cooperate in an emergency were significantly positively correlated with enrolment. The results suggest that CBHI members had greater bridging social capital which provided them with solidarity, risk pooling, financial protection and financial credit. Qualitative interviews with 109 individuals selected from the household survey confirm this interpretation. The results ostensibly suggest that CBHI schemes should build on bridging social capital to increase coverage, for example by enrolling households through community associations. However, this may be unadvisable from an equity perspective. It is concluded that since enrolment in CBHI was less common not only among the poor, but also among those with less social capital and less power, strategies should focus on removing social as well as financial barriers to financial protection from the cost of ill health. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dcb367d360d61e7b9e5289c61b56890",
  "timestamp": "2025-05-15T02:56:11.059469"
}