{
  "id": 8270,
  "title": "The impact of liquidity on common stocks returns: Empirical insights from commercial banks in Nepal",
  "abstract": "Most developed and emerging economies pay substantial attention to liquidity to understand stock return behavior. However, there is a need for more focus on understanding the impact of such factors on stock returns in developing countries such as Nepal. This study aims to examine the effect of liquidity, size, financial and asset risk, growth potential, and profitability on stock returns in Nepalese commercial banks. A pooled ordinary least squares regression model is utilized, employing data from the Central Bank of Nepal and the Nepal Stock Exchange. There are 249 observations in the data set, which covers the period from 2009/10 to 2019/20. The model considers the impact of trading volume, market capitalization, book-to-market ratio, asset growth, and return on asset on stock returns in Nepalese commercial banks. The results indicate that trading volume, a proxy of liquidity, positively affects stock returns in Nepalese commercial banks. The finding reveals that when other variables are held constant, a 0.288 percent increase in stock returns is expected for a one percent rise in trading volume. However, asset growth and return on assets show a weakly favorable link with stock returns in Nepal. Conversely, the research findings suggest an insignificant inverse correlation between book-to-market and stock returns. A decrease in stock returns of 0.307 percent is expected for a one percent increase in the book-to-market ratio. Similarly, market capitalization has a negligible effect on stock returns in Nepal.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dd27644b9d33a1b35f633e19b80f98f",
  "timestamp": "2025-05-15T03:17:21.439721"
}