{
  "id": 6600,
  "title": "Determinants of nonphysical intimate partner violence: a cross-sectional study with nationally representative data from Canada",
  "abstract": "Based on a nationally representative survey of the Canadian population conducted in 2019/2020, this study examined the prevalence and determinants of nonphysical intimate partner violence (NP-IPV). NP-IPV was defined as experiences of emotional abuse, controlling behaviors, or economic abuse during the past 5 years. Women (17.3%) and men (16.9%) were equally likely to report NP-IPV, often without co-occurring physical/sexual IPV. For both genders, the risk of NP-IPV decreased with age and increased with financial strain and having a disability. Childhood maltreatment (sexual abuse, emotional abuse, and exposure to emotional IPV for women and sexual abuse and emotional abuse for men) was associated with an increased likelihood of reporting NP-IPV in adulthood. Other risk factors included heavy episodic drinking (self and/or spouse/partner) for women and living in a neighborhood with high levels of social disorder for men. Having confidence in the police was a protective factor for both genders. These associations generally persisted in regression analyses controlling for co-occurring physical/sexual IPV. Future research should focus on methods of preventing NP-IPV and the development of gender-specific interventions to reach and support those who experience NP-IPV. Furthermore, there is a need to improve and standardize measures of NP-IPV.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2dd32bc3f9c4925e635b20d6e5bb37a1",
  "timestamp": "2025-05-15T02:59:37.084776"
}