{
  "id": 3111,
  "title": "Theory of inventive problem solving (TRIZ) applied in supply chain management of petrochemical projects",
  "abstract": "An innovative Supply Chain Management system is a vital core competency for competitiveness of any company in today's dynamic markets. Such an SCM system has to integrate ongoing innovations into its processes and welcome future ones. This paper studies issues relate to documentation and classifications of innovations and generally have an experimental origin. First, SCM Innovations applied by Petrochemical Industries Development Management Company (PIDMCo.) in last seven years have been extracted. PIDMCo is a national Iranian company which acts as a project based organization and manages procurement and operation of a large portfolio of petrochemical plant projects. 40 inventive principles (classes) of TRIZ -one of the less widely used innovation tools- have been the basis of the study for documentation and classification of innovations in procurement and supply chain management of the company. Classification (assigning innovations into 40 classes and development of analogies) has been performed by expert judgment based on analysis for re-applicability. Resulting framework based on 40 innovative principles then has been mapped against elements of company's procurement and SCM system to check applicability and validity of innovative patterns. Results show a good potential for speeding up innovation in SCM with use of TRIZ systematic approach. In the last section some difficulties of TRIZ application in SCM are discussed.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2de2763bb4d7abf42c9eac9cd2eb6ed0",
  "timestamp": "2025-05-15T01:13:45.197375"
}