{
  "id": 3737,
  "title": "ROLE OF FINANCIAL LITERACY AND AWARENESS OF TAX IMPACTS IN AN EMERGING ECONOMY FACING TAX REFORM",
  "abstract": "This study seeks to assess the levels of financial literacy based on demographic characteristics of residents in Bogota, capital of Colombia. Given the massive public demonstrations against tax reforms that have been taking place in large cities in Colombia in 2021, this paper analyses the knowledge of people of the nature and impact of tax reforms, especifically their financial understanding of the impact of these fiscal policies. Utilizing regression analysis with a quantitative and qualitative research design, the article investigates the degree of financial literacy and the relation between the financial knowledge and the current orientation in tax policy changes and their impact on the population. The data used in this study was gathered from 6,713 households in Bogota and supplemented by in-depth interviews of representatives of each demographic group selected by careful sampling to represent each demographic characteristic. The results are structured in two parts, firstly, based on the analysis of three variables measuring levels of financial literacy of individuals relating to the interest rate, inflation and the principle of risk diversification. Secondly, qualitative research added two questions on knowledge of tax reform. Logistic regression was used. Results of both qualitative and quantitative research show that there is significant difference in the financial knowledge of people of different age, marital status and education. Interviews showed the best awareness and orientation in the mid-age group, predominantly men, who are seen as leaders. The most vulnerable group is low-educated single women. Limitation of the study is the narrow focus on households in one city. This article provides an insight into the importance of financial literacy, its monitoring, implementation of continuous improvement based on feedback loop in an economy in transition.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e02b6d59fd5e57729290eb8a65d1005",
  "timestamp": "2025-05-15T02:29:28.037397"
}