{
  "id": 4839,
  "title": "COVID-19 pandemic and the determinants of depressive symptoms among senior citizens of India: An empirical investigation",
  "abstract": "The COVID-19 pandemic inflicted multiple threats to individuals' physical, mental, and financial health conditions. The pandemic-related restrictive behaviors pose serious consequences for public health and increase the risk of mental illness among individuals, particularly among older citizens. The combination of their pre-existing illnesses, social isolation, COVID fear, and financial adversity frequently aggravates their condition and leads to depression and mental illness. Thus, the present study investigates the mental health status and the determinants of depressive symptoms among older adults of Bhubaneswar during the COVID pandemic context. The study used the Geriatric Depression Scale (GDS-15) to measure their depressive symptoms. The social isolation parameter is measured with the De Jong Gierveld Loneliness Scale. Financial self-efficacy, COVID-19-related psychological fear, and comorbidity health status are other determinants considered. A chi-square test and multinomial logistic regression (MLR) models are adopted to find the probable risk factors that may influence depressive symptoms among older people. The results indicate that comorbidity health conditions, a social isolation mindset, and financial efficacy issues are the significant determinants that drive an older person towards different depression categories. The improvement of these influential factors can lead senior citizens to avoid any health emergency like COVID pandemic. In the event of a public health emergency, such as COVID pandemic, the government could use the study's findings to devise methods for assisting the elderly. Society as a whole should be aware of these findings, which can lead to depressive symptoms, and offer support to the elderly. Future research may concentrate on identifying the causes of depressive symptoms in different age groups or in the presence of specific comorbidity health conditions. Future research may also investigate the factors influencing depressive symptoms in a specific occupation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e05a1f89b0b0137cb29e5431e0438b3",
  "timestamp": "2025-05-15T02:41:32.748384"
}