{
  "id": 5414,
  "title": "The determinants of bank interest rate margins: an international study",
  "abstract": "This paper studies the determinants of bank net interest margins (NIMs) in six selected European countries and the US during the period 1988-1995 for a sample of 614 banks. We apply the Ho and Saunders model (Ho, T., Saunders, A., 1981. The determinants of bank interest margins: theory and empirical evidence. Journal of Financial and Quantitative Analyses 16, 581-600) to a multicountry setting and decompose bank margins into a regulatory component, a market structure component and a risk premium component. The regulatory components in the form of interest-rate restrictions on deposits, reserve requirements and capital-to-asset ratios have a significant impact on banks NIMs. The empirical results suggest an important policy trade-off between assuring bank solvency-high capital-to-asset ratios-and lowering the cost of financial services to consumers-low NIMs. The mon segmented or restricted the banking system-both geographically and by activity-the larger appears to be the monopoly power of existing banks, and the higher their spreads. Macro interest-rate volatility was found to have a significant impact on bank NIMs; this suggests that macro policies consistent with reduced interest-rate volatility could have a positive effect in reducing bank margins. (C) 2000 Elsevier Science Ltd. All rights reserved. JEL classification: D21; G15; G21.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e0a5f53c00e9cc443cbfddf657c12b0",
  "timestamp": "2025-05-15T02:47:42.864313"
}