{
  "id": 5591,
  "title": "Access to dental care barriers and poor clinical oral health in Australian regional populations",
  "abstract": "Background This paper investigated the associations between oral health with behavioural, demographic, periodontitis risk, financial and access to dental care barriers and compared the results in three Australian regional areas. Methods Data were obtained from the Australian National Study of Adult Oral Health (2017-18). Oral health status was measured using DMFT-score, and mean numbers of decayed, missing or filled teeth and periodontitis prevalence using the Center for Disease Control and Prevention (CDC) and the American Academy of Periodontology (AAP) Periodontal Classification. The analysis included these dependent variables by three regional areas, seven socio-demographic variables, two periodontal disease risk factors, two preventive dental behaviours, two barriers to dental care and three access to dental care variables. Results Of the 15,731 people interviewed, 5,022 were examined. There was no significant difference in periodontitis prevalence between the regions. All the socio-demographic characteristics, periodontal disease risk factors and preventive dental behaviours were significantly associated with at least one of the dental caries indicators. In multivariable analysis, there was no significant association between regional location with any of the four clinical dental caries variables. Conclusion Poorer oral health outside major cities was associated with household income, education level, higher smoking, usual reason for and frequency of dental visiting.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e20d6d40b1b645e9a91eff32ed2ee8f",
  "timestamp": "2025-05-15T02:49:21.710197"
}