{
  "id": 7104,
  "title": "Equity financing and Islamic bank stability: evidence from Malaysia and Indonesia",
  "abstract": "Purpose - This paper aims to determine the effect of equity financing on bank stability during normal and crisis periods. Design/methodology/approach - This study uses a static panel regression that includes pooled ordinary least square, random effect and fixed effect model to examine the influence of equity financing on bank stability. In estimating bank stability during a financial crisis, the authors predict the occurrence of a crisis using the early warning system (EWS). The authors then used z-score to measure Islamic banks' stability. Findings - Islamic banks that offer equity financing structure are more stable compared to Islamic banks without such structure. Islamic banks with medium equity financing have highest stability relative to Islamic banks with high or low equity financing. During crises, the Islamic banks with equity financing structure remain relatively stable compared to other Islamic banks. Research limitations/implications - The sampling coverage could have included a larger number of countries and banks. Practical implications - The authorities need to strengthen the banking framework to support the Islamic financial products by encouraging a wider use of risk-sharing instruments. Besides using a debt-like financing structure, Islamic banks should also place emphasis on equity financing in instilling the banking sector stability. In monitoring banks with equity financing, the authorities may need to look into the level of equity financing. Social implications - Besides avoiding riba and gharar in financing, equity financing encourages cooperation and participation among society as they share the risks. Originality/value - This paper analyses the effect of equity financing on the Islamic banks stability during normal and crisis periods. This paper further examines the intensity of the equity financing and its influence on bank stability.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e31036be6d9f91eb90568422a882165",
  "timestamp": "2025-05-15T03:05:03.559764"
}