{
  "id": 6632,
  "title": "The relationship between sociodemographic factors and reporting having terminated a pregnancy among Ghanaian women: a population-based study",
  "abstract": "Background: Pregnancy termination is an illegal medical procedure in Ghana and 88% of induced abortions are performed in unsafe conditions, thus recipients face an elevated risk of abortion-related complications. This study aims to explore the associations between sociodemographic factors and reporting having terminated a pregnancy among Ghanaian women. Methods: Logistic regression models were estimated using data from the 2014 Ghana Demographic and Health Survey (n=9396). ORs were computed for the associations between reporting pregnancy termination and select demographic and socio-economic factors. Results: Education Level, employment status, financial status and marital status of women are significantly associated with reporting having terminated a pregnancy. Conclusions: Women who are employed, cohabit with a partner and are considered middle class or wealthy are more Likely than their counterparts to report having terminated a pregnancy. Ghanaian women with intermediate Levels of education are more Likely than both their more- and Less-educated counterparts to report having terminated a pregnancy. These findings highlight the need for the development of policies aimed at reducing unsafe abortions associated with unintended pregnancies. Specific recommendations include providing family planning education and outreach to high-risk groups to reduce unintended pregnancies and improving working conditions for expectant mothers, including provisions for paid maternity Leave and job protection.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e4b7930098305f853d6a9517650929d",
  "timestamp": "2025-05-15T03:00:04.992640"
}