{
  "id": 2500,
  "title": "ANALYSIS OF ENVIRONMENTAL MANAGEMENT PRACTICES, ACQUISITION OF GREEN CREDITS AND POLLUTION LEVELS OF COMPANIES LISTED IN THE CARBON EFFICIENT INDEX (ICO2)",
  "abstract": "The theme of this study is the analysis of environmental management practices, acquisition of green credits and pollution levels of companies listed in the Efficient Carbon Index (ICO2). As a general objective, it was adopted to analyze the relationship between CO2 emission levels with investments in the ICO2 asset portfolio among listed companies. Furthermore, as specific objectives, categorize the studied population and examine the main greenhouse gas control, prevention and mitigation strategy practices among listed companies. Environmental responsibility was measured by analyzing the relationship between investments in assets in the aforementioned index portfolio and CO2 emission levels in the same period. Furthermore, the disclosure of Greenhouse Gas (GHG) control, prevention and mitigation strategy practices was measured through performance reports from the senior management of these organizations. The research has a descriptive nature, a documentary data source and a quantitative approach. The results pointed to the existence of a strong positive correlation between investments in ICO2 assets and carbon emission levels. The regression model indicated explanatory capacity of emission levels for investments in the index portfolio.Increasing energy efficiency, responding to stakeholders and increasing the competitive factor were identified as central concerns for listed companies. Furthermore, prevention practices, centered on the use of clean energy and technologies, were present in more than half of the companies that make up ICO2.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e645d111b53d8d5adcb28b0e7f4ab48",
  "timestamp": "2025-05-15T01:07:35.680246"
}