{
  "id": 92,
  "title": "Research of Dempster-Shafer's Theory and Ensemble Classifier Financial Risk Early Warning Model Based on Benford's Law",
  "abstract": "Previous research endeavors aimed at enhancing the predictive accuracy of early warning systems for enterprise financial risks have primarily focused on two key areas: optimization of financial risk early warning indicators and development of combination models. However, crucial issues relating to the uncertainty arising from divergent assessment results among multiple classifiers analyzing the same sample data in financial risk early warning, as well as the impact of distorted financial indicator data on the predictive performance of financial early warning models, have remained largely unexplored. This study employs Benford's law to establish a comprehensive early warning indicator system for financial risks, incorporating its inherent factors. Additionally, the DS-evidence theory is utilized to seamlessly integrate Logistic Regression (LR), Na & iuml;ve Bayes (NB), Support Vector Machine (SVM), Gradient Boosted Decision Tree (GBDT), and AdaBoost classifiers into an ensemble classifier named the Dempster-Shafer's theory and Ensemble Classifier (DS-EC) financial risk warning model. The findings demonstrate that: (1) The DS-EC model effectively resolves the issue of uncertainty resulting from diverse evaluation results among multiple classifiers analyzing identical sample data, significantly outperforming LR, NB, SVM, GBDT, and AdaBoost in terms of predictive accuracy. (2) Benford's law proves to be a robust technique for detecting fraudulent risks within financial data, and its amalgamation with the DC-EC financial risk warning model enhances the model's predictive accuracy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e655f9a5ad467e969a603a0ea22788a",
  "timestamp": "2025-05-15T01:46:39.586945"
}