{
  "id": 696,
  "title": "Simplified MCDM Analytical Weighted Model for Ranking Classifiers in Financial Risk Datasets",
  "abstract": "One of the most challenging tasks in data mining is to choose a better classifier for classification problems as this involves multiple criteria. The multiple criteria decision making (MCDM) techniques are noteworthy to judge different alternatives on various criteria. In this paper, a simplified MCDM technique is applied to make a judgement on different alternatives (classifiers) among multiple criteria in financial risk datasets. For this purpose, the paired t-test statistical significance test and significant win-loss tables are used to determine the performance scores for each classifier. Then, the weights are determined using an analytic hierarchy process (AHP) and finally simplified MCDM weighted sum model is applied to rank the classifiers. In addition, the efficiency of this simplified MCDM method is compared with other top MCDM methods such as TOPSIS, PROMETHEE and VIKOR to evaluate if there are any discrepancies in ranking. Analysis has been done for the three financial risk datasets from the UCI machine learning repository and surprisingly this simplified approach and the other top MCDM methods produce consistent rankings. Logistic regression and Bayesnet are ranked as the top two classifiers for financial risk datasets by this simplified approach and the other top MCDM methods. The simplified MCDM model can be applied to rank the classifiers which use simplified backgrounds in making right decisions among multiple criteria.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e6b31cf909edea7e425ade13f8e04a0",
  "timestamp": "2025-05-15T01:53:59.410600"
}