{
  "id": 8548,
  "title": "Is Diabetic Retinopathy Related to Subclinical Cardiovascular Disease?",
  "abstract": "Objective: Persons with diabetic retinopathy (DR) have an increased risk of clinical cardiovascular events. This study aimed to determine whether DR is associated with a range of measures of subclinical cardiovascular disease (CVD) in persons without clinical CVD. Design: Population-based, cross-sectional epidemiologic study. Participants: Nine hundred twenty-seven persons with diabetes without clinical CVD in the Multi-Ethnic Study of Atherosclerosis. Methods: Diabetic retinopathy was ascertained from retinal photographs according to modification of the Airlie House Classification system. Vision-threatening DR (VTDR) was defined as severe nonproliferative DR, proliferative DR, or clinically significant macular edema. Subclinical CVD measures were assessed and defined as follows: high coronary artery calcium (CAC) score, defined as CAC score of 400 or more; low ankle-brachial index (ABI), defined as ABI of less than 0.9; high ABI, defined as ABI of 1.4 or more; high carotid intima-media thickness (IMT), defined as highest 25% of IMT; and carotid stenosis, defined as more than 25% stenosis or presence of carotid plaque. Main Outcome Measures: Associations between DR and subclinical CVD measures. Results: The prevalence of DR and VTDR in this sample was 30.0% and 7.2%, respectively, and VTDR was associated with a high CAC score (odds ratio [OR], 2.33; 95% confidence interval [CI], 1.15-4.73), low ABI (OR, 2.54; 95% CI, 1.08-5.99), and high ABI (OR, 12.6; 95% CI, 1.14-140.6) after adjusting for risk factors including hemoglobin A1c level and duration of diabetes. The association between VTDR and high CAC score remained significant after further adjustment for hypoglycemic, antihypertensive, and cholesterol-lowering medications. Diabetic retinopathy was not significantly associated with measures of carotid artery disease. Conclusions: In persons with diabetes without a history of clinical CVD, the presence of advanced-stage DR is associated with subclinical coronary artery disease. These findings emphasize the need to be careful about the use of anti-vascular endothelial growth factor for the treatment of DR. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 860-865 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e763f76e32193842b1cdc9a70fddc5e",
  "timestamp": "2025-05-15T03:19:52.167110"
}