{
  "id": 7485,
  "title": "Interest rate liberalization and bank liquidity creation: evidence from China",
  "abstract": "Purpose This study aims to empirically analyze how interest rate liberalization affects bank liquidity creation, and investigate whether the relationship between them is linear. Design/methodology/approach Based on panel data on 145 banks in China over the period 1997-2015, this paper regresses the econometric model by conducting feasible generalized least square estimation. Findings The regression results show that, first, interest rate liberalization has a nonlinear impact on bank liquidity creation, and the relationship between them is inverted U-shaped. In other words, as interest rate liberalization progresses, bank liquidity creation increases first, and then decreases. Second, through the mediation effect tests, this study found that interest rate liberalization affects bank liquidity creation through bank risk-taking. That is, interest rate liberalization leads to changes in bank risk-taking, thus resulting in changes in bank liquidity creation. Research limitations/implications The effect of interest rate liberalization on bank liquidity creation is nonlinear, so promoting interest rate liberalization faces a trade-off because excessive bank liquidity creation may lead to asset price bubbles, while insufficient bank liquidity creation may inhibit economic growth. Practical implications Interest rate liberalization has a significant impact on bank liquidity creation; therefore, bank liquidity creation should be added to the objective function of the regulator that determines interest rate liberalization reform in China. Social implications Interest rate liberalization has a direct impact on bank risk-taking, so the consequences of interest rate liberalization should be included in the framework of macro-prudential supervision. Originality/value Interest rate liberalization is one of the most important financial reforms in China, yet its potential impact on firm-level bank liquidity is little explored. This paper attempts to fill the gap.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e784e84707abae033d3927338b03cc4",
  "timestamp": "2025-05-15T03:09:07.279436"
}