{
  "id": 7516,
  "title": "Diagnostic evaluation of unknown white-tailed deer morbidity and mortality in New York State: 2011-2017",
  "abstract": "White-tailed deer Odocoileus virginianus are the most popular big game animal in the United States. Recreational harvest of these animals is a critical tool in population management, as well as an important financial resource for state economies and wildlife agencies. Thus, herd health evaluations can provide information to wildlife managers tasked with developing sustainable harvest practices while monitoring for emergent problems. The purpose of our study was to document causes of illness and natural mortality in New York white-tailed deer submitted for post mortem evaluation. Animals were presented by members of the public and wildlife management personnel due to abnormal behavior or unexplained death. We describe demographic and seasonal associations among gross and histologic evaluation and diagnostic testing. Post mortem examinations were performed on 735 white-tailed deer submitted for necropsy in New York from January 2011 to November 2017. Causes of euthanasia or mortality were classified into nine categories. The most common findings were bacterial infections, trauma not evident at time of collection, and nutritional issues, primarily starvation. Using a multinomial logistic regression model, we looked for associations between the mortality categories and age, sex and season. Compared to the baseline of bacterial deaths, adults were less likely to have died from nutritional and parasitic causes, males were less likely to have died from other causes, and risk of death from nutritional reasons decreased from season to season, with lowest risk in winter. These methods can help wildlife biologists track changes in disease dynamics over time.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e7a32b614d76c7d801103bd1d7529a9",
  "timestamp": "2025-05-15T03:09:36.815323"
}