{
  "id": 3855,
  "title": "Risk Identification of Public Companies Based on Term Cohesion and Topic Visualization",
  "abstract": "The purpose of this article is to develop a procedure to identify risks in public companies based on cohesion relationships among terms and topic visualization. Prospectuses of public companies in the industry of computer implication services in China were collected and chapters of risk factors in those prospectuses were analyzed. Texts were split into 10 categories corresponding to different risks by coding subtitles of the texts and 10 sub text sets were formed. Ten categories of risk include market risk, operational risk, financial risk, products and technology risk, investment project risk, internal management risk, inter-control risk, human resources risk, industry risk, and political risk. Five major risks in the ten were visualized to identify topics. After the texts were cleaned and parsed, cohesion relationships among terms were expressed by proximity using cosine value. Relationships among each term and its related terms were characterized and grouped in visual spaces using multidimensional scaling (MDS). Topics were identified by clustering terms in a visual space while each topic corresponds to a specific sub-class of risk. A content analysis was employed to illustrate each topic in the visual space. The procedure to identify risks in public companies in our study enriches the analysis method system of public companies and provides supports for decision-making of the government decision-makers, enterprises' managers and securities practitioners and the public investors.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e7dddef0d5eaf88eb9bbf28fcf984fb",
  "timestamp": "2025-05-15T02:30:28.790897"
}