{
  "id": 7664,
  "title": "Prevalence of Diabetic Retinopathy in India Sankara Nethralaya Diabetic Retinopathy Epidemiology and Molecular Genetics Study Report 2",
  "abstract": "Objective: The aim of the study was to estimate the prevalence of diabetic retinopathy in an urban Indian population older than 40 years. Design: A population-based cross-sectional study. Participants: Five thousand nine hundred ninety-nine subjects residing in Chennai, India, were enumerated. Methods: A multistage random sampling, based on socioeconomic criteria, was followed. Identified subjects with diabetes mellitus (based on the World Health Organization criteria) underwent detailed examination at the base hospital. The fundi of all patients were photographed using 45 degrees, 4-field stereoscopic digital photography. The diagnosis of diabetic retinopathy was based on Klein's classification of the Early Treatment Diabetic Retinopathy Study scale. Main Outcome Measures: These included age- and gender-adjusted prevalence of diabetes and diabetic retinopathy, and correlation of prevalence with history-based risk factors. Results: The age- and gender-adjusted prevalence rate of diabetes in an urban Chennai population was 28.2% (95% confidence interval [CI), 27.0-29.3), and the prevalence of diabetic retinopathy in general population was 3.5% (95% CI, 3.49-3.54). The prevalence of diabetic retinopathy in the population with diabetes mellitus was 18.0% (95% CI, 16.0-20.1). History-based variables that were significantly associated with increased risk of diabetic retinopathy included gender (men at greater risk; odds ratio (OR], 1.41; 95% CI, 1.04-1.91); use of insulin (OR, 3.52; 95% CI, 2.05-6.02); longer duration of diabetes (>15 years; OR, 6.43; 95% CI, 3.18-12.90); and subjects with known diabetes mellitus (OR, 2.98; 95% CI, 1.72-5.17). Differences in the socioeconomic status did riot influence the occurrence of diabetic retinopathy. Conclusions: The prevalence of diabetic retinopathy was 18% in an urban population with diabetes mellitus in India. The duration of diabetes is the strongest predictor for diabetic retinopathy. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:311-318 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2e8ec1fcbe7ffc2a13488ba40c51e40d",
  "timestamp": "2025-05-15T03:11:04.493576"
}