{
  "id": 7122,
  "title": "Project finance risk evaluation of the Electric power industry of Serbia",
  "abstract": "From the aspect of the development of a country, the energy sector represents a domain of strategic interest Generation and use of energy resources most often belongs to the public sector, and are most often under the influence of the government in most countries. This paper analyzes the risks that are characteristic to the business of the public enterprise, Electric Power Industry of Serbia (EPS). EPS has started its restructuring and is adjusting to changes and challenges imposed by the launched reforms in the energy sector. However, due to certain limitations, it is still not possible to implement its complete restructuring and modernization. The paper aims to point at the risks a potential strategic partner faces. The risks have been identified as commercial, financial and political, classification immanent for project finance, and their evaluation was done using Failure Mode and Effects Analysis (FMEA). Risk analysis was performed based on current conditions for two potential scenarios that predict different types of changes in the analyzed period. The results of the analysis show that the potential strategic partner should pay special attention to price risks, estimation, investments, project activity neglect, quasi-risks and debt collection. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ea8dc2b8411d014a75393637124035c",
  "timestamp": "2025-05-15T03:05:32.013082"
}