{
  "id": 2526,
  "title": "Does financial regulation affect the profit efficiency and risk of banks? Evidence from China's commercial banks",
  "abstract": "The goal of financial regulation is to enable banks to improve liquidity and solvency. Stricter regulation may be good for bank stability, but not for bank efficiency. This research aims to examine whether banks have met the CBRC's standard of financial regulations and explores how the previously implemented financial regulations have affected bank efficiency and risk in the past. In addition, we also explored the trade-off relationship between efficiency and risk. Unlike other studies, this study used bank assets as a classification standard from the financial risk and differential regulatory perspective. The empirical results indicate that the CBRC regulates the provision coverage ratio and cost-to-income ratio, which seems relevant to large banks and the loan-to-deposit ratio, capital adequacy ratio, and leverage ratio, which seems relevant to small banks. The CBRC regulates the current ratio to reduce the risks of banks. Based on our empirical results, the current ratio did not affect the risks and led to different efficiency results between large and small banks. In an environment with asymmetric information, a bank decision-making is unobservable. The characteristics of financial regulation provide market clues if a bank is operating at the most efficiency and risk condition. (C) 2013 Elsevier Inc. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2eae516a78ec0b0a937f105881a0199d",
  "timestamp": "2025-05-15T02:16:32.605867"
}