{
  "id": 5146,
  "title": "Comparative Assessment of Utilization and Hospital Outcomes of Veterans Receiving VA and Non-VA Outpatient Dialysis",
  "abstract": "Objective Growing demand for VA dialysis exceeds its supply and travel distances prohibit many Veterans from receiving dialysis in a VA facility, leading to increased use of dialysis from non-VA providers. This study compared utilization and hospitalization outcomes among Veterans receiving chronic dialysis in VA and non-VA settings in 2008-2013. Data Sources VA, Medicare, and national disease registry data. Study Design National cohort of 27,301 Veterans initiating dialysis, observed for a period of 2 years after treatment initiation. We used multinomial logistic regression to examine associations between patient characteristics and dialysis use in VA, non-VA community settings via VA Purchased Care (VA-PC), community settings via Medicare, or Dual settings. Zero-inflated negative binomial regression was used to compare risk of hospitalization and days spent in the hospital across dialysis settings. Principal Findings Sixty-seven percent of Veterans obtained community-based dialysis exclusively via Medicare, 11 percent in the community via VA-PC, 4 percent in VA, and 18 percent in Dual settings. Financial and geographic access factors were important predictors of dialysis setting, but days spent in the hospital and risk of hospitalization did not differ meaningfully across settings. Conclusions Most Veterans obtained dialysis in the community. Dialysis setting appeared to have little impact on risk of hospitalization among Veterans.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2eb080ccf0cc81d33aaf4ad4a00f9bdb",
  "timestamp": "2025-05-15T02:44:43.947669"
}