{
  "id": 8415,
  "title": "ANXIETY AND CHRONIC PAIN IN CAREGIVERS OF CHILDREN WITH CEREBRAL PALSY IN ARMENIA: DESCRIPTIVE STUDY",
  "abstract": "Caregiving a child with special needs requires additional physical, psychological and financial resources. Current knowledge confirms that caregivers of children with functional limitations (i. e., cerebral palsy) are under greater risk of developing physical and psychological health problems. However, health characteristics of caregivers are not well investigated in low- and middle-income countries. Current observational study aimed to discover the anxiety and pain syndromes among caregivers of children with cerebral palsy residing in Armenia. Cross-sectional study was conducted in tertiary care center in 2015-2016. Demographic and health information was collected from eligible participants. Anxiety was measured by Norakidze 's modification of Taylor Manifest Anxiety Scale 60-items scale. Descriptive statistics was utilized for demographic data, chi square and regression analysis for exploratory analysis of anxiety and pain among caregivers. From 193 caregivers 188 (97.4%) were mothers with mean age of 37 (SD =10.6). Over two third of participants reported to have chronic pain syndromes. Moreover, 14% participants precepted pain every day. Pain syndromes mainly were associated with caregiving time. High anxiety levels according to Taylor Manifest Anxiety Scale 60-items scale were presented in 135 (69.9%) of caregivers. Correlations between anxiety and caregivers ''children characteristics were investigated. This is the first publication about health characteristics of caregivers of children with cerebral palsy in Armenia. Current study design lacks to find causations, and has not control for confounders. However, study findings emphasize the necessity for further research of health problems of caregivers of children with cerebral palsy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2eb9c6f64de58a04ff925edbbbb4932f",
  "timestamp": "2025-05-15T03:18:51.519677"
}