{
  "id": 2720,
  "title": "Economic Assessment for Battery Swapping Station Based Frequency Regulation Service",
  "abstract": "Battery swapping stations (BSSs) have great potential in providing fast frequency regulation service (FFRS) owing to their large battery storage capacity. However, compared to a regular BSS, a BSS providing FFRS faces the following financial risks: first, higher infrastructure investment to support the vehicle-to-grid services; second, higher battery aging costs due to FFRS; third, FFRS causes uncertainties to batteries' charging costs. Under such a context, in this article, we propose an economic risk assessment model for the BSS-based FFRS by comparing its economics with a regular BSS. In this model, the value at risk (VaR) of daily revenue and the long-term return on investment (ROI) of a regular BSS and a BSS providing FFRS are compared. The assessment results are obtained in three steps: first, we develop the operation and economic models for the BSS-based FFRS. Next, the mathematical models of the VAR and ROI analyses are formulated. Finally, the VaR of daily revenue is compared through a statistical analysis of a large number of scenarios. The ROI comparison is conducted by a policy gradient based reinforcement learning algorithm, which can handle the nonconvexity and stochastic dynamics brought by the electric vehicle visits. The practicality of the proposed framework is demonstrated by using the real ancillary market data from utilities and the traffic count data from onsite traffic sensors.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ecc4eb5b825b993b1b4588fab873d75",
  "timestamp": "2025-05-15T02:18:37.033342"
}