{
  "id": 7257,
  "title": "Risk Factors Associated with Incident Cataracts and Cataract Surgery in the Age-Related Eye Disease Study (AREDS) AREDS Report Number 32",
  "abstract": "Objective: To investigate potential risk factors associated with incident nuclear, cortical, and posterior subcapsular (PSC) cataracts and cataract surgery in participants in the Age-Related Eye Disease Study (AREDS). Design: Clinic-based prospective cohort study. Participants: Persons (n = 4425) 55 to 80 years of age enrolled in a controlled clinical trial of antioxidant vitamins and minerals, AREDS, for age-related macular degeneration and cataract. Methods: Lens photographs were graded centrally for nuclear, cortical, and PSC opacities using the AREDS system for classifying cataracts. Type-specific incident cataracts were defined as an increase in cataract grade from none or mild at baseline to a grade of moderate at follow-up, also with a grade of at least moderate at the final visit, or cataract surgery. Cox regression analyses were used to assess baseline risk factors associated with type-specific opacities and cataract surgery. Main Outcome Measures: Moderate cataract was defined as a grade of 4.0 or more for nuclear opacity, 10% or more involvement within the full visible lens for cortical opacity, and 5% or more involvement of the central 5-mm circle of the lens for PSC opacity. These were graded on baseline and annual lens photographs. Results: A clinic-based cohort of 4425 persons 55 to 80 years of age at baseline was followed up for an average of 9.8 +/- 2.4 years. The following associations were found: increasing age with increased risk of all types of cataract and cataract surgery; males with increased risk of PSC and decreased risk of cortical cataracts; nonwhite persons with increased risk of cortical cataract; hyperopia with decreased risk of PSC, nuclear cataract, and cataract surgery; Centrum (Wyeth Consumer Healthcare, Madison, NJ) use with decreased risk of nuclear cataract; diabetes with increased risk of cortical, PSC cataract, and cataract surgery; higher educational level with decreased risk of cortical cataract; and smoking with increased risk of cortical cataract and cataract surgery. Estrogen replacement therapy in female participants increased the risk of cataract surgery. Conclusions: These findings largely are consistent with the results of previous studies, providing further evidence for possible modifiable risk factors for age-related cataract. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011;118:2113-2119 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ecddd92c7ea44c2d15308901ca27ac8",
  "timestamp": "2025-05-15T03:06:35.449691"
}