{
  "id": 6076,
  "title": "Effect of a state-funded social health insurance programme, on equitable access to health care, financial risk protection and economic well-being in Khyber Pakhtunkhwa Province, Pakistan",
  "abstract": "Objective: To determine the effect of the SCP on access to health care, financial risk protection and perceived economic well-being among beneficiaries. Methods: Using a comparative, cross-sectional design, household survey was conducted across 10 districts of the KP province during Nov22-Feb23. A total of 3619 households were recruited in which at least one member had received SCP inpatient services (users=1874) and neighbourhood households where a hospitalized member did not use SCP inpatient services (nonuser=1745). Generalised regression models were used for analyses after adjusting for the propensity scores. Results: Socio-economic and demographic differences were not found between SCP user and non-user groups. Compared to SCP nonusers, SCP users were more likely to seek inpatient care from private hospitals and covered more distance to get to empanelled health facilities, stay longer in hospitals, especially for patients with chronic diseases and injuries. There was a significant reduction in medical care component of mean out-of-pocket expenditure for inpatient services among SCP users (PKR 1,006 +/- 9,248) as compared with SCP nonusers (PKR 30,042 +/- 69,014). The nonmedical component (transport etc.) was not substantively different in both groups. The level of catastrophic health expenditure was significantly lower among SCP users 253 (14%) compared to SCP nonusers 621 (35%), leading to higher perceived economic wellbeing among SCP users. Conclusion: KP Government's SCP has been effective in improving financial risk protection among its beneficiaries, resulting in an increased sense of economic well-being, as compared to SCP nonusers. SCP needs to devise strategy to increase access to inpatient services, particularly among poorer families to maximize its impact.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ed47250347ff39c233e102346f893a8",
  "timestamp": "2025-05-15T02:54:38.755671"
}