{
  "id": 7428,
  "title": "Financial incentives to promote retention in care and viral suppression in adults with HIV initiating antiretroviral therapy in Tanzania: a three-arm randomised controlled trial",
  "abstract": "Background Financial incentives promote use of HIV services and might support adherence to the sustained antiretroviral therapy (ART) necessary for viral suppression, but few studies have assessed a biomarker of adherence or evaluated optimal implementation. We sought to determine whether varying sized financial incentives for clinic attendance effected viral suppression in patients starting ART in Tanzania. Methods In a three-arm, parallel-group, randomised controlled trial at four health facilities in Shinyanga region, Tanzania, adults aged 18 years or older with HIV who had started ART within the past 30 days were randomly assigned (1:1:1) using a tablet-based application (stratified by site) to receive usual care (control group) or to receive a cash incentive for monthly clinic attendance in one of two amounts: 10 000 Tanzanian Shillings (TZS; about US$4.50) or 22500 TZS (about $10.00). There were no formal exclusion criteria. Participants were masked to the existence of two incentive sizes. Incentives were provided for up to 6 months via mobile health technology (mHealth) that linked biometric attendance monitoring to automated mobile payments. We evaluated the primary outcome of retention in care with viral suppression (<1000 copies per mL) at 6 months using logistic regression. This trial is registered with ClinicalTrials.gov , NCT03351556. Findings Between April 24 and Dec 14, 2018, 530 participants were randomly assigned to an incentive strategy (184 in the control group, 172 in the smaller incentive group, and 174 in the larger incentive group). All participants were included in the primary intention-to-treat analysis. At 6 months, approximately 134 (73%) participants in the control group remained in care and had viral suppression, compared with 143 (83%) in the smaller incentive group (risk difference [RD] 9 - 8, 95% CI 1.2 to 18.5) and 150 (86%) in the larger incentive group (RD 13.0, 4.5 to 21.5); we identified a positive trend between incentive size and viral suppression (p trend=0.0032), although the incentive groups did not significantly differ (RD 3.2, -4.6 to 11.0). Adverse events included seven (4%) deaths in the control group and 11 (3%) deaths in the intervention groups, none related to study participation. Interpretation Small financial incentives delivered using mHealth can improve retention in care and viral suppression in adults starting HIV treatment. Although further research should investigate the durability of effects from short-term incentives, these findings strengthen the evidence for implementing financial incentives within standard HIV care. Copyright (C) 2020 Elseiver Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2eeba7ff1715f3c8f053688b61c2285b",
  "timestamp": "2025-05-15T03:08:37.788879"
}