{
  "id": 8942,
  "title": "COVID-19 Pandemic: The Impact of COVID-19 on Mental Health and Life Habits in the Canadian Population",
  "abstract": "ObjectivesThe study aims to investigate the rate of clinical depression in the adult population during the COVID-19 pandemic, as well as the changes in anxiety, distress, suicidal ideation, and their relations with several personal and interpersonal/social variables. MethodsThis is an epidemiological, non-interventional study. It is part of an international multi-center study, with the main site at the Aristotle University of Thessaloniki, in Greece (COMET-G Study). We are presenting aspects of the research involving the Canadian site, based on 508 Canadian responders to the online survey (QAIRE). ResultsOf the 508 responders, 72.2% were females aged 42.57 +/- 14.00 years; 27.2% were males aged 42.24 +/- 15.49 years; and 0.6% were others aged 46.33 +/- 17.79 years. Increased anxiety during the lockdown was reported by 69.3% of those surveyed. The rate of suicidal thoughts increased in 19.5% of participants during the lockdown. Depression was reported by 22% of responders, while distress was present in 18.4%. We found a greater prevalence of depression, but not distress, in individuals with a history of any mental disorder. Based on the multiple regression analysis, we found four CORE factors equally influencing the changes in mental health during the lockdown (gender, quality of sleep, family conflicts, and changes in daily routine). In the Canadian population, two major changes acted as protective factors, significantly expressed when compared with the worldwide tendencies: fewer financial difficulties; and an increase in religious beliefs. ConclusionThe rate of major depression, distress, and suicidal ideation was higher in Canadians than in the worldwide population (per COMET-G), but the relative risk to develop depression in the presence of a history of mental disorders was lower. Almost 90% of Canadians believed in the real story of COVID source of provenience.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2eef3b19a6ac196b9b435f6e5e127711",
  "timestamp": "2025-05-15T03:23:56.103605"
}