{
  "id": 8715,
  "title": "Big data insights into predictors of acute compartment syndrome",
  "abstract": "Background: There remain gaps in knowledge regarding the pathophysiology, initial diagnosis, treatment, and outcome of acute compartment syndrome (ACS). Most reported clinical outcomes are from smaller studies of heterogeneous patients. For a disease associated with a financial burden to society that represents billions of dollars worldwide the literature does not currently establish baseline diagnostic parameters and risk factors that may serve to predict treatment and outcomes. Methods: This study looks at a very large cohort of trauma patients obtained from four recent years of the Trauma Quality Programs data from the American College of Surgeons. From 3,924,127 trauma cases -203,500 patients with tibial fractures were identified and their records examined for demographic information, potential risk factors for compartment syndrome, an associated coded diagnosis of muscle necrosis, and presence of other outcomes associated with compartment syndrome. A recurrent multiple logistic regression model was used to identify factors predictive of fasciotomy. The results were compared to the reported results from the literature to validate the findings. Results: The rate of fasciotomy treatment for ACS was 4.3% in the cohort of identified patients. The analysis identified several clinical predictors of fasciotomy. Proximal and midshaft tibial fractures ( P < 0.0 0 01) showed highest increases in the likelihood of ACS. Open fractures were twice (O.R [2.20-2.42]) as likely to have ACS. Having a complex fracture ( P < 0.0 0 01), substance abuse disorder ( P < 0.0 0 02), cirrhosis ( P = 0.002) or smoking ( P < 0.0051) all increased the likelihood of ACS. Age decreased the likelihood by 1% per year (OR = [0.99-0.993]). Crush and penetrating injuries showed an important increase in the likelihood of ACS (O.R of 1.83 and 1.37 respectively). Additionally, sex, BMI, cirrhosis, tobacco smoking and fracture pattern as defined by OTA group and OTA subgroup had predictive value on actual myonecrosis. Fasciotomies for open tibial fractures were more likely to uncover significant muscle necrosis compared to closed fractures. Amputation resulted after 5.4% of fasciotomies. Conclusion: This big data approach shows us that ACS is primarily linked to the extent of soft tissue damage. However, newfound effect of some comorbidities like cirrhosis and hypertension on the risk of ACS imply other mechanisms.(c) 2022 Elsevier Ltd. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2efdc19cda89aa09e9e25ec6968637fc",
  "timestamp": "2025-05-15T03:21:56.559849"
}