{
  "id": 6302,
  "title": "Optimizing treatment for the prevention of pre-eclampsia/eclampsia in Nepal: is calcium supplementation during pregnancy cost-effective?",
  "abstract": "Background: In Nepal, pre-eclampsia/eclampsia (PE/E) causes an estimated 21% of maternal deaths annually and contributes to adverse neonatal birth outcomes. Calcium supplementation has been shown to reduce the risk of PE/E for pregnant women and preterm birth. This study presents findings from a cost-effectiveness analysis of a pilot project, which provided calcium supplementation through the public sector to pregnant women during antenatal care for PE/E prevention as compared to existing PE/E management in Nepal. Methods: Economic costs were assessed from program and societal perspectives for the May 2012 to August 2013 analytic time horizon, drawing from implementing partner financial records and the literature. Effects were calculated as disability-adjusted life years (DALYs) averted for mothers and newborns. A decision tree was used to model the cost-effectiveness of three strategies delivered through the public sector: (i) calcium supplementation in addition to the existing standard of care (MgSO4); (ii) standard of care, and (iii) no treatment. Uncertainty was assessed using one-way and probabilistic sensitivity analyses in TreeAge Pro. Results: The costs to start-up calcium introduction in addition to MgSO4 were $44,804, while the costs to support ongoing program implementation were $72,852. Collectively, these values correspond to a program cost per person per year of $0.44. The calcium program corresponded to a societal cost per DALY averted of $25.33 ($25.22-29.50) when compared against MgSO4 treatment. Primary cost drivers included rate for facility delivery, costs associated with hospitalization, and the probability of developing PE/E. The addition of calcium to the standard of care corresponds to slight increases in effect and cost, and has a 84% probability of cost-effectiveness above a WTP threshold of $40 USD when compared to the standard of care alone. Conclusions: Calcium supplementation for pregnant mothers for prevention of PE/E provided with MgSO4 for treatment holds promise for the cost- effective reduction of maternal and neonatal morbidity and mortality associated with PE/E. The findings of this study compare favorably with other low-cost, high priority interventions recommended for South Asia. Additional research is recommended to improve the rigor of evidence available on the treatment strategies and health outcomes.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f0a5c8543a9524c2dad617fbca85f35",
  "timestamp": "2025-05-15T02:56:37.514680"
}