{
  "id": 6920,
  "title": "Correlates of adaptive skills in children with autism spectrum disorder",
  "abstract": "This study aimed to identify potential modifiable factors prior to early intervention that are associated with better adaptive skills in children with autism spectrum disorder. This cross-sectional study recruited patients with autism spectrum disorder, aged 5-12 years from two tertiary developmental programmes in Singapore. Demographics, family socio-economic status and early intervention details were collected. The primary outcome was the Vineland Adaptive Behaviour Scales Adaptive Behaviour Composite score. Multivariate linear regression analysis was done. The sample (N = 193) comprised 84% males with a mean age of 6 years and 7 months. Mean age at diagnosis was 35.5 months and mean Vineland Adaptive Behaviour Scales Adaptive Behaviour Composite standard score was 76.5. Mean waiting time for early intervention was 6.2 months with a mean intensity of 8.0 h/week. Waiting time for early intervention was a negative correlate of the Vineland Adaptive Behaviour Scales Adaptive Behaviour Composite score after controlling for other variables (beta = -0.74, p = 0.04). Significant correlates also included paternal education (beta = 5.44, p = 0.03) and the presence of financial difficulties in the family (beta = -5.98, p = 0.04). Waiting time for early intervention is a modifiable risk factor that may be addressed during service planning to potentially improve adaptive skills in autism spectrum disorder. Children from low socio-economic status families may be at risk for poor functional skills and will benefit from targeted intervention plans. Lay abstract Despite improving services and care for individuals with autism spectrum disorder, functional outcomes such as daily living skills tend to be suboptimal for many. This study wanted to identify modifiable early intervention factors that are associated with better outcomes and possible high-risk groups of children who are at risk of poorer outcomes. Participants included 193 children aged between 5 and 12 years of age whose parents provided information on their family background and early intervention characteristics. These children also had their adaptive behaviour skills examined by formal testing. Results indicated that shorter wait time for early intervention was associated with better adaptive behaviour scores. Children from families with financial difficulties and lower paternal education were also at risk of poorer adaptive skills. Designing services for children with autism such that wait times to enter early intervention services are minimised following initial diagnosis can improve their eventual functional outcomes. Changes in healthcare policy to allow expedited entry or targeted intervention to children from low socio-economic status families can also enhance their eventual adaptive skill gains.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f19182f9cb1dc1524eeaf3e1e706961",
  "timestamp": "2025-05-15T03:03:13.411159"
}