{
  "id": 7468,
  "title": "Impact of Compensated Cirrhosis Etiology on Postoperative Outcomes Following Total Knee Arthroplasty",
  "abstract": "Background: Cirrhotics often demonstrate worse outcomes than their non-cirrhotic counterparts following orthopedic surgery; however, there are limited arthroplasty-focused data on this occurrence. Additionally, variances in postoperative outcomes among the different etiologies of cirrhosis have not been well described. The aim of this study is to evaluate the effect compensated cirrhosis had on postoperative outcomes following elective total knee arthroplasty (TICS). Methods: In total, 1,734,568 patients who underwent primary TICS from 2006 to 2013 were identified using the Medicare Claims Database. Patients were divided into those with a history of compensated cirrhosis and those with no history of liver disease. Subgroup analysis was performed based on the etiology of cirrhosis. Multivariate logistic regression was used to evaluate postsurgical outcomes of interest. Results: Cirrhotic patients had higher risk of developing disseminated intravascular coagulation (odds ratio [OR] 2.76, P = .003), encephalopathy (OR 3.00, P < .001), and periprosthetic infection (OR 1.79, P < .001) compared to controls. Following subgroup analysis, alcoholic cirrhotics had high risk of periprosthetic infection (OR 2.12, P < .001), fracture (OR 3.28, P < .001), transfusion (OR 2.45, P < .001), and encephalopathy (OR 7.34, P < .001) compared to controls. Viral cirrhosis was associated with an increase in 90-day charges ($14,941, P < .001) compared to controls, while cirrhosis secondary to other causes was associated with few adverse outcomes compared to controls. Conclusion: Liver cirrhosis is an independent risk factor for increased perioperative morbidity and financial burden following TICS. Cirrhosis due to etiologies other than viral infections and alcoholism are associated with few adverse outcomes. Surgeons should be aware of these complications to properly optimize postoperative management. (C) 2020 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f1c1d508c8f9c78ddb8bcebfa16333d",
  "timestamp": "2025-05-15T03:09:07.224185"
}