{
  "id": 1290,
  "title": "Applied Artificial Intelligence: A risk management problem in trade finance",
  "abstract": "Rolling credit facilities secured on trade debt present a risk of financial loss to a lender; their client may defraud them e.g. by presenting fictitious debt. Attempts to minimise losses due to this risk involve the lender in detection and mitigation activities which are expensive in terms of staff cost, and may be inconsistently performed. This paper explores the possibility of reducing both the cost of risk management, and the percentage of loan monies lost, by means of the introduction of Artificial Intelligence support for these risk management activities. A data sample drawn from a lending organisation's operational databases is analysed by decision tree induction, in order to identify case features associated with instances of loss. A k-nearest: neighbour algorithm is then devised, using these features both to rank cases in order of risk, and to enable case-based reasoning support to the formulation of a risk mitigation plan. A proposal is presented, for the trial implementation of the risk management support tools which have been created. This proposal provides for the critical evaluation and assessment of these tools, both against each other and against the status quo. In the best of the trials conducted, minimal overlap occurred at score 41, with 9% of bads scoring 41 and above, compared to 73% of goods. This result is equivalent to misclassifications of 9% bad-as-good and 27% good-as-bad for a rule If the score is 41 or over, the classification is good.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f244f9957daf87a887200dd7fa49c99",
  "timestamp": "2025-05-15T02:01:11.866591"
}