{
  "id": 7296,
  "title": "Catastrophic health expenditure and its determinants in Kenya slum communities",
  "abstract": "Background: In Kenya, where 60 to 80% of the urban residents live in informal settlements (frequently referred to as slums), out-of-pocket (OOP) payments account for more than a third of national health expenditures. However, little is known on the extent to which these OOP payments are associated with personal or household financial catastrophe in the slums. This paper seeks to examine the incidence and determinants of catastrophic health expenditure among urban slum communities in Kenya. Methods: We use a unique dataset on informal settlement residents in Kenya and various approaches that relate households OOP payments for healthcare to total expenditures adjusted for subsistence, or income. We classified households whose OOP was in excess of a predefined threshold as facing catastrophic health expenditures (CHE), and identified the determinants of CHE using multivariate logistic regression analysis. Results: The results indicate that the proportion of households facing CHE varies widely between 1.52% and 28.38% depending on the method and the threshold used. A core set of variables were found to be key determinants of CHE. The number of working adults in a household and membership in a social safety net appear to reduce the risk of catastrophic expenditure. Conversely, seeking care in a public or private hospital increases the risk of CHE. Conclusion: This study suggests that a substantial proportion of residents of informal settlements in Kenya face CHE and would likely forgo health care they need but cannot afford. Mechanisms that pool risk and cost (insurance) are needed to protect slum residents from CHE and improve equity in health care access and payment.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f2d445865fc0822655553857f3a637c",
  "timestamp": "2025-05-15T03:07:02.669430"
}