{
  "id": 7025,
  "title": "Does Self-Efficacy Moderate the Effect of Gambling Advertising on Problem Gambling Behaviors?",
  "abstract": "Problem gambling causes significant harm to individuals and society. Financial losses from gambling in Australia exceed those anywhere else in the world. Problem gamblers are overrepresented among substance users and rural and remote Australians. Limited research exists on the impact of gambling advertising on problem gambling among those seeking substance use treatment, in rural/remote areas, and protective factors that may guard against these impacts. This study examined whether self-efficacy to control gambling moderated the relationship between the perceived impact of gambling advertising and problem gambling in people seeking treatment for substance use. Participants (N = 198, 60% female) who had recently sought treatment for substance use from services in rural/remote areas of Queensland and New South Wales, Australia. completed an anonymous online survey. Problem gambling severity was measured by the Problem Gambling Severity Index, with 30% of participants showing at least moderate-risk problem gambling behaviors (12% moderate-risk gambling, 18% high-risk gambling). Moderated regression analyses found self-efficacy to control gambling significantly moderated the relationship between the perceived impacts of gambling advertising and the severity of problem gambling. At low levels of self-efficacy to control gambling, higher perceived impacts of advertising on gambling involvement and awareness were associated with higher levels of problem gambling behavior. However, at high levels of self-efficacy to control gambling, the association between problem gambling and impact of gambling advertising was weaker for involvement and not significant for awareness. Findings suggest that self-efficacy could be targeted as a treatment option to protect vulnerable groups from the effects of gambling advertising.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f37f25fd2663df61de90953a96a3ea7",
  "timestamp": "2025-05-15T03:04:22.991963"
}