{
  "id": 7987,
  "title": "Baseline Risk Factors that Predict the Development of Open-Angle Glaucoma in a Population",
  "abstract": "Objective: To determine which baseline sociodemographic, lifestyle, anthropometric, clinical, and ocular risk factors predict the development of open-angle glaucoma (OAG) in an adult population. Design: A population-based, prospective cohort study. Participants: A total of 3772 self-identified Latinos aged >= 40 years from Los Angeles, California, who were free of OAG at baseline. Methods: Participants from the Los Angeles Latino Eye Study had standardized study visits at baseline and 4-year follow-up with structured interviews and a comprehensive ophthalmologic examination. We defined OAG as the presence of an open angle and a glaucomatous visual field abnormality and/or evidence of glaucomatous optic nerve damage in >= 1 eye. Multivariate logistic regression with stepwise selection was performed to determine which potential baseline risk factors independently predict the development of OAG. Main Outcome Measures: Odds ratios for various risk factors. Results: Over the 4-year follow-up, 87 participants developed OAG. The baseline risk factors that predict the development of OAG include older age (odds ratio [OR] per decade, 2.19; 95% confidence interval [CI], 1.74-2.75; P<0.001), higher intraocular pressure (IOP; OR per mmHg, 1.18; 95% CI, 1.10-1.26; P<0.001), longer axial length (OR per mm, 1.48; 95% CI, 1.22-1.80; P<0.001), thinner central cornea (OR per 40 mu m thinner, 1.30; 95% CI, 1.00-1.70; P = 0.050), higher waist-to-hip ratio (OR per 0.05 higher, 1.21; 95% CI, 1.05-1.39; P = 0.007) and lack of vision insurance (OR, 2.08; 95% CI, 1.26-3.41; P = 0.004). Conclusions: Despite a mean baseline IOP of 14 mmHg in Latinos, higher IOP is an important risk factor for developing OAG. Biometric measures suggestive of less structural support such as longer axial length and thin central corneal thickness were identified as important risk factors. Lack of health insurance reduces access to eye care and increases the burden of OAG by reducing the likelihood of early detection and treatment of OAG. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2012;119:2245-2253 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f50f5475348adc317b7dffb4f6a93c3",
  "timestamp": "2025-05-15T03:14:07.250062"
}