{
  "id": 1345,
  "title": "Analysis on innovation management of power financial transaction strategy integrating BO-BERT-GRNN model",
  "abstract": "This paper addresses the innovation management problem of financial trading strategies for power system planning through the utilization of the BO-BERT-GRNN model. The BO-BERT-GRNN model, which combines Bayesian optimization, BERT model, and gated recurrent neural network, is divided into three parts to optimize hyperparameters, extract features from historical data, and model and predict power system planning. The objective is to achieve electricity asset allocation, market risk management, and revenue maximization. Experimental analysis demonstrates that the BO-BERT-GRNN model outperforms in power system planning price prediction, energy transaction risk management, and energy asset allocation, showcasing its potential for practical application. This paper addresses the innovation management problem of financial trading strategies for power system planning through the utilization of the BO-BERT-GRNN model. The BO-BERT-GRNN model, which combines Bayesian optimization, BERT model, and gated recurrent neural network, is divided into three parts to optimize hyperparameters, extract features from historical data, and model and predict power system planning. The objective is to achieve electricity asset allocation, market risk management, and revenue maximization. Experimental analysis demonstrates that the BO-BERT-GRNN model outperforms in power system planning price prediction, energy transaction risk management, and energy asset allocation, showcasing its potential for practical application.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f7e1560b6ce20285266c67a23c1dd94",
  "timestamp": "2025-05-15T02:01:44.829485"
}