{
  "id": 4911,
  "title": "Corporate bond default prediction using bilateral topic information of credit rating reports",
  "abstract": "The default of corporate bonds can result in large financial losses as well as irreparable harm to investors' trust and the economy as a whole, which implies that the identification of corporate bond default must be done promptly and properly. Current studies mainly rely on accounting and/or macroeconomic data and use the credit rank (CR) to disclose the credit status of corporate bonds in the default prediction task. However, the textual data of credit rating reports (CRRs) contain richer and more comprehensive information and are neglected in related work. In this paper, we propose a novel framework that draws on the unstructured data in CRR to predict the default of corporate bonds. We extract the rating opinion sentences (categorized as positive and negative) from the collected CRR files and use latent Dirichlet allocation (LDA) models to mine topic information. The bilateral topic information of positive and negative opinions can reflect the anti-risk ability and potential risk of corporate bonds, respectively, based on which the constructed topic features are used for default prediction. Results on real-world Chinese corporate bonds dataset show that the bilateral topic information of CRR can significantly improve the predicting power of models (LR, SVM, KNN and MLP) under three performance metrics (AUC, KS and H-measure). By analyzing the ranking of topic features using SHAP value, the proposed framework can explain the factors that affect bond defaults, which can provide a basis for the decision-making of investment behavior.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2f84a58cf9f6a75a07b7e4e49bc8664f",
  "timestamp": "2025-05-15T02:42:04.991377"
}