{
  "id": 7783,
  "title": "Traumatic stress symptoms among Spanish healthcare workers during the COVID-19 pandemic: a prospective study",
  "abstract": "AimTo investigate the occurrence of traumatic stress symptoms (TSS) among healthcare workers active during the COVID-19 pandemic and to obtain insight as to which pandemic-related stressful experiences are associated with onset and persistence of traumatic stress. MethodsThis is a multicenter prospective cohort study. Spanish healthcare workers (N = 4,809) participated at an initial assessment (i.e., just after the first wave of the Spain COVID-19 pandemic) and at a 4-month follow-up assessment using web-based surveys. Logistic regression investigated associations of 19 pandemic-related stressful experiences across four domains (infection-related, work-related, health-related and financial) with TSS prevalence, incidence and persistence, including simulations of population attributable risk proportions (PARP). ResultsThirty-day TSS prevalence at T1 was 22.1%. Four-month incidence and persistence were 11.6% and 54.2%, respectively. Auxiliary nurses had highest rates of TSS prevalence (35.1%) and incidence (16.1%). All 19 pandemic-related stressful experiences under study were associated with TSS prevalence or incidence, especially experiences from the domains of health-related (PARP range 88.4-95.6%) and work-related stressful experiences (PARP range 76.8-86.5%). Nine stressful experiences were also associated with TSS persistence, of which having patient(s) in care who died from COVID-19 had the strongest association. This association remained significant after adjusting for co-occurring depression and anxiety. ConclusionsTSSs among Spanish healthcare workers active during the COVID-19 pandemic are common and associated with various pandemic-related stressful experiences. Future research should investigate if these stressful experiences represent truly traumatic experiences and carry risk for the development of post-traumatic stress disorder.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fac6a6d69686413d98ba46ba13c4e89",
  "timestamp": "2025-05-15T03:12:11.586513"
}