{
  "id": 7153,
  "title": "The effects of foreign currency exposure and Shari'ah-compliant status on financial hedging strategy",
  "abstract": "Purpose Drawing upon underinvestment theory and clientele effect hypothesis, this paper aims to examine the effects of foreign currency (forex) exposure and Shari'ah-compliant status on firms' financial hedging strategy. Design/methodology/approach Based on data of 250 nonfinancial firms listed on Bursa Malaysia from 2010 to 2018 (2,250 firm-year observations), the authors test the impact of forex exposure based on a vector of foreign-denominated cash flows (FCF) indicators and firms' ShariMODIFIER LETTER LEFT HALF RINGah-compliant status on two proxies of financial hedging decisions, namely, the ratio of the notional value of currency derivatives to total assets and a binomial measure of hedging status. The hedging decision models are estimated using panel logistic regression and system generalized method of moments. Findings The results indicate significant positive effects of the forex exposure indicators on firms' propensity to hedge. However, the impact of forex exposure is most prevalent via total FCF. The results also reveal significant positive effects of ShariMODIFIER LETTER LEFT HALF RINGah-compliant status on firms' propensity to hedge but its negative impacts on the value of currency derivatives they use. The results suggest that ShariMODIFIER LETTER LEFT HALF RINGah-compliant firms refrain from engaging in currency derivatives to avoid riba' and subsequently subdue the clientele effect. However, when the forex exposure reaches higher levels, engagement in currency derivatives becomes a matter of tentative necessity (dharurat). Research limitations/implications This study relies exclusively on the disclosure of foreign currency risk and management data in the annual reports of listed companies. Consequently, this limits the sample size to only those nonfinancial listed companies with complete data for the study period. Also, since none of the companies reports using ShariMODIFIER LETTER LEFT HALF RINGah-compliant derivatives, the authors thus assume that they use derivative instruments that tolerate riba. Practical implications Given the significance of forex exposure on hedging decisions, the accounting profession must strictly adopt FRS 7 and FRS 139 for all listed firms to avoid market scrutiny and sustain their clientele. The results also call for the Islamic market regulators to include mandatory disclosure of conventional currency derivatives in screening firms for clearly prohibited activities to help enhance the credibility of its Islamic financial market. Originality/value Due to difficulty accessing relevant cash flow data, the study is among the few studies that measure forex exposure using FCF and test more proxy indicators. This study is perhaps the first to examine the Shari'ah perspective on currency derivatives in corporate forex risk management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2faeeee3bc0ba60fa576f62f384ae6e8",
  "timestamp": "2025-05-15T03:05:32.096815"
}