{
  "id": 8248,
  "title": "Integrating leader affect, leader work-family spillover, and leadership",
  "abstract": "Purpose - Despite the abundance of dispositional affect, work-family, and leadership research, little has been done to integrate these literatures. Based primarily on conservation of resources theory, which suggests individuals seek to acquire and maintain resources to reduce stress, the purpose of this paper is to provide an empirical examination of the relationships between leader dispositional affect, leader work-family spillover, and leadership. Design/methodology/approach - Survey data were collected from a diverse sample of managers from a broad set of occupational groups (e. g. financial, government, library). Regression and Monte Carlo procedures were used to estimate model direct and indirect effects. Findings - The results indicate that dispositional affect is a strong predictor of both work-family spillover and leadership. Further, the relationship between negative/positive affect and leadership was partially mediated by work-family conflict/enrichment. Research limitations/implications - Data were cross-sectional self-report, which does not allow for causal interpretations and may increase the risk of common method bias. Practical implications - This study helps address why leaders experience both stress and benefits from multiple work and family demands, as well as why leaders engage in particular forms of leadership, such as passive and active leadership behaviors. Originality/value - This study provides the first empirical examination of leader's dispositional affect, work-family spillover, and leadership, and suggests that manager's dispositional affect and work-family spillover have meaningful relationships with leader behavior across situations.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fc5f1b7d676cc5e2ad19c6b38979511",
  "timestamp": "2025-05-15T03:16:49.007832"
}