{
  "id": 420,
  "title": "Sector-level equity returns predictability with machine learning and market contagion measure",
  "abstract": "In this paper, we develop new latent risk measures that are designed as a prior synthesis of key forecasting information associated with financial market contagion. These measures are based on the decomposition (using high-frequency financial data) of the quadratic covariation between two assets into continuous and jump components. We also examine the usefulness of a large variety of machine learning methods for forecasting equity returns at market and sector levels. In addition to constructing predictions using standard machine learning methods, we also investigate the predictive performance of a group of hybrid machine learning methods that combine least absolute shrinkage operator and neural network methods. We demonstrate that the novel latent measures significantly reduce the MSFE when added into candidate machine learning models and are dominant predictive signals based on variable importance analysis, suggesting that the latent measures constructed using high-frequency financial data are useful for predicting returns. Overall, at the monthly frequency, we find that machine learning methods significantly improve forecasting performance relative to the random walk and linear benchmark alternatives, when comparing mean square forecast error (MSFE), and when implementing Diebold-Mariano (DM) predictive accuracy test. The best method is the random forest method, which wins in almost all permutations, across all of the target variables that we predict. It is also worth noting that our hybrid machine learning methods often outperform individual methods.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fc752e232895f65acfbae22bccc852e",
  "timestamp": "2025-05-15T01:50:52.609225"
}