{
  "id": 5637,
  "title": "Intravitreal Topotecan for Vitreous Seeds in RetinoblastomaA Long-term Review of 91 Eyes",
  "abstract": "Purpose: To study the long-term efficacy of intravitreal topotecan (IVT) for vitreous seeds in eyes with retinoblastoma and risk factors for their recurrence. Design: Retrospective, non-comparative, interventional study. Participants: Ninety-one eyes of 90 patients with retinoblastoma treated between January 2013 and April 2019. Methods: Patients with recurrent or refractory vitreous seeds after completion of intravenous or intra-arterial chemotherapy were treated with IVT (30 mu g/0.15 ml) by the safety-enhanced technique. The injection was repeated every 4 weeks until the regression of seeds. Patients with a minimum follow-up of 12 months were included in the analysis. Main Outcome Measures: Primary outcome measures were vitreous seed regression and eye salvage. Secondary outcomes were risk factors for vitreous seed recurrence after treatment with IVT, vision salvage, and complications of IVT. Results: The median age of the patients was 18 months, with most having group D (n = 58 [64%]) and group E (n = 26 [29%]) retinoblastoma. Vitreous seeds were refractory in 46 eyes (51%) and recurrent in 45 eyes (49%). A total of 317 IVT injections were administered, with the median being 3 injections. The median number of IVT injections required was 2.5 injections for dust, 3 injections for sphere, and 5 injections for cloud morphologic features. Recurrence of vitreous seeds after IVT was seen in 17 eyes (19%) at a mean follow-up of 7.9 months. At a mean follow-up 34 months, vitreous seed regression was achieved in 88 eyes (97%) and eye salvage was achieved in 77 eyes (85%). Older age (P = 0.018) and recurrence of retinal tumor (15/17 eyes; P < 0.01) significantly increased the risk of vitreous seed recurrence. Cataract was the most common complication seen in 17 eyes (9%). Conclusions: Intravitreal topotecan at an every 3- to 4-week regimen is effective against both refractory and recurrent vitreous seeds. The vitreous seed morphologic features correspond to the number of injections required for regression. Increasing age and recurrence of retinal tumor increase the risk of vitreous seed recurrence after treatment with IVT. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fd6a6ae1a85b75cff22ecd3a556fbfc",
  "timestamp": "2025-05-15T02:49:50.314644"
}