{
  "id": 4203,
  "title": "Financial Burden in Recipients of Allogeneic Hematopoietic Cell Transplantation",
  "abstract": "Although allogeneic hematopoietic cell transplantation (HCT) is an expensive treatment for hematological disorders, little is known about the financial consequences for the patients who undergo this procedure. We analyzed factors associated with its financial burden and its impact on health behaviors of allogeneic HCT recipients. A questionnaire was retrospectively mailed to 482 patients who underwent allogeneic HCT from January 2006 to June 2012 at the Mayo Clinic, to collect information regarding current financial concerns, household income, employment, insurance, out-of-pocket expenses, and health and functional status. A multivariable logistic regression analysis identified factors associated with financial burden and treatment nonadherence. Of the 268 respondents (56% response rate), 73% reported that their sickness had hurt them financially. All patients for whom the insurance information was available (missing, n = 13) were insured. Forty-seven percent of respondents experienced financial burden, such as household income decreased by >50%, selling/mortgaging home, or withdrawing money from retirement accounts. Three percent declared bankruptcy. Younger age and poor current mental and physical functioning increased the likelihood of financial burden. Thirty-five percent of patients reported deleterious health behaviors because of financial constraints. These patients were likely to be younger, have lower education, and with a longer time since HCT. Being employed decreased the likelihood of experiencing financial burden and treatment nonadherence due to concern about costs. A significant proportion of allogeneic HCT survivors experience financial hardship despite insurance coverage. Future research should investigate potential interventions to help at-risk patients and prevent adverse financial outcomes after this life-saving procedure. (C) 2014 American Society for Blood and Marrow Transplantation.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fdefe6c3e7611d8e0c4794ba7d8f751",
  "timestamp": "2025-05-15T02:34:13.473719"
}