{
  "id": 3927,
  "title": "A novel strategy segmentation methodology integrating Kraljic portfolio matrix and supplier relationship model: a case study from machinery industry",
  "abstract": "PurposeThe purpose of this article is to develop a new model called strategy segmentation methodology (SSM) by combining the Kraljic portfolio matrix (KPM) and the supplier relationship model (SRM) so that the buyer company can effectively conduct its relations with its suppliers.Design/methodology/approachThe importance weights of the criteria defining the dimensions of each model are calculated with the single-valued neutrosophic analytical hierarchy process (SVN-AHP) method. Subsequently, the derived importance weights are employed in the single-valued neutrosophic technique for order preference by similarity to ideal solution (SVN-TOPSIS) method to obtain the scores of the suppliers and their supplied items. In order to illustrate the feasibility of the proposed methodology, a case study in the machinery industry is performed with the related comparative analysis.FindingsThe implementation of SSM enables to formulate various strategies to manage suppliers taking into account the items they procure, their capabilities and performance and the supplier-buyer relationship strength. Based on the proposed strategies, it is concluded that the firm in the case study should terminate its relationship with six of its suppliers.Originality/valueAlthough KPM has become the basis of purchasing strategies for various businesses, it neglects the characteristics of suppliers and the buyer-supplier relationship. In this study, KPM is integrated with the SRM approach presented by Olsen and Ellram (1997) to overcome these disadvantages of KPM. The novel integration of the two approaches enables the realization of a robust and reliable supplier classification model.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2fe60a328d8544f1066528004ddf9945",
  "timestamp": "2025-05-15T01:22:11.931702"
}