{
  "id": 4707,
  "title": "Barriers to shippers' resistance in adopting truck-sharing services",
  "abstract": "PurposeTruck-sharing stands out as an impactful strategy for minimizing emissions and optimizing the streamlined transport of goods. This study seeks to address a gap in understanding by investigating the barriers shippers face in adopting truck-sharing services.Design/methodology/approachThis study employs the innovation resistance theory to examine a range of potential barriers. A total of seven potential barriers are included in the investigation. Survey data from Bangladeshis are analyzed using an artificial neural network.FindingsThe barriers, ranked in importance, include image, tradition, value, usage, risk, psychological ownership and privacy concerns. Thus, psychological barriers (image and tradition) mostly underpin resistance to change, showing that the issue is more rooted in shippers' perceptions than operations. Also, they often do not find a financial cause to use truck-sharing services. Usage barriers, explicitly addressing the practical application of truck-sharing services, have now assumed the third position, underscoring their significance in overcoming the barriers.Research limitations/implicationsThe findings provide valuable insights for policymakers to reconsider their approaches in addressing the most formidable truck-sharing barriers.Practical implicationsThis insight holds implications for shippers and transport companies, offering strategic guidance to optimize their engagement with and support for such services.Originality/valueTo the best of our knowledge, this study examines shippers' reluctance to adopt truck-sharing services in a developing country.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "2ff32aa21ffcf8f3ae1be58c1316717d",
  "timestamp": "2025-05-15T02:39:57.625337"
}