{
  "id": 2554,
  "title": "Efficiency analysis in knitted fabric portfolio management using DEA",
  "abstract": "Purpose - The purpose of this paper is to develop a decision-making protocol to meet the new requirements in an atypical panorama, such as the economic instability, in the textile industry. Design/methodology/approach - The methodology consists of analyzing technical criteria, costing parameters and efficiency scores of knitted fabrics using the data envelopment analysis (DEA) and classification and regression (C&R) trees models, together with statistical techniques. From these tools, it is possible to guide the portfolio management of these products in a textile company, identifying those that are inefficient and require immediate management measures. The results are expected to be replicated in other companies because the DEA and C&R trees analytical procedures are applicable to different portfolios, whether in the same industry or not. Findings - The results allowed identifying inefficient textile products regarding the input-output relationship and the main technical reasons related to the most significant inefficiencies, such as fiber composition and knitted fabrics rapports used in manufacturing. Originality/value - DEA and C&R trees, in combination with the study of textile technical parameters, can be fundamental to investigating the efficiency and profitability of industries in periods of economic instability or other adverse situations. In addition, it is noteworthy that there are practically no studies in the literature on DEA applied in the textile industry, indicating excellent development potential.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30260f454684292588e7df72bd4dceae",
  "timestamp": "2025-05-15T01:08:10.776752"
}