{
  "id": 8900,
  "title": "Association between physical activity and the prevalence of gout among patients with type 2 diabetes mellitus and hyperuricemia: a two-center population-based cross-sectional study",
  "abstract": "Introduction Diabetes mellitus (DM) and gout cohabitation severely reduces patient life quality while raising financial burden on individual and society. The aim of this study was to elucidate the association between physical activity (PA) and the prevalence of gout among type 2 DM (T2DM) and hyperuricemia (HUA) patients. Methods In all, we recruited 2291 T2DM patients with HUA. Among them, 448 had gout and 1843 did not. We collected patient data, such as anthropometry, laboratory reports, and medical history, for our analyses. The PA assessment was based on the Chinese version of International PA Questionnaire-short (IPAQ). Moreover, the relationship between PA and gout risk was examined using multivariate logistic regression models. Results Total PA was markedly low among gout patients, relative to controls (p < 0.05). Based on the IPAQ categorical score, 38.2% exhibited low, 26.8% moderate, and 35.0% high PA among gout patients. In comparison, 12.4% performed low, 53.8% moderate, and 33.8% high PA among controls. Multivariate analysis revealed that, after adjustment of confounding factors, both low (OR 6.382) and high PA (OR 2.048) had a higher prevalence of gout, as compared to moderate PA. Moreover, we revealed that the male sex, age, HUA duration, serum uric acid, glycated hemoglobin, dyslipidemia history, and drinking status were also independent indicators of the prevalence of gout. Furthermore, stratification analyses revealed results consistent with our prior results. Conclusions PA intensity was associated with the prevalence of gout among T2DM and HUA patients, and the lowest prevalence was achieved from moderate intensity PA.Key Points center dot PA intensity was associated with the prevalence of gout among T2DM and HUA patients.center dot The lowest prevalence of gout was achieved from moderate intensity PA.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3042d00b82cb44026c1c0e8393b9d150",
  "timestamp": "2025-05-15T03:23:27.865694"
}