{
  "id": 2228,
  "title": "Cluster Analysis of Financial Strategies of Companies",
  "abstract": "Measuring the value of companies and assessing their risk often relies on econometric methods that consider companies as a set of objects under study, homogeneous in the sense of their use of financial strategies. This paper shows that cluster analysis methods can divide companies into classes according to financial strategies that they employ. This indicates that homogeneity can be considered within these classes, while between-class companies should rather be perceived as heterogeneous. The clustering of companies has to be performed on quite a dense set of strategies, which requires a combination of formal and heuristic methods. To divide companies into classes, we used financial coefficients characterizing strategies for the 2030 largest non-financial companies within the time period from 2006 to 2018. As a result, a stable division into seven clusters/strategies was obtained. We revealed that some strategies were more characteristic for the companies of high-tech economy, while others were typical for the companies in basic industries. The dynamics of clusters is characterized by an increase in the share of risky strategies. A good meaningful interpretation of the resulting clustering confirms its consistency. The identified clusters can be used as dummy variables in econometric studies of companies to improve the quality of the results.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "304c226d2e6ecbba769cb33ae0a37f4a",
  "timestamp": "2025-05-15T02:12:50.982405"
}