{
  "id": 4096,
  "title": "Regional differences study of renewable energy performance: A case of wind power in China",
  "abstract": "In recent years, the profit growth of wind power enterprises in China is generally weak, and the phenomenon of wind curtailment in some areas is relatively common. The comprehensive evaluation of wind power performance in various regions of China and the study of the driving forces of wind power performance differences in different regions are of great significance for scientific planning and layout of wind power investment. Based on the panel data, this paper combines Data Envelopment Analysis (DEA) and Technique for Order Preference by Similarity to an Ideal Solution (TOPSIS) to establish an evaluation model to evaluate the wind power performance of China's 29 provinces and cities from 2011 to 2018. Then uses the evaluation results as input data of Adaptive Neuro-Fuzzy Inference System (ANFIS) prediction model to predict the wind power performance of 2019 in various regions of China under the current policy and environment. Finally, the main factors affecting the performance of China's wind power generation are explored by establishing a regression model. The research results show that at present, the main factors affecting the performance of China's wind power generation are local power consumption capacity, economic development degree and the rate of wind abandonment. On the premise of solving the problem of wind curtailment, appropriately promoting power consumption and renewable energy policy reform, from Feed-in-Tariff (FiT) to a Renewable Portfolio Standard (RPS), are effective means to promote the development of wind power generation in China. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "304effbb849c01cb45081a04ae2f7765",
  "timestamp": "2025-05-15T01:23:58.021712"
}