{
  "id": 7615,
  "title": "Factors Influencing Online Shopping Intention: An Empirical Study in Vietnam",
  "abstract": "The study examines factors that influence shopping intention of online consumers in Vietnam. Studied factors include consumers' attitude, subjective norms, perception of behavioral control, perception of usefulness, perceived risks and trust. The expansion of Theory of Planned Behavior (TPB) and Technology Acceptance Model (TAM) are used as basic theories. We have surveyed people who have experiences on online shopping. There are 836 selected questionnaires that are qualified for data processing. The collected data are analyzed through a process which starts from scale reliability test to exploratory factor analysis (EFA), correlation analysis and regression analysis. The results show that shopping intention of online consumers are positively affected by their attitude, subjective norms, perception of behavioral control, perception of usefulness and trust. In contrast, online shopping intention is negatively affected by the perceived risks that online shopping could bring. Among those factors, the perception of risk is shown to have the strongest influence to online shopping intention. The findings of this study suggest that managers and retailers can apply cash-on-delivery method and design their website with user-friendly interface to enhance online shopping intention of consumers. The Government is also recommended to fulfill the law system to reduce customers' perception of financial risks.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3059a45a9fa04c341f813aa8862bf3b5",
  "timestamp": "2025-05-15T03:10:32.975220"
}