{
  "id": 104,
  "title": "Analysis of Regional Financial Risk in Guangdong Province Based on the DCN Deep Learning Model",
  "abstract": "In the free flow of financial factors oriented to capital, returns will be accompanied by the concentration and diffusion of financial resources to form regional financial spatial differences, which is an objective phenomenon of regional financial practice. Localized regional financial risks may appear in the process of regional financial practice in each region. To address the abovementioned problems, we propose a model for regional financial risk analysis based on the DCN deep learning model. The main contents are as follows: elaborating the financial risk transmission mechanism involving intra- and interregional financial risks, sorting out the relationship between sectors as clues; the designing process of regional financial risk index as well as the measurement method, and the regional financial risk index for typical regions is measured and found to be at peak in 2017 with a risk index of 0.58; and the construction of an early warning model based on the value of the regional financial risk index and the expansion of the RNN network applied to the construction of the regional financial risk early warning system. Based on the construction of the RNN network application risk early warning system, the three types of risks, payment risk, loan loss risk, and market risk with the percentages of 49.62%, 26.82%, and 23.56%, respectively, are derived, and the focus is on their supervision and management in the follow-up work.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3059289f26b8f4e77816a55ba46030f5",
  "timestamp": "2025-05-15T01:33:49.061929"
}