{
  "id": 9224,
  "title": "Prevalence of Eye Disease in Early Childhood and Associated Factors Findings from the Millennium Cohort Study",
  "abstract": "Purpose: To report the prevalence and distribution of eye conditions and visual impairment and associations with early social and biological factors using parental report of diagnosed eye conditions and additional chronic illnesses. Design: Population-based, cross-sectional study. Participants: We included 14 981 children, aged 3 years, participating in the United Kingdom Millennium Cohort Study. Methods: Data on demographic, socioeconomic, and maternal and child health factors were obtained by maternal report through structured interview and verbatim reports of diagnosed eye problems and additional chronic illnesses were recorded. Multinomial regression analyses were used to calculate risk ratios of the association of eye disease (with or without associated visual impairment), with socioeconomic and early life factors. Main Outcome Measures: Parental report of diagnosed eye conditions and other chronic illnesses. Results: Overall, at 3 years, 5.7% (95% confidence interval, 5.2-6.3%; n = 881) of children had 1 eye condition with 0.24% (0.15-0.3%; n = 45) reported to have associated visual impairment. In the majority, time of onset was reported to be the first year of life. Eye disorders without report of visual impairment were independently associated with lower socioeconomic status, decreasing birth weight, and prematurity. Visual impairment was more likely in those of low birthweight for gestational age and from an ethnic minority group. Maternal illnesses during pregnancy were associated with eye disease without reported visual impairment, as was white ethnicity. Conclusions: Good research opportunities exist within the context of population-based general health surveys to use parental report to estimate minimum prevalence, investigate associations of eye disease with a broad range of environmental factors, and as a mechanism for flagging individuals with eye disease in a population sample for further study. Our findings regarding the association of parentally reported childhood eye disease with early life factors such as modest degrees of prematurity, ethnicity and maternal ill-health warrant further investigation. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2010; 117: 2184-2190 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "306fa9a1d14c321e813df467dce4269b",
  "timestamp": "2025-05-15T03:26:54.515498"
}