{
  "id": 429,
  "title": "Can intangible assets predict future performance? A deep learning approach",
  "abstract": "Purpose The aim of this study is to evaluate of the predictive ability of goodwill and other intangible assets on forecasting corporate profitability. Subsequently, this study compares the efficiency of deep learning model to that of other machine learning models such as random forest (RF) and support vector machine (SVM) as well as traditional statistical methods such as the linear regression model. Design/methodology/approach Studies confirm that goodwill and intangibles are valuable assets that give companies a competitive advantage to increase profitability and shareholders' returns. Thus, by using as sample Greek-listed financial data, this study investigates whether or not the inclusion of goodwill and intangible assets as input variables in this modified deep learning models contribute to the corporate profitability prediction accuracy. Subsequently, this study compares the modified long-short-term model with other machine learning models such as SVMs and RF as well as the traditional panel regression model. Findings The findings of this paper confirm that goodwill and intangible assets clearly improve the performance of a deep learning corporate profitability prediction model. Furthermore, this study provides evidence that the modified long short-term memory model outperforms other machine learning models such as SVMs and RF , as well as traditional statistical panel regression model, in predicting corporate profitability. Research limitations/implications Limitation of this study includes the relatively small amount of data available. Furthermore, the aim is to challenge the authors' modified long short-term memory by using listed corporate data of Greece, a code-law country that suffered severely during the recent fiscal crisis. However, this study proposes that future research may apply deep learning corporate profitability models on a bigger pool of data such as STOXX Europe 600 companies. Practical implications Subsequently, the authors believe that their paper is of interest to different professional groups, such as financial analysts and banks, which the authors' paper can support in their corporate profitability evaluation procedure. Furthermore, as well as shareholders are concerned, this paper could be of benefit in forecasting management's potential to create future returns. Finally, management may incorporate this model in the evaluation process of potential acquisitions of other companies. Originality/value The contributions of this work can be summarized in the following aspects. This study provides evidence that by including goodwill and other intangible assets in the authors' input portfolio, prediction errors represented by root mean squared error are reduced. A modified long short-term memory model is proposed to predict the numerical value of the profitability (or the profitability ratio) in contrast to other studies which deal with trend predictions, i.e. the binomial output result of positive or negative earnings. Finally, posing an extra challenge to the authors' deep learning model, the authors' used financial statements according to International Financial Reporting Standard data of listed companies in Greece, a code-law country that suffered during the recent fiscal debt crisis, heavily influenced by tax legislation and characterized by its lower investors' protection compared to common-law countries.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3070b5d9a710dcfd7140654c9334bed8",
  "timestamp": "2025-05-15T00:43:10.590751"
}