{
  "id": 224,
  "title": "Financial Portfolio Management Based on Shaped- Based Unsupervised Machine Learning: A Dynamic Time Warping Baycenter Averaging Approach to International Markets and Periods of Downside Event Risks",
  "abstract": "Empirical evidence has shown that modern portfolio theory relating to diversification had failed investors in the recent financial crises, times when investors would hope that diversification is an effective tool to sustain portfolio performance. Almost all markets around the world declined, with varying degrees, at the 2008 financial crisis and 2020 COVID-19 market crisis. Correlation-based diversification optimized portfolios were not spared, generating significant losses. Recent research on an unsupervised machine learning method of time-series clustering using Dynamic Time Warping (DTW) as a distance measure have shown research promise as a financial portfolio diversification method and shown prospects of overcoming correlation convergence issues during periods of downside event risks. This research validates the applicability of DTW cluster diversification to achieve persistent portfolio performance in international developed markets, even across periods of market weakness. Results showed outperformance of mean and median return and Sharpe metrics of optimally weighted DTW cluster diversification, against correlation-based diversification methods. The findings will augment existing literature in the use of data science approach to portfolio diversification.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30823afa7e69dafd0054859721fc1220",
  "timestamp": "2025-05-15T00:40:34.201832"
}