{
  "id": 5220,
  "title": "Salary and Quality Compensation for Physician Practices Participating in Accountable Care Organizations",
  "abstract": "BACKGROUND The accountable care organization (ACO) is a new organizational form to manage patients across the continuum of care. There are numerous questions about how ACOs should be optimally structured, including compensation arrangements with primary care physicians. METHODS Using data from a national survey of physician practices, we compared primary care physicians' compensation between practices in ACOs and practices that varied in their financial risk for primary care costs using 3 groups: practices not participating in a Medicare ACO and with no substantial risk for primary care costs; practices not participating in an ACO but with substantial risk for primary care costs; and practices participating in an ACO regardless of their risk for primary care costs. We measured physicians' compensation as the percentage of compensation based on salary, productivity, clinical quality or patient experience, and other factors. Regression models estimated physician compensation as a function of ACO participation and risk for primary care costs while controlling for other practice characteristics. RESULTS Physicians in ACO and non-ACO practices with no substantial risk for costs on average received nearly one-half of their compensation from salary, slightly less from productivity, and about 5% from quality and other factors. Physicians not in ACOs but with substantial risk for primary care costs received two-thirds of their compensation from salary, nearly one-third from productivity, and slightly more than 1% from quality and other factors. Participation in ACOs was associated with significantly higher physician compensation for quality; however, participation was not significantly associated with compensation from salary, whereas financial risk was associated with much greater compensation from salary. CONCLUSION Although practices in ACOs provide higher compensation for quality, compared with practices at large, they provide a similar mix of compensation based on productivity and salary. Incentives for ACOs may not be sufficiently strong to encourage practices to change physician compensation policies for better patient experience, improved population health, and lower per capita costs.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "309aba59b9373a5c4c10d5a5ffb819d6",
  "timestamp": "2025-05-15T02:45:47.320296"
}