{
  "id": 4551,
  "title": "Forecasting PGR of the financial industry using a rough sets classifier based on attribute-granularity",
  "abstract": "In the financial industry, continually changing economic conditions and characteristics involving uncertainty and risk have made financial forecasts even more difficult, increasing the need for more reliable ways to forecast a bank's operating performance. However, early related studies of performance analysis for using statistical methods usually become more complex when relationships in input/output data are nonlinear. Furthermore, strict data assumptions, such as linearity, normality, and independence, limit real-world applications often. Additionally, a drawback of traditional rough sets is that data must be discretized first for improving classification accuracy. To remedy the existing shortcomings above, the study proposes a hybrid procedure, which mixes professional knowledge, an attribute granularity, and a rough sets classifier, for automatically classifying profit growth rate (PGR) to solve real problems faced by investors. The proposed procedure is illustrated by examining a practical dataset for publicly traded financial holding stocks in Taiwan's stock markets. The experimental results reveal that the proposed procedure outperforms listing methods in terms of accuracy, and they provide useful insights in responsiveness to rapidly changing stock market conditions. Importantly, the output created by the rough sets LEM2 (Learning from Examples Module, version 2) algorithm is a set of comprehensible rules applied in a knowledge-based investment system for investors.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30a202ea604aeef9eb8cc3389c2da821",
  "timestamp": "2025-05-15T02:38:20.462287"
}