{
  "id": 1845,
  "title": "The impact of heuristic and herding biases on portfolio construction and performance: the case of Greece",
  "abstract": "Purpose The purpose of this paper is to identify whether heuristic and herding biases influence portfolio construction and performance in Greece. The current research determines the situation among investors in Greece, a country with several economic problems for the last decade. Design/methodology/approach A survey has been conducted covering a group of active private investors. The relationship between private investors' behavior and portfolio construction and performance was tested using a multiple regression. Findings The authors find that heuristic variable affects private investor's portfolio construction and performance satisfaction level positively. A robustness test on a second group, consisting of professional investors, reveals that heuristic and herding biases affect investment behavior when constructing a portfolio. Practical implications The authors recommend investors to select professional's investment portfolio tools in constructing investment portfolios and avoid excessive errors, which occur due to heuristic. The awareness and understanding of heuristic and herding could be helpful for professionals and decision-makers in financial institutions by improving their performance resulting in more efficient markets. Originality/value The main contribution of this paper lies in the fact that it is the first study on two major behavioral dimensions that affect the investor's portfolio construction and performance in Greece. The rationale of the current research is that the results are helpful for investors in order to take rational, reliable and profitable decisions.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30a7171b24e21ad434e28e63ffd3f2d4",
  "timestamp": "2025-05-15T01:00:27.280188"
}