{
  "id": 6038,
  "title": "Clinical impact of malnutrition on complication rate and length of stay in elective ENT patients: a prospective cohort study",
  "abstract": "Malnutrition is considered as an independent risk factor for morbidity, mortality and a prolonged hospital stay for in-hospital patients. While most available data on the impact of malnutrition on health-related and financial implications refer to gastroenterologic or abdominal surgery patients, little is known about the impact of malnutrition on Ear Nose Throat (ENT)/head and neck surgery patients. The objective of this study was to investigate the impact of malnutrition on morbidity and length of hospital stay in an elective ENT/head and neck surgery patient cohort. The study was performed as a single-center, prospective cohort study at a tertiary referral centre. Nutritional risk at admission was assessed using the NRS-2002 screening tool. Multivariate regression models were used to determine independent risk factors for complications and a prolonged hospitalization. Three hundred fifty one participants were included in the study. A malignant disease was found in 62 participants (17.7 %). 62 patients (17.7 %) were at a moderate to severe risk of malnutrition. A bad general health condition and complications during hospital stay could be identified as independent risk factors for a prolonged hospitalization. Patients with a malignant tumor showed a more than fourfold higher risk of developing at least one complication. Malnutrition, however, was not statistically associated with a higher complication rate or a prolonged hospital stay. Our data suggests that malnutrition does not seem to play such an important role as a risk factor for complications and a prolonged hospital stay in ENT patients as it does in other disciplines like abdominal surgery or gastroenterology.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30a8584aacb9eec3e4d68cfd9b60fe2e",
  "timestamp": "2025-05-15T02:54:03.435033"
}