{
  "id": 466,
  "title": "Trends in Triptan Usage in Korea: A Population-Based Cohort Study",
  "abstract": "Background: Migraine presents a significant global health problem that emphasizes the need for efficient acute treatment options. Triptans, introduced in the early 1990s, have substantially advanced migraine management owing to their effectiveness compared to that of traditional medications. However, data on triptan use in migraine management from Asian countries, where migraines tend to have milder symptoms than those in European and North American countries, are limited. This study aimed to identify the trends in triptan usage in Korea. Methods: This retrospective cohort study used data from the Korean National Health Insurance Service-National Sample Cohort spanning from 2002 to 2019. Patients with migraine were identified using the International Classification of Diseases 10th revision codes, and triptan prescriptions were evaluated annually in terms of quantity, pills per patient, and associated costs. The distribution of triptan prescriptions across different medical specialties was also examined. Factors contributing to the odds of triptan use were analyzed using multivariable logistic regression. Results: From 2002 to 2019, the total number of triptan tablets, prescriptions, and patients using triptans increased by 24.0, 17.1, and 13.6 times, respectively, with sumatriptan being the most frequently prescribed type of triptan. Additionally, the number of prescriptions and related costs have consistently increased despite stable pricing because of government regulation. By 2019, only approximately one-tenth of all patients with migraines had been prescribed triptans, although there was a notable increase in prescriptions over the study period. These prescription patterns varied according to the physician's specialty. After adjusting for patient-specific factors including age and sex, the odds of prescribing triptans were higher for neurologists than for internal medicine physicians (odds ratio 2.875, P < 0.001), while they were lower for general practitioners (odds ratio 0.220, P < 0.001). Conclusion: The findings revealed an increasing trend in triptan use among individuals with migraines in Korea, aligning with global usage patterns. Despite these increases, the overall prescription rate of triptans remains low, indicating potential underutilization and highlighting the need for improved migraine management strategies across all medical fields. Further efforts are necessary to optimize the use of triptans in treating migraines effectively.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30c6468f79d0afa3986fbbe83d56f8f4",
  "timestamp": "2025-05-15T01:32:30.162470"
}