{
  "id": 7851,
  "title": "Breast cancer survivors: return to work and wage loss in selected hospitals in Malaysia",
  "abstract": "This study aimed, firstly, to assess the determinants of return to work (RTW), secondly, to explore the amount of annual wage loss, and finally, to discover the determinants of wage loss among breast cancer (BC) survivors. A cross-sectional study design was used in this research. The data was collected via interview using a validated questionnaire. Logistic regression models were developed to discover the significant determinants of RTW and of wage loss among BC survivors. A total of 256 BC survivors were included in this study. The analysis showed that there was a 21% loss of or reduction in mean income within 1 year after diagnosis. The significant predictors of RTW are being a government employee, having reduced wages or wage loss, and if the case had been diagnosed 1 year or more ago. Being a private sector employee and having a late stage of cancer was a barrier to RTW. The main risk factors for reduced wages or wage loss were belonging to the age group of 40-59 years, being of Chinese or Indian ethnicity, having low educational status, and not returning to work. However, belonging to the higher monthly income group (earning > RM 2000) is a protective factor against the risk of reduced wages or wage loss. Non-RTW and wage loss after diagnosis of BC may result in the survivors experiencing a significant financial burden. Assessment of these patients is becoming more crucial because more women participate in the workforce in Malaysia nowadays and because BC is managed using multiple treatment modalities with their consequences could lead to long absences from work.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30d02ef8132d59f774d37c462b2dd08f",
  "timestamp": "2025-05-15T03:12:36.538037"
}