{
  "id": 3434,
  "title": "Preventable hospitalizations through ED: does the number of hospital beds matter under the global budget in a single-payer system in Taiwan?",
  "abstract": "Background: Taiwan implemented global hospital budgeting with a floating-point value, which created a prisoner's dilemma. As a result, hospitals increased service volume, which caused the floating-point value to drop to less than one New Taiwan Dollar (NTD). The recent increase in the number of hospital beds and the call to enhance the floating-point value to one NTD raise concerns about the potential for increased financial burden without adding value to patient care if hospitals expand their bed capacity for volume-based competition. The present study aimed to examine the relationship between the supply of hospital beds and hospitalizations following an emergency department (ED) visit (called ED hospitalizations) by using diabetes-related ambulatory care sensitive conditions (ACSCs) that are preventable and discretionary as an example. Methods: The study was a pooled cross-sectional design analyzing 2011-2015 population-based claims data in Taiwan. The dependent variable was a dummy variable representing an ED hospitalization, with a treat-and-leave ED visit as the reference group. The key independent variable is the number of hospital beds per 1,000 populations. Multivariate logistic regression models with and without a clustering function were used for the analyses. Results: Approximately 59.26% of diabetes-related ACSCs ED visits resulted in ED hospitalizations. The relationship between the supply of hospital beds and ED hospitalizations was statistically significant (OR = 1.12; 95% CI: 1.09-1.14; P < 0.001) in the model without clustering but was statistically insignificant in the model with clustering (OR = 1.03; 95% CI: 0.94-1.12; P > 0.05). Several social risk factors were positively associated with the likelihood of ED hospitalizations, such as low income and the percentage of the population without a high school diploma. In contrast, other factors, such as female patients and the Charlson comorbidity index, were negatively associated with the likelihood of ED hospitalizations. Conclusion: Under hospital global budgeting with a floating-point value mechanism, increases in hospital beds likely motivate hospitals to admit ED patients with preventable and discretionary conditions. Our study emphasizes the urgent need to add value-based incentive mechanisms to the current global budget payment. The value-based incentive mechanisms may encourage providers to focus on quality of patient care by addressing social risk factors rather than engage in volume-based competition, which would improve population health while reducing preventable ED visits and hospitalizations.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30d7cc783070dd18bb99754cc5cf5838",
  "timestamp": "2025-05-15T02:26:09.158583"
}