{
  "id": 1071,
  "title": "Performance evaluation of state-owned enterprises based on fuzzy neural network combination model",
  "abstract": "Fuzzy neural networks have seen an increasing presence in state-owned enterprise performance evaluation. Fuzzy-based financial and non-financial indicators are combined to evaluate state-owned enterprise performance. In this paper, a combination model is proposed for enterprise performance evaluation. This model is built using fuzzy neural network and uses the fuzzy method along with the neural network's self-learning ability to reduce the impact of subjective factors on the evaluation results while realizing intelligent enterprise performance evaluation. First, this paper proposes construction ideas and principles for the state-owned enterprise' performance evaluation index system and then examines its efficiency. There are two types of indicators in the system: financial and non-financial. The Takagi-Sugeno fuzzy neural network is used to build a financial indicator model. The BP neural network is used to construct a non-financial indicator model for a state-owned enterprise performance evaluation portfolio model based on fuzzy neural networks. Both these networks use a decision support system during the process of building the model. Finally, a comparison is made between the results from Takagi-Sugeno fuzzy neural network and those from the BP neural network performance evaluation model after sample data have been selected, standardization processing has been applied, and a simulation of the network model has been trained. The experiments show that the combined model can be used to evaluate the performance of state-owned enterprises which opens a new direction for evaluating enterprise performance.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30d8acd83051055398f3d7790c11142d",
  "timestamp": "2025-05-15T00:51:25.941898"
}