{
  "id": 6275,
  "title": "Regional variation in fire weather controls the reported occurrence of Scottish wildfires",
  "abstract": "Fire is widely used as a traditional habitat management tool in Scotland, but wildfires pose a significant and growing threat. The financial costs of fighting wildfires are significant and severe wildfires can have substantial environmental impacts. Due to the intermittent occurrence of severe fire seasons, Scotland, and the UK as a whole, remain somewhat unprepared. Scotland currently lacks any form of Fire Danger Rating system that could inform managers and the Fire and Rescue Services (FRS) of periods when there is a risk of increased of fire activity. We aimed evaluate the potential to use outputs from the Canadian Fire Weather Index system (FWI system) to forecast periods of increased fire risk and the potential for ignitions to turn into large wildfires. We collated four and a half years of wildfire data from the Scottish FRS and examined patterns in wildfire occurrence within different regions, seasons, between urban and rural locations and according to FWI system outputs. We used a variety of techniques, including Mahalanobis distances, percentile analysis and Thiel-Sen regression, to scope the best performing FWI system codes and indices. Logistic regression showed significant differences in fire activity between regions, seasons and between urban and rural locations. The Fine Fuel Moisture Code and the Initial Spread Index did a tolerable job of modelling the probability of fire occurrence but further research on fuel moisture dynamics may provide substantial improvements. Overall our results suggest it would be prudent to ready resources and avoid managed burning when FFMC > 75 and/or ISI > 2.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30da740dd473d881c9e457d580622657",
  "timestamp": "2025-05-15T02:56:37.286477"
}