{
  "id": 3120,
  "title": "Identification of biomarkers for hepatocellular carcinoma using network-based bioinformatics methods",
  "abstract": "Background: Hepatocellular carcinoma (HCC) is one of the most common types of cancer worldwide. Despite several efforts to elucidate molecular mechanisms involved in this cancer, they are still not fully understood. Methods: To acquire further insights into the molecular mechanisms of HCC, and to identify biomarkers for early diagnosis of HCC, we downloaded the gene expression profile on HCC with non-cancerous liver controls from the Gene Expression Omnibus (GEO) and analyzed these data using a combined bioinformatics approach. Results: The dysregulated pathways and protein-protein interaction (PPI) network, including hub nodes that distinguished HCCs from non-cancerous liver controls, were identified. In total, 29 phenotype-related differentially expressed genes were included in the PPI network. Hierarchical clustering showed that the gene expression profile of these 29 genes was able to differentiate HCC samples from non-cancerous liver samples. Among these genes, CDC2 (Cell division control protein 2 homolog), MMP2 (matrix metalloproteinase-2) and DCN (Decorin were the hub nodes in the PPI network. Conclusions: This study provides a portfolio of targets useful for future investigation. However, experimental studies should be conducted to verify our findings.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30de17fbac26d632530ee8c43fc304c1",
  "timestamp": "2025-05-15T01:13:45.233247"
}