{
  "id": 276,
  "title": "Multi-class financial distress prediction based on support vector machines integrated with the decomposition and fusion methods",
  "abstract": "Binary financial distress prediction (FDP), which categorizes corporate financial status into the two classes of distress and nondistress, cannot provide enough support for effective financial risk management. This paper focuses on research on multiclass FDP based on the support vector machine (SVM) integrated with the decomposition and fusion methods. Corporate financial status is subdivided into four states: financial soundness, financial pseudosoundness, moderate financial distress and serious financial distress. Three multiclass FDP models are built by integrating the SVM with three decomposition and fusion methods, i.e., one-versus-one (OVO), one-versus-rest (OVR), and error-correcting output coding (ECOC), and they are, respectively called OVO-SVM, OVR-SVM and ECOC-SVM. Empirical research based on data from Chinese listed companies shows that OVO-SVM overall outperforms OVR-SVM and ECOC-SVM and is preferred for multiclass FDP. In addition, all three models trained on the original highly class-imbalanced training dataset cannot obtain satisfying performance, and the data level preprocessing mechanisms that make class distributions balanced in the training dataset can greatly improve their multiclass FDP performance. Compared with multivariate discriminant analysis (MDA) and multinomial logit (MNLogit), OVO-SVM has significantly higher accuracy for financial pseudosoundness and moderate financial distress and lower accuracy for financial soundness and serious financial distress, resulting in no significant difference among their overall multiclass FDP performance. However, OVO-SVM is still more competitive than MDA and MNLogit in that financial pseudosoundness and moderate financial distress are much more difficult to predict by human expertise than the other two financial states. (C) 2021 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30f4232d18e61251590eb7ee73b26234",
  "timestamp": "2025-05-15T01:49:04.540963"
}