{
  "id": 5911,
  "title": "A stock selection algorithm with hybrid support vector regression and differential evolutionary",
  "abstract": "To cope with the increasing complexity of financial markets, traditional stock analysis methods have faced many challenges in predicting market performance and constructing efficient portfolios. To address this issue, this study explores the potential of combining support vector regression (SVR) and differential evolution (DE) algorithms applied to the Chinese A-share market. In this paper, the SVR-DE model is used to predict the performance of all A-shares in 2022, with the aim of selecting the 30 stocks with the best annual performance. The hyperparameters of SVR are optimized by the DE algorithm to improve the prediction accuracy. Then, Monte Carlo simulation is used to assign weights to the portfolios of these 30 stocks in order to find the optimal balance between risk and return. The experimental results show that the portfolios predicted by the SVR-DE model significantly outperform the market benchmark, the Shanghai Stock Exchange (SSE), in terms of annualized and cumulative returns. This result not only validates the effectiveness of the SVR-DE model in forecasting real financial markets, but also demonstrates the practical value of Monte Carlo simulation in optimizing asset allocation strategies. The model can effectively predict stock market performance and help construct portfolios that cannot be matched by traditional market benchmarks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "30f8420f6cb18d39a1cc6155d4073770",
  "timestamp": "2025-05-15T02:52:31.525071"
}