{
  "id": 4435,
  "title": "The Social Relationship Context of Elder Mistreatment",
  "abstract": "Background and Objectives: Elder mistreatment victims at risk of poor physical and psychological health may benefit from increased social support. This article identifies mistreatment victims among community-dwelling older Americans and maps their social networks to guide the design of social support interventions. Research Design and Methods: Using nationally representative survey data from Wave 3 (2015-2016) of the National Social Life, Health, and Aging Project (N = 2,334) and descriptive, latent class, and regression analyses, we estimate the prevalence of mistreatment since age 60, identify the alleged perpetrators' relationships to the victims, and examine victims' social networks. Results: Self-reported lifetime prevalence of elder mistreatment is as high as 21%, depending on the mistreatment behavior measured. Latent class analysis reveals two mistreatment classes: 12% of older adults experienced multiple types of mistreatment (polyvictimization), and 6% experienced primarily financial mistreatment. Although alleged perpetrators are unlikely to appear in older adults' core social networks, the most commonly reported perpetrators are children and relatives. Regression analyses show that experiencing mistreatment since age 60 is associated with having less current social support, more social strain, and fewer kin in the core social network. Older adults reporting polyvictimization also have less-dense core networks. Discussion and Implications: Increasing family support should be done cautiously because children and relatives are frequently named as mistreatment perpetrators. Increasing communication across polyvictimization victims' network members may support their well-being. Providing outside assistance with financial management could benefit financial mistreatment victims.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3113873b4000b96af50ea61a626c293a",
  "timestamp": "2025-05-15T02:37:16.841973"
}