{
  "id": 8894,
  "title": "Gambling among Swedish youth: Predictors and prevalence among 15-and 17-year-old students",
  "abstract": "Background: Gambling among adolescents is a growing public health concern in Sweden as in many other countries. Excessive gambling has been found to be associated with a wide range of negative consequences such as financial problems, strained relationships, criminal behaviour, depression, and an elevated risk for suicide. Research suggests a link between alcohol consumption and gambling, particularly among male gamblers. There are nevertheless gaps in the available knowledge pertaining to school-aged students in Sweden. Aim: The purpose of this study is to investigate predictors of gambling and frequent gambling among Swedish students in Grade 9 and Grade 11 (ages 15 and 17 years). Data and method: Data on gambling and alcohol consumption were obtained from the Swedish Council on Information and Other Drugs yearly school surveys (n = 4763) in Grade 9 and Grade 11 (n = 3720). Poisson regression models have been applied to estimate the association between less frequent and frequent gambling with the predictors of gender, family and school satisfaction, school situation, and alcohol and drug use. Results: Gambling among Swedish students is a highly gendered activity: boys gamble more and more frequently than girls. Having consumed alcohol was associated with both less frequent and more frequent gambling among Grade 9 students while controlling for other variables. In Grade 9, heavy episodic drinking was only associated with less frequent gambling, not with frequent gambling. Among Grade 11 students, both alcohol consumption and heavy episodic drinking was associated with less frequent gambling but heavy episodic drinking was only associated with frequent gambling. Moreover, drug use was associated with less frequent gambling in Grade 11. Skipping classes was the only school factor that was found to be associated with less frequent gambling (Grade 11). Such factors as family satisfaction and two measurements of economic situation were not associated with gambling at all.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "311fbecaddaa40e6a2621eee88b6a0e9",
  "timestamp": "2025-05-15T03:23:27.855730"
}