{
  "id": 4252,
  "title": "The evolution of the ENERGY STAR® energy performance indicator for benchmarking industrial plant manufacturing energy use",
  "abstract": "ENERGY STAR(R) is a voluntary government/industry partnership that offers information to businesses and consumers on energy-efficient solutions, making it easier to save money and protect the environment for future generations. Introduced in 1992 by the US Environmental Protection Agency (EPA), this voluntary labeling program was designed to identify and promote energy-efficient products as basic pollution prevention opportunities. The ENERGY STAR label can now be found on appliances, office equipment, lighting, buildings, and more. In 2002, ENERGY STAR was extended beyond its role in identifying energy efficient products to identifying energy-efficient production. The ENERGY STAR industry program focuses on encouraging and enabling sustainable corporate energy management. One of the three information tools EPA developed under ENERGY STAR, which also includes energy management networking and industry specific energy guides, is the energy performance indicator (EPI). The EPI is a statistical benchmarking tool that provides a birds-eye view of sector-specific plant-level energy use via a functional relationship between the level of energy use and the level and type of various production activities, material input's quality, and external factors, e.g. climate and material quality. The EPI uses stochastic frontier regression to estimate the lowest observed plant energy use, given these factors. This statistical model also provides a distribution of energy efficiency across the industry, which allows the user to answer the hypothetical but very practical question, How would my plant compare to everyone else in my industry, if all other plants were similar to mine? The result is a tool that can be used by corporate and plant energy managers to estimate the energy efficiency of their portfolio of plants. This paper describes the role of the EPI within the context of the overall goals of ENERGY STAR and gives examples of how this information tool was developed and is being used. (C) 2007 Elsevier Ltd. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31260de4c26855160b85bd6aba455d43",
  "timestamp": "2025-05-15T01:25:23.232967"
}