{
  "id": 7560,
  "title": "Modeling the Behavioral Response of Dentists to COVID-19 and Assessing the Perceived Impacts of Pandemic on Operative Dentistry Practices in Pakistan",
  "abstract": "COVID-19 pandemic has affected dentistry in unprecedented ways. This study investigates the perceived effects of the pandemic on operative dentistry procedures and dentistry profession in Pakistan and the factors that determine the behavioral changes among dentists to adapt to the new normal. A Capability Opportunity Motivation-Behavioral model (COM-B) was utilized to investigate the factors that determine the behavior of dentists in Punjab, Pakistan to adhere to COVID-19 standard operating procedures (SOPs). Using social media, an online questionnaire was sent to operative dentistry professionals in Pakistan, and 312 responses were received. 81.4% of the respondents believed that the COVID-19 pandemic has severely affected the level of care provided to the patients, 66% were extremely worried about the risk of contagion during clinical practices, and more than 75% of the respondents opined that the pandemic has led to an increased emphasis on disinfection and oral hygiene instructions. The multiple regression model suggests that the behavior of Pakistani dentists to adhere to the COVID-19 SOPs is significantly affected by their Capabilities (beta = 0.358) and Opportunities (beta = 0.494). The study concluded that dentists in Punjab, Pakistan are concerned about the risk of contagion and report a serious concern about consequences such as financial loss and inappropriate care of patients. The current study results can feed the policymaking in Pakistan and other developing countries. Facilities and training to improve dentists' opportunities and capabilities can improve their ability to cope with the COVID-19 challenges.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "315369df85ed33df12c09a5347cbacf1",
  "timestamp": "2025-05-15T03:09:36.983772"
}