{
  "id": 6168,
  "title": "Hitting Close to Home: The Effect of COVID-19 Illness in the Social Environment on Psychological Burden in Older Adults",
  "abstract": "This study examines the impact of COVID-19 experience of infection in the individual's social environment on psychological burden controlling for a broad range of factors using data on an older population (50+ years). Based on the empirical evidence of preexisting studies, it is hypothesized that psychological burden will increase concurrent to the severity of COVID-19 experience (tested positive, hospitalized, and death) independent of the other stressors resulting from the pandemic, such as a subjective sense of uncertainty or financial burden. Data of the Survey of Health, Aging and Retirement in EUROPE, and a European cross-national panel study were used to examine this hypothesis. Besides Chi(2) test and Spearman's rho, a logistic regression model was constructed to test the hypothesized model. The study confirms that there is significantly higher risk for psychological burden by heightened COVID-19 severity in the social environment independent of multiple also significantly influential variables depicting stressors to everyday life of older people during the pandemic. The results point to the importance of multiple factors (social, financial, health, and sociodemographic) which have significantly affected the psychological condition of the individual during the past year. Conclusively, the results illustrate the dilemma that infection and illness in the social circle, as well as countermeasures (social distancing), have negative consequences for our mental health.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3153d5887463fb54cb8546be15a88447",
  "timestamp": "2025-05-15T02:55:44.438116"
}