{
  "id": 2584,
  "title": "Prediction models for earlier stages of chronic kidney disease",
  "abstract": "Purpose of reviewIdentifying patients with risk of developing progressive chronic kidney disease (CKD) early is an important step in improving kidney care. This review discusses four recently developed models, two which predict risk of new onset disease, and two which predict progression earlier in the course of disease.Recent findingsSeveral models predicting CKD incidence and progression have been recently developed and externally validated. A connecting theme across these models is the use of data beyond estimated glomerular filtration rate, allowing for greater accuracy and personalization. Two models were developed with stratification by diabetes status, displaying excellent model fit with and without variables like use of diabetes medication and hemoglobin A1C. Another model was designed to be patient facing, not requiring the knowledge of any laboratory values for use. The final model was developed using lab data and machine learning. These models demonstrated high levels of discrimination and calibration in external validation, suggesting suitability for clinical use.SummaryModels that predict risk of CKD onset and progression have the potential to significantly reduce disease burden, financial cost, and environmental output from CKD through upstream disease prevention and slowed progression. These models should be implemented and evaluated prospectively in primary care settings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "316de64819f0b9fbe877636a2b2d128d",
  "timestamp": "2025-05-15T02:17:01.676739"
}