{
  "id": 8964,
  "title": "Sources of Stress and Their Associations With Mental Disorders Among College Students: Results of the World Health Organization World Mental Health Surveys International College Student Initiative",
  "abstract": "The college years are stressful for many students. Identifying the sources of stress and their relative importance in leading to clinically significant emotional problems may assist in the development of targeted stress management interventions. The current report examines the distribution and associations of perceived stress across major life areas with 12-month prevalence of common mental disorders in a cross-national sample of first-year college students. The 20,842 respondents were from 24 universities in 9 countries that participated in the World Health Organization World Mental Health International College Student Initiative. Logistic regression analysis examined associations of current perceived stress in six life areas (financial situation, health, love life, relationships with family, relationships at work/school, problems experienced by loved ones) with six types of 12-month mental disorders (major depressive disorder, bipolar disorder, generalized anxiety disorder, panic disorder, alcohol use disorder, drug use disorder). Population attributable risk proportions (PARPs) were calculated to estimate the upper-bound potential effects of interventions focused on perceived stress in reducing prevalence of mental disorders. The majority of students (93.7%) reported at least some stress in at least one of the six areas. A significant dose-response association was found between extent of stress in each life area and increased odds of at least one of the six disorders. The multivariable models that included all stress measures were significant for all disorders (F= 20.6-70.6,p< 0.001). Interpretation of PARPs as representing causal effects of stresses on disorders suggests that up to 46.9-80.0% of 12-month disorder prevalence might be eliminated if stress prevention interventions were developed to block the associations of stress with these disorders.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "319727e93c076c828d4b77f6416b7ff6",
  "timestamp": "2025-05-15T03:24:26.242753"
}