{
  "id": 5186,
  "title": "Malnutrition and nutrition impact symptoms (NIS) in surgical patients with cancer",
  "abstract": "Background and aim Nutrition impact symptoms (NIS) are common in cancer patients and the negative impacts on nutritional status indicate the need for research, diagnosis and nutritional intervention in order to reduce the risk of malnutrition. We aimed to verify the presence of malnutrition, the need for nutritional intervention, NIS and their influence on the nutritional status of surgical patients with cancer. Methods This cross-sectional study was carried out in a public tertiary hospital, from March 2017 to October 2019. Nutritional status, the need for nutritional intervention and NIS were assessed through the Patient-Generated Subjective Global Assessment (PG-SGA) in the first 48 hours of hospital admission. Results Among the 135 patients evaluated, 55.6% were elderly and 51.1% were male; patients had a median age of 62 years and a predominance of cancer located in the lower gastrointestinal tract (35.6%). Malnutrition and the need for nutritional intervention were identified in 60.0% and 90.4% of cases, respectively. The presence of three or more NIS was reported by 51.9% of patients. Significant differences in NIS were observed according to sex, PG-SGA classification and PG-SGA score. After logistic regression analysis, it was determined that the symptoms that increased the chances of malnutrition were anorexia, constipation, strange taste, mouth sores and others (depression, dental or financial problems). Conclusion Malnutrition, the need for nutritional intervention and the presence of three or more NIS were elevated in the patients evaluated. Malnutrition was associated with the presence of NIS, indicating the need for attention and care in antineoplastic treatment.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "319dd9b4dfaeebe961498fca911d893e",
  "timestamp": "2025-05-15T02:45:17.077895"
}