{
  "id": 857,
  "title": "A heuristic approach to the estimation of an efficient benchmark in the Croatian stock market",
  "abstract": "In this paper a heuristic approach, which solely relies on risk parameter estimation, is pursued to estimate the efficient benchmark in the Croatian stock market. Optimisation method focused on risk parity is employed allowing investors to diversify risk by relying on equal risk contribution to achieve optimal portfolio diversification. Six different benchmarks related to risk parity method variations and covariance matrix estimations are examined in order to compare their performance with the capitalization-weighted counterpart. This allows insight regarding the po- tential sources of differences in their risk-reward characteristics. Results in this study are based on 28 out-of-sample estimations in the period from April 2005 to March 2019. The findings do not show evidence of risk parity method being able to provide exposure to rewarded risk factors in the Croatian stock market. Moreover, regarding the diversification of unrewarded risks even the benchmark portfolio with the lowest reported volatility is more volatile than the CROBEX bench- mark. However, if only expansion sub-period is analysed all examined benchmarks outperform the CROBEX benchmark with the factor risk parity portfolio based on two or more components reporting the lowest volatility. Overall the results show that risk parity portfolios do outperform the equally-weighted benchmark and that assuming equal correlations of portfolio constituents or applying statistical shrinkage method for their estimation yields better results than relying on the principal components analysis.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31a8aca19da34f9c3f73566ea19241db",
  "timestamp": "2025-05-15T00:49:03.137613"
}