{
  "id": 5813,
  "title": "Long working hours and cardiovascular disease mortality: Prospective evidence from the United States",
  "abstract": "Aims: Cardiovascular disease (CVD) is the leading cause of death in the United States (U.S.). This study aimed to explore prospective associations between long working hours with CVD mortality using a large, national study in the U.S. Methods: Data from the Midlife in the U.S. (MIDUS) Study were used, including 4051 currently employed participants without prior experience of myocardial infarction or stroke at baseline in 1995-1996. Working hours were categorized into: <35 h/week, 35-40 h/week (reference), 41-48 h/week, 49-54 h/week, and >= 55 h/week. Mortality data were extracted from the National Death Index (NDI) through Spring 2021. Cox proportional hazards regression was applied to analyze the prospective associations between working hours at baseline and CVD mortality, adjusting for sociodemographic and lifestyle factors. Stratified analyses by socioeconomic status (i.e., education and financial situation) were also conducted. Results: Long working hours (>= 55 h/week) were significantly associated with increased CVD mortality (adjusted HR 1.50; 95 % CI 1.03-2.17) compared to the reference group. Subgroup analyses showed that individuals with low education level or poor financial situation had a higher risk of CVD mortality when working long hours. Conclusion: Long working hours are a significant risk factor for CVD mortality in this national sample of U.S. workers, and participants with low socioeconomic status are more vulnerable to the effects of long working hours on CVD deaths. These findings highlight the need for considering working hour interventions in public health strategies to improve cardiovascular health outcomes in the workforce.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31ab4bcb614a68f200b99027c53653c9",
  "timestamp": "2025-05-15T02:51:58.493728"
}