{
  "id": 3672,
  "title": "Assessing and coping with the financial burden of computed tomography utilization in Limbe, Cameroon: a sequential explanatory mixed-methods study",
  "abstract": "BackgroundThere has been a significant increase in computed tomography (CT) utilization over the past two decades with the major challenges being a high exposure to ionizing radiation and rising cost. In this study we assess the risk of financial hardship after CT utilization and elaborate on how users adapt and cope in a sub-Saharan context with user fee for services and no national health insurance policy.MethodsWe carried out a sequential explanatory mixed methods study with a quantitative hospital-based survey of CT users followed by in-depth interviews of some purposively selected participants who reported risk of financial hardship after CT utilization. Data was summarized using frequencies, percentages and 95% confidence intervals. Logistic regression was used in multivariable analysis to determine predictors of risk of financial hardship. Identified themes from in-depth interviews were categorized. Quantitative and qualitative findings were integrated.ResultsA total of 372 participants were surveyed with a male to female sex ratio of 1:1.2. The mean age (standard deviation) was 52(17) years. CT scans of the head and facial bones accounted for 63% (95%CI: 59-68%) and the top three indications were suspected stroke (27% [95%CI: 22-32%]), trauma (14% [95%CI: 10-18%]) and persistent headaches (14% [95%CI: 10-18%]). Seventy-two percent (95%CI: 67-76%) of the respondents reported being at risk of financial hardship after CT utilization and predictors in the multivariable analysis were a low socioeconomic status (aOR: 0.19 [95%CI: 0.10-0.38]; p<0.001), being unemployed or retired (aOR: 11.75 [95%CI: 2.59-53.18]; p=0.001) and not having any form of health insurance (aOR: 3.59 [95%CI: 1.31-9.85]; p=0.013). Coping strategies included getting financial support from family and friends, borrowing money and obtaining discounts from the hospital administration and staff.ConclusionNo health insurance ownership, being unemployed or retired and a low socioeconomic status are associated with financial hardship after CT utilization. Diverse coping strategies are utilized to lessen the financial burden, some with negative consequences. Minimizing out-of-pocket payments and/or the direct cost of CT can reduce this financial burden and improve CT access.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31b02290c6f2898c82ce6fde6f33e6ea",
  "timestamp": "2025-05-15T02:29:00.042776"
}