{
  "id": 1757,
  "title": "Artificial Neural Dynamics for Portfolio Allocation: An Optimization Perspective",
  "abstract": "Real-time high-frequency trading poses a significant challenge to the classical portfolio allocation problem, demanding rapid computational efficiency for constructing Markowitz model-based portfolios. Building on the principles of arbitrage pricing theory (APT), this study introduces a dynamic neural network model aimed at minimizing investment risk, optimizing portfolio allocation within predefined constraints, and maximizing returns. First, a convex optimization objective function incorporating risk constraints is formulated based on APT principles. This is followed by the introduction of a novel dynamic neural network model designed to solve the convex optimization problem, accompanied by comprehensive theoretical analysis and rigorous proofs. The study uses two distinct datasets sourced from Yahoo Finance, consisting of 30 selected stocks, covering a span of 250 valid trading days to validate the proposed methodology. The results of 30 different stock market scenario experiments indicate that, when the upper limit for investment risk is set at 3.285 x 10(-4), the expected maximum investment return exceeds the Dow Jones Industrial Average (DJIA) index by 16.2816%. These empirical findings highlight the viability, stability, and efficacy of the proposed approach and framework, demonstrating its potential applicability for real-time, high-frequency trading scenarios. Furthermore, the outcomes suggest policy implications for risk management and portfolio optimization in dynamic financial environments.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31bdc0fbf15b59e2cd80f5dde7eac514",
  "timestamp": "2025-05-15T02:06:52.785187"
}