{
  "id": 7386,
  "title": "Behavioral and Perceived Stressor Effects on Urinary Catecholamine Excretion in Adult Samoans",
  "abstract": "Objectives: The effects of perceptions and behaviors related to culturally patterned socioeconomic obligations on catecholamine excretion rates were studied in a cross-sectional sample of Samoan adults. Methods: A total of 378 participants, ages 29-62 years, from 9 villages throughout Samoa, provided timed overnight urine specimens, and self-reported perceptions and behaviors associated with contributions to one's family, alga, and chief, matai, and communal gift exchanges, fa'alavelave. Urinary norepinephrine and epinephrine excretion rates were measured by high performance liquid chromatography with electrochemical detection. Age (<= 40 vs. >40 years) and gender-specific regression models were estimated to detect associations with catecholamine excretion. Results: Young women who contribute more to their matai, who consider fa'alavelave to be a financial strain, and who view their contribution to their matai to be just right, had significantly higher residence-adjusted norepinephrine excretion. Young women who contribute more to their matai, who consider fa'alavelaue to be a financial strain, and who consider their contribution to their aiga not to be a burden, had higher epinephrine excretion. Older men who contribute more to their aiga and who perceive their contribution to their aiga to be just right had increased residence-adjusted epinephrine excretion. Conclusions: Individual-level perceptions and behaviors related to traditional socioeconomic obligations are a significant correlate of increased overnight catecholamine excretion rates. Higher excretion rates may be attributed to psychosocial stress arousal associated with a discordance between personal desires for upward social mobility, and family and community-based socioeconomic obligations. Changes in patterns of individual-level psychosocial stress arousal may contribute to cardiovascular disease risk in modernizing Samoans. Am. J. Hum. Biol. 23:693-702,2011. 20 11 (C) Wiley-Liss, Inc.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31c59c0cff0e125109e7412e14e64fdb",
  "timestamp": "2025-05-15T03:08:00.800147"
}