{
  "id": 7063,
  "title": "Trading Health Risks for Glory: A Reformulation of the Goldman Dilemma",
  "abstract": "Background The Goldman dilemma presented athletes with a Faustian bargain that guaranteed winning an Olympic gold medal in their sport but resulted in certain death 5 years later. Athletes' responses to Goldman's bargain were reported from 1982 to 1995. Several studies subsequently evaluated people's willingness to accept the bargain proposed in the Goldman question. Our study updates Goldman's question using contingent-behavior questions, a preference-elicitation method widely applied in economics, marketing and psychology to understand people's choice behavior. Contingent-behavior questions ask people to evaluate hypothetical tradeoffs between outcomes when real-world decisions are unobservable, nonexistent, or unreliable. Methods A web-enabled survey was conducted with athletes in 50 sports between June, 2012 and April, 2013. Athletes were invited by their sport governing bodies in the United States to complete the online survey. Responses from 2888 athletes were collected. Our reformulation elicited athletes' willingness to accept a performance-enhancing drug (PED) associated with the risk of a realistic fatal event, not certain death. A double-bounded dichotomous- choice question format was used to elicit athletes' maximum acceptable mortality risk (MAMR) for winning an Olympic gold medal. Data were analyzed using an interval regression model to estimate the implicit probability of accepting a continuous risk level. MAMR was defined as the mortality risk level with a 0.50 probability of acceptance. Results Estimated mean MAMRs varied between 7 and 14% across athletes in different ranks and sports. Elite athletes were generally the most willing to accept a fatal cardiovascular risk to win a gold medal in the Olympics. This range was similar to the levels of risk that patients accept for life-changing interventions. Conclusions Results suggest that very few athletes would be expected to accept a PED in the bargain postulated by the Goldman dilemma. Risk tolerance among elite athletes suggest they may be more aware of the potential financial and nonfinancial benefits of such a win, and/ or less optimistic about their potential to move up in the level of competition without the use of PEDs.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31cb9ca645817a86d902a0019484ef4d",
  "timestamp": "2025-05-15T03:05:03.349394"
}