{
  "id": 9361,
  "title": "Are Husbands Involving in Their Spouses' Utilization of Maternal Care Services?: A Cross-Sectional Study in Yangon, Myanmar",
  "abstract": "Introduction Husbands can play a crucial role in pregnancy and childbirth, especially in patriarchal societies of developing countries. In Myanmar, despite the critical influence of husbands on the health of mothers and newborns, their roles in maternal health have not been well explored. Therefore, the aim of this study was to identify the factors associated with husbands' involvement in maternal health in Myanmar. This study also examined the associations between husbands' involvement and their spouses' utilization of maternal care services during antenatal, delivery and postnatal periods. Methods A community-based, cross sectional study was conducted with 426 husbands in Thingangyun Township, Yangon, Myanmar. Participants were husbands aged 18 years or older who had at least one child within two years at the time of interview. Face to face interviews were conducted using a pretested structured questionnaire. Factors associated with the characteristics of husband's involvement as well as their spouses' utilization of maternal care services were analyzed by multivariable logistic regression models. Results Of 426 husbands, 64.8% accompanied their spouses for an antenatal visit more than once while 51.6% accompanied them for a postnatal visit. Husbands were major financial supporters for both antenatal (95.8%) and postnatal care (68.5%). Overall, 69.7% were involved in decision making about the place of delivery. Regarding birth preparedness, the majority of husbands prepared for skilled birth attendance (91.1%), delivery place (83.6%), and money saving (81.7%) before their spouses gave birth. In contrast, fewer planned for a potential blood donor (15.5%) and a safe delivery kit (21.1%). In the context of maternal health, predictors of husband's involvement were parity, educational level, type of marriage, decision making level in family, exposure to maternal health education and perception of risk during pregnancy and childbirth. Increased utilization of maternal health services was found among spouses of husbands who accompanied them to antenatal visits (AOR 5.82, 95% CI, 3.34-10.15) and those who had a well birth plan (AOR 2.42, 95% CI, 1.34-4.39 for antenatal visit and AOR 2.88, 95% CI, 1.52-5.47 for postnatal visit). Conclusion The majority of husbands supported their spouses' maternal care services use financially; however, they were less involved in birth preparedness and postnatal care. Exposure to maternal health education and their maternal health knowledge were main predictors of their involvement. Women were more likely to use maternal care services when their husbands company them for ANC visits and had a well-birth plan in advance.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "31e3d7afa3bcfa3f1f5284c02b7e2577",
  "timestamp": "2025-05-15T03:27:53.439185"
}