{
  "id": 4704,
  "title": "Developing a business failure prediction model for cooperatives: Results of an empirical study in Spain",
  "abstract": "The use of statistical models to predict business failures has received considerable attention in recent decades. However, very few studies have been devoted to predicting failures of cooperative societies, which play an important social and economic role in many sectors and possess certain characteristics that distinguish them from investor-owner companies. This paper develops a statistical business failure prediction model specifically for cooperative societies and identifies the most powerful predictive variables. This is done by applying logistic regression to a sample of Spanish agricultural cooperatives with financial indicators as explanatory variables. The prediction models obtained, capable of predicting failures one or two years before they actually happen, reached an accuracy level of more than 94%. The best predictors confirmed the importance to cooperatives of having a minimum amount of capital available to ensure their financial independence, which could be put at risk by virtue of the cooperative principle of voluntary and open membership, especially when financial problems appear on the horizon. The importance of the results-based indicators was also shown, which could be considered as obvious, given that the objectives of cooperative societies is to obtain the greatest possible advantage from the activities carried out for their members.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "320a7161dfc9f92c50f1ffc7a6774bab",
  "timestamp": "2025-05-15T02:39:57.616837"
}