{
  "id": 6382,
  "title": "Financial Burden of Discarded Weight-based Antineoplastic Drugs to Payers and Patients in the Private Insurance Market",
  "abstract": "Background: Our study estimated insurance payments and patient out-of-pocket (OOP) expenses associated with discarded weight-based intravenous antineoplastic drugs for privately insured US adult patients with cancer. Methods: We identified patients who received weight-based antineoplastic drugs from a 2017 MarketScan health risk assessment (IBM Corp, Armonk, NY) linked to claims data. Using weight information in the health risk assessment, we derived the recommended dose and calculated the percentage of drugs discarded. We applied beta-regression to determine factors associated with the discarded percentages. To compare patients with and without high-deductible plans, we employed a generalized linear model and a 2-part model to examine insurance payment and OOP expense, respectively. All statistical tests were 2-sided. Results: Of 27 350 claims for 58 weight-based antineoplastic drugs from 1970 patients, the median discarded percentage was 9.8% (mean [SD] = 12.8% [10.5%]). Aside from drug and tumor type, statistically significantly higher discarded percentages were found for patients in the lowest weight group (5.5% [95% confidence interval = 4.7% to 6.4%]; P < .001; weight <150 lb [68.0 kg] vs >= 200 lb [90.7 kg]). Private payers spent $5090 per patient in 2017 on discarded weight-based antineoplastic drugs, and patients' mean OOP expense on discarded drugs was $63. In total, 39.7% of patients had high-deductible plans. The adjusted mean OOP expense for discarded drugs was statistically significantly higher for those in high-deductible plans ($95 vs $47; P < .001). Conclusions: Private insurers incurred substantial financial burden from discarded weight-based antineoplastic drugs. Although the OOP expenses of discarded drugs were modest for most privately insured patients with cancer, approximately 5% spent more than $400 on the discarded drugs. Policies designed to reduce drug waste from single-dose, weight-based antineoplastic drugs should evaluate their financial consequences for payers and patients.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32291e116107408296d6a5c6ed46bb50",
  "timestamp": "2025-05-15T02:57:38.733339"
}