{
  "id": 6576,
  "title": "Association of smoking, physical activity, and dietary habits with socioeconomic variables: a cross-sectional study in adults on both sides of the Hungarian-Romanian border",
  "abstract": "Background: The association between socioeconomic status and health-related behaviours has been clarified in several epidemiological studies. The aim of this study was to reveal the socioeconomic differences in health-related behaviours and in nutritional status of Hungarian and Romanian citizens living on both sides of the border. Methods: A cross-sectional study based on interviewer-administered questionnaires was conducted on both sides of the Hungarian-Romanian border. The survey was completed by 1, 099 Hungarians (Hu) and 852 Romanians (Ro) aged 18 years and over; the overall participation rate was 92.9%. Demographic and socioeconomic factors, health-related behaviours (smoking, dietary habits and physical activity), body weight and height were recorded. All analyses were performed separately for Hungarians and Romanians. Simple descriptive statistics and logistic regression models were used to measure the associations between socioeconomic status and behaviour, as well as obesity. Results: The prevalence of smoking was similar in Hungarians and Romanians (33.2% and 36.4%). The frequency of unhealthy diet was 70.6% in Hungarians and 75.2% in Romanians. Physical inactivity was more prevalent in Romanians (73.2%) than in Hungarians (32.0%), while the prevalence of obesity was higher in Hungarians (22.0%) than in Romanians (16.5%). Based on the univariate logistic regression models the risk of smoking was higher among those with medium educational level (ORHu = 1.66) and poor financial conditions (ORHu = 3.13) in Hungarians. The risk of unhealthy diet was higher among the low educated (ORHu = 1.77; ORRo = 7.91) and among those with poor financial conditions (ORHu = 2.05; ORRo = 4.25). None of the socioeconomic factors was associated with leisure time physical inactivity. In the multivariate models obesity was associated with medium level of education in Hungarians, and with unhealthy diet in Romanians (ORRo = 2.10). Physically inactive Hungarians were more (ORHu = 1.74), whereas inactive Romanians were less (ORRo = 0.64) likely to be obese than physically active people from the same country. Conclusions: The present study shows that socioeconomic status is associated with health-related behaviours in a small area of Hungary and Romania. The results highlight the need for developing interventional strategies, focusing more on people in lower socioeconomic status, in order to reduce the existing inequalities in health and health-related behaviours.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "323c52ef6eb0437258b0173510d8a626",
  "timestamp": "2025-05-15T02:59:36.924183"
}