{
  "id": 3913,
  "title": "Clinical endpoints in the controlled human challenge model for Shigella: A call for standardization and the development of a disease severity score",
  "abstract": "Background Since 1946 the controlled human infection model (CHIM) for Shigella has been used to improve understanding of disease pathogenesis, describe clinical and immunologic responses to infection and as a tool for vaccine development. As the frequency and intent for use in vaccine comparisons increases, standardization of the primary endpoint definition is necessary. Methods Subject-level data were obtained from previously conducted experimental Shigella CHIM studies. Signs and symptoms severity were categorized consistently across all studies. Sign and symptom correlations were estimated and univariate models were utilized to describe the association between stool output and other Shigella-attributable signs and symptoms. Multiple correspondence and hierarchical clustering analyses were performed to describe the co-occurrence of signs and symptoms. A disease score is proposed based on the co-occurrence of these events. Results Data were obtained on 54 subjects receiving 800 to 2000 colony forming units (cfu) of S. flexneri. The median maximum 24 hour stool output was 514 ml (IQR: 300, 998 ml) with a median frequency of 6 (IQR: 4, 9). Subjects reported abdominal pain or cramps (81.5%), headache (66.7%) and anorexia (64.8%), 50.0% had a fever and 27.8% had gross blood in multiple loose stools. Multiple correspondence analyses highlighted co-occurrence of symptoms based on severity. A 3-parameter disease severity score predicted shigellosis endpoints and better differentiated disease spectrum. Conclusion Dichotomous endpoints for Shigella CHIM fail to fully account for disease variability. An ordinal disease score characterizing the breadth of disease severity may enable a better characterization of shigellosis and can decrease sample size requirements. Furthermore, the disease severity score may be a useful tool for portfolio management by enabling prioritization across vaccine candidates with comparable efficacy estimates using dichotomous endpoints.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "323eb2b70dffa4956ddd065f63a08b6e",
  "timestamp": "2025-05-15T01:22:11.846119"
}