{
  "id": 4484,
  "title": "Does firm competitiveness affect corporate risk-taking?",
  "abstract": "PurposeFew studies utilize insurance sector data to analyze how insurers' competitiveness affects their risk-taking decisions. To fill the research gap, this study aims to investigate the relationship between insurers' competitiveness and risk-taking decisions.Design/methodology/approachThis study employs unbalanced panel data for the US property-liability insurance companies from 2006 to 2019. Two-Stage estimation is applied to address the endogeneity issue, such as the Two-Step Generalized Method of Moments, General Two-Stage Least Square and Two-Stage Quantile Regression.FindingsThe regression analysis reveals that insurers' competitiveness in their risk-taking decisions is primarily negative. The finding suggests that insurers with low (high) competitiveness tend to take more (less) risk. This study sheds light on how insurers with low competitiveness may alter their risk preference, supporting the fundamental argument of the prospect theory, the CEO hubris argument, the risk-return theory and the risk-sensitivity theory.Research limitations/implicationsThe critical findings of this study provide policy implications when evaluating and drafting insurance legislation. Regulators must pay close attention to insurers' riskier decisions while insurers with low competitiveness or during periods of economic recession.Originality/valueThis research contributes to the literature by assessing whether insurers' competitiveness influences their risk-taking decisions. The empirical findings suggest that insurers with low competitiveness take on greater risks to gamble for survivability and boost profits to strengthen their financial standing. The evidence indicates that insurers may risk-seeking or irrational decision-making when facing a competitive disadvantage.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "324e781f692c959952818d9a15290793",
  "timestamp": "2025-05-15T02:37:47.514792"
}