{
  "id": 8924,
  "title": "How prepared are people for their future? Findings from the Preparedness for the Future survey",
  "abstract": "Objective: People are living longer than ever before. Many arrive at a later stage of life in poor health and with inadequate financial and social resources. The purpose of this paper is to describe people's general state of preparedness for their future as older persons, identify specific attitudes towards ageing and key characteristics that portend a lesser degree of preparedness, and identify the issues that need greater emphasis. Design: Cross-sectional survey. Setting: 502 adult participants enlisted on an online polling panel in Canada. Methods: Demographics, attitudes towards the future self and ageing and the responses to the 'Preparedness for the Future Questionnaire' (Prep-FQ) were analysed. Descriptive statistics were used to highlight overall and domain scores (possible score 0-100). Regression models were used to link key demographic characteristics and attitudes to a lower Prep FQ score. Results: The average age of participants was 54.1 years old (range 30-91). The majority (97%) felt it was important to think about themselves as an older person, yet less than 25% of people regularly spent time thinking about what it would be like for them as an older person. The average score on the Prep FQ was 61.6 (range 25-99). Items with the lowest scores were related to advance serious illness planning (medical care, funeral and legacy planning). Factors associated with a higher Prep FQ score included being female, having more education, thinking about when they are older and feeling positive about themselves as an older person. Conclusion: Helping people think and plan ahead more for healthy ageing may help some people move forward with confidence in creating a long, high-quality life and high-quality death. Helping 'at-risk' people plan for serious illness in advance is a high-priority target for improving people's general state of preparedness for the future.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "324fc97c4c97499fe2141ed0410fc31a",
  "timestamp": "2025-05-15T03:23:56.048779"
}