{
  "id": 3976,
  "title": "Impact of Effective Generic Business Strategies on Probability of Default: A Study of NSE Listed Firms",
  "abstract": "The aim of the current study is to examine the impact of generic business strategies (GBS) on default risk for Indian firms listed on the National Stock Exchange. This study employs a distance-to-default model to compute default risk and GBS, which are measured through Porter's framework. The relationship between GBS and the probability of default is derived through panel data regression analysis for the period 2008-2009 to 2021-2022. The results support the hypothesis and show a positive relationship between cost leadership and the distance-to-default model. The findings indicate that companies employing a cost leadership strategy tend to have sound financial health, which makes them less prone to default risk. The results show practical implications for financial institutions, creditors, and investors who can check the strategic positioning of a firm before evaluating and arriving at the credit rating, lending, and investment decisions. Based on the findings of this study, investors can provide funds to invest in a firm that implements GBS effectively to ensure high investment returns and fewer credit defaults. The study is expected to contribute to default risk literature by providing evidence that GBS indicators can be experimented for incorporation into new default risk prediction models.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3260741575389e172195849fef41db25",
  "timestamp": "2025-05-15T02:31:58.612275"
}