{
  "id": 804,
  "title": "Time-varying mean-variance portfolio selection problem solving via LVI-PDNN",
  "abstract": "It is widely acclaimed that the Markowitz mean-variance portfolio selection is a very important investment strategy. One approach to solving the static mean-variance portfolio selection (MVPS) problem is based on the usage of quadratic programming (QP) methods. In this article, we define and study the time-varying mean-variance portfolio selection (TV-MVPS) problem both in the cases of a fixed target portfolio's expected return and for all possible portfolio's expected returns as a time-varying quadratic programming (TVQP) problem. The TV-MVPS also comprises the properties of a moving average. These properties make the TVMVPS an even greater analysis tool suitable to evaluate investments and identify trading opportunities across a continuous-time period. Using an originally developed linear-variational-inequality primal-dual neural network (LVI-PDNN), we also provide an online solution to the static QP problem. To the best of our knowledge, this is an innovative approach that incorporates robust neural network techniques to provide an online, thus more realistic, solution to the TV-MVPS problem. In this way, we present an online solution to a time varying financial problem while eliminating static method limitations. It has been shown that when applied simultaneously to TVQP problems subject to equality, inequality and boundary constraints, the LVI-PDNN approaches the theoretical solution. Our approach is also verified by numerical experiments and computer simulations as an excellent alternative to conventional MATLAB methods.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "327b08183f95abc7f00727838362b8e9",
  "timestamp": "2025-05-15T00:48:22.344785"
}