{
  "id": 2854,
  "title": "A Data Analytics and Machine Learning Approach to Develop a Technology Roadmap for Next-Generation Logistics Utilizing Underground Systems",
  "abstract": "The increasing density of urban populations has spurred interest in utilizing underground space. Underground logistics systems (ULS) are gaining traction due to their effective utilization of this space to enhance urban spatial efficiency. However, research on technological advancements in related fields remains limited. To address this gap, we applied a data-driven approach using patent data related to the ULS to develop a technology roadmap for the field. We employed Latent Dirichlet Allocation (LDA), a machine learning-based topic modeling technique, to categorize and identify six specific technology areas within the ULS domain. Subsequently, we conducted portfolio analytics to pinpoint technology areas with high technological value and to identify the major patent applicants in these areas. Finally, we assessed the technology market potential by mapping the technology life cycle for the identified high-value areas. Among the six technology areas identified, Topic 1 (Underground Material Handling System) and Topic 4 (Underground Transportation System) showed significant patent activity from companies and research institutions in China, the United States, South Korea, and Germany compared to other countries. These areas have the top 10 patent applicants, accounting for 20.8% and 13.6% of all patent applications, respectively. Additionally, technology life cycle analytics revealed a growth trajectory for these identified areas, indicating their rapid expansion and high innovation potential. This study provides a data-driven methodology to develop a technology roadmap that offers valuable insights for researchers, engineers, and policymakers in the ULS industry and supports informed decision-making regarding the field's future direction.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32a3b16e5152eddf47c8768c5a84cc36",
  "timestamp": "2025-05-15T01:11:17.392374"
}