{
  "id": 28,
  "title": "FinCaKG: A Framework to Construct Financial Causality Knowledge Graph from Text",
  "abstract": "Causality analysis holds a prominent role in finance, and the presentation of causality could offer valuable insights for risk mitigation and investment decisions. Recent research has extensively investigated the identification of causality from text, yet there is still a significant deficiency in providing a comprehensive causality presentation from those textual discoveries. In this paper, we present an end-to-end framework to automatically construct Financial Causality Knowledge Graph (FinCaKG) from text, which allows us to visualize the captured causality from a holistic perspective. This framework involves three distinct tasks, including causality sentence detection, cause-effect span identification, and causal dependency representation. To examine the adaptability of FinCaKG framework, we generate, compare, and analyze the distinct FinCaKGs created from different corpus. The results show that this framework has the capability to not only capture the confidential causality but also represent them in a highly detailed manner in the resulting knowledge graphs. We perform a comparative study with ConceptNet, revealing the notable contributions of FinCaKGs in terms of domain coverage and the density of its causal knowledge. Furthermore, we implement two case studies to examine the capability of financial role declaration and distinction of ChatGPT and FinCaKGs applications. We found that, compared to ChatGPT, FinCaKGs are able to represent the much clearer and more distinctive logic opinions among diverse financial roles. The related resources will be available in the webpage https://www.ai.iee.e.titech.ac.jp/FinCaKG/.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "LLMs",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32b9bd5a371d8d5a9aee84c42df65473",
  "timestamp": "2025-05-15T01:45:16.365862"
}