{
  "id": 5384,
  "title": "Understanding the behavior of bank spreads in Latin America",
  "abstract": "Over the last decade, many countries in Latin America have eliminated interest rate ceilings, reduced reserve requirements, and stopped direct credit controls. These market-oriented reforms have encouraged financial deepening, thereby producing considerable economic benefits to the countries. Nevertheless, the persistence of high interest rate spreads has been a disquieting outcome of the reforms. This paper explores the determinants of bank spreads in asystematic way for Argentina, Bolivia, Chile, Colombia, Mexico, Peru, and Uruguay during the mid-1990s. The analysis shows that high operating costs raise spreads as do high levels of non-performing loans, although the size of these effects differs across the countries. In addition, reserve requirements in a number of countries still act as a tax on banks that gets translated into a higher spread. Beyond bank specific variables, uncertainty in the macroeconomic environment facing banks appears to increase interest spreads. The combination of these microeconomic and macroeconomic factors is a cause for concern in Latin America. As spreads widen, the cost of using the financial system becomes prohibitive to some potential borrowers. In addition,the results suggest that bank capital requirements may not prevent excessive risk taking by banks when bank spreads are high. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: L51; G21; E44.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32cb1c253c8ee9e1769e31043a202097",
  "timestamp": "2025-05-15T02:47:13.956451"
}