{
  "id": 9275,
  "title": "METHODS FOR EXTERNAL FACTORS ASSESSING WITHIN GEOINFORMATION MANAGEMENT OF TERRITORIES",
  "abstract": "Geoinformation management (GIM) as a contemporary scientific approach to the management of territories and spatially distributed systems (SDS) is based on the wide processing of spatial information with geoinformation systems (GIS) while the realization of the management basic functions: planning, organization, motivation and control. The goals set within GIM have to adjust the management basic functions and to present them as the basic functions of GIM. This approach is most relevant for SDS and territories. We focused methodologically on modern trends in the development of public administration systems including local self-government and on the usage of GIS as decision support systems in the structure of state and local governance in the Russian Federation. We consider the classification of the factors and present the methods to their evaluation and usage for solving problems within sustainable development of territories and SDS. While research we used: decision theory, risk management approach, GIS technologies best practice, system analysis for SDS management, economic meteorology fundamentals. We propose to divide the spatial factors into some categories by its content and the specifics of SDS in accordance with certain characteristics. The factor system allows to group the management models on certain grounds and to use appropriate methods and management tools extending their capabilities on the basis of spatial information. In this sense, the logic of GIM for development of the SDS should consider the characteristics of the territories, the system of internal and external objects and relations between them: the spatial structure of the territory, the system of relations, position and contacts on the dedicated management levels. Using the terminology and the most common GIS technologies we can talk about the formation of the respective sections or layers or slices of GIS and detail of objects of each slice in the space of events and in the space of management decisions. Association of slices or layers, events and objects is based on the multidimensional knowledge bases (KB) in relation to shared components of SDS, strategic relevance of the management facilities, operation conditions. We examine the characteristics of the main external factors within GIM: geographic, demographic, geopolitical, military-strategic, hydrometeorological. As a tool for scientific communication while research we used the platform https://www.researchgate.net/profile/Valery_Abramov2/?ev=hdr_xprf. The Ministry of education and science of Russia provides financial support for this research with the state order 2014/166.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32d46e37573fd7d40c528aff72923af6",
  "timestamp": "2025-05-15T03:27:24.951724"
}