{
  "id": 6929,
  "title": "Area Deprivation Index and Rurality in Relation to Financial Toxicity among Breast Cancer Surgical Patients: Retrospective Cross-Sectional Study of Geospatial Differences in Risk Profiles",
  "abstract": "BACKGROUND: Financial toxicity (FT) depicts the burden of cancer treatment costs and is associated with lower quality of life and survival in breast cancer patients. We examined the relationship between geospatial location, represented by rurality and Area Deprivation Index (ADD, and risk of FT. STUDY DESIGN: A single-institution, cross-sectional study was performed on adult female surgical breast cancer patients using survey data retrospectively collected between January 2018 and June 2019. Chart reviews were used to obtain patient information, and FT was identified using the COmprehensive Score for Financial Toxicity questionnaire, which is a validated instrument. Patients' home addresses were used to determine rurality using the Rural Urban Continuum Codes and linked to national ADI score. ADI was analyzed in tertiles for univariate statistical analyses, and as a continuous variable to develop multivariable logistic regression models to evaluate the independent associations of geospatial location with FT. RESULTS: A total of 568 surgical breast cancer patients were included. Univariate analyses found significant differences across ADI tertiles with respect to race/ethnicity, marital status, insurance type, education, and rurality. In multivariable analysis, advanced cancer stage (odds ratio [OR] 2.26, 95% CI 1.15 to 4.44) and higher ADI (OR 1.012, 95% CI 1.01 to 1.02) were associated with worsening odds of FT. Increasing age (continuous) (OR 0.976, 95% CI 0.96 to 0.99), married status (vs unmarried) (OR 0.46, 95% CI 0.30 to 0.70), and receipt of bilateral mastectomy (OR 0.56, 95% CI 0.32 to 0.96) were protective of FT. CONCLUSIONS: FT was significantly associated with areas of greater socioeconomic deprivation as measured by the ADI. However, in adjusted analyses, rurality was not significantly associated with FT. ADI can be useful for preoperative screening of at-risk populations and the targeted deployment of community-based interventions to alleviate FT. (C) 2022 by the American College of Surgeons. Published by Wolters Kluwer Health, Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32f94742c2e805e451ad617f5e8a8713",
  "timestamp": "2025-05-15T03:03:13.438826"
}