{
  "id": 6805,
  "title": "Role of social determinants of health in differential respiratory exposure and health outcomes among children",
  "abstract": "BackgroundAttributes defining the Social Determinants of Health (SDoH) are associated with disproportionate exposures to environmental hazards and differential health outcomes among communities. The dynamics between SDoH, disproportionate environmental exposures, and differential health outcomes are often specific to micro-geographic areas.MethodsThis study focused on children less than 20 years of age who lived in Douglas County, Nebraska, during 2016-2019. To assess the role of SDoH in differential exposures, we evaluated the association between SDoH metrics and criteria pollutant concentrations and the association between SDoH and pediatric asthma exacerbations to quantify the role of SDoH in differential pediatric asthma outcomes. The Bayesian Poisson regression model with spatial random effects was used to evaluate associations.ResultsWe identified significant positive associations between the annual mean concentration of criteria pollutants (carbon monoxide, particulate matter(2.5), nitrogen dioxide, sulfur dioxide) with race (Non-Hispanic Black and Hispanic/Latino), financial stability, and literacy. Additionally, there were significant positive associations between higher rates of pediatric asthma emergency department visits and neighborhoods with more Non-Hispanic Black children, children without health insurance coverage, and households without access to a vehicle.ConclusionsNon-Hispanic Black and Hispanic/Latino children living in Douglas County, NE experience disproportionately higher exposure to criteria pollutant concentrations. Additionally, higher rates of asthma exacerbations among Non-Hispanic Black children could be due to reduced access to respiratory care that is potentially the result of financial instability and vehicle access. These results could inform city planners and health care providers to mitigate respiratory risks among these higher at-risk populations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "32fe51ff5a888a0fe095557c6cfbaa81",
  "timestamp": "2025-05-15T03:01:31.481253"
}