{
  "id": 5860,
  "title": "A Novel Approach to Improving E-Government Performance from Budget Challenges in Complex Financial Systems",
  "abstract": "Today, the risk management of budget challenges throughout the budget process is greater than ever. The process of change has been driven by new information and communication technologies, resulting in e-government. The purpose of this scientific paper is to see whether budgetary challenges have an effect on the performance of e-government in complex financial systems based on factors F1, F2, F3, F4, and F5: lack of information, lack of cooperation, lack of resources and reduction of focus, lack of budget experts and financial stability, and shortcomings and inconsistencies during the budget process. Therefore, this study aims to advance the understanding of how to manage risks from budgetary challenges by focusing on a novel approach to improve e-government performance in complex financial systems. Empirical research was based on three key issues: an approach to e-government, analyzing which variables need more attention to risk, and learning how to meet budgetary challenges to improve performance during governance. For this study, the data were conducted by Kosovo's public institutions, more specifically at the central level (Ministry of Finance) and at the local level (38 municipalities of Kosovo). A total of 38 questionnaires were analyzed and divided into three sessions, which were analyzed through three analyses, such as factor analysis, data reliability analysis, and multiple regression analysis, using SPSS version 23.0 for Windows. The research was conducted over the years 2017, 2018, 2019, and 2020, while the analysis involved several processes, where some of the factors were removed in order to make the model acceptable. In this case, 21 variables were tested and divided into 5 factors. The results showed that special attention should be paid to these factors to reduce budgetary challenges and increase the performance of e-government in complex financial systems, such as (a) lack of resources (staff, funds, infrastructure, tools, etc.), (b) increasing the focus on risk management even after the transfer of funds from the ministry to the municipality, (c) the selection of programs based on priorities and not on the basis of wishes and policies, (d) having political stability, rule of law, and more control, and (e) having regulations and guidelines from the practices of developed countries as well as taking into account the opinions of budget experts. The implications of this paper have to do with only a considerable number of variables, which were taken in the study as well as only in the municipalities of Kosovo. In this case, for other analyses by other researchers, other variables can be analyzed in other countries by making comparisons.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "33030ff4d2021e79e7b9c10ec7cc4a25",
  "timestamp": "2025-05-15T02:51:58.723765"
}