{
  "id": 2419,
  "title": "Analysing the gold-stock nexus using VARMA-BEKK-AGARCH and Quantile regression models: New evidence from South Africa and Nigeria",
  "abstract": "This study examines the nexus between gold and stock for Nigeria and South Africa using VARMA-BEKK-AGARCH (V-B-A) model and Quantile regression (QR) approach. A major distinguishing feature of the V-B-A model is its capacity to account for cross-market asymmetric shock spillover. This kind of shock spillover occurs within the gold market and the two countries' stock markets. In addition, cross-market asymmetric shock spillover is noticed between each country's stock market and gold market. The quantile regression analysis shows instantaneous influence of South Africa's stock on gold in the low to intermediate quantiles where structural break is not considered, while no evidence of instantaneous response of gold to stock returns is found for Nigeria at all quantiles. In the presence of structural break, there is instantaneous gold response to stock returns in both countries in almost all quantiles. Effective portfolio allocation and hedging analysis based on the two methods used in this study reveals that, in the case of Nigeria (unlike South Africa) adding gold asset to a well-diversified portfolio of stocks may improve the risk-adjusted performance. This suggests that gold could be used to effectively hedge stock risk exposures in Nigeria as opposed to South Africa.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3308816f1aad931669ceedfbd019a7af",
  "timestamp": "2025-05-15T01:06:38.094028"
}