{
  "id": 8607,
  "title": "The Effects of an Inpatient Palliative Care Team on Discharge Disposition",
  "abstract": "Overview: Inpatient palliative care teams' (PCT) contribution to improved quality of life and patient satisfaction as well as decreased utilization and costs has been well established. Yet few studies have examined the specific effect of an inpatient PCT on discharge disposition, despite evidence of an association between hospice enrollment, decreased rehospitalization, and improved resource utilization. Methods: Patients admitted to a large nonprofit multisite hospital between June 2004 and December 2007 and seen by the PCT were matched to usual care (UC) patients on age, mortality risk, prior year hospitalized days, and disease severity. Discharge disposition and demographic factors were abstracted from hospital administrative claims; mortality data was collected from the social security death index. Analyses were performed using Wilcoxon's test, chi(2) analysis, and multinomial logit regression. Results: Three hundred sixty-one matched pairs were available for analysis. Compared to UC, patients who received a PCT consultation were 3.24 times more likely to be discharged to hospice (p < 0.0001), 1.52 times more likely to be discharged to a nursing facility, and 1.59 times more likely to be discharged home with services (p < 0.001), controlling for patient demographics and disease severity. PCT patients were also referred to hospice earlier in their disease trajectory, rather than in the last few weeks of life. Conclusion: Patients receiving an inpatient PCT consultation are more likely to receive follow-up services upon discharge from the hospital. These services likely contribute to better quality of care and financial benefits, and warrants further study, especially considering the current focus on health care efficiency and quality.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "331060c6813e33e01f69846b588139f4",
  "timestamp": "2025-05-15T03:20:22.401853"
}