{
  "id": 7546,
  "title": "The Exosystem Impact: An Analysis of Male- and Female Physical Intimate Partner Violence Victimization in Heterosexual Relationships",
  "abstract": ": An increasing body of sociological research explores the complexity of intimate partner violence (IPV) in heterosexual relationships. However, early research in this area concentrated exclusively on male perpetration, thereby necessitating a better understanding of the contexts behind female-perpetrated and bidirectional IPV. Using the two most recent cycles of the Canadian General Social Survey (2014 and 2019), our study employs a multinomial logistic regression model to examine the prevalence and severity of female and male physical IPV victimization among a large sample of married and common-law heterosexual couples. Framing our analysis through one concentric level of Dutton's (1990) nested ecological model, the exosystem, we aim to understand whether these indicators serve as protective markers against severe and nonsevere physical IPV. We investigate the impact of eight exosystem indicators (financial stress, number of children, length of relationship, religiosity, employment, social support, education, and income). Our findings suggest that social support, employment, and household income serve as protective markers against male and female physical IPV victimization. Other protective factors include the length of the relationship and the partner's religiosity for female-perpetrated violence. At the same time, the presence of children in the household reduces the likelihood of male-perpetrated IPV despite being a risk marker for female perpetration. Risk factors for both men and women include education and their partner's employment. Future research should undertake a more in-depth exploration of the impact of exosystem and macrosystem factors on instances of IPV to generate a better understanding of predictive and preventative measures.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "331434757f159cfadebc4b7e243fd8fe",
  "timestamp": "2025-05-15T03:09:36.932180"
}