{
  "id": 587,
  "title": "Learning to hit the Ground Running - The Online Way",
  "abstract": "On the road of transition, many people in South Affica still lack the skills needed to participate in society. The South African Government committed itself to empower its citizens with the skills and competencies required to function optimally in the world of work. To ensure that people hit the ground running when they enter the labour market, the National Qualifications Framework (NQF) stipulates critical, cross-field learning outcomes as exit requirements at all levels of education and training. In adherence to this framework, a major curriculum review in the School of Medicine, University of the Free State, was introduced in 2000. An increased focus on helping students develop not only subject-specific and professional skills, but also lifelong learning skills, and a commitment to achieve a synergistic relationship between learning and technology, were among the goals of the review. In 2000-2006, a face-to-face instructional approach was used in a module on generic skills for first-year medical students. Task-oriented activities were used to develop proficiency in skills such as communication, collaboration and the use of computers. However, challenging logistics and cumbersome paper-based portfolio assessment prompted the relocation of this module to an online environment. Since constructivist learning theories claim that generic skills development is encouraged in environments conducive to deep learning, authentic content, social negotiation, reflexivity and tasks requiring active involvement of students, were emphasised. No consensus exists in the literature regarding the benefits of computer-assisted learning. Online learning could even be dangerous in the hands of students who struggle with self-regulatory tasks. This study aimed to evaluate the acceptability and effectiveness of the new approach to skills development. A snapshot descriptive study investigated whether students could identify with the technology-based approach and whether the delivery process permitted deep, constructivist learning. The questionnaire survey and nominal group discussion used to capture student feedback, form part of a more comprehensive action research project aimed at internal quality assurance and on-going improvement of generic skills development. The results indicate that online learning not necessarily leads to enhanced critical outcomes, thus highlighting the vital role of methodology in skills development. The study further confirms that technology is only a tool and not an end in itself in addressing the skills needs of a diverse student population. Ultimately, the how-to knowledge gained by relocating paper-based learning content to an online environment, may be applicable to other similar contexts.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "332ed004af94d99fc1b31c96b0692e2a",
  "timestamp": "2025-05-15T00:37:38.202365"
}