{
  "id": 7032,
  "title": "Early Warning of Late Spring Frost in Apple Orchards of Northwest of Iran",
  "abstract": "Frost on agricultural products in spring imposes heavy financial losses to agriculture particularly in northwest of Iran's orchards. Frost early warning is an effective way in preventing frost risk in apple orchards. This paper aims to validate frost early warning system in apple orchards of northwestern Iran by predicting flowering date of apple tree and its combination with WRF (Weather Research and Forecasting) model simulations of the 2-m temperature. To this end, stepwise multiple linear regression model was used for predicting flowering date; therefore thermal variables data including mean temperature, mean maximum temperature, mean minimum temperature, last frost date, heat wave duration, heat wave intensity, GDD and maximum standard temperature data larger than 1 (Z > 1) for the period of 2007-2016 (from March 1st until flowering date) in Kahriz agrometeorological station in northwest of Iran were calculated and added to the model. Also, to evaluate the accuracy of WRF model simulations, the 72-h simulations of the 2-m air temperature for internal computational grid in northwestern Iran (West Azerbaijan Province) in 17 synoptic stations were compared to minimum air temperature observed in the stations. Results revealed that the proposed stepwise regression method is a relatively precise model with a mean absolute error of 2.7 days between the predicted and observed flowering dates. Findings were also indicative of an acceptable accuracy of 72-h minimum air temperature simulations of WRF model in the study area.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "333961f223ce1da48c192b466adace33",
  "timestamp": "2025-05-15T03:04:23.007783"
}