{
  "id": 7657,
  "title": "Does healthcare inequity reflect variations in peoples' abilities to access healthcare? Results from a multi-jurisdictional interventional study in two high-income countries",
  "abstract": "Background Primary healthcare services must respond to the healthcare-seeking needs of persons with a wide range of personal and social characteristics. In this study, examined whether socially vulnerable persons exhibit lower abilities to access healthcare. First, we examined how personal and social characteristics are associated with the abilities to access healthcare described in the patient-centered accessibility framework and with the likelihood of reporting problematic access. We then examined whether higher abilities to access healthcare are protective against problematic access. Finally, we explored whether social vulnerabilities predict problematic access after accounting for abilities to access healthcare. Methods This is an exploratory analysis of pooled data collected in the Innovative Models Promoting Access-To-Care Transformation (IMPACT) study, a Canadian-Australian research program that aimed to improve access to primary healthcare for vulnerable populations. This specific analysis is based on 284 participants in four study regions who completed a baseline access survey. Hierarchical linear regression models were used to explore the effects of personal or social characteristics on the abilities to access care; logistic regression models, to determine the increased or decreased likelihood of problematic access. Results The likelihood of problematic access varies by personal and social characteristics. Those reporting at least two social vulnerabilities are more likely to experience all indicators of problematic access except hospitalizations. Perceived financial status and accumulated vulnerabilities were also associated with lower abilities to access care. Higher scores on abilities to access healthcare are protective against most indicators of problematic access except hospitalizations. Logistic regression models showed that ability to access is more predictive of problematic access than social vulnerability. Conclusions We showed that those at higher risk of social vulnerability are more likely to report problematic access and also have low scores on ability to seek, reach, pay, and engage with healthcare. Equity-oriented healthcare interventions should pay particular attention to enhancing people's abilities to access care in addition to modifying organizational processes and structures that reinforce social systems of discrimination or exclusion.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "333e8e6fcee6c0b84984127868514ffe",
  "timestamp": "2025-05-15T03:10:33.136459"
}