{
  "id": 1208,
  "title": "Embedded draw-down constraint reward function for deep reinforcement learning",
  "abstract": "Money management, also known as asset allocation, is constantly at the forefront of research in the trading and investing fields. Since Markowitz established the current portfolio theory in 1952, it has drawn many experts to this intriguing topic. The Kelly criteria are one of the brightest stars among these new techniques. It provides an elegant solution for players and investors to get the best bidding fraction and maximize their logarithm worth over time. However, it ignores the fact that each investor has a different risk tolerance, and the proportion was calculated using the Kelly criterion without taking into account the downside risk. This paper attempts to develop a risk prediction model using a probability-based method and adjust the reward function of deep reinforcement learning to account for the downside risk. To summarize, rather than a naive reward function that solely optimizes the return, the improved deep reinforcement learning may consider an investor's risk tolerance. Finally, we solely analyze the scenario of a single asset and employ DXY, GBP/USD, and EUR/USD as the underlying training and validation data sets. The outcome demonstrates that the adjustment to the reward mechanism produces an interesting performance. When the required MDD (Maximum draw-down) is greater than 3%, the likelihood is on average greater than 70%. (c) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "334d22421b897653c968530c54aeff5c",
  "timestamp": "2025-05-15T00:53:09.891573"
}