{
  "id": 8500,
  "title": "Variation in Postpartum Use of Most and Moderately Effective Contraceptive Methods Among Louisiana Women",
  "abstract": "Background Women experiencing unintended and short-interval pregnancies are at increased risk for adverse outcomes. Nationally, researchers report disparities in women's use of effective contraceptive methods based on demographic, cultural, financial and system-level factors. Despite 58% of Louisiana births being unplanned, researchers have not reported on these relationships in Louisiana. Methods We used Louisiana Pregnancy Risk Assessment Monitoring System data from 2015 to 2018. Among postpartum women who were not abstinent, pregnant, or trying to become pregnant, we estimated use of five categories of effective contraception versus no effective method. We used multivariable multinomial logistic regression to investigate the association between effective contraceptive use and race/ethnicity, postpartum insurance and education. Results Among Louisiana postpartum women who were not abstinent, pregnant, or trying to become pregnant, 35.4% were not using effective contraception. Women with public insurance had greater odds of using long-acting reversible contraception than women with private insurance (adjusted odds ratio [AOR] 1.55; 95% confidence interval [CI] 1.11-2.16). Compared to women with a bachelor's or higher, women with less than high school (AOR 2.09; CI 1.22-3.56), high school (AOR 3.11; CI 2.01-4.82) or some college education (AOR 2.48; CI 1.64-3.75) had greater odds of using permanent contraception. Black (AOR 3.83; CI 2.66-5.54) and Hispanic (AOR 3.85; CI 2.09-7.11) women, women with less than high school (AOR 6.79; CI 2.72-16.94), high school (AOR 7.26; CI 3.06-17.21) and some college (AOR 7.22; CI 3.14-16.60), and women with public insurance (AOR 1.91; CI 1.28-2.87) had greater odds of using injectable contraception. Discussion Results showed variation in effective contraceptive method use by race/ethnicity, insurance and education. These findings highlight the need for state-level research into the individual, provider, and policy-level factors that influence women's contraceptive choices.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "335376344f5a5c396159c9d63c4db415",
  "timestamp": "2025-05-15T03:19:21.361372"
}