{
  "id": 6186,
  "title": "Crop Residue Burning and Its Relationship between Health, Agriculture Value Addition, and Regional Finance",
  "abstract": "Crop residue burning (CRB) poses a serious threat to the climate, soil fertility, human health and wellbeing, and air quality, which increases mortality rates and slumps agricultural productivity. This study conducts a pan-India analysis of CRB burning based on the spatial characteristic of crop residue management practices and analyzes the linkage among health, agriculture value addition, and regional finance using the simultaneous equation to find the causality and panel quantile regression for direct effect and intergroup difference. We discuss some of the alternative crop residue management practices and policy interventions. Along with in situ management, this paper discusses ex situ crop residue management (CRM) solutions. The ex situ effort to manage crop residue failed due to the scarcity of the supply chain ecosystem. Force of habit and time constrain coupled with risk aversion have made farmers reluctant to adopt these solutions. Our results show that financial viability and crop residue have bidirectional causality; therefore, both the central and state governments must provide a financial solution to lure farmers into adopting residue management practices. Our analysis shows that framers are likely to adopt the management solution (farmers have some economic benefits) and are reluctant to adopt the scientific solution because the scientific solution, such as pusa decomposer, is constrained by the weather, temperature, and humidity, and these parameters vary throughout India.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "335ba171863de061ffed01b10856dec1",
  "timestamp": "2025-05-15T02:55:44.540629"
}