{
  "id": 8478,
  "title": "Health Risks and Country Sustainability: The Impact of the COVID-19 Pandemic with Determining Cause-and-Effect Relationships and Their Transformations",
  "abstract": "The authors investigated the coronavirus pandemic as a health and safety risk factor for sustainable state development. The main purpose is to determine the cause-and-effect relationships between the key spheres of society life: economic, financial-budgetary, political--institutional. The authors hypothesize that these spheres influence each other and that this influence becomes more obvious and important to consider during significant shifts such as health threats and transformations in the public health system. As part of the calculations, the methodology of canonical regression analysis was used, which made it possible to evaluate the influence of a set of indicators using the construction of a correlation matrix. Aggregation of the complex of development indicators for each direction was carried out, and their mutual influence and degree of importance within each group of indicators was determined. The identified interdependencies are valuable for predicting the state of various industries in the future. It was concluded that there were no significant changes between the indicators of the analyzed components of a country's development in the pre-and post-pandemic period. This makes it possible to state with a high probability that forecasting in the long-term perspective of a country's development is possible based on the degree of interrelationships between the indicators of individual areas of development. Forecasting can also be based on the trends occurring in a specific related field to correct the upward or downward movement of a particular indicator, and to change the functioning of the complex system under the influence of threats to public health.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3371f0218d5cb7cfa33d71fc99f95540",
  "timestamp": "2025-05-15T03:19:21.285998"
}