{
  "id": 370,
  "title": "Regime Classification and Stock Loan Valuation",
  "abstract": "For traditional perpetual American put options under regime-switching models, the risk-free interest rates are typically assumed to be positive, and optimal stopping usually can occur in any regime. However, this may not hold true when the risk-free interest rates are allowed to be equal to zero (the interest rate may drop to zero in reality, e.g., in certain periods in Japan); there may exist continuation regimes within which optimal stopping can never occur, that is, within which stopping is never optimal. In this paper, we develop a unified, fixed point approach to determining all continuation regimes explicitly for the pricing problem of perpetual American put options under general regime-switching exponential Levy models with any finite numbers of regimes and general Levy types, in which the risk-free interest rate in each regime is nonnegative and the discounted stock price with the dividends reinvested is not necessarily a martingale. As an important application of this regime classification result, we provide a unified framework for the valuation of infinite maturity stock loans under general regime-switching exponential Levy models with any finite numbers of regimes and general Levy types, which can be formulated as the pricing problem of perpetual American call options with negative interest rates. Applying this unified approach yields analytical solutions to the infinite maturity stock loan prices under both the general exponential Levy models without regime switching and the regime-switching phase-type jump diffusion models with any finite numbers of regimes and with or without dividends, which include some related results in the literature as special cases.",
  "year": 2020,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "338f7d948434c2f3c81ab6c20153c4de",
  "timestamp": "2025-05-15T01:31:13.179418"
}