{
  "id": 443,
  "title": "Deep learning-based image processing for financial audit risk quantification in healthcare",
  "abstract": "Recently, deep learning technology has gradually penetrated various fields. Today, the field of healthcare is also closely linked to deep learning technology. Image processing technology based on deep learning can accurately segment medical images, which is convenient for medical research and pathological analysis. Accurate distribution of images can effectively save medical resources. Therefore, image processing techniques can contribute to the quantification and assessment of economic audit risks. In recent years, medical image segmentation has achieved many research results. However, with the improvement of accuracy, the segmentation standards of medical images are also becoming more and more stringent. For medical images, they tend to have rough and fuzzy boundaries and noise disturbances of different shapes. The above problems pose challenges for accurate localization and segmentation of lesion regions. On the other hand, in the field of medical images, there are also problems such as unbalanced number of samples and scarcity of large medical image datasets. In response to these problems, this paper conducts research work and proposes an Attention Mechanism and Multi-Scale spatial Pooling-based conditional Adversarial Network (AM-MSP-cGAN) model to achieve automatic segmentation of medical images. AM-MSP-cGAN can learn more detailed features from fuzzy boundaries, and effectively solve the problem of data lack, thereby promoting economic audit risk quantification and assessment in the healthcare field.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3399a7bdcb76576fe98cddde2a6b7b22",
  "timestamp": "2025-05-15T01:38:17.414896"
}