{
  "id": 6654,
  "title": "Analysing and predicting wildlife-vehicle collision hotspots for the Swiss road network",
  "abstract": "ContextWildlife-vehicle collisions (WVCs) are a significant threat for many species, cause financial loss and pose a serious risk to motorist safety.ObjectivesWe used spatial data science on regional collision data from Switzerland with the objectives of identifying the key environmental collision risk factors and modelling WVC risk on a nationwide scale.MethodsWe used 43,000 collision records with roe deer, red deer, wild boar, and chamois from 2010 to 2015 for both midlands and mountainous landscape types. We compared a fixed-length road segmentation approach with segments based on Kernel Density Estimation, a data-driven segmentation method. The segments' environmental properties were derived from land-cover geodata using novel neighbourhood operations. Multivariate logistic regression and random forest classifiers were used to identify and rank the relevant environmental factors and to predict collision risk in areas without collision data.ResultsThe key factors for WVC hotspots are road sinuosity, and two composite factors for browsing/forage availability and traffic noise-a proxy for traffic flow. Our best models achieved sensitivities of 82.5% to 88.6%, with misclassifications of 20.14% and 27.03%, respectively. Our predictions were better in forested areas and revealed limitations in open landscape due to lack of up-to-date data on annual crop changes.ConclusionsWe illustrate the added value of using fine-grained land-cover data for WVC modelling, and show how such detailed information can be annotated to road segments using spatial neighbourhood functions. Finally, we recommend the inclusion of annual crop data for improving WVC modelling.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "33b0441dccb4648796cf00b876c35eac",
  "timestamp": "2025-05-15T03:00:05.067687"
}