{
  "id": 1506,
  "title": "What Can Machine Learning Teach Us about Australian Climate Risk Disclosures?",
  "abstract": "There seems to be no agreed taxonomy for climate-related risks. The information in firms' climate risk disclosures represents a new resource for identifying the priorities and strategies of Australian companies' management of climate risk. This research surveys 839 companies listed on the Australian Stock Exchange for the presence of climate risk disclosures, identifying 201 disclosures on climate risk. The types of climate risks and the risk management strategies were extracted and evaluated using machine learning. The analysis revealed that Australian firms are focused on acute physical climate risks, followed by market and regulatory risks. The predominant management strategy for these risks was to use a risk reduction approach, rather than avoiding or transferring risk. The analysis showed that key Australian industry sectors, such as materials, banking, insurance, and energy are focusing on different mixtures of risk types, but they are all primarily managing risks through risk-reduction strategies. An underlying driver of climate risk disclosure was composed of the financial implications of climate risk, particularly with respect to acute physical risks. The research showed that emission reductions represent a primary consideration for Australian firms in their disclosures identifying how they are responding to climate risk. Further research using machine learning to evaluate climate risk disclosure should focus on analysing entire climate risk reports for key topics and trends over time.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "33bd9f8f1c9a91d5cf410e5c6991fb29",
  "timestamp": "2025-05-15T02:03:39.846296"
}