{
  "id": 8947,
  "title": "ESG AND ESG CONTROVERSIES ON FIRM RISKS IN EMERGING MARKETS: THE MODERATING ROLES OF SHARI'AH SCREENING AND LEGAL ORIGIN",
  "abstract": "Purpose - This study examines the impact of environmental, social and governance (ESG) and ESG controversies (ESGC) on firm risks, and it proposes the moderating roles of Shari'ah screening and legal origins over the relationship. Design/Methodology/Approach - The research data included 522 firms from 16 emerging markets over the period 2013-2021 (4,689 observations). The data (i.e., ESG, financial data, etc.) were obtained from the Refinitiv database. The panel regression model was used to examine the relationships of the variables studied. Findings - The study finds that ESG is negatively related to risks while ESGC are positively related to risks. Further, this study finds that both Shari'ah screening and the legal origins play significant moderating roles in reducing risks via their influence on ESG and ESGC. The evidence is consistent with the observation that Shari'ah-compliant firms are more inclined to engage in ESG activities. Originality/Value - This study is unique as it is an attempt to examine the moderating role of Shari'ah screening and the legal environment in influencing the impact of ESG and ESGC on firm risks in an emerging market situation. Practical Implications - The findings may be used as a basis for all governments in emerging markets to introduce and strengthen their ESG strategies in all aspects of firms' operations. Additionally, in relation to developing global Islamic finance, policymakers need to be mindful of the importance of the Shari'ah-ESG linkage and imbed this relationship in their strategic development blueprints. Research Limitations/Implications - The findings suggest that more aggressive engagement in ESG activities can benefit firms through their risk-mitigating effects. Furthermore, the evidence indicates the positive impact of Shari'ah screening in mitigating risks via ESG and corporate controversies, lending credibility for firms to be considered Shari'ah compliant.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "33e2de22cc114f704c9ec35fe951afb2",
  "timestamp": "2025-05-15T03:23:56.127346"
}