{
  "id": 433,
  "title": "BITCOIN: A PONZI SCHEME OR AN EMERGING INFLATION-FIGHTING ASSET?",
  "abstract": "Under the dual impact of the COVID-19 pandemic and the Russian-Ukrainian conflict, the excessive stimulation of monetary policy continuously pushes up global inflation (INF). Therefore, this article explores whether Bitcoin can serve as a safe haven for INF. We apply the rolling-window Granger causality test to solve the issue of parameter instability in vector autoregression (VAR) systems and investigate the time-varying interaction between INF and Bitcoin price (BP). The negative influence of INF on BP means a high inflation shock causes BP to decline, indicating that Bitcoin cannot be a safe asset against INF. This is because investors have decreased their willingness to hold Bitcoin under the high INF expectations and cause BP to fall. This finding is not supported by the Intertemporal Capital Asset Pricing Model, emphasising that INF positively impacts BP. Conversely, BP has positive and negative impacts on INF. The positive effect highlights the effectiveness of Bitcoin in predicting INF fluctuations, but economic factors could undermine this effectiveness. In the context of economic stagnation and market turmoil, investors can adjust their portfolio investments based on Bitcoin. The government should utilise the trend of BP to regulate the dynamics of INF to reduce uncertainty in the financial system.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "33fc41ce2a3165e91db9a756824a21cc",
  "timestamp": "2025-05-15T00:35:49.751321"
}