{
  "id": 2854,
  "title": "The Effect of Financial Development and MFI's Characteristics on the Efficiency and Sustainability of Micro Financial Institutions",
  "abstract": "The Micro Financial Institutions (MFIs) have been touted as development strategies for Emerging Markets and Developing Economies (EMDEs) which merits research into the effect of financial development on the efficiency and sustainability of the MFIs. The Efficient and sustainable MFIs significantly paved the way for the economic development of a country particularly in developing countries. Surprisingly there are very rare studies that examine the nexus of financial development, MFIs efficiency, and sustainability. Also, these studies are confined to the impact of financial development either on the efficiency or sustainability of MFIs. Addressing this gap, the study attempts to explore the country-specific and MFIs-specific factors which significantly affect the efficiency and sustainability of the MFIs. For this purpose, the study first determines whether financial development contributes to the efficiency and sustainability of MFI. Secondly, the effect of MFIs' specific characteristics such as credit risk, market risk, liquidity risk, lending strategy, Development Financial Institutions (DFIs) funds management, financial outreach, and poverty alleviation on the efficiency and sustainability of MFIs. The study has been conducted for Bangladesh, India, and Pakistan consisting of a panel data set of 12 MFIs over a period spanning from 2008-2018 using Stochastic Frontier Analysis and Cobb Douglas production function regression analysis. Overall empirical analysis reveals that financial development has significantly affected the efficiency and sustainability of the MFIs. While specific characteristics such as poverty alleviation and DFIs funds management have been shown to improve MFIs efficiency whereas an increase in credit risk, lending strategy, and market risk decrease MFIs sustainability and liquidity risk along with an increase in financial outreach leads to a decrease in MFIs efficiency. The directions and magnitudes of the findings suggest the stakeholders for all three countries for the significant direction leads to the efficiency and sustainability of MFIs. Moreover, future research could strive to understand the aspects of financial development which negatively correlate with the MFIs' efficiency and sustainability such as stringent tax policies, creditor rights protection, and implementation of rules and regulations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "340429d813a8b9ce604afb2269e05737",
  "timestamp": "2025-05-15T02:19:46.751918"
}