{
  "id": 8883,
  "title": "A Prospective Cohort Study of Stability Preferred Place of Death Among Patients With Stage IV Cancer in Singapore",
  "abstract": "Background: Advance care planning (ACP) involves documentation of patients' preferred place of death (PoD). This assumes that patients' preferred PoD will not change over time; yet, evidence for this is inconclusive. We aimed to assess the extent and correlates of change in patients' preferred PoD over time. Materials and Methods: Using data from a cohort study of patients with advanced cancer in Singapore, we analyzed preferred PoD (home vs institution including hospital, hospice, an`d nursing home vs unclear) among 466 patients every 6 months for a period of 2 years. At each time point, we assessed the proportion of patients who changed their preferred PoD from the previous time point. Using a multinomial logistic regression model, we assessed patient factors (demographics, understanding of disease stage, ACP, recent hospitalization, quality of life, symptom burden, psychologic distress, financial difficulty, prognosis) associated with change in their preferred PoD. Results: More than 25% of patients changed their preferred PoD every 6 months, with no clear trend in change toward home or institution. Patients psychologically distressed at the time of the survey had increased likelihood of changing their preferred PoD to home (relative risk ratio [RRR], 1.02; 95% CI, 1.00-1.05) and to an institution (RRR, 1.06; 95% CI, 1.02-1.10) relative to no change in preference. Patients hospitalized in the past 6 months were more likely to change their preferred PoD to home (RRR, 1.56; 95% CI, 1.07-2.29) and less likely to change to an institution (RRR, 0.50; 95% CI, 0.28-0.88) relative to no change in preference. Conclusions: The present study provides evidence of instability in the preferred PoD of patients with advanced cancer. ACP documents need to be updated regularly to ensure they accurately reflect patients' current preference.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3407fe27887b41e9d72758e18f72fb81",
  "timestamp": "2025-05-15T03:23:27.803405"
}