{
  "id": 6481,
  "title": "Coding in general practice-Will the ICD-11 be a step forward?",
  "abstract": "Primary care physicians in Germany don't benefit from coding diagnoses-they are coding for the needs of others. For coding, they mostly are using either the thesaurus of the German Institute of Medical Documentation and Information (DIMDI) or self-made cheat-sheets. Coding quality is low but seems to be sufficient for the main use case of the resulting data, which is the morbidity adjusted risk compensation scheme that distributes financial resources between the many German health insurance companies. Neither the International Classification of Diseases and Health Related Problems (ICD-10) nor the German thesaurus as an interface terminology are adequate for coding in primary care. The ICD-11 itself will not recognizably be a step forward from the perspective of primary care. At least the browser database format will be advantageous. An implementation into the 182 different electronic health records (EHR) on the German market would probably standardize the coding process and make code finding easier. This method of coding would still be more cumbersome than the current coding with self-made cheat-sheets. The first steps towards a useful official cheatsheet for primary care have been taken, awaiting implementation and evaluation. The International Classification of Primary Care (ICPC-2) already provides an adequate classification standard for primary care that can also be used in combination with ICD-10. A new version of ICPC (ICPC-3) is under development. As the ICPC-2 has already been integrated into the foundation layer of ICD-11 it might easily become the future standard for coding in primary care. Improving communication between the different EHR would make taking over codes from other healthcare providers possible. Another opportunity to improve the coding quality might be creating use cases for the resulting data for the primary care physicians themselves.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34274675f339bfb2ca97728bd8d20e96",
  "timestamp": "2025-05-15T02:58:34.159208"
}