{
  "id": 9021,
  "title": "Stock Market Development and Macroeconomic Performance in Thailand",
  "abstract": "Rapid development of financial markets particularly stock markets has been a main feature of many emerging markets. The conventionally held view, which has a basis in the seminal work of Schumpeter (1911), is that the stock market development is beneficial to the economy since it provides liquidity and an avenue for risk sharing and diversification, allows efficient allocation of resources to productive investment, reduces information and transaction costs and, consequently allows firms to undertake profitable investments. This view has been supported by various early empirical studies noting a positive relation between stock market development and economic growth. It has also been supported by recent studies utilizing advanced time series econometrics and finding the causal influences of stock market development on economic performance. Still, against this view and empirical evidence, some have also noted potential detrimental effects of stock market development through saving reduction, facilitation of counterproductive corporate takeovers, attraction of speculative inflows and reversal of financial capitals. The questions as to whether the stock market development influences macroeconomic performance and whether it can be employed as a development policy strategy are particularly relevant for emerging or developing economies. Over the past years, these economies have attempted to promote their stock markets with the objective of improving resource allocation and, consequently, of propelling their economic growth. However, after especially the liberalization of their financial markets, they have been exposed to sharp swings and wide fluctuations of their market performance, which may have inflicted detrimental impacts on macroeconomic performance. In this regards, the 1997/1998 Asian crisis, which started in Thailand and propagated to other Asian economies, is a good example. In looking at whether stock market development contributes to macroeconomic performance, existing studies have mainly looked at the relation between stock market development indicators and measures of economic performance using a linear regression model or has ascertained the causal relations that run from the stock market development indicators to macroeconomic variables using such approached as Granger causality, vector error correction modeling (VECM) and vector autoregressive modeling (VAR). While it is essential to document a strong relation between them, the linear regression model is not sufficient to establish causation. Moreover, the employment of a dynamic model such as the VAR or VECM and the finding of a causal pattern that runs from the stock market development to economic growth are not sufficient for policy prescription. This stems from the fact their relation or causal influences may shift due to the shift in regimes, signifying that the stock market development cannot be employed as a policy variable. In short, their relations are the subject of the well-known Lucas critique. In this paper, we utilize a 4-variable framework and quarterly data from 1993 to 2007 to examine the stock market and macroeconomic performance relation for Thailand. To this end, we first evaluate the causal patterns between a measure of stock market development and measures of macroeconomic performance, which is essential to evaluate whether stock market development 'causes' growth. Then, we assess whether the relations between the two main variables, i.e. measures of stock market development and macroeconomic performance, are structurally invariant to policy shifts. Hence, in addition to using standard time-series econometrics of cointegration and vector autoregressions (VAR), we alo examine within the error correction setting the superexogeneity of the stock market development. More specifically, to make a strong case for promotion of the stock market as a development strategy, the stock market development must be superexogenous since their relationship is structurally invariant to policy shifts and, accordingly, circumventing the famous Lucas critique in making policy recommendation. The cointegration test results suggest the presence of a long run relationship among the variables, namely, real gross domestic product (GDP), market capitalization ratio, investment ratio, and the aggregate price level. Further, the impulse-response functions and variance decompositions simulated from the estimated VAR models clearly indicate positive and sizeable contributions of stock market development to real GDP as well as investment ratio. Finally, the superexogeneity test indicates that the stock market development is superexogenous in the system. Thus, the relation between economic development and stock market development is structurally invariant to policy shifts. In the case of Thailand, there is a strong case for policy prescription to promote the development of its stock market as a catalyst to economic growth.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "343148cfd5b6ce68a645abddeeb40673",
  "timestamp": "2025-05-15T03:24:54.877598"
}