{
  "id": 4812,
  "title": "CAESAR II Tool: Complementary Analyses for Emergency Planning Based on Seismic Risks Impact Evaluations",
  "abstract": "Italy is a country with high seismic hazard, however since the delay in the seismic classification of the national territory, most of the existing building heritage does not comply with the current technical standards for buildings. The seismic events that have hit different Italian regions in recent years have highlighted the complexity of the challenge for the public bodies both in the emergency management and post-event reconstruction and in the planning of effective risk prevention and mitigation measures to be implemented in 'peacetime'. These difficulties concern, in particular, the capacity to properly manage the financial and technical resources available and to identify the intervention priorities throughout the entire emergency cycle. For correct management, the priority is to quantify and localize, through simulations, the quantification of probable damages and to evaluate in terms of cost-benefits the possible alternative strategies for mitigation, also taking into account the potential, in terms of cost-effectiveness, of integrated measures for seismic and energy retrofitting. In this framework, the project CAESAR II (Complementary Analyses for Emergency planning based on Seismic Risks impact evaluations) has been developed as a Decision Support System for Public Authorities in charge of developing Disaster Risk Reduction plans, with the possibility of programming mid to long-term investments for public and private properties, as well as defining custom financial support mechanisms and tax incentives.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3434b28dc6d47317dbc16baa0afdb663",
  "timestamp": "2025-05-15T02:41:00.929663"
}