{
  "id": 8427,
  "title": "How have people been coping during the COVID-19 pandemic? Patterns and predictors of coping strategies amongst 26,016 UK adults",
  "abstract": "Background Individuals face increased psychological distress during the COVID-19 pandemic. However, it's unknown whether choice of coping styles are influenced by COVID-19 in addition to known predictors. Methods Data from 26,016 UK adults in the UCL COVID-19 Social Study were analysed from 12/4/2020 15/5/2020. Regression models were used to identify predictors of coping styles (problem-focused, emotion-focused, avoidant, and socially-supported): model 1 included sociodemographic variables, model 2 additionally included psychosocial factors, and model 3 further included experience of COVID-19 specific adverse worries or events. Results Sociodemographic and psychosocial predictors of coping align with usual predictors of coping styles not occurring during a pandemic. However, even when controlling for the wide range of these previously known predictors specific adversities were associated with use of specific strategies. Experience of worries about finances, basic needs, and events related to Covid-19 were associated with a range of strategies, while experience of financial adversities was associated with problem-focused, emotion-focused and avoidant coping. There were no associations between coping styles and experiencing challenges in meeting basic needs, but Covid-19 related adversities were associated with a lower use of socially-supported coping. Conclusions This paper demonstrates that there are not only demographic and social predictors of coping styles during the COVID-19 pandemic, but specific adversities are related to the ways that adults cope. Furthermore, this study identifies groups at risk of more avoidant coping mechanisms which may be targeted for supportive interventions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "343cc03477abe4fafa3162c5678d267b",
  "timestamp": "2025-05-15T03:18:51.554842"
}