{
  "id": 4276,
  "title": "Explaining logistics social responsibility from a dynamic capabilities perspective",
  "abstract": "Purpose So far, most of the literature on logistics social responsibility (LSR) has prioritized the examination, classification of and adaption toward positive LSR practices instead of investigating necessary logistics service providers' capabilities to implement LSR strategies. Therefore, the purpose of this paper is to contribute to theory by an assessment of LSR and its linkages to dynamic capabilities theory to gain insights into how logistics service providers can foster an enhanced application of LSR practices. Design/methodology/approach The paper is conceptual and grounded on dynamic capabilities theory. Relevant literature from logistics management, supply chain management and sustainable supply chain management (SSCM) as well as dynamic capabilities was examined to build upon existing theory by conceptualizing LSR from a dynamic capabilities perspective. In addition, propositions for future research are presented based on the conceptual model. Findings With regards to the controversial discussion in the literature about the direct link between dynamic capabilities and competitive advantage as well as the necessary degree of heterogeneity of dynamic capabilities, the conceptualization of LSR from a dynamic capabilities perspective adds new elements to this discussion. Considering long-term or even sustainable competitive advantage, the current degree of homogeneity across logistics services might hinder a sustainable advantage in the long run and demands for more advanced logistical capabilities. In this line, it is important to understand and utilize the causal relationships between different logistical resources and capabilities to achieve a unique long-term advantage allowing logistics service providers to further enhance LSR practices. Practical implications Due to the current role of logistics service providers, they should not just foster their resources focusing on the relationship to the focal firm, but they should also develop and implement new logistical capabilities derived from SSCM-related dynamic capabilities to design alternative service portfolio extensions and new business models. Originality/value Although dynamic capabilities have been studied intensively in the last two decades, the causal relationships between different logistical resources and necessary dynamic capabilities to achieve advantages by enhancing LSR practices still lack conceptualization. To build on the understanding of LSR, the paper at hand presents a conceptual framework explaining LSR and SSCM practices through the lens of dynamic capabilities theory.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "344e7f4d7594da4c6134508a89119f7e",
  "timestamp": "2025-05-15T01:25:23.332601"
}