{
  "id": 5755,
  "title": "Green Bonds for the Transition to a Low-Carbon Economy",
  "abstract": "The green bond market is emerging as an impactful financing mechanism in climate change mitigation efforts. The effectiveness of the financial market for this transition to a low-carbon economy depends on attracting investors and removing financial market roadblocks. This paper investigates the differential bond performance of green vs non-green bonds with (1) a dynamic portfolio model that integrates negative as well as positive externality effects and via (2) econometric analyses of aggregate green bond and corporate energy time-series indices; as well as a cross-sectional set of individual bonds issued between 1 January 2017, and 1 October 2020. The asset pricing model demonstrates that, in the long-run, the positive externalities of green bonds benefit the economy through positive social returns. We use a deterministic and a stochastic version of the dynamic portfolio approach to obtain model-driven results and evaluate those through our empirical evidence using harmonic estimations. The econometric analysis of this study focuses on volatility and the risk-return performance (Sharpe ratio) of green and non-green bonds, and extends recent econometric studies that focused on yield differentials of green and non-green bonds. A modified Sharpe ratio analysis, cross-sectional methods, harmonic estimations, bond pairing estimations, as well as regression tree methodology, indicate that green bonds tend to show lower volatility and deliver superior Sharpe ratios (while the evidence for green premia is mixed). As a result, green bond investment can protect investors and portfolios from oil price and business cycle fluctuations, and stabilize portfolio returns and volatility. Policymakers are encouraged to make use of the financial benefits of green instruments and increase the financial flows towards sustainable economic activities to accelerate a low-carbon transition.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "344fa007a5f305717de7ce1f23c7f609",
  "timestamp": "2025-05-15T02:50:54.019806"
}