{
  "id": 7403,
  "title": "Changes in health behaviours during early COVID-19 and socio-demographic disparities: a cross-sectional analysis",
  "abstract": "Objectives The COVID-19 pandemic has profoundly disrupted daily life in Canada. This study assesses changes in health behaviours during the early stages of the pandemic and examines socio-demographic disparities associated with these changes. Methods We analyze data on adults age 25 and older (N = 4383) from the public-use Canadian Perspectives Survey Series 1: Impacts of COVID-19 (CPSS-COVID). Multinomial regression models assess the association between demographic and socio-economic characteristics with increases or decreases in six health behaviours: alcohol, tobacco, and cannabis use, junk food consumption, and TV and internet screen time. Results While findings varied across the six behaviours, overall, there was an increase in negative health behaviours: 14% of Canadian adults reported increasing their alcohol use (95% CI = 0.12, 0.15), 25% increased their junk food consumption (95% CI = 0.23, 0.27), and over 60% increased their screen time (62%, 95% CI = 0.60, 0.65 for TV and 66%, 95% CI = 0.63, 0.68 for internet). Younger and Canada-born adults were more likely to increase negative health behaviours than older and immigrant Canadians. Adults who reported financial impact of COVID-19 were more likely to increase all negative health behaviours (e.g., for increased junk food consumption, the relative risk ratio (RRR) = 1.81, 95% CI = 1.49, 2.20 relative to group reporting no impact). Conclusion Our study documents the overall deterioration of health behaviours during the early stages of the COVID-19 pandemic. To minimize long-term harm to the Canadian population's health, the results highlight the need to tailor interventions, especially for younger Canadians, and the importance of mitigating financial impacts, which are linked to negative changes in health behaviours.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34571b6177e69e0ca0086fa8c40048ca",
  "timestamp": "2025-05-15T03:08:00.884926"
}