{
  "id": 7881,
  "title": "Do women on boards break the glass ceiling or face the glass cliff?",
  "abstract": "PurposeThis paper aims to appraise the effectiveness of gender quotas in breaking the glass ceiling for women on boards (WoBs) in companies that are legally obliged to comply with quotas (listed companies and state-owned companies, LP) and in those that are not (unlisted companies and nonstate-owned companies, NLNP). Furthermore, it investigates the glass cliff phenomenon, according to which women are more likely to be appointed to apical positions in underperforming companies.Design/methodology/approachA balanced panel data of the top 116 Italian companies by total assets, which are present in both 2010 and 2017, is used for estimating ANOVA tests across sectors and fixed-effects panel regression models.FindingsWoBs significantly increased in both the LP and the NLNP companies, and this increase was greater in the financial sector. Furthermore, the relationship between the percentage of WoBs and firm performance is not linear but depends on the financial corporate health. Specifically, the situation in which a woman ascends to a leadership position in challenging circumstances where the risk of failure is high (glass cliff phenomenon) is only present in companies with the lowest performance in the sample, in other words, when negative values of Roe and negative or zero values of Roa occur together.Practical implicationsThese findings have relevant policy implications that encourage the adoption of gender quotas even in specific top positions, such as CEO or president, as this could lead to a double spillover effect both vertically, that is, in other job positions, and horizontally, toward other companies not targeted by quotas. Practical interventions to support women in glass cliff positions, on the other hand, relate to the extent of supervisor mentoring and support to prevent women from leaving director roles and strengthen their chances for career advancement.Originality/valueThe authors explore the ability of gender quotas to break through the glass ceiling in companies that are not legally obliged to do so, and to the best of the authors' knowledge, for the first time, the glass cliff phenomenon in the Italian context.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34686bdd60c3af6c768adc0bf597d4df",
  "timestamp": "2025-05-15T03:13:04.907598"
}