{
  "id": 8293,
  "title": "Public Preference for Financing Preventive Vaccines in Health Shocks: The Case of COVID-19 Vaccines in a Middle-Income Country",
  "abstract": "Background To effectively manage health crises such as disease pandemics, health authorities require reliable information regarding people's preferences. This helps to ensure timely and targeted interventions and avoids increasing societal costs through developing evidence-based policies. This study investigates the Iranian people's preference for financing coronavirus disease 2019 (COVID-19) vaccines and the factors affecting this.Methods A cross-sectional survey was performed during the third-wave peak of COVID-19 in Iran from 1 to 20 February 2021 utilizing various data collection methods. The public preference regarding imported and domestically produced vaccines, their willingness to fully or partially contribute to the financing of these vaccines, and their willingness to pay (WTP) for domestically produced vaccines using the contingent valuation method was assessed in different scenarios. The determinants of the probability of positive financing preferences were evaluated using an ordered probit regression model.Results Among the 2071 survey respondents, approximately 60% stated willingness to contribute to vaccine financing in the form of partial or full user fee payments. Forty percent of respondents are willing to be vaccinated if it is provided for free by the government. Interestingly, people's preference for financing the vaccine was not related to the type of vaccine. The regression analysis showed that income, having supplementary insurance, being male, perceived COVID-19 risk, education, and working in the health sector are significantly related to a higher probability of contribution to vaccine financing.Conclusions Regardless of country of origin of COVID-19 vaccines, vaccination is very important for the Iranian people, and the majority of respondents in our study showed an inclination to contribute to vaccine funding, from partial to full user fees, to achieve higher protection against COVID-19 disease. Hence, ensuring timely access to vaccines during health crises such as pandemics is imperative, as it saves lives and reduces the economic burden of disease. This commitment from the health system can be supported by financial contributions from the general public. In this regard, considering public preferences is strongly advised to policymakers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3469b06bd4af7686d96b99070f69a4e6",
  "timestamp": "2025-05-15T03:17:21.555453"
}