{
  "id": 3243,
  "title": "Multicenter evaluation of financial toxicity and long-term health outcomes after injury",
  "abstract": "In this multi-institutional longitudinal study, the majority (65%!) of trauma survivors are impacted by Financial Toxicity; and worse financial outcomes are independently associated w/ worse physical + mental health. The solutions already exist -> better financial risk protection BACKGROUND Despite the growing awareness of the negative financial impact of traumatic injury on patients' lives, the association between financial toxicity and long-term health-related quality of life (hrQoL) among trauma survivors remains poorly understood.METHODS Patients from nine trauma centers participating in a statewide trauma quality collaborative had responses from longitudinal survey data linked to inpatient trauma registry data. Financial toxicity was defined based on patient-reported survey responses regarding medical debt, work or income loss, nonmedical financial strain, and forgone care due to costs. A financial toxicity score ranging from 0 to 4 was calculated. Health-related quality of life was assessed using the EuroQol 5 Domain tool. Multivariable regression models evaluated the association between financial toxicity and hrQoL outcomes while adjusting for patient demographics, injury severity and inpatient treatment intensity, and health systems variables.RESULTS Among the 403 patients providing 510 completed surveys, rates of individual financial toxicity elements ranged from 21% to 46%, with 65% of patients experiencing at least one element of financial toxicity. Patients with any financial toxicity had worse summary measures of hrQoL and higher rates of problems in all five EuroQol 5 Domain domains (p < 0.05 for all). Younger age, lower household income, lack of insurance, more comorbidities, discharge to a facility, and air ambulance transportation were independently associated with higher odds of financial toxicity (p < 0.05 for all). Injury traits and inpatient treatment intensity were not independently associated with financial toxicity.CONCLUSION A majority of trauma survivors in this study experienced some level of financial toxicity, which was independently associated with worse risk-adjusted health outcomes across all hrQoL measures. Risk factors for financial toxicity are not related to injury severity or treatment intensity but rather to sociodemographic variables and measures of prehospital and posthospital health care resource utilization. Targeted interventions and policies are needed to address financial toxicity and ensure optimal recovery for trauma survivors.LEVEL OF EVIDENCE Prognostic and Epidemiological; Level III.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34962563c2c9ebe31e378a43b6faf362",
  "timestamp": "2025-05-15T02:24:05.207284"
}