{
  "id": 2572,
  "title": "Stock Market Forecasting Using Computational Intelligence: A Survey",
  "abstract": "Stock market plays a key role in economical and social organization of a country. Stock market forecasting is highly demanding and most challenging task for investors, professional analyst and researchers in the financial market due to highly noisy, nonparametric, volatile, complex, non-linear, dynamic and chaotic nature of stock price time series. Prediction of stock market is a crucial task and prominent research area in financial domain as investing in stock market involves higher risk. However with the development of computational intelligent methods it is possible to reduce most of the risk. In this survey paper, our focus is on application of computational intelligent approaches such as artificial neural network, fuzzy logic, genetic algorithms and other evolutionary techniques for stock market forecasting. This paper presents an up-to-date survey of existing literature on stock market forecasting based on computational intelligent methods. In this article, the selected papers are organized and discussed according to six main point of view: (1) the stock market analyzed and the related dataset, (2) the type of input variables investigated, (3) the pre-processing techniques used, (4) the feature selection techniques to choose effective variables, (5) the forecasting models to deal with the stock price forecasting problem and (6) performance metrics utilized to evaluate the models. The major contribution of this work is to provide the researcher and financial analyst a systematic approach for development of intelligent methodology to forecast stock market. This paper also presents the outlines of proposed work with the aim to enhance the performance of existing techniques.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34ad8259dfb9aa4f870f69fd1c9e7f0b",
  "timestamp": "2025-05-15T02:17:01.613221"
}