{
  "id": 6717,
  "title": "Sociodemographic diversity in cancer clinical trials: New findings on the effect of race and ethnicity",
  "abstract": "Background: Cancer clinical trials (CCT) offer significant potential benefit, not only for future patients but also for enrolled participants, yet a very small minority of cancer patients participate, resulting in low levels of enrollment that have stalled clinical trials dramatically. Though many have endeavored to study this phenomenon, relatively little research has explored the demographic factors which may affect CCT enrollment. Understanding patient demographics is critical to optimizing enrollment, evaluating generalizability, and ensuring equity of CCT. Methods: To better understand the effect of social determinants of health on CCT enrollment, the authors constructed a multivariable logistic regression model to analyze data collected in the last ten years in the CDC Behavioral Risk Factor Surveillance System (BRFSS) Survey, an annual national survey conducted among the non-institutionalized adult population of the U.S. Results: In multivariable regression analysis, enrollment varied significantly with sociodemographic factors. Individuals of higher income, Hispanic ethnicity, and younger age were most likely to participate in CCTs. Enrollment did not vary significantly by educational attainment. Conclusion: Our multivariable analysis indicated people of color are more likely to participate in CCT, perhaps demonstrating that structural barriers shape participation more than race alone. Efforts to improve CCT enrollment may benefit from a shift in focus towards access to care by alleviating structural and financial barriers to enrollment",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34b3a6a1662c8d73837c69f9511a6da5",
  "timestamp": "2025-05-15T03:01:03.526260"
}