{
  "id": 7688,
  "title": "Exploring the influence of CEO overconfidence on innovation in artificial intelligence technology: a machine learning approach",
  "abstract": "PurposeInnovation in AI technology has transformed the global economic landscape, thereby becoming a focal point for academic research. A review of extant literature reveals a preponderant focus on the application aspects of AI technology, underscoring the necessity for a more nuanced examination. However, the innovation of AI technology is led by managers who are likely influenced by cognitive biases.Design/methodology/approachThis study combines supervised machine learning models in the AI field and patent abstracts to accurately identify AI technology innovation. It also considers a vital type of cognitive bias, namely overconfidence, to provide novel insights into the literature on AI technology innovation.FindingsFind that overconfident CEOs are more likely to promote AI technology innovation than non-overconfident CEOs. Moreover, consistent with the BTOF prediction, the positive impact of CEO overconfidence on corporate AI technology innovation is strengthened by negative performance feedback, but the above relationship has been weakened by positive performance feedback.Research limitations/implicationsThis study does not posit that all cognitive biases invariably contribute positively to a firm's AI technology innovation. Instead, it advocates for a nuanced understanding of the role of manager-specific cognitive biases in influencing such innovation, taking into account the particular characteristics of these biases. Future researchers could consider key decision-makers behavioral attributes and evaluate the influence of other cognitive biases such as escalation commitment, status quo bias and narcissism.Practical implicationsExecutives must comprehend how their inherent beliefs influence their interpretations and reactions to financial outcomes. Given an external environment with uncertainties and crises, organizations must revise the conventional perception of CEO overconfidence, recognizing its positive impact on risk mitigation, adversity response and AI technological innovation. The selection or replacement of overconfident managers should be contingent on the organization's developmental stage, performance status and strategic requirements, complemented by suitable disciplinary and incentive systems.Originality/valueThis research indicates that when a CEO decides to adopt AI technology innovation in response to negative performance feedback, such a decision might be significantly influenced by personal beliefs rather than an objective assessment of the firm's strategic predicament. Directors and investors find this perspective enlightening. This awareness can foster support for the firm's activities in AI technology innovation, concentrate on emerging technologies and market opportunities and augment its strategic trajectory by enhancing the firm's orientation toward technological innovation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34c00ae3b7b4f1353c5b140fb11861c6",
  "timestamp": "2025-05-15T03:11:04.563751"
}