{
  "id": 3856,
  "title": "What Factors Are Associated with Increased Financial Burden and High Financial Worry For Patients Undergoing Common Hand Procedures?",
  "abstract": "Background Few studies have examined whether orthopaedic surgery, including hand surgery, is associated with patients' financial health. We sought to understand the level of financial burden and worry for patients undergoing two common hand procedures-carpal tunnel release and open reduction and internal fixation for a distal radius fracture-as well as to determine factors associated with a higher financial burden and worry. Questions/purposes In patients undergoing operative treatment for isolated carpal tunnel syndrome with carpal tunnel release or open reduction and internal fixation for a distal radius fracture, we used validated financial burden and worry questionnaires to ask: (1) What percentage of patients report some level of financial burden, and what is the median financial burden composite score? (2) What percentage of patients report some level of financial worry, and what percentage of patients report a high level of financial worry? (3) When accounting for other assessed factors, what patient- and condition-related factors are associated with financial burden? (4) When accounting for other assessed factors, what patient- and condition-related factors are associated with high financial worry? Methods In this cross-sectional survey study, a hand and upper extremity database at a single tertiary academic medical center was reviewed for patients 18 years or older undergoing operative treatment in our hand and upper extremity division for an isolated distal radius fracture between October 2017 and October 2019. We then selected all patients undergoing carpal tunnel release during the first half of that time period (given the frequency of carpal tunnel syndrome, a 1-year period was sufficient to ensure comparable patient groups). A total of 645 patients were identified (carpal tunnel release: 60% [384 of 645 patients]; open reduction and internal fixation for a distal radius fracture: 40% [261 of 645 patients). Of the patients who underwent carpal tunnel release, 6% (24 of 384) were excluded because of associated injuries. Of the patients undergoing open reduction and internal fixation for a distal radius fracture, 4% (10 of 261) were excluded because of associated injuries. All remaining 611 patients were approached. Thirty-six percent (223 of 611; carpal tunnel release: 36% [128 of 360]; open reduction and internal fixation: 38% [95 of 251]) of patients ultimately completed two validated financial health surveys: the financial burden composite and financial worry questionnaires. Descriptive statistics were calculated to report the percentage of patients who had some level of financial burden and worry. Further, the median financial burden composite score was determined. The percentage of patients who reported a high level of financial worry was calculated. A forward stepwise regression model approach was used; thus, variables with p values < 0.10 in bivariate analysis were included in the final regression analyses to determine which patient- and condition-related factors were associated with financial burden or high financial worry, accounting for all other measured variables. Results The median financial burden composite score was 0 (range 0 [lowest possible financial burden] to 6 [highest possible financial burden]), and 13% of patients (30 of 223) reported a high level of financial worry. After controlling for potentially confounding variables like age, insurance type, and self-reported race, the number of dependents (regression coefficient 0.15 [95% CI 0.008 to 0.29]; p = 0. 04) was associated with higher levels of financial burden, while retired employment status (regression coefficient -1.24 [95% CI -1.88 to -0.60]; p < 0.001) was associated with lower levels of financial burden. In addition, the number of dependents (odds ratio 1.77 [95% CI 1.21 to 2.61]; p = 0.004) and unable to work or disabled employment status (OR 3.76 [95% CI 1.25 to 11.28]; p = 0.02) were associated with increased odds of high financial worry. Conclusion A notable number of patients undergoing operative hand care for two common conditions reported some degree of financial burden and worry. Patients at higher risk of financial burden and/or worry may benefit from increased resources during their hand care journey, including social work consultation and financial counselors. This is especially true given the association between number of dependents and work status on financial burden and high financial worry. However, future research is needed to determine the return on investment of this resource utilization on patient clinical outcomes, overall quality of life, and well-being.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34cd0a0c778d0abefe16ac0e0780d261",
  "timestamp": "2025-05-15T02:30:28.798277"
}