{
  "id": 8959,
  "title": "Epidemiology of non-deferrable medical conditions in primary care in Italy",
  "abstract": "Non-deferrable medical conditions (NDMC) are clinical entities other than exacerbations of chronic diseases which are too frequently managed by emergency departments. The primary care setting would be indeed the ideal environment to proficiently treat them. Few studies have investigated the epidemiology of NDMC in primary care, especially in Italy. With the aim to better identify NDMC sufferers, we assessed the accuracy of the NDMC definition by means of four algorithms, featured by different specificities and sensitivities. Four algorithms, based on the hierarchical definition of NDMC, were developed to calculate the incidence rate of NDMC in 2014. Each was tested using a Cox univariate model adjusted for gender, comparing patients aged <45 years old with older patients. Algorithms 1 and 3 gave similar results (408.1 vs. 405.5 per 1,000 person-years); Algorithms 2 and 4 reported sensibly lower rates (84.7 and 84.0 per 1,000 person-years). Incidence rate of NDMC for female patients was higher than in males and for older age group (i.e. 75-84 age group) than younger patients, for both gender groups. Regarding the regression model, a higher risk of NDMC was estimated in patients aged 45 years or more and in females. This study allowed us to assess the incidence rate of NDMC in Italy which was unexpectedly higher among older patients. Given the crucial role of general practitioners (GPs) in the diagnosis and management of these conditions, as well as the healthcare system reforms imposed by the ongoing financial crisis, our findings may contribute to informing the capacity and strategic workload planning in group of GPs to improve service quality and profitably to reduce the excessive use of emergency departments.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34cf11670e0bb5c471feaa0c04461ded",
  "timestamp": "2025-05-15T03:23:56.186722"
}