{
  "id": 4020,
  "title": "Validation of the Prognostic Usefulness of the Gene Expression Profiling Test in Patients with Uveal Melanoma",
  "abstract": "Purpose: To validate the prognostic usefulness of gene expression profile (GEP) testing in patients with uveal melanoma. To determine whether combining tumor size with the GEP classification provides additional prog-nostic value. Design: Retrospective analysis. Participants: Patients with a diagnosis of choroidal melanoma examined at Yale New Haven Hospital; University of California, San Diego; and Memorial Sloan Kettering Cancer Center. Methods: Patients' demographic and clinical data and tumor characteristics were collected. Univariate and multivariate Cox hazard regression analysis were used to assess the association between tumor characteristics and GEP classification with metastasis as an outcome. Main Outcome Measures: Metastasis-free survival (MFS). Results: Of the 337 individuals included in the study, 87 demonstrated metastases. The mean follow-up time was 37.2 (standard deviation [SD], 40.2) months for patients with metastases and 55.0 (SD, 49.3) months for those without metastases. Tumors of larger thickness and GEP class 2 (vs. class 1) were associated significantly with increased risk of metastasis. Tumor thickness showed better prognostic usefulness than GEP classification (Wald statistic, 40.7 and 24.2, respectively). Class 2 tumors with a thickness of 7.0 mm or more were associated with increased risk of metastasis than tumors with a thickness of < 7.0 mm (hazard ratio [HR], 3.23; 95% con-fidence interval [CI], 1.61-6.51), whereas class 1 tumors with a thickness of 9.0 mm or more were associated with increased risk of metastasis than tumors with a thickness of < 9.0 mm (HR, 2.07; 95% CI, 0.86-4.99). No dif-ference in MFS was found between patients with class 1A tumors compared with those with class 1B tumors (P 1/4 0.8). Patients with class 2 tumors showed an observed 5-year MFS of 47.5% (95% CI, 36.0%-62.8%). Conclusions: Tumor size was the most significant predictor of metastasis and provided additional prog-nostic value independent of GEP classification. In addition, rates of metastasis for class 2 tumors were lower than estimates reported by Castle Bioscience, and no difference in rates of metastasis were found between class 1A and 1B tumors. This indicates that tumor size should be accounted for when relying on GEP for prognostication and that patients with GEP class 1A or 1B tumors may benefit from the same metastatic surveillance protocols. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2023;130:598-607 (c) 2023 Published by Elsevier Inc. on behalf of the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34d2c006bd341c8417a3b2bf7d374619",
  "timestamp": "2025-05-15T02:32:27.435385"
}