{
  "id": 6589,
  "title": "Association Between Hospital Financial Distress and Immediate Breast Reconstruction Surgery After Mastectomy Among Women With Ductal Carcinoma In Situ",
  "abstract": "IMPORTANCE Hospital financial distress (HFD) is a state in which a hospital is at risk of closure because of its financial condition. Hospital financial distress may reduce the services a hospital can offer, particularly unprofitable ones. Few studies have assessed the association of HFD with quality of care.& para;& para;OBJECTIVE To examine the association between HFD and receipt of immediate breast reconstruction surgery after mastectomy among women diagnosed with ductal carcinoma in situ (DCIS).& para;& para;DESIGN, SETTING, AND PARTICIPANTS This retrospective cohort study assessed data from the Nationwide Inpatient Sample of 5760 women older than 18 years (mean [SD) age: 57.5 [13.2]) with DCIS who underwent mastectomy in 2008-2012 at hospitals categorized by financial distress. Women treated at 1156 hospitals located in 538 different counties across Arkansas, Arizona, California, Colorado, Connecticut, Florida, Iowa, Kentucky, Massachusetts, Maryland, Missouri, North Carolina, New Hampshire, New Jersey, Nevada, New York, Oregon, Pennsylvania, Rhode Island, Utah, Virginia, Vermont, Washington, Wisconsin, West Virginia, and Wyoming were included. Of these, 2385 women (41.4%) underwent immediate breast reconstruction surgery. Women with invasive cancer were excluded. The database included unique hospital identification variables, and participants were identified using International Classification of Diseases, Ninth Revision, Clinical Modification codes. Data were analyzed from January 1, 2012, to February 28, 2014.& para;& para;MAIN OUTCOMES AND MEASURES The primary outcome was the adjusted association between HFD and receipt of immediate breast reconstruction surgery after mastectomy.& para;& para;RESULTS In this analysis of database information, 2385 of 5760 women (41.4%) received immediate breast reconstruction surgery. Of these, 693 (36.7%) were treated at a hospital under high HFD and received immediate breast reconstruction surgery compared with 863 (44.0%) treated at a hospital under low HFD (P < .001). Reconstruction surgery was associated with younger age, white race, private insurance, treatment at a teaching and cancer hospital, private hospital ownership, and the percentage of individuals in the county with insurance. After adjustment, women treated at hospitals under high HFD (OR, 0.79; 95% CI, 0.62-0.99) and medium HFD (OR, 0.76; 95% CI. 0.61-0.94) were significantly less likely to receive reconstruction than women treated at hospitals with low to no HFD.& para;& para;CONCLUSIONS AND RELEVANCE The financial strength of the hospital where a patient receives treatment is associated with receipt of immediate breast reconstruction surgery. In addition to focusing on patient-related factors, efforts to improve quality should also focus on hospital-related factors.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34e27658558fcdf80cdde289a0e96793",
  "timestamp": "2025-05-15T02:59:37.043241"
}