{
  "id": 7136,
  "title": "Current status and associated factors of psychological resilience among the Chinese residents during the coronavirus disease 2019 pandemic",
  "abstract": "Background: Since December 2019, over 4,600 deaths and 84,000 confirmed cases were reported in China because of the coronavirus disease 2019 (COVID-19) pandemic. However, there is a dearth of studies on the psychological resilience in residents. Aims: This study aims to measure the psychological resilience of Chinese residents to reflect their psychological status as well as influencing factors during the pandemic. Method: We conducted a combination of stratified sampling and snowball sampling to select survey subjects. We employed the psychological resilience and influencing factor questionnaire based on the 10-item Connor and Davidson Resilience Scale (CD-RISC10) for survey. We collected data from 3,398 residents in China between 31 January and 29 February 2020. Multivariable linear stepwise regression analysis was used to determine factors associated with psychological resilience in residents. Results: The mean score of psychological resilience among Chinese residents was 27.11 +/- 8.45 (SD = 7.98). There were some factors significantly associated with psychological status among the Chinese residents during the COVID-19 outbreak. Residents with lower financial status, living in rural areas, unmarried, lacking fixed employment or retirement guarantees, and lacking knowledge of policies were more likely to report a lower level of psychological resilience. Conclusion: Health service policy makers in many countries should adopt relevant measures to improve the psychological resilience of residents during the pandemic. This includes short-term aggressive treatment, strengthening health education, and improving the awareness of residents with respect to emergency health policies. In addition, the financial status, health levels, and risk management capabilities of residents should be increased over the long term.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "34efa02dc4694ff6146d04f2179927c3",
  "timestamp": "2025-05-15T03:05:32.052212"
}