{
  "id": 2257,
  "title": "Initial preference algorithm of industrial project portfolio",
  "abstract": "Purpose This paper aims to develop an algorithm to pretest an industrial portfolio on a new scale. Portfolios include complex and uncertain projects at the front-end phase. The study, therefore, proposes a procedure that helps decision-makers to handle various complex projects and defines a common scale applicable to various kinds of industrial projects. Design/methodology/approach Decision-makers can employ the preference algorithm to reach a common understanding. To this end, the current paper posits the organization of criteria in various project sets. A sexagesimal scale is developed based on project complexity and its ability to achieve broad impact, both these factors being gauged on a five-point scale of user-friendly numberings. Findings The proposed algorithm shows the equivalence of industrial projects in different fields. Also, the algorithm articulates the status in terms of uncertainty, complexity, risk, and value of projects. The connections between decision-makers and criteria operate on the basis of the foreseen complexity, risk, and value. It can be said that this study exemplifies and visualizes the portfolio and criteria relationship. Research limitations/implications The procedure covers contingency exercises at the front-end phase of a portfolio and supports decisions. However, updated information can change support positions. Originality/value The paper presents original scoring guidance for portfolio complexity on a new scale. The scaling and scoring are adjustable and calibrated using the proposed sexagesimal system. It presents an original classification of project risk and value. The main contribution is the presented algorithm which can be used to pretest industrial portfolios composed of projects that vary in both size and context.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3501333830a1b2a08458bf43646411f8",
  "timestamp": "2025-05-15T01:05:04.447513"
}