{
  "id": 9455,
  "title": "Do the different expressions of an artist offer the same financial performance over time? The case of Fernando Botero",
  "abstract": "PurposeArt return indices are usually estimated based only on a few means of artistic expression (mainly paintings and drawings). Other forms of expression (e.g. sculptures and installations) are generally ignored, in part because they are three-dimensional and, hence, more difficult to measure. We analyze the price determinants as well as the return and risk of three artistic expressions (paintings, drawings and sculptures) executed by Fernando Botero, the most expensive living Latin American artist, to analyze the degree to which their risk and return attributes differ throughout a 20-year period.Design/methodology/approachWe analyzed all paintings, drawings and sculptures executed by Botero and sold at Sotheby's and Christie's between 2000 and 2020 (a total of 707 artworks). The data and the images of each artwork were obtained from the web pages of these two auction houses. A hedonic regression was run to explain the price of each artwork and use explanatory variables that are standard in the literature. Art price indices for paintings, drawings and sculptures were constructed using the year-dummy variables estimated in the regressions. We performed a similar analysis for another artist, Carlos Cruz-Diez, as a robustness to our results.FindingsThe performance of Botero's sculptures through time differs markedly from that of his paintings and drawings. Our results suggest that it is possible that returns estimated in the literature could suffer from a bias, as they have usually ignored the performance of sculptures and other artistic expressions. Botero's paintings provided a return that was comparable to those of his sculptures (3.36% and 3.20%, respectively), they were two times as high as those of his drawings (1.68%). On the other hand, whereas paintings and drawings had similar annual standard deviations (26% and 25.22%, respectively), sculptures had a much smaller standard deviation (16.96%).Research limitations/implicationsA limitation of the hedonic regression method lies in the need to have a significant and diverse sample to identify the true effect of each variable on the price of a good. Another limitation is that we were only able to use art prices from auctions, as this is the only comprehensive source of art price data that is publicly available. These two limitations are shared by all the studies that use the hedonic pricing model.Practical implicationsOur results have practical applications for art collectors and investors, as well as for artists, galleries and, in general, for the whole art market ecosystem. The risk and return attributes of the various artistic expressions of an artist can be different, and thus it makes sense to analyze each one of them individually, as well as their correlations with the other artistic expressions and with traditional and other alternative investments.Social implicationsThe art market is part of what is known as the orange economy (also known as the Creative Economy). According to the World Bank, the economic value of the creative sector is not well known or appreciated, even though cultural, creative and artistic activities are vital for our sense of well-being.Originality/valueTo the best of our knowledge, this is the first paper that compares the financial performance of paintings, drawings and sculptures for the case of a specific artist. We chose Botero for three reasons. First, he is a Latin American living artist who has achieved the highest levels of international sales. Second, Botero has worked extensively on various artistic expressions (oil paintings, drawings on different materials and sculptures) throughout his life, a characteristic that is essential to be able to carry out our study. Third, there is a long record of auction sales for each of Botero's artistic expressions. Propó sitoLos í ndices de rentabilidad del arte generalmente se estiman basá ndose ú nicamente en unos pocos medios de expresió n artí stica (principalmente pinturas y dibujos). Otras formas de expresió n artí stica (por ejemplo, esculturas e instalaciones) generalmente se ignoran, en parte porque son tridimensionales y, por tanto, má s difí ciles de medir. Analizamos los determinantes del precio, así como el retorno y el riesgo de tres expresiones artí sticas (pinturas, dibujos y esculturas) ejecutadas por Fernando Botero, el artista latinoamericano vivo má s caro, para analizar en qué medida sus atributos de riesgo y retorno difieren a lo largo del tiempo, en un perí odo de 20 añ os.Diseñ o/metodologí a/enfoqueAnalizamos todas las pinturas, dibujos y esculturas ejecutadas por Botero y vendidas en Sotheby's y Christie's entre 2000 y 2020 (un total de 707 obras de arte). Los datos y las imá genes de cada obra se obtuvieron de las pá ginas web de estas dos casas de subastas. Se realizó una regresió n hedonante para explicar el precio de cada obra de arte y se utilizaron variables explicativas está ndar en la literatura. Los í ndices de precios de arte para pinturas, dibujos y esculturas se construyeron utilizando variables ficticias anuales estimadas en las regresiones. Realizamos un aná lisis similar para otro artista, Carlos Cruz-Diez, como aná lisis de robustez de nuestros resultados.HallazgosEl desempeñ o de las esculturas de Botero a travé s del tiempo difiere marcadamente del de sus pinturas y dibujos. Nuestros resultados sugieren que es posible que los retornos estimados en la literatura sufran un sesgo, ya que generalmente han ignorado el desempeñ o de esculturas y otras expresiones artí sticas. Las pinturas de Botero proporcionaron un retorno comparable al de sus esculturas (3.36% y 3.20%, respectivamente), pero fueron dos veces superiores a los de sus dibujos (1.68%). Por otro lado, mientras que las pinturas y los dibujos tuvieron desviaciones está ndar anuales similares (26% y 25.22%, respectivamente), las esculturas tuvieron una desviació n está ndar mucho menor (16.96%).Limitaciones/implicacionesUna limitació n del mé todo de regresió n hedó nica radica en la necesidad de contar con una muestra significativa y diversa para identificar el verdadero efecto de cada variable sobre el precio de un bien. Otra limitació n consiste en que solo pudimos utilizar precios de arte de subastas, ya que esta es la ú nica fuente completa de datos sobre precios de arte que está disponible pú blicamente. Estas dos limitaciones son compartidas por todos los estudios que utilizan el modelo de precios hedó nico.Implicaciones prá cticasNuestros resultados tienen aplicaciones prá cticas para coleccionistas e inversores de arte, así como tambié n para artistas, galerí as y, en general, para todo el ecosistema del mercado del arte. Los atributos de riesgo y retorno de las diversas expresiones de un artista pueden ser diferentes, por lo que tiene sentido analizar cada una de ellas individualmente, así como sus correlaciones con las otras expresiones artí sticas y con las inversiones tradicionales y otras alternativas. Implicaciones socialesEl mercado del arte forma parte de lo que se conoce como economí a naranja (tambié n conocida como Economí a Creativa). Segú n el Banco Mundial, el valor econó mico del sector creativo no es bien conocido ni apreciado, a pesar de que las actividades culturales, creativas y artí sticas son vitales para nuestra sensació n de bienestar.Originalidad/valorHasta donde hemos podido comprobar, este es el primer artí culo que compara el desempeñ o financiero de pinturas, dibujos y esculturas para el caso de un artista especí fico. Elegimos a Botero por tres razones. En primer lugar, es el artista vivo latinoamericano que ha alcanzado los mayores niveles de ventas internacionales. En segundo lugar, Botero ha trabajado extensamente en diversas expresiones artí sticas (ó leos, dibujos sobre distintos materiales y esculturas) a lo largo de su vida, caracterí stica que resulta fundamental para poder realizar nuestro estudio. En tercer lugar, existe un largo historial de ventas en subasta de cada una de las expresiones artí sticas de Botero.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35051712222e49efba7bffd30f38c68a",
  "timestamp": "2025-05-15T03:28:46.393705"
}