{
  "id": 5685,
  "title": "Unveiling time-varying asymmetries in the stock market returns through energy prices, green innovation, and market risk factors: wavelet-based evidence from China",
  "abstract": "The study explores the nexus between crude oil prices (COP), financial risk index (FRI), political risk index (PRI), green innovation (GIN) and information globalization index (ING) for Shanghai stock exchange (SSE) in China from 1997/M9 to 2021/M12 by utilizes novel wavelet methodologies to handle co-movement dynamics of multivariate time series via moving weighted regression also wavelet-based causality employed to identify the causality. The finding of Wavelet regression indicates the highest multiple correlation from a linear combination of the and ING at each scale, which indicates these variables are impacted by the stock market index. While FRI relates investor confidence declining stock prices may be detrimental to the SSE. However, any changes in PRI government rules or regulations could influence SSE-listed enterprises. GIN develops and employs eco-friendly technologies and procedures. As global awareness of sustainability grows, pioneering green entrepreneurs may attract investors and increase corporate valuations. Investors may find green innovation-driven companies less enticing, resulting in lower stock prices. Yet, ING may propose improved access to global markets and information, hence increasing the value of SSE's shares. According to the findings of wavelet-based Granger Causality, COP, FRI, GIN, ING, PRI, and SSE show significant causal interconnections at several scales. The study offers policy insights based on these findings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "350792c3e90f1630dedf35094df3ddb2",
  "timestamp": "2025-05-15T02:50:21.232518"
}