{
  "id": 5095,
  "title": "Family Studies for Classification of Variants of Uncertain Classification: Current Laboratory Clinical Practice and a New Web-Based Educational Tool",
  "abstract": "Multi-gene cancer panels often identify variants of uncertain clinical significance (VUS) that pose a challenge to health care providers in managing a patient's cancer risk. Family segregation analysis can yield powerful data to re-classify a VUS (as either benign or pathogenic). However, financial and personnel resources to coordinate these studies are limited. In an informal assessment we found that family studies for variant classification are done by most clinical genetics laboratories that offer hereditary cancer panel testing. The process for family studies differs substantially across laboratories. One near universal limitation is that families usually have too few individuals for an informative co-segregation analysis. A unique and potential resource-saving approach is to engage patients and their families in expanding their own pedigrees for segregation analysis of their VUS. We describe a novel public educational tool (FindMyVariant.org) designed to inform patients and genetic counselors about strategies to improve the probability of variant classification using familial segregation. While the web tool is designed to be useful for any gene, the project was primarily focused on VUS's returned in cancer risk genes. FindMyVariant.org is a resource for genetic providers to offer motivated families who are willing to gather information about their family relationships and history. Working alongside clinical or research genetic laboratories, the information they collect may help reclassify their VUS using segregation analysis.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "350e8c5ac982bcfdbe069659bbf6ebb6",
  "timestamp": "2025-05-15T02:44:11.046644"
}