{
  "id": 4034,
  "title": "INTRADAY RETURN OF WINNERS VS LOSERS: INDONESIAN CAPITAL MARKET EVIDENCE",
  "abstract": "The aim of this study is to determine intraday returns in the Indonesian capital market, using sample of 177 listed Indonesian companies from 2021-2022. This study adopts a multiple linear regression analysis, where the return of the last half hour as an endogenous variable consists of winners and losers, the return of the first half hour of trading, the volume of the first half hour, overnight returns, and the USA index futures as an exogenous variable. The originality of this research aims to demonstrate empirical evidence on intraday returns by distinguishing winner & loser stocks and the relationship between the intraday returns of winners and losers with volume, overnight, and US index futures in the emerging market (Indonesia). We find that the first half hour of trading can impact future return. The return of the first thirty minutes is significantly positive on the return of the last thirty minutes for both winner and loser stocks. Further, the volume of the first half hour and the overnight return both positively influences on the last half hour return of the day for loser stocks. This study can offer valuable insights for investment portfolio strategies, especially regarding intraday returns. The findings of this research prove to be a valuable resource for investors when devising investment strategies in the stock market. Additionally, it provides guidance for regulators in establishing rules for stock trading, particularly in transactions involving trading robots.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "351de036bfe96f14e345cca40d1dbe11",
  "timestamp": "2025-05-15T01:23:07.414720"
}