{
  "id": 3828,
  "title": "A person-centered approach to financial capacity: early memory loss, financial management and decision-making",
  "abstract": "ObjectivesPrevious research has noted that a person-centered approach to financial capacity assessment is feasible. This study of personal finance included a review of 12 months of checking account statements followed by research interviews to investigate income, spending, financial literacy, and financial decision-making. The objective of the study was to determine the convergent validity of excess spending to contextual aspects of financial decision-making, financial literacy, and early memory loss.MethodParticipants were 114 adults over the age of 60 who came primarily from two research registries; the Healthier Black Elders registry and the Michigan Alzheimer's Disease Research Center registry. After sharing their checking statements participants completed two telephone interviews. Bivariate and multivariate analyses were used to compare those with no memory loss to the memory loss group, and to determine which measures were significantly related to excess spending.ResultsThere was a significant difference in excess spending between those with early memory loss and those with no memory loss. There was a significant difference in financial decision-making risk scores between the groups, as well as on a memory measure and a financial literacy measure. In a hierarchical regression analysis financial decision-making was the only measure significantly related to excess spending.ConclusionThis study documented the convergent validity of person-centered measures of personal spending and financial decision-making with early memory loss. Early memory loss was related to both excess spending and contextual aspects of financial decision-making.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3533121ce79f336fcf5153c17dafdd57",
  "timestamp": "2025-05-15T02:30:28.659469"
}