{
  "id": 176,
  "title": "Earthquake vulnerability assessment for the Indian subcontinent using the Long Short-Term Memory model (LSTM)",
  "abstract": "Earthquakes are one of the most destructive and unpredictable natural hazards with a long-term physical, psychological, and economic impact to the society. In the past century, more than 1100 destructive earthquakes occurred, and caused around 1.5 million deaths worldwide. Some recent studies have suggested that a future earthquake in the Himalayan region of magnitude range MW 7.5-8 can cause more than 0.2 million human lives and around 150 billion dollar financial loss. Deep learning methods in recent studies proved very useful in natural hazards forecasting and prediction modelling. Long Short-Term Memory (LSTM) model has been particularly popular in several natural hazard forecasting. In this research, for the first time, LSTM model is implemented with suitable Geospatial Information Systems (GIS) techniques to assess the earthquake vulnerability for whole of India. In India, most of the seismic vulnerability assessment available are at city level or state level using traditional techniques. Several factors such as land use, geology, geomorphology, fault distribution, transportation facility, population density were all used to develop the social, structural, and geotechnical vulnerability maps. The results show that the areas around Delhi, NE region of India, major parts of Gujrat, West Bengal plain exhibit high to very-high seismic vulnerability. This model achieved an accuracy of 87.8%, sensitivity (90%) and specificity (84.9%). The present analysis can be helpful towards prioritization of regions which are in higher need of risk reduction interventions. Also, based on this vulnerability index map, the risk metrics can be attenuated.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "353e8bd5980e31c08c74ec8f93e6f104",
  "timestamp": "2025-05-15T01:35:04.375125"
}