{
  "id": 1361,
  "title": "Investigation of the Factors Affecting Teachers' Attitudes towards E-Portfolio Using Data Mining Methods",
  "abstract": "This current study aims to determine the factors affecting teachers' attitudes towards e-portfolios by using data mining methods such as the Classification and Regression Tree (CART) algorithm and Random Forest (RF) algorithm. The study group consists of 449 participants willing to participate on a volunteer basis. In the study, the data were collected using the Scale of Attitude towards E-Portfolio, the Reflective Thinking Tendency Scale, and the Scale of Attitude towards Technology. The survey research design, one of the quantitative research approaches, was used in the study. The collected data were analyzed by using the CART and RF analysis methods, two of the data mining methods. It was concluded with the CART method that the variable with the highest predictor importance in predicting the level of (low-high) attitude towards electronic portfolio is the variable of attitude towards technology, while the variable of how teachers see themselves in using technology is with the lowest predictor importance. It was concluded that with the RF model the variable with the highest predictor importance in predicting the level of attitude (low-high) towards electronic portfolio is the variable of attitude towards technology, followed by the variable of reflective thinking tendency, while the variable with the lowest predictor importance is the variable of the type of the graduated university (state- foundation). The results show that the RF method better determines the predictor variables.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3544e9547ca15c26d4a969c8104b194d",
  "timestamp": "2025-05-15T00:54:56.424027"
}