{
  "id": 6296,
  "title": "Stress Testing of Credit Risk Lithuania Banks under Simulated Economical Crisis Environment Conditions",
  "abstract": "The quality of bank loan portfolios and the incurred credit risk loss is determined by the development of the economy of the country as well as the financial state of the debtors. With loans accounting for the largest share of the assets of Lithuanian banks, the credit risk is the main individual source of risk. With the current recession of the world economy and the respective situation in Lithuania, when the economy of the country started to recede at the end of 2008, it is obvious that in the future the processes of development of economy of Lithuania will surely be a major influence on the credit risk and results of activities of the bank system of the country, therefore evaluation of this effect under current conditions becomes critical. The importance of research of the influence of macroeconomic processes on the sorts of risks incurred by the bank sector is also proved by the abundance of theoretical research. Testing of the credit risk of the Lithuanian bank sector upon change of risk factors is carried out combining the models used in research performed by M Sorge (2004), M A. Segoviano Basurto, P. Padilla (2007) and other scientists. The research covers five phases: the first phase - modeling of macroeconomic scenarios performing an analysis of the current macroeconomic situation of the country, analyzing expert evaluations and establishing the main risk factors. During the second phase indicators describing the quality of bank loan portfolio are evaluated performing an evaluation of the current quality of loan portfolio and calculating the probability of default according to loan sectors. The third phase covers the establishment of macroeconomic indicators influencing the change of the probability of default and the net profit of banks by selecting macroeconomic indicators that can influence the change of the probability of default according to loan sectors and the net profit of banks, by eliminating the seasonal fluctuations of the selected indicators, by evaluating correlation between macroeconomic indicators and the probability of default as well as the net profit, by defining the parameters of explanatory macroeconomic variables, by employing the model of linear regression and verifying reliability. The fourth phase is the research of the influence of macroeconomic scenarios on the credit risk of the bank sector by providing a prognosis of explanatory macroeconomic variables under the formulated macroeconomic scenarios and evaluating the influence of the macroeconomic scenarios on the probability of default according to loan sectors and the net profit of banks. The research is completed with a prognosis of the reserves accumulated by banks for covering the probable losses on the basis of different scenarios: scenario 1- expensive loans, i.e. the rate of interest for loans in litas remains very high, scenario 2 dropping real estate prices. Evaluation of the credit risk of the bank sector combining the models created by M Sorge (2004) & M A. Segoviano Basurto, P. Padilla (2007) helps to raise the most relevant questions of the macroeconomic state for the current period, and the integration of the analysis of the indicators of financial stability into the critical testing of the bank system and drawing up of macroeconomic prognosis helps to form an efficient future activity strategy for the bank sector or an individual financial institution. The results of the research showed that in case the macroeconomics of the country develops according to scenario 2 the Lithuanian bank system would face deficit of capital for coveringthe probable losses, therefore the banks of the country should accumulate more capital in order to be able to avoid such risk in the future.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "355e07c0b8c77de5cdae6d9590dcace2",
  "timestamp": "2025-05-15T02:56:37.504783"
}