{
  "id": 4181,
  "title": "Length The GCC's regional roller coaster: Do regional factors affect stock market dynamics in the GCC Region? Evidence from non-parametric quantile regression",
  "abstract": "This paper investigates the impact of regional factors on Islamic and conventional stock returns in the member countries of the Gulf Cooperation Council (GCC) from April 2011 to April 2021. This paper employs the quantile regression method to determine the effect of regional factors on GCC markets during different market states, enabling a more detailed investigation of the structure and degree of dependence. Regional stock market returns and regional political risk are used to study the effect of regional factors. The findings of this study reveal that the reaction of market returns to regional factors is heterogeneous across the conditional distribution of the GCC's stock returns. More specifically, the results demonstrate that changes in regional factors, with respect to Islamic and conventional markets, have asymmetric effects on stock returns in the majority of the GCC markets. Except in Qatar, the regional geopolitical risk negatively affects the GCC's Islamic stock returns during bearish markets. Results for conventional stock returns have the same negative effect, yet only in extreme market states. As for the impact of the regional stock market, we find that the regional Islamic index has a positive impact across almost all quantiles with a stronger effect during bullish markets, except in Bahrain and Oman. As for conventional markets, we observe the same impact throughout the GCC except for in Saudi Arabia. Islamic and conventional markets' responses to changes in regional factors have similar behavior. Therefore, we conclude that, despite fundamental differences, Islamic and conventional stock markets in the GCC perform comparably, implying that a potential portfolio diversification benefit is not achieved except in limited cases.Copyright & COPY; 2022 Borsa Istanbul Anonim S,irketi. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "356ed4d150115ea9e88239a35a0ef225",
  "timestamp": "2025-05-15T01:24:25.463858"
}