{
  "id": 2876,
  "title": "Behaviour does not fully explain the high risk of chronic liver disease in less educated men in Hungary",
  "abstract": "Background: Hungary has among the highest mortality rates from chronic liver disease (CLD) and cirrhosis in Europe. Usually, conventional behavioural factors are hypothesized as the cause of the high risk of CLD. Methods: A case-control study was performed with 287 cases and 892 controls to study the relationship between socio-economic and behavioural factors and the risk of CLD. Liver disease was verified by physical examination and blood tests. Blood samples were collected for detecting hepatitis B, C and E virus infection. Information on exposure factors was recorded by the participating physicians and by self-administered questionnaire. Simple regression analysis was used to study the relationship between CLD/cirrhosis and potential risk factors as alcohol intake (amount and source), problem drinking, cigarette smoking, physical activity, viral hepatitis infections, socio-economic factors (education, financial and marital status). Multiple regression analysis was used to identify whether the effect of socio-economic factors is fully mediated by health behaviour (smoking, alcohol consumption, physical activity). Results: The univariate analysis showed that heavy alcohol consumption, problem drinking, former and heavy cigarette smoking, single, separated or divorced marital status, bad or very bad perceived financial status and lower education significantly increased the risk of CLD/cirrhosis. The effect of marital status and of education did not change after adjustment for behavioural factors, but the effect of perceived financial status disappeared. Conclusions: The effect of low socio-economic status on the risk of CLD/cirrhosis is only partially explained by conventional behavioural risk factors in Hungary.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35725ac0be3ae9009cb5886b65c262d4",
  "timestamp": "2025-05-15T02:20:16.837594"
}