{
  "id": 2250,
  "title": "Clustering sustainable suppliers in the plastics industry: A fuzzy equivalence relation approach",
  "abstract": "Nowadays, pure economic supply chain management is not commonly contemplated among companies (especially buyers), as recently novel dimensions of supply chains, e.g., environmental, sustainability, and risk, play significant roles. In addition, since companies prefer buying their needs from a group of suppliers, the problem of supplier selection is not solely choosing or qualifying a supplier from among others. Buyers, hence, commonly assemble a portfolio of suppliers by looking at the multi-dimensional pre-determined selection criteria. Since sustainable supplier selection criteria are often assessed by linguistic terms, an appropriate clustering approach is required. This paper presents an innovative way to implement fuzzy equivalence relation to clustering sustainable suppliers through developing a comprehensive taxonomy of sustainable supplier selection criteria, including supply chain risk. Fifteen experts participated in this study to evaluate 20 suppliers and cluster them in the plastics industry. Findings reveal that the best partitioning occurs when the suppliers are divided into two clusters, with 4 (20%) and 16 (80%) suppliers, respectively. The four suppliers in cluster one are performing better in terms of the capability of supplier/delivery, service, risk, and sustainability criteria such as environment protection/management, and green innovation. These factors are critical in clustering and selecting sustainable suppliers. The originality of this study lies in developing an all-inclusive set of criteria for clustering sustainable suppliers and adding risk factors to the conventional supplier selection criteria. In addition to partitioning the suppliers and determining the best-performing ones, this study also highlights the most influential factors by analysing the suppliers in the best cluster.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "357b66cc69051be431845cc1e95b57bd",
  "timestamp": "2025-05-15T01:05:04.402027"
}