{
  "id": 3138,
  "title": "Green banks, golden returns? Unraveling the ESG-Financial performance nexus in European banking",
  "abstract": "PurposeThis paper aims to examine the link between environmental policies and financial markets, with a particular focus on the banking sector. The assessment of banks is based on their environmental impact, social responsibility and governance practices.Design/methodology/approachA panel data regression model is used to examine the link between ROE and systematic risk, on the one hand, and European banking institutions' ESG scores and its environmental, social and governance (ESG) pillar scores, as well as other financial indicators, on the other hand. The timeframe of the research is 10 years and includes 61 European banks, thus providing an extensive review of existing literature and empirical analysis to reveal the complex link between environmental policies, ESG performance and financial performance in the banking sector.FindingsBetter ESG performance is associated with lower ROE but also lower systematic risk for European banks. An improved environmental and social performance leads to higher ROE and lower beta coefficients. However, higher governance scores depress ROE.Originality/valueThe paper aims to contribute to the existing literature by showcasing a complex link between ESG practices and financial performance, focusing extensively on the banking sector. This research analyses how ESG initiatives, when implemented within banks, influence key financial metrics such as profitability, risk management and long-term sustainability. It also examines the unique challenges and opportunities that banks face in aligning ESG goals with financial objectives. Through this thorough analysis of the banking sector, the study adds depth to the current discourse on the broader impact of ESG practices on the financial performance of companies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "357e54db7d668eb4680953cb58ca7ce0",
  "timestamp": "2025-05-15T02:22:56.744250"
}