{
  "id": 8234,
  "title": "Procyclicality in Basel III in the Visegrad Countries",
  "abstract": "The term procyclicality refers to the ability of a system to amplify, business cycles. The recent financial crisis has revealed that the current bank regulatory framework Basel II affects the business cycle in exactly that manner. As a result, the newly published Basel III has introduced tools that should mitigate the procyclical nature of regulatory framework As the Basel III framework was published in December 2010, there are few studies analyzing its effect on procyclicality. The aim of the paper is to analyze whether the new tools are effective and whether the procyclicality under Basel III has been mitigated compared to Basel II. We employ a regression model with households and firm sector in order to conduct such analysis. Using the OLS estimation method we estimate the sensitivity of Basel risk weights to the business cycle under both Basel II and Basel III conditions. The main contribution of this paper consists of implementation of Basel III countercyclical tools and of comparison between both frameworks. The paper further contributes to the existing literature by conducting the analysis on the data for the Visegrcid Group (the Czech Republic, Slovakia, Hungary and Poland). When applying a standard regulatory formula, we show that results for Hungary differ greatly from the rest of the region as this country has shown a completely different pattern in the input data. This conclusion that regulatory rules cannot be applied generally for all countries should be appealing for both regulators and bankers.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3586d35e56151b519be49f939960fae6",
  "timestamp": "2025-05-15T03:16:48.943122"
}