{
  "id": 2382,
  "title": "A Deep Reinforcement Learning-Based Adaptive Large Neighborhood Search for Capacitated Electric Vehicle Routing Problems",
  "abstract": "The Capacitated Electric Vehicle Routing Problem (CEVRP) poses a novel challenge within the field of vehicle routing optimization, as it requires consideration of both customer service requirements and electric vehicle recharging schedules. In addressing the CEVRP, Adaptive Large Neighborhood Search (ALNS) has garnered widespread acclaim due to its remarkable adaptability and versatility. However, the original ALNS, using a weight-based scoring method, relies solely on the past performances of operators to determine their weights, thereby failing to capture crucial information about the ongoing search process. Moreover, it often employs a fixed single charging strategy for the CEVRP, neglecting the potential impact of alternative charging strategies on solution improvement. Therefore, this study treats the selection of operators as a Markov Decision Process and introduces a novel approach based on Deep Reinforcement Learning (DRL) for operator selection. This approach enables adaptive selection of both destroy and repair operators, alongside charging strategies, based on the current state of the search process. More specifically, a state extraction method is devised to extract features not only from the problem itself but also from the solutions generated during the iterative process. Additionally, a novel reward function is designed to guide the DRL network in selecting an appropriate operator portfolio for the CEVRP. Experimental results demonstrate that the proposed algorithm excels in instances with fewer than 100 customers, achieving the best values in 7 out of 8 test instances. It also maintains competitive performance in instances with over 100 customers and requires less time compared to population-based methods.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "358f2c4acda4475689a1b21dd891bdc5",
  "timestamp": "2025-05-15T01:06:10.807443"
}