{
  "id": 1656,
  "title": "Assessment and Classification Models of Regional Investment Projects Implemented through concession agreements",
  "abstract": "Imposed wide-ranging sanctions require stricter control over the use of budget funds in or-der to increase the return on investment and minimise the risks of inappropriate spending. Thus, regional development based on the implementation of investment projects with public participation through con-cession agreements becomes particularly important. The article considers the construction of classifica-tion models for the assessment of such projects to identify high-risk concession agreements. State custom-ers can use these models to make informed decisions when choosing a contractor and to improve the ef-ficiency of public property management. For an objective assessment of the integrity of contractors based on financial and other factors, the study used screening models and built-in tools of the SPARK informa-tion and analytical system, as well as the methods of descriptive analysis of big data, machine learning and the nearest neighbours approach for clustering regional investment projects according to the risk of improper execution of concession agreements. The presented approach was tested on 1248 regional in-vestment projects implemented through concession agreements. As a result, the research identified two clusters: projects with low risk (83.8 %) and high risk (16.2 %) of improper performance of obligations by the concessionaire. To assess the models' accuracy and sensitivity to outliers, the confusion matrix and Spearman's coefficient were utilised, which showed a sufficiently high accuracy of the resulting classifica-tion. The constructed models can be used for selecting regional investment projects, as well as for mon-itoring implemented projects in order to identify potential risks of their non-completion and timely take necessary response measures.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35aea993e40fee4b4234777d901d5016",
  "timestamp": "2025-05-15T02:05:42.627288"
}