{
  "id": 6318,
  "title": "Automatic Method for Stock Trading Combining Technical Analysis and the Artificial Bee Colony Algorithm",
  "abstract": "There are many researches on forecasting time series for building trading systems for financial markets. Some of these studies have shown that it is possible to obtain satisfactory results, thereby contradicting the theory of Efficient Markets Hypothesis (EMH) that suggests that prices are randomly generated over time. This paper proposes an intelligent system based on historical closing prices that uses technical analysis, the Artificial Bee Colony Algorithm (ABC), a selection of past values (lags), nearest neighbor classification (k-NN) and its variation, the Adaptative Classification and Nearest Neighbor (A-k-NN). A very important step for time series prediction is the correct selection of the past observations (lags). Our method uses this strategy since it uses the k-NN and A-k-NN to decide on the buy and sell points, combined with the ABC algorithm which is used to search for the best parameter settings of system and a good set of lags. This paper compares the results obtained by the proposed method with the buy and hold strategy and with other work that performed similar experiments with the same trading model and the same stocks. The key measure for performance comparison is the profitability in the analyzed period. The proposed method generates much larger profits compared to the other method and to the buy and hold strategy. Our method outperforms the other methods in thirteen out of the fifteen stocks tested, minimizing the risk of market exposure.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35c1ce2ce02124c0448fa3a8d05385d8",
  "timestamp": "2025-05-15T02:57:07.661239"
}