{
  "id": 3822,
  "title": "Introducing a classification framework to urban waste policy: Analysis of sixteen zero-waste cities in China",
  "abstract": "Chinese cities are experiencing rapid urban development while facing severe challenges of environmental pollution. China's central government has proposed several policies to reduce urban waste. However, little is known about the adoption of these policies. Here, we raise the question how can circular policies be classified, and how can this classification be applied to cities in China that wish become zero-waste cities? We develop a framework to classify urban waste policies according to: (a) the 5R principles (Rethink, Reduce, Reuse, Recycle, and Recover), (b) four types of waste (industrial, agricultural, municipal, and hazardous) and (c) six types of policy instruments (legal, economic, network, communication, innovation and projects). We use this framework to analyze urban waste policies implemented by sixteen zero-waste demonstration projects in China. The present study emphasizes combinations of policy instruments, R strategy and waste type in the implementation of zerowaste policies. We find that the Rethink, Reduce, and Recycle principles have been widely implemented by local authorities in contrast to the principles Reuse and Recover. Local governments address waste management by embracing regulations, innovation instruments, and project arrangements, while network-based, economic, or communicative policy instruments are used less often. Based on the results we suggest that local governments embrace a comprehensive approach to the use of the 5R principles and deploy a diverse portfolio of policy instruments.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35c1ebdc3569061748c80b66ee681ee8",
  "timestamp": "2025-05-15T01:21:08.248480"
}