{
  "id": 8970,
  "title": "Organizational and environmental determinants of hospital EMR adoption: A national study",
  "abstract": "The recent focus on health care quality improvement and cost containment has led some policymakers and practitioners to advocate the adoption of health information technology. One such technology is the Electronic Medical Record (EMR), which is predicted to change and improve health care in the USA. Little is known about factors that influence hospital adoption of this relatively new technology. The purpose of this paper is to determine the national prevalence of EMR adoption in acute care hospitals while examining the organizational and environmental correlates using a Resource Dependence Theoretical Perspective. Significant predictors of hospital EMR use may indicate barriers to use for some hospitals and can be used to guide policy. This study uses a non-experimental cross sectional design to examine hospital EMR use in 2004. A logistic regression approach is used to determine the correlations between hospital EMR use and organizational and environmental characteristics. Hospital EMR use was identified using the HIMSS Analytics data. Organizational and environmental variables were measured using data from the AHA, CMS (financial and case mix) and ARF. Hospital EMR adoption is significantly associated with environmental uncertainty, type of system affiliation, size, and urban-ness. The effects of competition, munificence, ownership, teaching status, public payer mix, and operating margin were not statistically significant. Significant predictors of hospital EMR adoption represent barriers that may prevent certain hospitals from obtaining and using EMRs. These hospitals include those that are smaller, more rural, non-system affiliated, and in areas of low environmental uncertainty. Since EMR adoption may be an organizational survival strategy for hospitals to improve quality and efficiency, hospitals that are at risk of missing the wave of implementation should be offered services and incentives to enable them to implement and maintain EMR systems.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35c24ae9d14c98f9fdefc7cd3fd373c7",
  "timestamp": "2025-05-15T03:24:26.263345"
}