{
  "id": 5008,
  "title": "Ethno-Specific Risk Factors for Adverse Pregnancy Outcomes: Findings from the Born in Bradford Cohort Study",
  "abstract": "Objectives Preterm birth (PTB) and small for gestational age (SGA) are major causes of perinatal mortality and morbidity. Previous studies indicated a range of risk factors associated with these poor outcomes, including maternal psychosocial and economic wellbeing. This paper will explore a range of psycho-social and economic factors in an ethnically diverse population. Methods The UK's Born in Bradford cohort study recruited pregnant women attending a routine antenatal appointment at 26-28 weeks' gestation at the Bradford Royal Infirmary (2007-2010). This analysis includes 9680 women with singleton live births who completed the baseline questionnaire. Data regarding maternal socio-demographic and mental health were recorded. Outcome data were collected prospectively, and analysed using multivariate regression models. The primary outcomes measured were: PTB (< 37 weeks' gestation) and SGA (< 10th customised centile). Results After adjustment for socio-demographic and medical factors, financial strain was associated with a 45 % increase in PTB (OR 1.45: 95 % CI 1.06-1.98). Contrary to expectation, maternal distress in Pakistani women was negatively associated with SGA (OR 0.65: CI 0.48-0.88). Obesity in White British women was protective for PTB (OR 0.67: CI 0.45-0.98). Previously recognized risk factors, such as smoking in pregnancy and hypertension, were confirmed. Conclusions This study confirms known risk factors for PTB and SGA, along with a new variable of interest, financial strain. It also reveals a difference in the risk factors between ethnicities. In order to develop appropriate targeted preventative strategies to improve perinatal outcome in disadvantaged groups, a greater understanding of ethno-specific risk factors is required.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35ccb142e0ba9a52ec61e454b25a8d26",
  "timestamp": "2025-05-15T02:43:06.884459"
}