{
  "id": 8973,
  "title": "The influence of excessive stress on medical students in the Czech Republic - national sample",
  "abstract": "PurposeThe Czech Republic has been dealing with a long-term shortage of doctors, which, according to demographic forecasts, will continue to worsen due to the retirement of stronger generations of doctors in contrast to the gradual aging of the population, which will require more health care over time. The country ' s political set is trying to respond to this shortage and demographic forecasts by gradually increasing financial funding of medical faculties with the aim of increasing the number of graduates of the program in the field of general medicine.MethodsAnonymous questionnaire survey was conducted among students and graduates of general medicine at all eight Czech medical faculties. A total of 3183 respondents participated in the survey. There were 2843 medical students, which represents approximately 28% of all medical students in the Czech Republic. The distribution of respondents within the study years was approximately even and approximately corresponded to the real distribution of students between individual faculties in country, which makes survey a national sample. The statistical processing was performed in the statistical software R. Apart from the basic comparison using percentage relative frequencies and Pearson ' s chi-squared test, in this study we used Odds ratios (OR) with CI 0,95 from logistic regression model for a better interpretation of some outputs.ResultsThe results show that the vast majority of Czech medical students experience excessive stress during their studies, which increases the risk of students ' somatic problems (OR = 4.89, CI 0.95 = (4.11;5.83), p < 0.001)., targeted alcohol use (OR = 2.29, CI 0.95 = (1.73;3.04), p < 0,001) and the use of anxiolytic or antidepressant medication to reduce it (OR = 2.99, CI 0.95 = (2.24;4.01), p < 0.001). Students experiencing higher levels of excessive stress are more likely to leave their studies based on their own decision (4.20 (CI 0.95 (3.39;5.19), p < 0.001) and not to enter clinical practice after graduation (OR = 2.62, CI 0.95 = (2.06;3.33), p < 0.001).ConclusionsThe survey shows the need for an open discussion at the highest level about the possibilities of reasonable reduction of unnecessary stress during medical studies. Medical students in the Czech Republic are exposed to excessive stress with all the consequences described above. All that remains is to state the existence of unnecessary components of stress, which represent an opportunity to reduce it, thereby achieving better conditions for studying, improvement in the staff situation in the Czech healthcare system and a reduction in inefficiently spent financial resources for the education of young doctors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35d6cb933d35f238d06acc45c58ec784",
  "timestamp": "2025-05-15T03:24:26.268053"
}