{
  "id": 7741,
  "title": "Effects of Integrated Case Payment on Medical Expenditure and Readmission of Inpatients with Chronic Obstructive Pulmonary Disease: A Nonrandomized, Comparative Study in Xi County, China",
  "abstract": "In the past few decades, Chinese government attempted to reduce the economic burden of chronic diseases and lower family financial risk of patients by establishing a nationwide coverage of Social Health Insurance system. However, the payment mode of Social Health Insurance varies across Chinese healthcare settings, and the effectiveness of each mode differs. This study aimed to evaluate the effects of integrated case payment on medical expenditure and readmission of inpatients with chronic obstructive pulmonary disease (COPD), a complex, multicomponent, chronic condition. A nonrandomized, comparative method was used in this study. Inpatients with COPD before (n=1569) and after the integrated case payment reform (n=4764) were selected from the inpatient information database of the New Cooperative Medical Scheme Agency of Xi County. The integrated case payment comprises the case payment (including price-cap case payment and fixed-reimbursement case payment) and clinical pathway (including clinical pathway A, clinical pathway B and clinical pathway C). Effects of integrated case payment were evaluated with indicators of per capita total medical expense and readmission within 30 days. A multivariate linear regression and a binary logistic regression were used to conduct statistical analysis. The results showed that case payment, comprising price-cap case payment (beta=2382.988, P<0.001) and fixed-reimbursement case payment (beta=2613.564, P<0.001), and clinical pathway C (beta=1996.467, P<0.001) were risk factors of per capita total medical expenses. Clinical pathway A (beta=-1443.409, P<0.001) and clinical pathway B (beta=-1583.791, P<0.001) were protective factors. The interactive effects of case payment with hospital level (beta=0.710, P<0.001) lowered the readmission rate within 30 days. Meanwhile, clinical pathways A (beta=18.949, P<0.001), B (beta=-19.752, P<0.001) and C (beta=-1.882, P<0.1) were associated with the rate increase. The findings revealed that integrated case payment ensured the quality of care for inpatients with COPD to some extent. However, this payment mode increased the per capita total medical expense. Further, policy-makers should set reasonable reimbursement standards of case payment, unify the type of case payment, and strengthen the supervision of the reform to enhance its function on medical cost control.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35e0af7f9522c465c85357b6fd6ed156",
  "timestamp": "2025-05-15T03:11:38.548154"
}