{
  "id": 2374,
  "title": "Overreaction effect: evidence from an emerging market (Shanghai stock market)",
  "abstract": "Purpose The purpose of the study is to examine overreaction effect in the Chinese stock market after the global financial crisis (GFC) of 2007 for all the stocks listed in Shanghai Stock Exchange (SSE) Composite 50 index. Design/methodology/approach To capture overreaction effect in the stock listed at SSE 50 Index, a time series analysis of average cumulative abnormal return within a unified framework is applied for the period of January 2009 to December 2015. From these loser and winner portfolios, contrarian strategy is applied to build arbitrage portfolio, which is the difference of mean reversions between loser and winner portfolios. The portfolio construction is based on a 12-month formation period and 6-month testing period for intermediate-term analysis and. for short-term analysis, 6 month formation and 3 month testing periods. The authors also applied regression analysis to test a return reversal effect for the sampled period. Findings Results show that contrarian strategy yields positive excess returns for the arbitrage portfolio for most of the testing periods. The intermediate baseline case shows the arbitrage portfolio producing an average excess return of 14.1%, while even the short-term one produces 4%, which is statistically significant at the 5% level. The study finds asymmetrical overreactions in the SSE especially for loser portfolios. The biggest winner and loser portfolios follow the mean reversal effect. Moreover, before-after test for the biggest winner and loser portfolios shows that the losers recovered and beat the market immediately. Practical implications The study could benefit government, policy makers and regulators by studying how presence of more individual investors than institutional investors of China stock market leads to more irrational decisions giving rise to volatility. The regulators could build favourable policies for institutional investors to give them incentive to invest more than individual investors through which market volatility could be controlled. Originality/value This research contributes to market behaviour research, showing how working under hypotheses of overreaction; gains can be made with contrarian investment strategy through arbitrage portfolios. The authors provide specific additional support for the short and medium-term overreaction in the SSE for the period 2009-2015 using regression analysis. Contribution to Impact This research contributes to market behaviour research, showing how working under hypotheses of overreaction; gains can be made with contrarian investment strategy through arbitrage portfolios. We provide specific additional support for the short and medium-term overreaction in the SSE for the period 2009-2015 using regression analysis.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35e0ab0e8945306994e29561c5ea89c6",
  "timestamp": "2025-05-15T01:06:10.781387"
}