{
  "id": 6621,
  "title": "Phenotyping Hospital Value of Care for Patients with Heart Failure",
  "abstract": "ObjectiveTo characterize hospitals based on patterns of their combined financial and clinical outcomes for heart failure hospitalizations longitudinally. Data SourceDetailed cost and administrative data on hospitalizations for heart failure from 424 hospitals in the 2005-2011 Premier database. Study DesignUsing a mixture modeling approach, we identified groups of hospitals with distinct joint trajectories of risk-standardized cost (RSC) per hospitalization and risk-standardized in-hospital mortality rate (RSMR), and assessed hospital characteristics associated with the distinct patterns using multinomial logistic regression. Principal FindingsDuring 2005-2011, mean hospital RSC decreased from $12,003 to $10,782, while mean hospital RSMR declined from 3.9 to 3.2 percent. We identified five distinct hospital patterns: highest cost and low mortality (3.2 percent of the hospitals), high cost and low mortality (20.4 percent), medium cost and low mortality (34.6 percent), medium cost and high mortality (6.2 percent), and low cost and low mortality (35.6 percent). Longer hospital stay and greater use of intensive care unit and surgical procedures were associated with phenotypes with higher costs or greater mortality. ConclusionsHospitals vary substantially in the joint longitudinal patterns of cost and mortality, suggesting marked difference in value of care. Understanding determinants of the variation will inform strategies for improving the value of hospital care.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "35f2ada9a7ac715cd008a06df1c9eb4b",
  "timestamp": "2025-05-15T03:00:04.944923"
}