{
  "id": 8574,
  "title": "The Stock and Option Market Response to Negative ESG News",
  "abstract": "SynopsisThe research problemThis study investigates the response of stock prices and equity options to negative environmental, social, and governmental (ESG) incidents.MotivationDespite the growing significance of ESG news and the prominent role of equity options in portfolio management, empirical research on the relationship between options and ESG news remains notably scarce. Yet, the bulk of active asset managers, hedge funds, and investment banks continuously analyze stock prices and option prices simultaneously, to improve strategy performance and risk management and to search for information signals.The test hypothesesWe hypothesize that negative ESG news events tend to negatively impact stock prices and trigger an increase in implied volatility (IV). We also postulate that the magnitude of market response is driven by the event characteristics, that is, severity, novelty, and reach, as well as the financial materiality.Target populationActive asset managers, investment banks, regulators.Adopted methodologyWe employed a two-stage approach to analyze the effect of ESG events on stocks and option IVs. We estimated expected returns and expected change in IV using regression techniques. First, we used these to calculate abnormal returns (AR) and abnormal implied volatility (AIV). We then summed up the ARs and AIVs over several days to obtain cumulative abnormal returns (CAR) and cumulative abnormal changes in volatility (CAIV). Second, we used the CARs and CAIVs as dependent variables for fixed effect panel regressions.AnalysesWe created a large dataset of daily stock and options data on the companies from the S&P 500 index between 2006 and 2021. Most importantly, we use two unique datasets - one on negative ESG news from RepRisk and the other on options prices from OptionMetrics. Out of nearly 3 billion option prices, we extracted option implied volatilities for each stock, applied Bayesian imputation, and obtained daily average IV per stock.FindingsResults of event studies indicate that, on average, option IV exhibits a minimal day-to-day reaction to ESG incidents. However, more severe incidents and those reported by major business sources result in a more pronounced increase in IV within 10 days following the event. Additionally, our empirical analysis highlights the influence of financial materiality on asset prices, as financially material ESG incidents lead to significant declines in stock prices and an upward surge in IV. Notably, this effect is particularly prominent for incidents related to natural capital. In conclusion, the options market incorporates information regarding ESG events, while stock prices exhibit comparatively lower and less systematic reactivity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3604bdf12f55fadc3789819655c6463f",
  "timestamp": "2025-05-15T03:20:22.176665"
}