{
  "id": 9377,
  "title": "Differences in Rates of Glaucoma among Asian Americans and Other Racial Groups, and among Various Asian Ethnic Groups",
  "abstract": "Purpose: To determine the incidence and prevalence of different glaucoma types among Asian Americans and other races, and evaluate the hazard for glaucoma among different races and Asian ethnicities. Design: Retrospective, longitudinal, cohort study. Participants: A group of 2 259 061 eye care recipients, aged >= 40, who were enrolled in a US managed-care network in 2001-2007. Methods: Incidence and prevalence rates of open-angle glaucoma (OAG), narrow-angle glaucoma (NAG), and normal-tension glaucoma (NTG) were calculated and stratified by race and Asian ethnicity. Cox regression was performed to assess the hazard of developing OAG, NAG, and NTG for Asian Americans and other races, and among different Asian ethnicities, with adjustment for potentially confounding variables. Main Outcome Measures: Multivariable adjusted hazard of OAG, NAG, and NTG among different races and Asian ethnicities. Results: The OAG prevalence rate for Asian Americans, 6.52%, was similar to that of Latinos (6.40%) and higher than that of non-Hispanic whites (5.59%). The NAG and NTG prevalence rates were considerably higher among Asian Americans (3.01% and 0.73%, respectively) relative to other races. After adjustment for potential confounding factors, Asian Americans had a 51% increased hazard of OAG (adjusted hazard ratio [HR], 1.51 [95% confidence interval (CI), 1.42-1.60]), a 123% increased hazard of NAG (adjusted HR, 2.23; CI, 2.07-2.41), and a 159% increased hazard of NTG (adjusted HR, 2.59; CI, 2.22-3.02) compared with non-Hispanic whites. Vietnamese Americans (adjusted HR, 3.78; CI, 3.19-4.48), Pakistani Americans (adjusted HR, 2.45, CI 1.50-4.01), and Chinese Americans (adjusted HR, 2.31, CI 2.06-2.59) had considerably higher hazards of NAG, whereas Japanese Americans (adjusted HR, 4.37, CI 3.24-5.89) had a substantially higher hazard of NTG, compared with non-Asian Americans. Conclusions: Given the rapid rise in the number of Asian Americans in the US population, resources should be devoted to identifying and treating glaucoma in these patients. Eye-care providers should be aware of the increased risk for OAG, NAG, and NTG among Asian Americans relative to other races. Knowing Asian-American patients' ancestral country of origin may permit more precise estimation of their risks for OAG, NAG, and NTG. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 1031-1037 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36065493578cf746104e9eed13ab6d4d",
  "timestamp": "2025-05-15T03:28:17.563935"
}