{
  "id": 6553,
  "title": "Insomnia and post-migration stress among resettled Syrian refugees: a cross-sectional survey",
  "abstract": "PurposePost-migration stress is an important aspect of refugees' mental health, but little is known about the relationship with insomnia. The purpose of this study was to investigate the assication between different post-migration stress factors and insomnia among Syrian refugees living in Norway.Design/methodology/approachThe authors analysed survey data from the REFUGE study with 873 Syrian adults who resettled in Norway between 2015 and 2017. Potential participants were randomly selected from The Norwegian Population Register. Insomnia was measured using the Bergen Insomnia Scale. Perceived-discrimination, navigation difficulties, financial strain and loss of social status were measured via the refugee post-migration stress scale. The authors ran logistic regression analyses, controlling for socio-demographics, potentially traumatic experiences and symptoms of post-traumatic stress.FindingsOverall, 59% (95% CI, 56%-62%) of the sample reported experiencing insomnia. In the fully-adjusted model, only financial strain and navigation difficulties were significantly associated with increased odds of insomnia. Loss of social status was also related to insomnia but only before adjusting for symptoms of post-traumatic stress.Originality/valueFinancial strain and navigation difficulties appear to be the most important post-migration stress factors in terms of insomnia among Syrian refugees living in Norway. Ameliorating these difficulties could potentially reduce insomnia among refugees. Since insomnia is a risk factor for the subsequent development of post-traumatic stress and depression, it is important to prevent or improve symptoms of insomnia among Syrian refugees, especially considering the high prevalence found in this study.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3612582257889b8af9ee2b69c5fb4dad",
  "timestamp": "2025-05-15T02:59:07.593999"
}