{
  "id": 5566,
  "title": "Effects of foreign finance measures on the decoupling of greenhouse gas emissions from economic development: a panel study of 97 developing countries over the period 2000-2018",
  "abstract": "Greenhouse gas (GHG) emissions from human activities are the principal cause of accelerated global climate change and climate risk. A country faces a coupling of GHG emissions in proportion to increases in the gross domestic product (GDP) in the initial stage of its economic development. In the later period of economic development, the decoupling of GHGs from GDP can be achieved by efficient technology and environmental awareness. What makes some developing countries achieve decoupling? This study analyses the effects of three financial measures-foreign direct investment (FDI), climate change aid and the Clean Development Mechanism (CDM)-which influence both GDP and GHGs in developing countries. For the empirical analysis, this study utilizes a panel regression using data from 97 countries between 2000 and 2018. The results suggest that the effectiveness of reducing GHG emissions and decoupling differ among the three previously mentioned financial measures. Climate change aid induces decoupling while coupling follows the CDM. FDI lacks statistical significance. A proportion of renewable energy from the total electricity is associated with strong decoupling. Well-designed climate finance measures that consider developing countries' socio-economic conditions and renewable energy adoption can induce GHG mitigation as well as economic growth.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "361c7a94c843328529f17c74b2733ef7",
  "timestamp": "2025-05-15T02:49:21.596117"
}