{
  "id": 6976,
  "title": "Health care delivery system contributions to management of newly diagnosed prostate cancer",
  "abstract": "Background: Despite clinical guidelines advocating for use of conservative management in specific clinical scenarios for men with prostate cancer, there continues to be tremendous variation in its uptake. This variation may be amplified among men with competing health risks, for whom treatment decisions are not straightforward. The degree to which characteristics of the health care delivery system explain this variation remains unclear.Methods: Using national Medicare data, men with newly diagnosed prostate cancer between 2014 and 2019 were identified. Hierarchical logistic regression models were used to assess the association between use of treatment and health care delivery system determinants operating at the practice level, which included measures of financial incentives (i.e., radiation vault ownership), practice organization (i.e., single specialty vs. multispecialty groups), and the health care market (i.e., competition). Variance was partitioned to estimate the relative influence of patient and practice characteristics on the variation in use of treatment within strata of noncancer mortality risk groups.Results: Among 62,507 men with newly diagnosed prostate cancer, the largest variation in the use of treatment between practices was observed for men with high and very high-risk of noncancer mortality (range of practice-level rates of treatment for high: 57%-71% and very high: 41%-61%). Addition of health care delivery system determinants measured at the practice level explained 13% and 15% of the variation in use of treatment among men with low and intermediate risk of noncancer mortality in 10 years, respectively. Conversely, these characteristics explained a larger share of the variation in use of treatment among men with high and very high-risk of noncancer mortality (26% and 40%, respectively).Conclusions: Variation among urology practices in use of treatment was highest for men with high and very high-risk noncancer mortality. Practice characteristics explained a large share of this variation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3622895f38941d990e6ea6b320add7aa",
  "timestamp": "2025-05-15T03:03:55.689993"
}