{
  "id": 3138,
  "title": "Betting against real earnings management",
  "abstract": "Purpose The study presents the zero investment strategies based on the pricing impact of real earnings management (REM) on stock returns after taking into account the direction and endogeneity nature of REM. Design/methodology/approach The authors use standard portfolio methodology and Fama-Macbeth cross-sectional regression to analyze the data for this study. Both upward and downward form of REM has been examined. Accrual earnings management (AEM) has been controlled while examining the association between REM and stock returns. Findings The findings demonstrate that the REM anomaly exists in the Indian equity market and is consistent under different market conditions and investment horizons. It is robust after controlling for cross-sectional effects and AEM. Our subsequent analysis suggests that a decile-based zero investment portfolio strategy based on REM loadings generates an annual excess return of 17.90%. The presented annual excess return is highest among quantile and mean-based investment strategies. Further, the authors find that REM sorted proposed investment strategies outperform the AEM sorted investment strategies in all spheres. Practical implications The findings suggest that investors can form an arbitrage profitable investment strategy by taking a long position in the bottom 10% of negative REM stocks, and a short position in the top 10% of positive REM stocks. Originality/value This is the first study that examines the pricing impact of REM on stock returns and provides zero investment strategies by betting against REM.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36254e0e56b1468e798d10526b1c8b99",
  "timestamp": "2025-05-15T01:13:45.328708"
}