{
  "id": 3184,
  "title": "Financial Risks in Building Planning: A Literature Review",
  "abstract": "Introduction: The construction industry plays a crucial role in the economic development of countries, driving both growth and infrastructure. However, this sector also faces significant challenges, with financial risks being particularly critical. Proper planning in construction projects is a key factor for success, as it allows for the anticipation and mitigation of such risks from the early stages of the project. Objective: The objective of this study was to identify and classify financial risks associated with the planning of building construction through a scientific literature review. The analysis focused on the sources of these risks, their causes, their statistical weight within the literature, and proposed alternatives for risk management. Materials and Methods: This study was conducted through a systematic literature review in both English and Spanish, covering the period from 2000 to 2024. A mixed-methods approach was employed, combining quantitative and qualitative analysis. The main scientific databases were consulted. A total of 163 articles were initially reviewed, from which 42 were selected based on their relevance, recency, and direct contribution to the topic. Results: The analysis identified 28 causes of financial risk in the planning stage of building construction. These risks were classified by origin, highlighting common sources such as bidding, financing, and consulting. It was observed that 30% of the reviewed literature pointed to engineering consulting as the most recurrent source of financial risk, which facilitates the implementation of mitigation strategies. The main identified causes include poor information gathering, inaccurate financial estimates, and flawed process design during the planning phase. Conclusions: The review revealed that financial risks in construction planning stem from multiple interrelated factors. Inadequate consulting, poor planning practices, and errors in initial economic assessments are the main drivers. Early identification and proper classification of these causes are essential for developing effective mitigation strategies that ensure the financial viability of construction projects.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "364143e3d094411b52107e88cc36be41",
  "timestamp": "2025-05-15T02:23:33.528901"
}