{
  "id": 335,
  "title": "THRESHOLD LEVELS, STRIKE PRICE GRID, AND OTHER MARKET MICROSTRUCTURE ISSUES ASSOCIATED WITH EXCHANGE-TRADED EQUITY OPTIONS",
  "abstract": "This study addresses a number of important market microstructure issues associated with exchange-traded equity Options having significant research implications for Studies investigating clustering on option strike prices. Price threshold levels associated with exchange listing and the automatic exercise of equity options as established by the Securities and Exchange Commission and Options Clearing Corporation (OCC) to carry out their regulatory and oversight responsibilities are examined. Significant changes are documented including motivation for such changes. Market microstructure issues potentially impact equity Options research outcomes and one important issue is documenting changes over time to the strike price grid. A chronological outline of the introduction of option strike codes from April 26, 1973, through December 2008 is presented. Pricing discrepancies are documented between Standard & Poor's end-of-day updates (closing prices) and similar prices reported by Center for Research in Security Prices, Thompson, and Bloomberg, which is the source of ambiguities associated with the OCC's official settlement price. A number of quirks associated with option databases are identified to be of potential interest to researchers. (C) 2009 Wiley Periodicals, Inc. Jrl Fut Mark 30: 188-201, 2010",
  "year": 2010,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36690634026663abf57a015b5bd91ef7",
  "timestamp": "2025-05-15T01:30:46.403518"
}