{
  "id": 5105,
  "title": "The effects of political risk on foreign exchange demand: Evidence from Zimbabwe",
  "abstract": "The political climate of any country has become one of the pillars of decision-making for investment and any other financial business. Zimbabwe is one of the countries that have experienced political instability for the longest time. Many studies have looked at the impact of political risk on the stock market and other macroeconomics variables without considering the impact of political risk on the demand for foreign exchange in a country. Using secondary data from the World Bank - World Development Indicator (WDI), International Country Risk Guide (ICRG), and Reserve Bank of Zimbabwe (RBZ), this study examined the effects of political risk on the foreign currency demand in Zimbabwe. The regression results showed a negative and significant association between political risk and foreign exchange reserve both in the short run and long-run period, implying an increase in foreign currency demand as political risk increases. The study also applied an alternate indicator for foreign exchange demand to test whether the main findings are robust to different dependent variable measures. The results from the robustness test are consistent with the main findings of the study. The study makes recommendations for policymaking by the Zimbabwean government and other regulators.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3679a55fe0877a34fd6544f250327376",
  "timestamp": "2025-05-15T02:44:11.101331"
}