{
  "id": 8855,
  "title": "Outcome and cost of spinal fractures and spinal tumors",
  "abstract": "The aim of the study was to delineate rates of surgery, length of hospital stay, return to work, iterative surgery rates and cost to society of spinal tumor (ST) and spinal fracture (SF) surgery in Belgium. Overall surgery rates were obtained from the National Institute for Health Care and Disability Insurance. Medical and financial claims data were abstracted from the administrative database of the Alliance of Christian Sickness Funds which includes data of 42% of the mandatory insured Belgian population. All records including the reimbursement codes for ST and SF surgery in 2005 were identified. A logistic regression model was developed to determine the socio-demographic, surgery-related and sick leave predictors of return to work. Our database contained information about 3.791 patients who underwent surgery for SF and 2.322 patients who had surgery for ST. Year-to-year surgery rate growth for SF was estimated at 15%. The yearly increase in surgery rates for ST was calculated at 11%. The return to work rate was 90% 1 year after surgery for both SF and ST. Sixty percent of patients who underwent radiotherapy and surgery for ST were still alive 1 year after surgery. Length of hospital stay ranged from 1 to 27 days after surgery for ST and from 1 to 16 days after surgery for SF. Repeat surgery was performed in 8% of the ST cases and in 12% of the SF patients. Return to work rate remained significantly lower for blue collar workers, self-employed workers and patients with a longer sick leave before surgery. Patients who were absent from work for more than 3 months at time of surgery represent a high-risk group with regard to successful functional recovery.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "367f10f6f363526ff08d0f84b90a259c",
  "timestamp": "2025-05-15T03:22:57.948431"
}