{
  "id": 2785,
  "title": "Financial risk allocation and provider incentives in hospital-insurer contracts in The Netherlands",
  "abstract": "In healthcare systems with a purchaser-provider split, contracts are an important tool to define the conditions for the provision of healthcare services. Financial risk allocation can be used in contracts as a mechanism to influence provider behavior and stimulate providers to provide efficient and high-quality care. In this paper, we provide new insights into financial risk allocation between insurers and hospitals in a changing contracting environment. We used unique nationwide data from 901 hospital-insurer contracts in The Netherlands over the years 2013, 2016, and 2018. Based on descriptive and regression analyses, we find that hospitals were exposed to more financial risk over time, although this increase was somewhat counteracted by an increasing use of risk-mitigating measures between 2016 and 2018. It is likely that this trend was heavily influenced by national cost control agreements. In addition, alternative payment models to incentivize value-based health care were rarely used and thus seemingly of lower priority, despite national policies being explicitly directed at this goal. Finally, our analysis shows that hospital and insurer market power were both negatively associated with financial risk for hospitals. This effect becomes stronger if both hospital and insurer have strong market power, which in this case may indicate a greater need to reduce (financial) uncertainties and to create more cooperative relationships.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3685c3eb3673cda37429b6086f2c0f34",
  "timestamp": "2025-05-15T02:19:08.456209"
}