{
  "id": 437,
  "title": "Secondary school canteens in Australia: analysis of canteen menus from a repeated cross-sectional national survey",
  "abstract": "Objective: The current study aimed to assess the nutritional quality of Australian secondary school canteen menus. Design: Stratified national samples of schools provided canteenmenus in 2012-2013 and 2018, which were systematically assessed against a 'traffic light' classification system according to the National Healthy School Canteen Guidelines. Items were classified as green (healthiest and recommended to dominate canteen menus), amber (select carefully) or red (lownutritional quality, should not appear on canteen menus), and pricing and promotional strategies were recorded. Setting: Australia. Participants: Canteen menus from 244 secondary schools (2012-2013 n 148, 2018 n 96). Results: A total of 21 501 menu items were classified. Forty-nine percent of canteen menus contained at least 50% green items; however, nearly all (98.5%) offered at least one red item and therefore did not comply with national recommendations. Snacks and drinks had the least healthy profile of all product sectors, and a large proportion of schools supplied products typically of poor nutritional quality (meat pies and savoury pastries 91.8 %, sugary drinks 89.5 %, sweet baked goods 71.5%, ice creams 64.1% and potato chips 44.0 %). Red items were significantly cheaper than green items on average, andmany schools promoted the purchase of red items on canteen menus (52.8%). There were few differences between survey waves. Conclusions: There is considerable room for improvement in the nutritional quality of canteen menus in Australian secondary schools, including in the availability, pricing and promotion of healthier options. Additional resources and services to support implementation of national guidelines would be beneficial.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36873833a20d278a9ed98fe6d4e61dcc",
  "timestamp": "2025-05-15T01:31:50.785010"
}