{
  "id": 3235,
  "title": "Suicidality among gambling helpline callers: A consideration of the role of financial stress and conflict",
  "abstract": "Background and Objectives: High rates of suicidal ideation and attempts secondary to gambling are well established among those with gambling disorders. The present study explores potential risk factors for suicidal ideation and/attempt among a sample of help-line callers. Methods: Participants (N = 202) completed measures assessing demographics; gambling behavior; and financial, family/social, employment, substance use, and legal difficulties related to gambling. Bivariate analyses, logistic regression, and mediation analyses were used to explore relationship between predictors and risk of suicidal ideation and attempt. Results: Female gender, gambling severity (including engagement in illegal behaviors), a history of mental health problems, financial problems, and conflict related to gambling were associated with current suicidality in this sample. Mediation analyses revealed that financial problems were associated with increased familial conflict, which was in turn associated with increased suicidality. Conclusions: Family and social conflict may be one important way in which financial problems confer risk for suicidality among problem gamblers. These results align with findings from the substance use disorder (SUD) literature and highlight one potential factor that may merit further assessment and/or intervention. Scientific Significance: Researchers and clinicians may want to consider the overall level of conflict a patient is experiencing when assessing suicide risk among individuals with gambling problems. Professionals may also want to consider the suitability of interventions to address conflict within the context of gambling treatment.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "368a975f22b3abac9bbd4544ae55d4b6",
  "timestamp": "2025-05-15T02:24:05.124246"
}