{
  "id": 3549,
  "title": "Application technology opportunity discovery from technology portfolios: Use of patent classification and collaborative filtering",
  "abstract": "Technology opportunity discovery (TOD), customized to a firm's current technology capability, can be a good starting point to formulate a technology strategy for a firm that lacks technology information, experts, and/or facilities. Although patent-based studies have suggested systematic methods for customized TOD, these methods have limitations such as insufficient consideration of a target firm's technology portfolio and difficulty of method reproducibility due to expert intervention-based text mining. Therefore, this paper proposes an approach to determine application technology opportunities customized to a target firm by applying collaborative filtering to firms' technology portfolios, which are represented as a set of patent classification codes of the firm's patents. The proposed method involves 1) structuring technology portfolios as firm-international patent classification (IPC) distribution vectors using main group-level IPC codes of the applicants' patents, recommending main group-level IPCs untapped by the target firm and with high preference scores by using collaborative filtering, and 3) classifying the recommended IPCs for the firm's strategic decision-making support using indexes of heterogeneity, growth rate, and competition level. To show the workings of this approach, we applied it to a high-tech firm with wireless communication technology, building on the analysis of large-scale patents and their applicants. This approach is expected to contribute to the systematic identification of application technology opportunities customized to firms and across various industries, and to become a basis for developing future technology intelligence systems. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36902002866887f689d9c98d7d5bbd7c",
  "timestamp": "2025-05-15T01:18:20.527399"
}