{
  "id": 2005,
  "title": "Pressurized Hot Water Extraction as Green Technology for Natural Products as Key Technology with Regard to Hydrodistillation and Solid-Liquid Extraction",
  "abstract": "Hydrodistillation and solid-liquid extraction with organic solvents or supercritical CO2 are standard technologies for natural product manufacturing. Within this technology, portfolio pressurized hot water technology is ranked as a green, sustainable, resilient, kosher and halal manufacturing process. Essential for sustainability is energy integration for heating and cooling the auxiliary water as well as product concentration without evaporation but with the aid of low energy consuming ultra- and nanofiltration membrane technology. The incorporation of modern unit operations, such as pressurized hot water extraction, along with inline measurement devices for Process Analytical Technology approaches, showcases a shift in traditional extraction processes. Traditional equipment and processes still dominate the manufacturing of plant extracts, yet leveraging innovative chemical process engineering methods offers promising avenues for the economic and ecological advancement of botanicals. Techniques such as modeling and process intensification with green technology hold potential in this regard. Digitalization and Industry 4.0 methodologies, including machine learning and artificial intelligence, play pivotal roles in sustaining natural product extraction manufacturing and can profoundly impact the future of human health.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3697f923ea836ccd86eda9b3c6254ad2",
  "timestamp": "2025-05-15T01:02:10.181106"
}