{
  "id": 4889,
  "title": "Toward Sustainable Development: Assessing the Effects of Financial Contagion on Human Well-Being in Romania",
  "abstract": "In a globally interconnected economy marked by volatility, this study employs the Autoregressive Distributed Lag (ARDL) model to examine financial contagion's impact on Romania's financial stability. It investigates both conventional and unconventional channels through which financial contagion is transmitted, emphasizing its sensitivity to factors such as geopolitical events and investor sentiment. The study also assesses the influence of unemployment, market capitalization, and financial freedom on Romania's Human Development Index (HDI) from 2000 to 2022. Using HDI, which encompasses health and education alongside economic aspects, the research provides a holistic view of well-being and quality of life. In addition to the ARDL model's insights, this study expands its scope by conducting a multilinear regression analysis, with GDP as the dependent variable. We have incorporated independent variables such as HDI, transaction volume, and the BET-FI index to comprehensively assess their relationships and potential impact on Romania's economic growth. This analytical approach unveils intricate connections between key economic and financial indicators, paving the way for a deeper understanding of how these variables interact. Furthermore, to shed light on the financial dynamics within Romania, a supplementary analysis in the Altreva Adaptive Modeler was undertaken, focusing on the BET-FI index. This software-based exploration provides a nuanced perspective on the index's behavior and its interactions with other economic and social indicators. This additional dimension contributes to our holistic understanding of the effects of financial contagion and the implications for sustainable human development in Romania. By combining traditional econometric methodologies with cutting-edge modeling techniques, this study strives to offer a robust framework for comprehending the multifaceted nature of financial contagion and its implications for both the national economy and well-being. These findings have the potential to guide policymakers and financial institutions in implementing more effective risk management strategies, driving economic development, and ultimately enhancing the overall quality of life in Romania.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "369a6346a5d27c8ecfd367f3b77b0976",
  "timestamp": "2025-05-15T02:42:04.871140"
}