{
  "id": 6143,
  "title": "Empirical analysis of asymmetric long memory volatility models in value-at-risk estimation",
  "abstract": "Value-at-risk (VaR) has emerged as the standard tool for measuring and managing financial market risk. In this paper, we stud), the effects of asymmetric long memory volatility models on the accuracy of stock index return VaR estimates. We also investigate the relevance of Student's t and skewed Student's t-distribution innovations in analyzing volatility stylized facts, such as volatility clustering, volatility asymmetry and volatility persistence or long memory in volatilities, in some developed and emerging stock markets. In order to do so, we evaluate and compare the performance of asymmetric, FIEGARCH and FIAPARCH, versus symmetric, FIGARCH, long memory VaR models, respectively with normal, Student's t and skewed Student's t-distributions. Based on individual market indexes for selected developed and emerging stock markets, the empirical results show that, using Kupiec's likelihood ratio tests, the FIAPARCH(1, d, 1) model with skewed Student's t innovation is more accurate in in-sample VaR analysis for long and short trading positions than the other models. For out-of sample VaR analysis, the FIAPARCH(1, d, 1) model with Student's t-distribution innovation provided more accurate VaR calculations in capturing stylized facts in the volatility of our sample returns. Thus, in-sample and out-of-sample VaR values computed using asymmetric long memory volatility models have better accuracy than those generated using the symmetric FIGARCH model and the correct assumption of return distribution might improve the estimated performance of VaR models in the stock markets.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36a268527fd786a5075a6b01c3178bda",
  "timestamp": "2025-05-15T02:55:12.925668"
}