{
  "id": 4269,
  "title": "COVID-19 and overconfidence bias: the case of developed, emerging and frontier markets",
  "abstract": "Purpose The main purpose of the present study is to delve into the overconfidence bias in global stock markets during both pre COVID-19 and COVID-19 phases. Design/methodology/approach The present study makes use of daily adjusted closing prices and volume of the broad market indices of 46 global stock markets over a period ranging from July 2015 till June 2020. The sample period is split into pre COVID-19 and COVID-19 phases. In order to test the overconfidence fallacy in the chosen stock markets, bivariate market-wide vector auto regression (VAR) models and impulse response functions (IRFs) have been employed in both phases. Findings A highly significant contemporaneous relationship between market return and volume appears to be more pronounced in the Japanese, US, Chinese and Vietnamese stock markets in the pre COVID-19 era for the relevant coefficients are positive and highly significant for most lags. Coming to the period of turbulence, the present study discovers strong overconfident behavior in the Chinese, Taiwanese, Turkish, Jordanian and Vietnamese stock markets during COVID-19 phase. Practical implications A stark finding is that none of the developed stock markets reveal strong overconfidence bias during pandemic, suggesting a loss or decline in the investors' confidence. Therefore, the regulators should try to regain the investors' trust and confidence in the markets by ensuring honest, fair and transparent practices. The money managers should reduce the transaction cost to encourage trading and educate investors to hold a well-diversified portfolio to mitigate risk in the long run. The governments may launch recovery packages focusing on sustaining and improving economic activities. Finally, a better investment culture may be built by the corporate houses through good corporate governance practices to regain lost trust. Originality/value The present study appears to be the very first attempt to gauge overconfidence bias in the wake of a recent COVID-19 pandemic.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36cd0326e29e10a4ce69458135c94f53",
  "timestamp": "2025-05-15T01:25:23.305211"
}