{
  "id": 2077,
  "title": "The effects of status on the performance of portfolio diversification strategies",
  "abstract": "Purpose This paper investigates how a firm's status moderates the performance of its investment portfolio diversification strategy. We combine the investment diversification literature with the organizational status theory, arguing that status would weaken the benefits of a specialist strategy in their niche industry of investments while strengthening the positive consequences of a generalist strategy across various industries. Design/methodology/approach We collected our data using the Securities Data Company (SDC) Platinum VentureXpert database. A fixed-effects spline regression analysis for 2,201 US venture capital firms between 1969 and 2016 was used to test for a nonlinear relationship between the level of portfolio diversification and firm performance. Findings We found that status differences exist in the performance of a specialist strategy but not in that of a generalist strategy. Our results indicate that portfolio specialization in fewer number of industries has little impact on low-status firms, whereas high-status firms suffer significantly lower IPO success rates. In contrast, above-median portfolio diversification was found to be beneficial to both high- and low-status firms. Originality/value We specifically identify the impact of status on the performance of investment diversification strategies, an area of research which has received little attention. Further, our findings provide some practical implications for managers making investment decisions between specialist and generalist investment strategies, given their status within the market. Implications for understanding the roles of firm status in portfolio diversification strategies are discussed.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36cff4cb6f6c4724df2accd1041081a1",
  "timestamp": "2025-05-15T01:02:32.927772"
}