{
  "id": 922,
  "title": "From forecasting to trading: A multimodal-data-driven approach to reversing carbon market losses",
  "abstract": "The carbon market is characterized by inherent nonlinearity and high volatility, significantly influenced by several market and factor exposures. These include the energy market, financial market, foreign exchange market, international carbon markets, environmental factors, public attention, and market sentiment. Given the multifaceted determinants of carbon prices, this study has bridged a gap in the existing research by transitioning from traditional historical-data-driven methods to an innovative multimodal-data-driven framework integrating both structured and unstructured data. Combining decomposition techniques with feature filtering, we analyze the dynamic relationships between multiple variables and different frequency components of carbon prices, particularly within the relatively young and understudied Chinese carbon market. Furthermore, we calculate entropy values to distinguish between high-complexity and low-complexity sub-sequences and implement an adaptive forecasting process fusing conventional statistical approaches with prevalent deep learning methods, improving interpretability and forecasting accuracy. The proposed method has a prediction RMSE of only 0.3471 in the carbon market of Hubei, China, and a prediction MAPE of 0.9491 in the newly established national unified carbon market. Building upon the forecasting results, this paper makes a further extension by proposing an interval-constrained trading strategy that encapsulates the predictive uncertainties, providing an effective risk management tool in the volatile carbon market. Enterprises can improve their cumulative return rate by 2 % to 14 % through the improvement of our trading strategies, and the maximum drawdown can be reduced by about 2 %. Notably, our strategy's potential for reversing losses to gains, could offer actionable insights for enterprises' decision-making processes.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36e0eb0ebd4be978a9d364f67138eda9",
  "timestamp": "2025-05-15T01:44:35.372829"
}