{
  "id": 1972,
  "title": "Sustainable language learning and ePortfolio application",
  "abstract": "Adapting engineering education to a sustainable ESP (English for Special Purposes) training and competence-based education requires dedicated effort. Although active learning methodologies are commonly utilised in Higher Education institutions, there remains a need for enhanced curricular coordination and coherence. To address this, we are investigating the latest syllabus updates by introducing and verifying a valuable and student-friendly tool - an electronic portfolio in English. We view the ePortfolio as a comprehensive platform to facilitate students' academic and professional growth, as well as their development of competences. This quasi-experimental study utilised a pre-/post-training trial design and nonrandomised control group to investigate the implementation of ePortfolios. During the diagnostic assessment, the first questionnaire allowed students to express their ideas regarding their competences, portfolio understanding, ESP and professional growth. The second was used to determine the undergraduates' learning outcomes and perceptions after three months of training. There was a significant increase in learners' support of several types of transversal competences, whereas some other competences appeared to be declining. This indicates that the ePortfolio tool stimulated a fresh process of self-reflection among the students. Our research focuses on examining the creation of the ePortfolio in the context of an ESP course to integrate technical students' reflections on capacity building and advanced professional development in English.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36e763bf641a101c8ca2e322fca8c75c",
  "timestamp": "2025-05-15T01:01:41.627560"
}