{
  "id": 5941,
  "title": "A Multi-criteria Weighted Risk Priority Number Model for Evaluating Failure Modes and Effects: A Case Study",
  "abstract": "This study addresses the challenges associated with high maintenance costs in petroleum companies, particularly those involved in drilling wells, where continuous equipment wear leads to increased financial burdens. The study aims to improve maintenance strategies through the Failure Modes and Effects Analysis (FMEA), widely used for risk assessment in industrial systems. This analysis relies on calculating the Risk Priority Number (RPN), determined by factors of occurrence (O), severity (S), and detection (D). A model, known as the Weighted Multi-Criteria Risk Priority Number (RPNmc), was developed, considering additional criteria such as time to repair, number of failures, and maintenance cost. This model aids in improving the classification of machine components and identifying the most effective maintenance policies in terms of reducing faults and their time as well as their costs. A case study was conducted on a mud pump in a petroleum drilling company to apply this model. The results showed that the proposed model addresses several gaps in the traditional Failure Modes, Effects, and Criticality Analysis (FMECA) model, such as cases where the RPN is equal despite differing values among criteria, prioritizing one criterion over another, and incorporating additional criteria like maintenance cost. The model provides a precise and extensive analysis of the studied condition, helping companies make more informed and effective decisions. This improvement is expected to lead to substantial resource savings and enhanced overall system performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36ea01852bd6fe5ebf0931968aafe487",
  "timestamp": "2025-05-15T02:53:03.105585"
}