{
  "id": 7962,
  "title": "Inequalities in cancer incidence and mortality across income groups and policy implications in South Korea",
  "abstract": "Objective: To investigate inequalities in cancer incidence and mortality across income groups in South Korea. Study design: After reviewing 2001 data from the Korean National Cancer Registry, and National Health Insurance and National Medical Aid data, 49,277 cancer cases were classified into six income groups. The incidence and 3-year mortality rates of major cancers were calculated separately and as a total. Methods: Two composite indices (slope index of inequality and relative index of inequality) were calculated to analyse the relative differences in cancer incidence. The 3-year mortality rate ratios for major cancers were calculated, with Class 1 as the reference, using a Cox regression model to adjust for age. Results: The relative risk of cancer incidence (total) in the lowest income group was 1.65 and 1.43 times higher than that in the highest income group for mates and females, respectively. For cancer mortality, all other income groups showed significantly higher 3-year mortality rate ratios than the highest income group for mates and females. Conclusions: This study identified inequalities in cancer incidence and 3-year mortality across income groups in South Korea, most of which were unfavourable to lower income groups. It is suggested that Lower income groups should receive financial assistance for cancer screening and inpatient medical services. (C) 2007 The Royal Institute of Public Health. Published by Elsevier Ltd. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36eb712e0616abe6e07d88c079f6cbeb",
  "timestamp": "2025-05-15T03:13:30.755052"
}