{
  "id": 475,
  "title": "Ethnozoological and commercial drivers of the pangolin trade in Benin",
  "abstract": "BackgroundPangolins are trafficked in unsustainable volumes to feed both local and global trade networks for their meat and the medicinal properties of their derivatives, including scales. We focus on a West African country (Benin) to assess the medicinal and spiritual values of pangolins among different ethnic groups and identify the cohort of buyers involved in the pangolin trade and related economic values along the chain, notably from local diasporas.MethodsWe organised 54 focus groups in villages surrounding occurrence habitats of pangolins across Benin and conducted 35 individual interviews with vendors from five major traditional medicine markets (TMMs). Our questionnaire addressed the different uses of pangolins, the commercial value of pangolin items, the categories of clients and the related selling prices.ResultsPangolin meat was strictly consumed as food. Scales, head, bones, tongue, blood, heart and xiphisternum were the items used by local communities as part of medicinal (65% of the focus groups) and spiritual (37%) practices. Scales were the most frequently used item (use value index = 1.56). A total of 42 medicinal and spiritual uses, covering 15 International Classification of Diseases (ICD) categories, were recorded among ethnic groups. The ICD and spiritual categories-based analyses of similarity showed a partial overlapping of ethnozoological knowledge across Benin, although knowledge was significantly influenced by ethnicity and geographic location. The pricing of pangolins both varied with the category of stakeholders (local communities vs. stakeholders of TMMs) and clients (local and West African clients vs. Chinese community) and the type of items sold. The Chinese community was reported to only buy pangolins alive, and average selling prices were 3-8 times higher than those to West African clients.ConclusionsOur results confirm that pangolins in Africa are valuable and versatile resources for consumption and medicinal / spiritual practices. The pangolin trade in Benin is based on an endogenous and complex network of actors that now appears influenced by the specific, high-valued demand from the Chinese diaspora. Further investigations are required to assess the growing impact of the Chinese demand on the African wildlife trade.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36ebf595da522ca8d2ca30cb46fba9e9",
  "timestamp": "2025-05-15T01:32:30.174588"
}