{
  "id": 8721,
  "title": "Strategies to improve the implementation of preventive care in primary care: a systematic review and meta-analysis",
  "abstract": "Background Action on smoking, obesity, excess alcohol, and physical inactivity in primary care is effective and cost-effective, but implementation is low. The aim was to examine the effectiveness of strategies to increase the implementation of preventive healthcare in primary care.MethodsCINAHL, CENTRAL, The Cochrane Database of Systematic Reviews, Dissertations & Theses - Global, Embase, Europe PMC, MEDLINE and PsycINFO were searched from inception through 5 October 2023 with no date of publication or language limits. Randomised trials, non-randomised trials, controlled before-after studies and interrupted time series studies comparing implementation strategies (team changes; changes to the electronic patient registry; facilitated relay of information; continuous quality improvement; clinician education; clinical reminders; financial incentives or multicomponent interventions) to usual care were included. Two reviewers screened studies, extracted data, and assessed bias with an adapted Cochrane risk of bias tool for Effective Practice and Organisation of Care reviews. Meta-analysis was conducted with random-effects models. Narrative synthesis was conducted where meta-analysis was not possible. Outcome measures included process and behavioural outcomes at the closest point to 12 months for each implementation strategy.ResultsEighty-five studies were included comprising of 4,210,946 participants from 3713 clusters in 71 cluster trials, 6748 participants in 5 randomised trials, 5,966,552 participants in 8 interrupted time series, and 176,061 participants in 1 controlled before after study. There was evidence that clinical reminders (OR 3.46; 95% CI 1.72-6.96; I2 = 89.4%), clinician education (OR 1.89; 95% CI 1.46-2.46; I2 = 80.6%), facilitated relay of information (OR 1.95, 95% CI 1.10-3.46, I2 = 88.2%), and multicomponent interventions (OR 3.10; 95% CI 1.60-5.99, I2 = 96.1%) increased processes of care. Multicomponent intervention results were robust to sensitivity analysis. There was no evidence that other implementation strategies affected processes of care or that any of the implementation strategies improved behavioural outcomes. No studies reported on interventions specifically designed for remote consultations. Limitations included high statistical heterogeneity and many studies did not account for clustering.ConclusionsMulticomponent interventions may be the most effective implementation strategy. There was no evidence that implementation interventions improved behavioural outcomes.Trial registrationPROSPERO CRD42022350912.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "36f958c4ec6534a2db17de75c40056c1",
  "timestamp": "2025-05-15T03:21:56.589019"
}