{
  "id": 8975,
  "title": "Willingness to Join and Pay for Community-Based Health Insurance Among Rural Households of Selected Districts of Jimma Zone, Southwest Ethiopia",
  "abstract": "Background: Globally, millions of people suffer and die because they do not have the money to pay for health care. A voluntary health insurance scheme is a prepayment mechanism to overcome the financial hardship of poor households. There is a high demand to determine the enrolment rate and ability to pay before scale-up of the scheme by the government to be sure of its feasibility and sustainability. Objective: To determine willingness to join and pay for a community-based health insurance scheme and associated factors among rural households of selected districts in Jimma Zone, 2018. Methods: A community-based cross-sectional study design was employed in selected districts of Jimma Zone, Ethiopia. Multistage simple random sampling was used to select 422 households. Data were collected using a semi-structured interviewer-administered questionnaire. A double bounded contingent valuation method was applied to elicit households' willingness to pay for the scheme. Data were entered into Epi-Data 3.1 and analyzed with SPSS V.23. A binary logistic regression model was fitted to determine the presence of statistically significant associations between the dependent and independent variables at p-value <0.05 and AOR values with 95% CI. Results: Of 422 sampled respondents, 389 participated in this study with a response rate of 92%. Of these, 305 (78%) were willing to join and 274 (90%) of them were willing to pay. The average amount of money the households were willing to pay per household per annum was 228 ETB (8.27 USD), with a range of 100-500 ETB. The older age groups, poor households, and experience of local risk-sharing schemes were found to be determinants for willingness to join the community-based health insurance. Similarly, having a large family size, and low economic and education status of households were significant predictors of willingness to pay for this scheme. Conclusion: A high proportion of households were willing to join and pay for the CBHI scheme. The average amount of money they were willing to pay for the scheme was very slightly lower than what is planned by the government. Thus, the government of Ethiopia should strengthen efforts to scale up this scheme in the rural areas of the country specifically to districts not yet enrolled, to reduce direct out-of-pocket payment at service delivery points. This will also contribute to guaranteeing dwellers of rural areas access to quality health services without facing financial hardship, to achieve universal health coverage for all by the end of 2035.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "370a3bf1b19492ddc1dd0613340b0cc9",
  "timestamp": "2025-05-15T03:24:26.270040"
}