{
  "id": 9163,
  "title": "Socioeconomic status in relation to incident fracture risk in the Study of Women's Health Across the Nation",
  "abstract": "We examined baseline and annual follow-up data (through annual follow-up visit 9) from a cohort of 2,234 women aged 42 to 52 years at baseline. Independent of financial status, higher educational level was associated with lower fracture incidence among non-Caucasian women but not among Caucasian women. This study was conducted to determine the associations of education and income with fracture incidence among midlife women over 9 years of follow-up. We examined baseline and annual follow-up data (through annual follow-up visit 9) from 2,234 participants of the Study of Women's Health Across the Nation, a cohort of women aged 42 to 52 years at baseline. We used Cox proportional hazards regression models to examine the associations of socioeconomic predictors (education, family-adjusted poverty-to-income ratio, and difficulty paying for basics) with time to first incident nontraumatic, nondigital, noncraniofacial fracture. Independent of family-adjusted poverty-to-income ratio, higher educational level was associated with decreased time to first incident fracture among non-Caucasian women but not among Caucasian women (p (interaction) 0.02). Compared with non-Caucasian women who completed no more than high school education, non-Caucasian women who attained at least some postgraduate education had 87 % lower rates of incident nontraumatic fracture (adjusted hazard ratio 0.13, 95 % confidence interval [CI] 0.03-0.60). Among non-Caucasian women, each additional year of education was associated with a 16 % lower odds of nontraumatic fracture (adjusted odds ratio 0.84, 95 % CI 0.73-0.97). Income, family-adjusted poverty-to-income ratio, and degree of difficulty paying for basic needs were not associated with time to first fracture in Caucasian or non-Caucasian women. Among non-Caucasian midlife women, higher education, but not higher income, was associated with lower fracture incidence. Elucidation of the mechanisms underlying the possible protective effects of higher educational level on nontraumatic fracture incidence may allow us to better target individuals at risk of future fracture.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "370bfede9b072b831ad6783e95bffc46",
  "timestamp": "2025-05-15T03:26:25.859229"
}