{
  "id": 9444,
  "title": "Trends in human papillomavirus vaccination among women aged 27 to 45 years, from 2017 to 2019",
  "abstract": "OBJECTIVE: In 2018, the Food and Drug Administration approved the expanded use of the 9-valent human papillomavirus (HPV) vaccine for individuals aged 27 to 45 years.(1) In 2019, the Centers for Disease Control and Prevention and the Advisory Committee on Immunization Practices released guidelines recommending shared decision-making between providers and patients aged 27 to 45 years considering vaccination, emphasizing individual risk assessment.(2) With limited data regarding vaccination uptake since regulatory approval, we analyzed HPV vaccination rates among women aged 27 to 45 years before and after the guideline change. STUDY DESIGN: The IBM Watson Health MarketScan and Multi-State Medicaid MarketScan databases used for analysis included medical claims for inpatient and outpatient services for more than 50 million commercially insured individuals and 7 million Medicaid beneficiaries in multiple geographically dispersed states.(3) The study was deemed nonhuman subjects research by our institution's institutional review board. Women aged 27 to 45 years with commercial or Medicaid coverage who had an index HPV vaccination during 2017 to 2019 were selected. HPV vaccine administration was captured using Current Procedural Terminology codes and National Drug Codes. Data were analyzed by quarter with subjects included in the analysis of a given quarter if they had insurance coverage for that entire quarter and did not have any previous vaccination claim. The trends were analyzed using a linear regression model. RESULTS: A total of 6,256,503 commercially insured women aged 27 to 45 years and 2,402,757 women with Medicaid were identified (Supplemental Table). Among those commercially insured, HPV vaccination rose from 45 (0.01%) in the first quarter of 2017 to 3049 (0.10%) in the fourth quarter of 2019 (P<.001) (Figure, A). For Medicaid beneficiaries, HPV vaccination increased from 125 (0.01%) to 715 (0.05%) during the same period (P<.01). When stratified by age group, HPV vaccination rates increased in each age strata between the first quarter of 2017 and fourth quarter of 2019 (Figure, B and C). During this period, the HPV vaccination rate among those commercially insured rose from 334 (0.04%) to 1190 (0.13%) for those aged 27 to 32 years, from 42 (0.004%) to 973 (0.10%) in those aged 33 to 38 years, and from 29 (0.002%) to 864 (0.07%) in those aged 39 to 45 years. There were similar trends in the Medicaid cohort. CONCLUSION: With the recent expansion of HPV vaccination eligibility among adults aged 27 to 45 years, we identified an increase in index vaccination uptake among women in this age group from 2017 to 2019; however, it was a very small percentage overall. These low overall rates may be attributed to previous vaccination at an earlier age coupled with slow uptake given uncertain population-level benefits and concerns regarding the cost-effectiveness of widespread HPV vaccination in this age group.(4) Although previous studies used self-reporting to assess vaccination trends, our use of the billing data allowed us to capture women with insurance claims for the vaccine.(5) We recognized several limitations. In this cross-sectional study, we have limited longitudinal data regarding previous vaccination history, including women who received the vaccine outside of insurance, possibly underestimating the actual vaccination rate. However, theoretically, the goal of our analysis was to provide an estimate of trends in vaccine allocation among women aged 27 to 45 years. Moving forward, it is important to understand the clinical characteristics of older adults receiving a vaccination and the financial impact expanded vaccination will have on the healthcare system.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "370d805b5c554f43131be095b90bdee6",
  "timestamp": "2025-05-15T03:28:46.343813"
}