{
  "id": 7091,
  "title": "Comprehensive understanding of schizophrenia and its treatment",
  "abstract": "An overview of schizophrenia is presented, including diagnostic criteria, etiology, neurologic findings, pharmacotherapy options, quality-of-life issues, and the financial impact of the disease. Schizophrenia is a chronic disease characterized by positive symptoms, negative symptoms, mood symptoms, and cognitive deficits, Often comorbid substance abuse is present. Schizophrenia accounts for 20% of all hospital bed-days and over 50% of all psychiatric beds in the United States. There is a strong genetic component to schizophrenia, and other possible contributing factors are explored. The diagnostic workup should include a detailed longitudinal history, mental status exam, physical and neurologic exams, and laboratory tests. A magnetic resonance imaging scan can rule out structural causes of psychosis and should be considered at the time of diagnosis. Treatment is based on a biopsychosocial model including pharmacotherapy in combination with individual, group, and family therapies. Rather than classifying antipsychotics as typical or atypical, a new classification scheme has been proposed based on risk of causing extrapyramidal symptoms and tardive dyskinesia (TD), effect on prolactin level, and efficacy profile: first-generation or traditional agents (e,g., chlorpromazine and haloperidol); second-generation agents (e,g,, risperidone and ziprasidone); and third-generation agents (e.g., clozapine, olanzapine, and quetiapine). The binding affinities of antipsychotics in the brain help explain the mechanisms by which different antipsychotics alleviate specific symptoms of schizophrenia, as well as cause specific adverse effects. Improved cognition, fewer depressive and mood symptoms, and decreased risk of TD associated with third-gene ration antipsychotics have improved the quality of life for patients with schizophrenia.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "372074af948639cc7dc66caf98f54c69",
  "timestamp": "2025-05-15T03:05:03.493916"
}