{
  "id": 4071,
  "title": "The evolution of Analytical Hierarchy Process (AHP) as a decision making tool in property sectors",
  "abstract": "In the 1970s, Analytical Hierarchy Process (AHP) has been introduced accidentally by Saaty [4] as a tool to allocate resources and planning needs for the military. However, due to its ability to identify the weightage of variables efficiently in research, it has become popular in many sectors. Basically, AHP is a tool in decision making that arranges the variables into a hierarchical form in order to rank the importance of each variable. Leading to the weightage calculation of the variables indirectly researchers in all over the world also have discovered that AHP can be modified and used not only for military but in any sectors as well. From the military sector, the modification of AHP has been widely used in other sectors such as automotive, medical, education, business and also administration. It has also been discovered that AHP has given an impact in the property market field. The application of AHP in the property market has taken place in many ways such as assessment of building quality and performance, tenants perception and expectation, identification of the tenants or occupiers needs, investment portfolio as well as grading and classification. In a global context, the advanced AHP modification has been used in property research. However, in Malaysia, only a few property research had used AHP nevertheless, it has shown positive development. Therefore, this paper aims to identify the evolution of the AMP usages in a global and local context, especially in property sectors. The findings from this paper will highlight some critical issues in using AMP in property sectors and provides some suggestions for improving the use of it.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3723b99a2789588e3daea072e3a7a45b",
  "timestamp": "2025-05-15T01:23:27.369383"
}