{
  "id": 7074,
  "title": "Next Generation Agricultural Stress Index System (ASIS) for Agricultural Drought Monitoring",
  "abstract": "Over the past 40 years, drought has affected more people in the world than any other natural hazard, affecting large segments of the population and destroying the natural resource base, livestock and livelihoods. Recent projections show that drought events are expected to increase in frequency and intensity due to climate change. According to studies conducted by the Food and Agriculture Organization of the United Nations (FAO), 83% of all damages and losses caused globally by drought between 2006 and 2016 have been absorbed by agriculture, putting a large part of the world's population at risk of food insecurity. This study shows the advantage of scaling-up FAO's agricultural drought monitoring and early warning system (ASIS) and building the bridge with the anticipatory action, drought financial mechanisms, social protection and other initiatives for preventing the deterioration of food security and strengthening resilience. The results of the methodology that is based on and supported by the digital innovation, machine learning, matured knowledge and experiences accumulated over the past 10 years are illustrated with practical examples from different countries, ecological environments and crops. A fused time series of Advanced Very-High-Resolution Radiometer (AVHRR) data from Meteorological Operational satellite (METOP) and National Oceanic and Atmospheric Administration (NOAA) was used to produce a consistent time series of a vegetation health index (VHI) at 1 km spatial resolution from 1984 to present. VHI is multiplied by the crop coefficient (kc) to provide more responsiveness to the VHI anomaly that occurs during sensitive phenological phases to water stress such as a flowering and grain filling. The weighted VHI (wVHI) is integrated from the start of the season (SOS) up to the end of season (EOS). Once the temporal analysis of wVHI is completed, the spatial average is calculated using the values of pixels within a specific crop mask and administrative unit. The system proposed different vegetation indices to assess the impact of drought in agriculture; including an agricultural drought forecast that provide more time to the decision makers for implementing anticipatory actions to mitigate the drought in agriculture. Next generation agricultural stress index system (ASIS) offers full capabilities to support: parametric crop insurance, social protection schemes, early action, national drought management plans and to guide public investments.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3726a9b81d66b29df60b1bc1f1643e12",
  "timestamp": "2025-05-15T03:05:03.377994"
}