{
  "id": 7719,
  "title": "Dentists' situation and their needs during the COVID-19 pandemic in Nepal: an online questionnaire survey",
  "abstract": "Background During the coronavirus disease (COVID-19) pandemic, ordinary dental services were sustained in Nepal. Because a dental practice is considered to involve a high risk of infection, the needs of dentists should be identified, and demand-driven support should be provided. The purpose of this study was to investigate the situation and needs of dentists during the COVID-19 pandemic in order to guide demand-driven support. First, we investigated how the situation of Nepali dentists differed according to their types of practices between private clinics and university/government hospitals. Second, we assessed the characteristics of dentists demanding four types of support: financial, material, technical, and guidelines/guidance support. Methods A cross-sectional online questionnaire survey was conducted between July 28th and August 7th 2020. Closed-ended questions were prepared regarding behavior, material availability, economic and psychological impacts, training, and the main support dentists wanted to receive. The situation of dentists between private clinics and university/government hospitals was determined using a chi-squared test for each variable. To examine the association between the characteristics of dentists and four types of support, multivariable logistic regression analyses were used to estimate adjusted odds ratios (ORs) with a 95% confidence interval (CI) for each variable. Results There were 352 dentists (137 males and 215 females) included in the analysis. Private clinic dentists experienced a bigger economic impact and demanded financial support that 45.5% of them did not receive a salary, compared to 18.9% in university/government hospitals. On the contrary, university/government hospitals experienced lack of PPE and demanded material support that 79.8% had personal protective equipment, compared to 92.5% in private clinics. Financial support was demanded significantly more by male than female dentists (ORs = 5.56; 95% CI = 2.96-10.45). Material support was demanded significantly more by dentists who received training regarding COVID-19 management (ORs = 1.96; 95% CI = 1.01-3.81). Technical support was demanded significantly less by male dentists (ORs = 0.44; 95% CI = 0.23-0.83). Guideline/guidance support was demanded significantly more by dentists who answered that Nepal Dental Association provided appropriate support (ORs = 2.21; 95% CI = 1.25-3.91). Conclusion This study articulated the diverse needs of Nepali dentists during the COVID-19 pandemic. Demand-driven support should be provided in the future.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "373a4e8a100450e35b6461558f6bd7e8",
  "timestamp": "2025-05-15T03:11:38.432966"
}