{
  "id": 6351,
  "title": "A geographic comparison of the prevalence and risk factors for postnatal depression in an Australian population",
  "abstract": "Objective: This study sought to compare the contribution of demographic and psychosocial variables on the prevalence of, and risk for, PND in urban and rural women. Methods: Demographic, psychosocial risk factor and mental health data was collected from urban (n=908) and rural (n=1,058) women attending perinatal health services in Victoria, Australia. Initial analyses determined similarities and significant differences between demographic and psychosocial variables. The association between these variables and PND case/non-case was evaluated using logistic regression analysis. Results: There were a number of significant differences between the two cohorts in terms of socio-economic status (SES), age, marital status and past history of psychopathology Antenatal depression was more common in the urban group compared to the rural group (8.5% vs 3.4%, p=0.006); there was no significant difference in the prevalence of PND (6.6% vs 8.5%, p=0.165). For urban mothers, antenatal EPDS score was the best predictor of PND. For rural mothers antenatal EPDS score, SES and psychiatric history had a significant influence on postnatal mood. Conclusions: Findings confirm the contribution of established risk factors such as past psychopathology, antenatal EPDS score and SES on the development of PND and reiterate the need for procedures to identify and assess psychosocial risk factors for depression in the perinatal period. Other predictors such as efficacy of social support and perceived financial burden may strengthen statistical models used to predict PND for women living in a rural setting.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3762bea20204f838696d3b42c16c098c",
  "timestamp": "2025-05-15T02:57:07.761688"
}