{
  "id": 9290,
  "title": "Knowledge, Attitudes and Practices Towards Seasonal Influenza and Vaccine among Private High School Students in Connecticut",
  "abstract": "Background: The United States suffered from its worst influenza season since 2009 during the winter of 2017-2018. High school is prone to influenza outbreak due to the high density of students and close social spaces. In order to understand the weak points of knowledge, attitudes and practices towards seasonal influenza and its vaccine among high school students, a cross-sectional questionnaire study was conducted in Connecticut. Methods: From March to May, 2018, a close-ended self-administered questionnaire with 24 multiple choice questions about the knowledge, attitudes and practices towards seasonal influenza and vaccine was distributed to all the enrolled students in Suffield Academy, Connecticut. The knowledge score was calculated for each student, which was compared across demographic categories. Factors associated with uptake of seasonal influenza vaccine were explored using multivariate logistic regression. Results: 60% of the students responded to the questionnaire, of whom 228 were included in analysis. The number of respondents was balanced across grades, of whom 10.5% were international students. The average knowledge score was 11.6 +/- 1.4 out of 14 points. The score of international students was significantly lower than that of domestic students (p<0.001). Only 56.6% of students recognized that flu might cause serious complications, and nearly 60% mistakenly believed flu could be transmitted by food or blood. Most students get their flu knowledge from school (68.4%), while other information sources like public media and internet were underused. 84.2% and 57.9% students believed in the safety and effectiveness of seasonal flu vaccine, while few students felt a high risk to get a flu or to develop into severe illness (25.4% and 9.6% respectively). Respondents showed good compliance to preventive behaviors like wash hands and avoid contact with patients, and 60.1% of them got the flu shot annually in the past 3 years. High knowledge scores (OR=1.34, 95% CI 1.05-1.72), high perceived vaccine safety (OR=4.01, 95% CI 1.60-10.00) and effectiveness (OR=2.37, 95% CI 1.26-4.45) were significantly associated with vaccine uptake behavior after adjusting for gender, grade and nationality. The main reason for no vaccination was afraid of the pain of injection, while financial cost was the least consideration. The most persuasive messages focused on the direct and indirect benefits of the vaccine. Conclusion: More knowledge of influenza and positive attitudes towards the safety and effectiveness of seasonal influenza vaccine are positive predictors for vaccine uptake. Students tend to underestimate the risk of infection and the severity of the illness, and have misconception on the transmission mode of influenza. Future health promotion activities should improve the weak points of knowledge and emphasize the benefits of vaccination, with more attention paid to international student study in the US.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3773037d9446b31a90644c18867f2848",
  "timestamp": "2025-05-15T03:27:25.000002"
}