{
  "id": 9335,
  "title": "The Dawn of next generation DNA sequencing in myelodysplastic syndromes- experience from Pakistan",
  "abstract": "Background Myelodysplastic syndromes (MDS) are clonal disorders of hematopoietic stem cells exhibiting ineffective hematopoiesis and tendency for transformation into acute myeloid leukemia (AML). The available karyotyping and fluorescent in situ hybridization provide limited information on molecular abnormalities for diagnosis/prognosis of MDS. Next generation DNA sequencing (NGS), providing deep insights into molecular mechanisms being involved in pathophysiology, was employed to study MDS in Pakistani cohort. Patients and methods It was a descriptive cross-sectional study carried out at National institute of blood diseases and bone marrow transplant from 2016 to 2019. Total of 22 cases of MDS were included. Complete blood counts, bone marrow assessment and cytogenetic analysis was done. Patients were classified according to revised WHO classification 2016 and IPSS score was applied for risk stratification. Baseline blood samples were subjected to analysis by NGS using a panel of 54 genes associated with myeloid malignancies. Results The median age of patients was 48.5 +/- 9.19 years. The most common presenting complaint was weakness 10(45.45%). Cytogenetics analysis revealed abnormal karyotype in 10 (45.45%) patients. On NGS, 54 non-silent rare frequency somatic mutational events in 29 genes were observed (average of 3.82 (SD +/- 2.08) mutations per patient), including mutations previously not observed in MDS or AML. Notably, two genes of cohesin complex, RAD21 and STAG2, and two tumor suppressor genes, CDKN2A and TP53, contained highest number of recurrent non-silent somatic mutations in the MDS. Strikingly, a missense somatic mutation p.M272Rof Rad21 was observed in 13 cases. Overall, non-silent somatic mutations in these four genes were observed in 21 of the 22 cases. The filtration with PharmGKB database highlighted a non-synonymous genetic variant rs1042522 [G > C] located in the TP53. Genotype GG and GC of this variant are associated with decreased response to cisplatin and paclitaxel chemotherapy. These two genotypes were found in 13 cases. Conclusion Sequencing studies suggest that numerous genetic variants are involved in the initiation of MDS and in the development of AML. In countries like Pakistan where financial reservation of patients makes the use of such analysis even more difficult when the availability of advanced techniques is already a prevailing issue, our study could be an initiating effort in adding important information to the local data. Further studies and large sample size are needed in future to enlighten molecular profiling and ultimately would be helpful to compare and contrast the molecular characteristics of Asian versus global population.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "37750f4aee8c01c7558e760f3912c9c3",
  "timestamp": "2025-05-15T03:27:53.347354"
}