{
  "id": 9240,
  "title": "Geopolitical risk and corporate tax behavior: international evidence",
  "abstract": "PurposeThis study examines the association between geopolitical risk (GPR) and corporate tax, which is a major source of revenue for the government and a significant explicit cost for firms. The authors use a comprehensive measure of GPR to study its effects on corporate taxes by using an international sample.Design/methodology/approachThe authors adopt the geopolitical measure constructed by Caldara and Iacoviello (2022) as a proxy for GPR and cash-effective tax rate benchmarked with statutory tax rate to measure corporate tax avoidance. The authors employ panel regression with fixed effects (FEs) to investigate the impact of GPR on corporate tax avoidance. The authors also conduct a battery of robustness tests to ensure the strength of the study's results.FindingsThis study's empirical results indicate that sample firms increase their tax avoidance amid increasing GPR. Further analyses show that financial constraints incentivize firms to avoid taxes during rising geopolitical tensions. The authors also provide evidence on the role of firm-level and country-level governance in weakening the association between GPR and tax avoidance.Practical implicationsPolicymakers and governments may strengthen the enforcement rule to limit aggressive tax practices of corporates during GPR to balance fiscal deficit. In addition, this study sheds light on the debate among administrators and politicians over the efficacy of current tax laws and governance structures in the presence of heightened GPR.Originality/valueThe authors extend the literature on GPR by analyzing its effect on corporate tax avoidance. Unlike existing single-country studies, the authors use a cross-country setup to investigate the impact of GPR on tax avoidance, making this study's results more generalizable as the authors control for a host of country, industry, and time factors. Apart from political uncertainty, terrorism, and climatic issues, the authors document GPR as a strong macroeconomic driver of corporate tax avoidance. The authors make a new contribution to the literature on the moderating role of governance and institutional factors on the association between tax avoidance and GPR in an international context. The authors also contribute to the literature on macroeconomic determinants of tax avoidance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3777570000ed44f49d1f9ea0ce36e03c",
  "timestamp": "2025-05-15T03:26:54.579817"
}