{
  "id": 367,
  "title": "Adoption of deep learning Markov model combined with copula function in portfolio risk measurement",
  "abstract": "In order to accurately describe the risk dependence structure and correlation between financial variables, a scientific financial risk assessment was carried out, and the basis for accurate financial decision-making was provided; the basic theory of copula function is established first, and the mixed copula model is constructed; then, the hybrid copula model is nested in a hidden Markov model (HMM); the risk dependences among banking, insurance, securities and trust industries are analysed, and the Copula-Garch model is constructed for empirical analysis of investment portfolio; finally, the deep learning Markov model is adopted to predict the financial index. The results show that the mixed copula model based on the HMM is more effective than the single copula model and the mixed copula model. The empirical structure shows that among the four major financial industries in China, banking and insurance industries have strong interdependence and a high probability of risk contagion. The investment failure rate under 95%, 97.5% and 99% confidence intervals calculated by the Copula-Garch model is 4.53%, 2.17% and 1.08%, respectively. Moreover, the errors of the deep learning Markov model in stock price prediction of Shanghai Pudong Development Bank (sh600000), Guizhou Moutai (sh600519) and China Ping An Insurance (sh601318) are 2.56%, 2.98% and 3.56%, respectively, which indicates that the four major financial industries in China have strong interdependence and risk contagion so that the macro or systemic risks may arise, and the deep learning Markov model can be adopted to predict the stock prices.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "377b08700b343baddcd2fd86e5e6e7fb",
  "timestamp": "2025-05-15T01:37:32.404651"
}