{
  "id": 4876,
  "title": "Distributional health and financial consequences of increased cigarette tax in Iran: extended cost-effectiveness analysis",
  "abstract": "Background To assess the potential impact of a tax-induced cigarette price increase on financial and health outcomes by different socioeconomic groups. Methods In a modeled condition using pooled cross-section data from Household Income and Expenditure Survey (2002-2017) and Iran 2019 population data, a methodology of an extended cost effectiveness analysis (ECEA) was applied to model the impact on cigarette consumption of hypothetically increased cigarette tax. The methodology was employed to evaluate: [1] health benefits (premature deaths averted); [2] health expenditures regarding smoking-related disease treatment averted; [3] additional tax revenues raised; [4] change in household expenditures on cigarettes; and [5] financial risk protection among male Iranian smokers in a time span of 60 years following a one-time increase in cigarette price of 75%. The Stata version 15.1 (StataCorp., College Station, TX, USA) was used to perform the relevant analysis and estimate regression models. Results A 75% increase in cigarettes price through taxation would reduce the number of smokers by more than half a million, 11% of them in the poorest quintile; save about 1.9 million years of life (11% of which would be gained in the lowest quintile compared to 20% in the highest one); eliminate a total of US$196.4 million of health expenditures (9% of which would benefit the bottom quintile). Such a policy could raise the additional annual tax revenues by roughly US$ 1 billion, where the top two quintiles bear around 46% of the total tax burden. We estimated that the tax increase would avert an estimated 56,287 cases of catastrophic expenditure that wholly concentrated among the bottom two expenditure quintiles. Conclusion Increasing cigarette tax can provide health and financial benefits, and would be pro-poor in terms of health gains, Out-of-Pocket (OOP) savings, and financial risk protection against smoking-related diseases.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "377faf4d5c002024ec2c9f93b2d1ddc8",
  "timestamp": "2025-05-15T02:42:04.841647"
}