{
  "id": 6017,
  "title": "The social dimension of academic success. An analysis with a focus on second generation immigrant students",
  "abstract": "Empirical findings from school-based educational research in Austria show that students with a migrant background have fewer educational opportunities than their native peers. However, the situation of migrants at Austrian universities has been little researched. Using data from the Student Social Survey 2019, a broad survey of all students in Austria, binary-logistic regression models show that second generation immigrant students consider dropping out of university more often than autochthonous students. On the one hand parental education plays a greater role for second-generation migrants, on the other hand, migration-specific differences cannot be explained by parental education. This is also the case when additional factors related to the life situation, such as employment and financial situation, are taken into account. Including current study characteristics, such as social and academic integration and assessment of academic performance, the migration background only has a significant effect when considered intersectionally in combination with the parents' education: Less educated students with a migration background have a significantly higher risk of dropping out than other students. The risk of dropping out also varies according to the region of origin of their parents, with those with roots in EU third countries showing an increased risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3785d888d56db7ced9447aa143ba0b88",
  "timestamp": "2025-05-15T02:54:03.326881"
}