{
  "id": 7449,
  "title": "The impact of adding cost information to a conversation aid to support shared decision making about low-risk prostate cancer treatment: Results of a stepped-wedge cluster randomised trial",
  "abstract": "BackgroundDecision aids help patients consider the benefits and drawbacks of care options but rarely include cost information. We assessed the impact of a conversation-based decision aid containing information about low-risk prostate cancer management options and their relative costs. MethodsWe conducted a stepped-wedge cluster randomised trial in outpatient urology practices within a US-based academic medical center. We randomised five clinicians to four intervention sequences and enroled patients newly diagnosed with low-risk prostate cancer. Primary patient-reported outcomes collected postvisit included the frequency of cost conversations and referrals to address costs. Other patient-reported outcomes included: decisional conflict postvisit and at 3 months, decision regret at 3 months, shared decision-making postvisit, financial toxicity postvisit and at 3 months. Clinicians reported their attitudes about shared decision-making pre- and poststudy, and the intervention's feasibility and acceptability. We used hierarchical regression analysis to assess patient outcomes. The clinician was included as a random effect; fixed effects included education, employment, telehealth versus in-person visit, visit date, and enrolment period. ResultsBetween April 2020 and March 2022, we screened 513 patients, contacted 217 eligible patients, and enroled 117/217 (54%) (51 in usual care, 66 in the intervention group). In adjusted analyses, the intervention was not associated with cost conversations (& beta; = .82, p = .27), referrals to cost-related resources (& beta; = -0.36, p = .81), shared decision-making (& beta; = -0.79, p = .32), decisional conflict postvisit (& beta; = -0.34, p= .70), or at follow-up (& beta; = -2.19, p = .16), decision regret at follow-up (& beta; = -9.76, p = .11), or financial toxicity postvisit (& beta; = -1.32, p = .63) or at follow-up (& beta; = -2.41, p = .23). Most clinicians and patients had positive attitudes about the intervention and shared decision-making. In exploratory unadjusted analyses, patients in the intervention group experienced more transient indecision (p < .02) suggesting increased deliberation between visit and follow-up. DiscussionDespite enthusiasm from clinicians, the intervention was not significantly associated with hypothesised outcomes, though we were unable to robustly test outcomes due to recruitment challenges. Recruitment at the start of the COVID-19 pandemic impacted eligibility, sample size/power, study procedures, and increased telehealth visits and financial worry, independent of the intervention. Future work should explore ways to support shared decision-making, cost conversations, and choice deliberation with a larger sample. Such work could involve additional members of the care team, and consider the detail, quality, and timing of addressing these issues. Patient or Public ContributionPatients and clinicians were engaged as stakeholder advisors meeting monthly throughout the duration of the project to advise on the study design, measures selected, data interpretation, and dissemination of study findings.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3793452fb928f5c2c7b29911180276b1",
  "timestamp": "2025-05-15T03:08:37.919323"
}