{
  "id": 1316,
  "title": "An analysis of spatio-temporal landscape patterns for protected areas in northern New England: 1900-2010",
  "abstract": "Landscape ecology theory provides insight about how large assemblages of protected areas (PAs) should be configured to protect biodiversity. We adapted these theories to evaluate whether the emergence of decentralized land protection in a largely private landscape followed the principles of reserve design. Our objectives were to determine: (1) Are there distinct clusters of PAs in time and space? (2) Are PAs becoming more spatially clustered through time? and (3) Does the resulting PA portfolio have traits characteristic of ideal reserve design? We developed an historical dataset of the PAs enacted since 1900 in the northern New England region of the US. We conducted spatio-temporal clustering, landscape pattern, and aggregation analyses at both the landscape scale and for specific classes of land ownership, conservation method, and degree of protection. We found the frequency of PAs increased through time, and that area-weighted clusters of PAs were heavily influenced by a few recent large PAs. PA clustering around preexisting PAs was driven primarily by establishment of large PAs focused on natural resource management, rather than strict reserves. Since 1990, the complete portfolio has increased in aggregation, but reserve patches have become less aggregated and smaller, while patches that allow extractive uses have become more aggregated and larger. Our extension of landscape ecology theory to a diverse portfolio of PAs underscores the importance of prioritizing conservation choices in the context of existing PAs, and elucidates the landscape scale effects of individual actions within a portfolio of protected areas.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3795e60dc7ebe4cd1b4cfad8f6b279b7",
  "timestamp": "2025-05-15T00:54:24.652602"
}