{
  "id": 4122,
  "title": "Synergy frontier of multi-factor stock selection model",
  "abstract": "The classical efficiency frontier  emphasizes the combination of negatively correlated or low-correlated portfolios to reduce the diversifiable risk of the investment portfolio. While the synergy frontier  focuses on combining stock selection factors or models with synergy  to strengthen the ability to increase the return rate of the stock selection model. Therefore, to raise the return, the focus of the multi-factor model is to discover the synergy effects of stock-picking factors. To systematically discover the synergy of stock-picking factors, two profitability factors, ROE and ROC, and two value factors, P/B and P/S were chosen. Then stock picking models that express various styles were systematically generated by means of weighted scoring approach and mixture design. The polynomial regression analysis was employed to build the return and risk models. Then a set of optimal portfolios that offer the highest expected return for a set of various levels of risk can be generated through solving an optimization model. We used the S & P 500 constituent stocks as the stock selection pool. The results showed that (1) There are strong synergy effects of return between the two profitability factors, ROE and ROC, and the value factor, P/B. (2) The relations between factor weights and risk of portfolios are rather linear, which shows that there are no synergy effects of risk between profitability factors and value factors. (3) There is synergy rotation in stock market, and the momentum strategy can overcome the rotation phenomenon and significantly improve the investment performance.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "37ce51afaa844d48541a70ee1055a1c6",
  "timestamp": "2025-05-15T01:23:58.106309"
}