{
  "id": 2691,
  "title": "Secure and Fraud Proof Online Payment System for Credit Cards",
  "abstract": "Credit card fraud is one of the most critical threats affecting individuals and companies worldwide, particularly with the growing number of financial transactions involving credit cards every day. The most common threats are likely to come from database breaches and identity theft. All these threats put the security of financial transactions at severe risk and require a fundamental solution. This paper aims to suggest a secure online payment system that significantly improves credit card security. Our system can be particularly resilient to potential cyber-attacks, unauthorized users, man-in-the-middle, and guessing attacks for credit card number generation or illegal financial activities by utilizing a secure communication channel between the cardholder and server. Our system uses a shared secret and a verification token that allow both sides to communicate through an encrypted channel. Furthermore, our system is designed to generate a one-time credit card number at the user's machine that is verified by the server without sharing the credit card number over the network. Our approach combines machine learning (ML) algorithms with unique temporary credit card numbers in one integrated system, which is the first approach in the online credit card protection system. The new security system generates a one-time-use credit card number for each transaction with a predetermined amount of money. Simultaneously, the system can detect potential fraud utilizing ML algorithm with new critical features such as the IMEI or IP address, the transaction's location, and other features.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "37d1d0d448911eb6204c23605ec6cbc7",
  "timestamp": "2025-05-15T02:18:06.213495"
}