{
  "id": 7942,
  "title": "Neighborhood Environment and Child Health in Immigrant Families: Using Nationally Representative Individual, Family, and Community Datasets",
  "abstract": "Purpose: This study aimed to examine neighborhood effects on the physical and socioemotional health of children from immigrant families, after controlling for parents' demographic characteristics, socioeconomic status, acculturation, and health care issues. Design: Pooled cross-sectional data were merged with community profiles. Setting: The United States in 2013, 2014, and 2015. Participants: 10,399 children from immigrant families in the 2013-2015 National Health Interview Surveys and the U.S. Census Data. Measures: Both objective and subjective measures of neighborhood environments were assessed, including neighborhood physical disorder, socioeconomic status, demographic composition, community resources, and social trust. Analysis: Descriptive statistics, logistic regression models. Results: About half of the sampled children were male (51%); 68% were white; 56% were of Hispanic; and 34% were school-aged. Three neighborhood factors-neighborhood trust, area-level poverty rate, and the presence of primary care physician-were identified as significant predictors for child health outcomes. Foreign-born population, green space, and food desert were not significant. At the individual level, parents' racial and ethnic minority status, non-marital status, and healthcare issues were found to be risk factors. Families' financial resources and parental education were identified as protective factors of socioemotional health. Conclusion: Intervention approaches to build on neighborhood trust may have broad potential to improve child outcomes. Programs focusing on immigrant families with children in high poverty neighborhoods should be a high priority.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "37d8707d0ccc18aee90e106d030b1e1a",
  "timestamp": "2025-05-15T03:13:30.690050"
}