{
  "id": 4972,
  "title": "The Effects of Multiple Dimensions of Risk and Protective Factors on Depressive Symptoms Among Nonresident African American Fathers",
  "abstract": "Compared to other groups, African American men experience proportionately greater adverse social and economic circumstances, which have been linked to poor mental health. A growing body of literature has begun to examine depressive symptoms among African American men; however, limited literature has examined the concurrent contributions of risk and protective factors among nonresident African American fathers. This study examined the relative contribution of perceived financial strain, perceived neighborhood characteristics, and interpersonal stress on depressive symptoms among 347 nonresident African American fathers. Social support was examined as a protective factor for depressive symptoms. Results from hierarchical regression analyses indicated interpersonal stress was associated with depressive symptoms even after controlling for perceived financial strain, perceived neighborhood characteristics, and specific sociodemographic factors. Additionally, among fathers with high interpersonal stress, having more social support buffered the negative effect of interpersonal stress on depressive symptoms. Findings suggest experiencing strain from multiple dimensions can increase the risk of depressive symptoms among nonresident African American fathers. We also found that interpersonal stress was especially harmful for mental health. Family service providers and mental health professionals should incorporate stress management techniques to reduce stressful interpersonal relationships as a way to lower depressive symptoms among nonresident African American fathers.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "37f19cc45817ee849579ebd95588b20a",
  "timestamp": "2025-05-15T02:43:06.694965"
}