{
  "id": 4345,
  "title": "The varying impact of financial development on the environmental footprint due to geopolitical risk: The difference between high- and middle-income countries",
  "abstract": "The global debate among policy makers and environmentalists concerns how environmental degradation can be minimized without impeding economic growth. Because of intensification of geopolitical uncertainty, achieving this balance has become difficult. To contribute to breaking this deadlock, our research explores the interlinkage among financial development, geopolitical risk, and the environmental footprint in 40 high-and middle-income countries from 2000 to 2018. The estimated results obtained from a novel quantile regression show the heterogeneous envi-ronmental impacts of bank credit, the stock market, and geopolitical uncertainty across the quantile distribution of the environmental footprint and two country groups. Although the credit market tends to reduce the environmental footprint in high-income countries with moderate environ-mental quality, it exacerbates environmental degradation in middle-income countries. Similarly, stock market development improves the envi-ronment in high-income countries but harms it in middle-income countries that have extremely good and poor environmental quality. Geopolitical risk is found to escalate environmental degradation in both high-and middle-income countries. In addition, the empirical outcomes confirm the moderating role of geopolitical risk on the linkage between financial development and environmental footprint. In high-income countries, escalating geopolitical risk has two contrasting effects on the environmental impact of financial development. Whereas high geopolitical un-certainty reduces the harmful impact of bank credit on the environment, it magnifies the harmful impact of the stock market. In middle-income countries, high geopolitical risk reduces the harmful impact of both bank credit and the stock market on environmental sustainability. These complex relationships offer new implications for policy makers in the transition to a sustainable environment.Copyright (c) 2023 Borsa Istanbul Anonim S,irketi. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "380686827a7988cdbe03e3c8aa459135",
  "timestamp": "2025-05-15T02:36:05.227488"
}