{
  "id": 8345,
  "title": "Ridership exceedance exposure risk: Novel indicators to assess PM2.5 health exposure of bike sharing riders",
  "abstract": "Identifying the fine particulate matter (PM2.5) exposure risk for bicycle riders is crucial for promoting the development of theory and technology in transportation-related air pollution assessment as well as urban health planning. Previous studies have employed daily mean PM2.5 concentrations and designed routes to evaluate air pollution exposure risk. However, because the daily mean PM2.5 concentrations cannot fully illustrate the intraday variations in PM2.5, which are typically higher than daily mean values, the adverse effects of PM2.5 concentrations remain underestimated. Moreover, the quantity and representativeness of monitoring samples make large spatial-scale and multi-temporal-scale analysis challenging. By defining hourly exceedance PM2.5 concentration and sharing bicycle rider data, two novel indicators were proposed in our study: exceedance exposure risk of PM2.5 for sharing bicycle riders (EPSR) and accumulative exceedance exposure risk of PM2.5 for sharing bicycle riders (AEPSR). Standard deviation ellipse analysis was conducted to investigate the multi-temporal variation of ESPR and AEPSR. A geographically weighted regression model was applied to quantify the relationship between city function zones and exceedance PM2.5 exposure risk for sharing bicycle riders. Results revealed that the mean values of EPSR and AEPSR during morning peak periods ranged between 0.109 min lig/ m3 and 1.27 min lig/m3 and 6.83 min lig/m3 and 43.41 min lig/m3, respectively, whereas the mean values of EPSR and AEPSR during evening peak periods ranged between 0.19 min lig/m3 and 4.28 min lig/m3 and 14.67 min lig/m3 and 357.66 min lig/m3, respectively. This implied that sharing bicycle riders were exposed to higher PM2.5-related risks during the evening than in the morning. When considering the accumulative effects, the average centers of the AEPSR moved to the north side as compared to the average centers of the EPSR. Expanding areas of EPSR shrunk by 20.25 km2. This indicated that accumulative effects aggregated spatial clusters of exceedance PM2.5 exposure risk for sharing bicycle riders more tightly to the north of the study areas. Spatiotemporal variation of EPSR and AEPSR led us to investigate the mechanism behind this phenomenon. Spatial associations between city function zones and EPSR and AEPSR showed that sharing bicycle riders experienced more severe exceedance PM2.5 exposure risk around financial/corporations and leisure service areas, with R2 values of 0.33 and 0.35, respectively. This spatial association tended to be more significant during the evening peak periods. By developing two novel indicators, the increasing health threats for bicycle riders caused by exceedance PM2.5 were investigated in this study. The mechanism results should be included for developing mitigation strategies to alleviate the adverse effects of air pollution for public rider participators and achieving the goal of eco-health cities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "380d1543effcea143ec17e5b9ab422e3",
  "timestamp": "2025-05-15T03:17:49.168543"
}