{
  "id": 1666,
  "title": "Predicting the Distress of Financial Intermediaries using Convolutional Neural Networks",
  "abstract": "Over the past 15 years, the United States has faced two major economic events - the 2008 financial meltdown and the 2019 Shadow Bank crisis. Now, it faces a new financial emergency brought on by COVID-19. Financial intermediaries comprise institutions such as banks, mutual funds, insurance companies, real estate investment trusts, among others, and are a significant part of economic stability. Too big to fail has become a well-known phrase. Therefore, being able to predict the financial distress of a financial intermediary is very important. Traditionally, the Altman Z-score (or a variation thereof), has been used to predict bankruptcy. It uses 5 key financial ratios to create an index score, or Z-score. Predicting financial distress, however, also accounts for companies that may not be currently on the path to bankruptcy, but may be in the future. Contemporary research has shown that combining sentiment analysis with ratio analysis improves the prediction. Our methodology uses both financial ratios and sentiment, but also includes the London Interbank Offered Rate (LIBOR), and the keywords Going Concern and Concentration Risk. Using a Convolutional Neural Network, we classified financial intermediaries as either distressed or not distressed with an accuracy of 88.24%.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "381096dddc87949ad1a4aad5a0e9d54e",
  "timestamp": "2025-05-15T02:06:22.383056"
}