{
  "id": 2478,
  "title": "Environmental, social and governance performance and financial risk: Moderating role of ESG controversies and board gender diversity",
  "abstract": "This study examines the consequence of environmental, social, and governance (ESG) performance on oil and gas firms' financial risk. This study uses an international sample of 70 oil and gas firms from 2010 to 2018 and applies two-stage least squares panel regression analysis to defaecate the endogeneity issue. This study finds an adverse effect of ESG performance on total risk. Board gender diversity adversely influences the total and systematic risk. Also, board gender diversity and ESG controversy have a substantial moderating effect on ESG and financial risk connection. The findings are consistent with the stakeholder, risk management and legitimacy theory. The firms that perform reasonably on ESG have lower total risk. However, the firm's negligence on ESG and involvement in ESG controversies moderates ESG-total risk nexus. Similarly, women's weak participation on board considerably moderates and escalates the association between ESG and financial risk. The findings will help investors and portfolio managers evaluate how ESG, ESG controversy, and board gender diversity influence firms' financial risk and help them make better investment decisions. Additionally, regulators can revise the ESG and ESG controversy disclosure criteria and make them accessible to all stakeholders for better decision making.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "382b79bc284bde8e9469a291c01eca99",
  "timestamp": "2025-05-15T02:15:59.827104"
}