{
  "id": 1671,
  "title": "A purchasing portfolio model for humanitarian supply chain resilience: perspectives from a development aid context",
  "abstract": "Purpose The impact of supply disruptions from unplanned events can cause goods shortage, limited responsiveness and high opportunity cost thus compromising development aid programmes' achievement targets. These situations force humanitarian aid agencies to develop new strategies for effectively managing their supplies. The purpose of this paper is to illustrate the foundation of humanitarian supply chain resilience through the development of an adapted Kraljic portfolio model. Design/methodology/approach Action research was used to adapt and validate the Kraljic portfolio model to the development aid context. The research team worked with a humanitarian aid agency in developing criterions and used Analytical Hierarchical Process (AHP) in weighting those key criterions. Findings The adapted portfolio model was able to evaluate purchases done by the aid agency by incorporating different perspectives related to the strategic importance of purchase and supply vulnerability. In particular, development aid programmes require large supplies annually. Better classification offers improved visualisation of purchases, leading to a more precise adoption of mitigation strategies and policies to minimise supply disruption risks. Research limitations/implications Adapting the Kraljic portfolio model is a stepping-stone to building humanitarian supply chain resilience. The proposed humanitarian supply chain resilience framework is based on the foundation that current humanitarian supply chain needs to be re-engineered. In order to re-engineer, the supply base strategy must first be revisited. Practical implications Many aid agencies do not have a holistic view on their purchases and commonly apply a transactional classification of purchases that only considers the consumption values. Purchasing strategies mostly focus on cost minimisation, whereas risk mitigations have been disregarded. The proposed portfolio model overcomes these drawbacks. Societal impact may be limited but development aid agencies will be able to offer more reliable aid delivery as part of their mandate. Originality/value The proposed portfolio model is among the first tool to guide humanitarian aid agencies to develop procurement strategies to alleviate supply disruptions and increase development aid programmes resilience.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "383b1917fed6a0a737000b2481bc1e18",
  "timestamp": "2025-05-15T00:58:18.372114"
}