{
  "id": 8321,
  "title": "Genetic Status Affects Disease-Specific Mortality But Not the Incidence of Local Recurrence in Patients with Uveal Melanoma",
  "abstract": "Purpose: Increased disease-specific mortality has been observed among patients with local recurrence (LR) from uveal melanoma (UM), but the underlying mechanism is unknown. The purpose of this study was to determine if copy number alterations of chromosomes 3 and/or 8q, at the time of diagnosis, increase the inci-dence of LR and if disease-specific mortality among patients with LR depends on the chromosome status of the primary tumor.Design: Retrospective cohort study.Participants: The study included 239 consecutive patients with primary UM (choroidal or ciliary body) treated with Ruthenium-106 (Ru-106) brachytherapy from January 2009 to December 2019 at a single national referral center.Methods: Cox regression modeling and Kaplan-Meier analyses were used to assess the effect of the status of chromosomes 3 and 8q on the incidence of LR and disease-specific mortality after the event of LR. Multistate models were used to illustrate the probabilities over time of patients being alive and disease-free, alive with LR, dead from UM metastases, or dead from other causes split on the status of chromosomes 3 and 8q. Main Outcome Measures: Incidence of LR and disease-specific mortality.Results: Local recurrence was observed in 42 patients (16%). Overall incidence of LR was not affected by aberrations of chromosomes 3 and/or 8q (P 1/4 0.87). Although LR occurred earlier in patients with aberrations of chromosomes 3 and/or 8q compared with patients with a normal copy number of chromosomes 3 and 8q, the median time from primary diagnosis to LR was 1.6 years (interquartile range [IQR], 1.0-2.0) and 3.2 years (IQR, 2.1-5.0), respectively. Cox regression found LR to be an independent risk factor for disease-specific mortality (hazard ratio [HR], 2.7; 95% confidence interval [CI], 1.5-5.0) among all patients, but multistate models demonstrated a low risk of disease-specific death among patients with normal chromosomes 3 and 8q status, even after an LR. Conclusions: Copy number alterations of chromosome 3 and/or 8q in the primary UM did not increase the overall incidence of LR. However, the development of an LR enhanced the risk of disease-specific mortality among patients with copy number alterations of chromosomes 3 and/or 8q. Even after an LR, disease specific mortality remained low among patients with normal copy numbers of chromosomes 3 and 8q.Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2023;130:822-829 (c) 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "383e3342c02ed3e51e715c630db59f81",
  "timestamp": "2025-05-15T03:17:49.074984"
}