{
  "id": 8994,
  "title": "fMRI study of brain activation associated with earnings management techniques in proximity to debt covenant violations",
  "abstract": "Business managers employ various earnings management techniques (EMTs) to prevent debt covenant breaches. Understanding the underlying decision-making processes related to such techniques may help a manager choose the optimal approach to avoid a violation, but these cognitive processes remain poorly understood. The current functional magnetic resonance imaging (fMRI) study aims to explore the brain activation associated with assessment and decision-making to apply three commonly employed EMTs: accounting earnings management (AEM), classification shifting (CS), and total real earnings management (REM). During the fMRI scans, fifty participating business managers read the text presentations of multiple scenarios where companies were at different proximities (FAR or CLOSE) to debt covenant violations. Then, the managers assessed the options and decided whether to apply one of the three EMTs. Behavioral results suggest that managers preferred using AEM and REM over CS to avoid debt covenant violations, and they were more likely to apply EMTs when companies were CLOSE to rather than FAR from default. The fMRI findings revealed that assessing and deciding the three techniques elicited activation in the occipital, frontal, and lateral temporal cortices regions. In addition, REM and CS were associated with more significant subcortical hippocampus regions for memory processing. REM activated the brain's motor system for actions, but CS activated the basal ganglia for delayed reward processing. Increased risk of debt covenant violation in CLOSE scenarios was linked to reduced activation in the frontal pole, superior parietal, precuneus, lingual, lateral occipital, posterior inferior temporal, and posterior cingulate gyri, suggesting decreased visual attention and emotion regulation activation during assessing and deciding to apply EMTs to avoid default risks. These activation patterns reveal shared and distinct neural processes in applying EMTs. Proximity to debt covenant violations reduces brain activation in areas tied to decision-making and emotional regulation, fostering stress-driven short-term strategies. These findings highlight financial pressure's impact on managerial behavior and emphasize the need for resilience-focused interventions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "383f2daef3582ce91787e7a949239d17",
  "timestamp": "2025-05-15T03:24:26.385574"
}