{
  "id": 4263,
  "title": "HORIZONS protocol: a UK prospective cohort study to explore recovery of health and well-being in adults diagnosed with cancer",
  "abstract": "Introduction Understanding the impact of cancer and its treatment on people's everyday lives will help prepare people for what to expect, enable health professionals to predict likely recovery trajectories and shape care management according to needs. HORIZONS will recruit people awaiting treatment and follow them up at regular intervals to assess recovery of health and well-being. Research questions What impact does cancer diagnosis and treatment have on people's lives in the short, medium and long term? What are people's health and well-being outcomes, experiences and self-management activities over time across different cancer types and what influences these? How do people connect with and relate to others in mobilising resources that enable them to self-manage the consequences of cancer and treatment? Methods and analysis HORIZONS is a multicentre, prospective cohort study exploring recovery of health and well-being in 3000 people diagnosed with breast cancer (<50 years), non-Hodgkin's lymphoma or gynaecological cancer. Recruitment will take place across National Health Service (NHS) sites in the UK between September 2016 and March 2019, before primary treatment starts. Participants will be identified through clinical teams and invited to complete questionnaires including assessments of quality of life, symptoms and functioning (Quality of Life in Adult Cancer Survivors; European Organisation for Research and Treatment Consortium Core quality of life questionnaire, EORTC-QLQ-C30), health status (EuroQol-5 dimensions, EQ-5D), self-efficacy, social support, social networks and lifestyle. Clinical data will also be collected. Descriptive statistics will characterise outcomes. Changes over time will be investigated. Factors that may influence recovery and self-management will be included in regression models to determine which influence health and well-being and self-management. Ethics and dissemination Ethics and Health Research Authority approvals granted (IRAS Project ID: 202342, REC reference number 16/NW/0425). Adopted onto the National Institute for Health Research Clinical Research Network portfolio. We will engage with our Scientific Advisory Board, Tumour Specific Expert Panels, User Reference Group, Macmillan and the University of Southampton to ensure maximum publicity and benefit.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "384281202f463954ea9cb5f27a01fbbe",
  "timestamp": "2025-05-15T01:25:23.283530"
}