{
  "id": 2640,
  "title": "A Nested Weighted Tchebycheff Multi-Objective Bayesian Optimization Approach for Flexibility of Unknown Utopia Estimation in Expensive Black-Box Design Problems",
  "abstract": "We propose a nested weighted Tchebycheff Multi-objective Bayesian optimization (WTB MOBO) framework where we built a regression model selection procedure from the ensemble of models, toward better estimation of the uncertain parameters (utopia) of the weighted Tchebycheff expensive black-box multi-objective function. In our previous work, a weighted Tchebycheff MOBO approach has been demonstrated which attempts to estimate the model parameters (utopia) in formulating the acquisition function of the weighted Tchebycheff multi-objective black-box functions, through calibration using an a priori selected regression model. However, the existing MOBO model lacks flexibility in selecting the appropriate regression models given the guided sampled data and, therefore, can under-fit or over-fit as the iterations of the MOBO progress. This ultimately can reduce the overall MOBO performance. As, in general, it is too complex to a priori guarantee a best model, this motivates us to consider a portfolio of different families (simple-to-complex) of predictive models that have been fitted with current training data guided by the WTB MOBO, and the best model is selected following a user-defined prediction root-mean-square error-based approach. The proposed approach is implemented in optimizing a thin tube design under constant loading of temperature and pressure, minimizing the risk of creep-fatigue failure and design cost. Finally, the nested WTB MOBO model performance is compared with different MOBO frameworks with respect to accuracy in parameter estimation, Pareto-optimal solutions, and function evaluation cost. This approach is generalized enough to consider different families of predictive models in the portfolio for best model selection, where the overall design architecture allows for solving any high-dimensional (multiple functions) complex black-box problems and can be extended to any other global criterion multi-objective optimization methods where prior knowledge of utopia is required.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38452f678f09abe59e0b5c69a68b7c7a",
  "timestamp": "2025-05-15T01:09:14.829840"
}