{
  "id": 8971,
  "title": "Primary care physician compensation method in medical groups - Does it influence the use and cost of health services for enrollees in managed care organizations?",
  "abstract": "Context.-Growth of at-risk managed care contracts between health plans and medical groups has been well documented, but less is known about the nature of financial incentives within those medical groups or their effects on health care utilization. Objective.-To test whether utilization and cost of health services per enrollee were influenced independently by the compensation method of the enrollee's primary care physician. Design.-Survey of medical groups contracting with selected managed care health plans, linked to 1994 plan enrollment and utilization data for adult enrollees. Setting.-Medical groups, major managed care hearth plans, and their patients/enrollees in the state of Washington. Study Participants.-Sixty medical groups in Washington, 865 primary care physicians (internal medicine, pediatrics, family practice, or general practice) from those groups and affiliated with 1 or more of 4 managed care health plans, and 200 931 adult plan enrollees. Intervention.-The effect of method of primary care physician's compensation on the utilization and cost of health services was analyzed by weighted least squares and random effects regression. Main Outcome Measures.-Total visits, hospital days, and per member per year estimated costs. Results.-Compensation method was not significantly (P>.30) related to utilization and cost in any multivariate analyses. Patient age (P<.001), female gender (P<.001), and plan benefit level (P<.001) were significantly positively related to visits, hospital days, and per member per year costs. The primary care physician's age was significantly negatively related (P<.001) to all 3 dependent measures. Conclusions.-Compensation method was not significantly related to use and cost of health services per person. Enrollee, physician, and health plan benefit factors were the prime determinants of utilization and cost of health services.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "388e56af38e59244c94e97c62bcc3760",
  "timestamp": "2025-05-15T03:24:26.264206"
}