{
  "id": 8627,
  "title": "Predictors of Landowners' Intention to Manage Emerald Ash Borer in Kentucky",
  "abstract": "Native ash species in the central hardwood region of the United States have been threatened by infestations of emerald ash borers (EAB), which have caused significant damage to the forests' ecological and economic value. Because private landowners own most of these forestlands, their knowledge, attitudes, and behavior are important in managing EAB effectively across the landscape. We conducted a mail survey of landowners in Kentucky, where EAB are spreading across the state and causing variable levels of damage depending upon how long they have been established, and assessed whether and how psychosocial and demographic factors help explain the landowner's behavioral intention to manage EAB on their property. The results of an ordinal logistic regression model, grounded in a modified theory of planned behavior framework, suggested that severity of risk perception, knowledge about management options, importance of economic objectives, and perceived group efficacy were related positively to landowners' intention to manage EAB. These findings shed light on landowners' perspective of EAB's effects and the role of psychosocial factors in their motivation to adopt EAB control options. Study Implications: Landowners' active participation can be critical in managing EAB effectively in privately owned forests. This study found that landowners' management intentions depended on their perception of EAB risks, knowledge of EAB prevention, and perceived cooperation among landowners. Raising awareness of EAB threats, educating landowners on the control options available, and promoting collaborative approaches to combat EAB at the regional scale can help increase landowners' participation in EAB management. Taking a collaborative approach is important to address such transboundary problems as EAB infestations because such an approach ensures that relevant agencies will provide landowners with continuous legal, technical, and financial support.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38a2f95ba8027f2a8acb74b0c0ddbbff",
  "timestamp": "2025-05-15T03:20:55.856529"
}