{
  "id": 9121,
  "title": "Does group affiliation impact financial constraints? Evidence from India",
  "abstract": "Purpose This study aims to primarily investigate two vital questions: First, the authors examine whether group-affiliated firms are more (less) financially constrained vis-a-vis standalone firms. The authors estimate working capital investment (WCI) to cash flow sensitivity to understand the nature of financial constraints. Second, the authors further investigate the impact of working capital level on firm values and risks between group-affiliated and standalone firms. Design/methodology/approach This paper uses balanced panel data set from the year 2012-2019. The authors employ propensity score matching to ascertain comparable firm attributes from business group and standalone firms. This process yields 280 firms (140 in each group) after controlling the firm heterogeneity between these two groups. All the models are estimated using fixed-effect regression. Findings The authors find that group affiliated firms are less financially constrained than standalone firms. The results show that WCI to cash flow sensitivity is higher in standalone firms vis-a-vis group-affiliated firms, implying that standalone firms are more financially constrained than group-affiliated firms. Second, the authors find that firm values are more sensitive to working capital level in standalone firms versus group-affiliated firms. Furthermore, the authors document that the risk of the standalone firms is less sensitive to working capital level than that of group-affiliated firms. Originality/value Most recent studies exploring the role of group affiliation in financing constraints have not controlled for heterogeneity among group-affiliated firms vis-a-vis standalone firms, which may arise due to variation in firm characteristics. Unlike prior studies, this research design ascertains comparable firm attributes between business group and standalone firms, implying firms belonging to these two groups differ by the exogeneous affiliation (business group and standalone firms). The authors document that group-affiliated firms are less financially constrained than standalone firms controlling firm-level heterogeneity between group-affiliated and standalone firms. To the best of the authors' knowledge, no such work has been previously done in general (specifically in India).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38aad6704938757ae798a5813daf0ca2",
  "timestamp": "2025-05-15T03:25:54.542962"
}