{
  "id": 9441,
  "title": "Housing loan default in Malaysia: an analytical insight and policy implications",
  "abstract": "Purpose The purpose of this paper is to examine the drivers of default in the Malaysian housing market in the light of various policy interventions by the country's central bank, and the government's expressed concern to ensure balanced growth in the market. This paper assesses the importance of considering the endogeneity of loan-to-value (LTV) in predicting housing loan default and its implications. Design/methodology/approach In this paper, the author addresses the endogeneity problem in the LTV variable using two instrumental variables (IV) in this probit regression: national residential property gains tax and the statutory reserve ratio of Bank Negara Malaysia. This study uses the instrumental variable probit model to consider endogeneity bias. This study assumes a latent (unobservable) variable (Y*), representing a borrower's tendency to default, which is associated linearly with the borrower's and loan characteristics and other variables (Xi). This study uses individual borrower-level information of 43,156 housing loan borrowers from the files of a well-established housing bank in Malaysia. Findings This study's results confirm that endogeneity causes a substantial difference in the magnitude of the estimated effects of LTV on the default tendency. At the lower values of LTV, the probability of default is over-estimated, and at the higher values, the default probability is substantially underestimated. Endogeneity bias also affects the estimated coefficients of loan and borrower characteristics. The authors find that the interest rate is less relevant in predicting loan default. Other loan characteristics, such as loan age, tenure, payment amount and the built-up area, are relevant. This study's result confirms that the borrower's location matters, and an increase in state gross domestic product per capita and an increase in the supply of residential units reduce default probability. Research limitations/implications The present study did not explore the applicability of the equity theory of default in the Malaysian housing market. This study did not assess strategic default issues and the effect of borrowers' characteristics, personality traits and self-control of Malaysian housing loan borrowers in the mortgage decision-making process. The evolving dynamics of the Malaysian housing market microstructure in property valuation remained unexplored in the present study. Practical implications The findings have crucial relevance in the decision-making process of commercial banks, the central bank and the government to frame policies to foster balanced growth and development in the housing market. The authors argue that striking a subtle balance between the concerns of financial stability and productive risk-taking by commercial banks in Malaysia remains a continuing challenge for the country's central bank. The authors also argue that designing suitable taxation policies by the government can deliver its cherished goal of balanced development in the housing market. Originality/value Empirical research on the Malaysian housing market based on micro-level data is scarce due to a paucity of relevant data. This study is based on the individual borrower-level information of 43,156 housing loan borrowers from the files of a well-established housing bank in Malaysia. In this analysis, the authors find clear evidence of endogeneity in LTV and argue that any attempts to decipher the default drivers of housing loans without addressing the issue of endogeneity may lead to faulty interpretation. Therefore, this study is unique in recognizing endogeneity and has gone deeper in identifying the default drivers in the Malaysian housing market not addressed by earlier papers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38ae43a15e8805e2e8e2dd7700809134",
  "timestamp": "2025-05-15T03:28:46.319214"
}