{
  "id": 8722,
  "title": "Association of Employees' Meal Skipping Patterns with Workplace Food Purchases, Dietary Quality, and Cardiometabolic Risk: A Secondary Analysis from the ChooseWell 365 Trial",
  "abstract": "Background Employed adults may skip meals due to time or financial constraints, challenging work schedules, or limited workplace food choices. Little is known about the relationship between employees'meal skipping patterns and workplace dietary choices and health. Objective To examine whether hospital employees' meal skipping patterns were associated with workplace food purchases, dietary quality, and cardiometabolic risk factors (ie, obesity, hypertension, and prediabetes/diabetes). Design This is a secondary cross-sectional analysis of baseline data from the Choose-Well 365 randomized controlled trial. Employees reported meal-skipping frequency in a baseline survey. The healthfulness of workplace food purchases was determined with a validated Healthy Purchasing Score (HPS) (range = 0 to 100 where higher scores = healthier purchases) calculated using sales data for participants' purchases in the 3 months before study enrollment. Dietary quality was measured with the 2015 Healthy Eating Index (range = 0 to 100 where higher score = healthier diet) from two 24-hour recalls. Cardiometabolic risk factors were ascertained from clinic measurements. Participants/setting Participants were 602 hospital employees who regularly visited workplace cafeterias and enrolled in ChooseWell 365, a workplace health promotion study in Boston, MA, during 2016-2018. Main outcome measures Primary outcomes were HPS, 2015 Healthy Eating Index, and cardiometabolic risk factors. Statistical analyses Regression analyses examined differences in HPS, 2015 Healthy Eating Index, and cardiometabolic variables by meal skipping frequency, adjusting for demographic characteristics. Results Participants'mean(standarddeviation) agewas 43.6 (12.2) years and 478 (79%) were women. Overall, 45.8% skipped breakfast, 36.2% skipped lunch, and 24.9% skipped dinner >= 1 day/week. Employeeswho skipped breakfast >= 3days/week(n = 102) had lower HPS (65.1 vs 70.4; P < 0.01) and 2015 Healthy Eating Index score (55.9 vs 62.8; P < 0.001) compared with those who never skipped. Skipping lunch >= 3 days/week and dinner >= 1 day/week were associated with significantly lower HPS compared with never skipping. Employees who worked nonstandard shifts skipped moremeals than those whoworked standard shifts. Meal skipping was not associated with obesity or other cardiometabolic variables. Conclusions Skipping meals was associated with less healthy food purchases at work, and skipping breakfast was associated with lower dietary quality. Future research to understand employees' reasons for skipping meals may inform how employers could support healthier dietary intake at work.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38c5fbc9666ff1dae27d4930018cefe7",
  "timestamp": "2025-05-15T03:21:56.590019"
}