{
  "id": 66,
  "title": "Research on internet financial risk control based on deep learning algorithm",
  "abstract": "With the rapid development of Internet technology, Internet finance has entered thousands of households, bringing a lot of convenience to people's lives. As a financial model based on Internet technology, compared with traditional bank loans, online loans have lower operating costs and faster returns, so they are developing rapidly. Providing users with better and faster services while standardizing operations has always been the development goal of various Internet finance companies. At present, many domestic Internet financial enterprises are facing many problems such as difficulty in risk control. Therefore, this paper makes full use of deep learning algorithms to build an Internet financial risk control system. After in-depth analysis and research on the deep learning algorithm, the Internet financial risk control system is divided into several modules. The project mainly includes model management module, user behavior analysis module, alarm management module, monitoring module, product management module, etc., and then by analyzing the test results of each test scenario, it is concluded that the performance test of the system design meets the actual needs of users, and simulates the test. It is carried out in accordance with the constraints and regulations of the test plan, and the performance test meets the standard. The system not only ensures the safety of the company's funds, but also helps the company to form a smooth and effective financial risk control process. This paper designs a class of effective management systems by applying deep learning algorithms to the field of Internet financial risk control.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38d0832b647b300be385f11e4e543548",
  "timestamp": "2025-05-15T01:33:48.978205"
}