{
  "id": 3548,
  "title": "Research and practice of intelligent coal mine technology systems in China",
  "abstract": "This study considered the role of coal as China's basic energy source and examines the development of the coal industry. We focused on the intelligent development of coal mines, and introduced the Chinese mode of intelligent mining in underground coal mines, which uses complete sets of technical equipment to propose classification and grading standards. In view of the basic characteristics and technical requirements of intelligent coal mine systems, we established a digital logic model and propose an information entity and knowledge map construction method. This involves an active information push strategy based on a knowledge demand model and an intelligent portfolio modeling and distribution method for collaborative control of coal mines. The top-level architecture of 5G+ intelligent coal mine systems combines intelligent applications such as autonomous intelligent mining, human-machine collaborative rapid tunneling, unmanned auxiliary transportation, closed-loop safety control, lean collaborative operation, and intelligent ecology. Progress in intelligent mining technology was described in terms of a dynamic modified geological model, underground 5G network and positioning technology, intelligent control of the mining height and straightness of the longwall working face, and intelligent mining equipment. The development of intelligent coal mines was analyzed in terms of its imbalances, bottlenecks, and the compatibility of large-scale systems. Implementation ideas for promoting the development of intelligent coal mines were proposed, such as establishing construction standards and technical specifications, implementing classification and grading standards according to mining policy, accelerating key technology research, and building a new management and control model.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38d3a77148e0073e7d91d74d99851eb9",
  "timestamp": "2025-05-15T01:18:20.525831"
}