{
  "id": 9281,
  "title": "The biochar dilemma",
  "abstract": "Any strategy towards widespread adoption of biochar as a soil amendment is constrained by the scarcity of field-scale data on crop response, soil quality and environmental footprint. Impacts of biochar as a soil amendment over a short period based on laboratory and greenhouse studies are often inconclusive and contradictory. Yet biochar is widely advocated as a promising tool to improve soil quality, enhance C sequestration, and increase agronomic yield. While substantial reviews exist on positive aspects of biochar research, almost no review to date has compiled negative aspects of it. Although biochar science is advancing, available data indicate several areas of uncertainty. This article reviews a range of negative impacts of biochar on soil quality, crop yield, and associated financial risk. This review is important because advances in biochar research demand identification of the risks (if any) of using biochar as a soil amendment before any large-scale field application is recommended. It is the first attempt to acknowledge such issues with biochar application in soil. Thus, the aims of this review are to assess the uncertainties of using biochar as a soil amendment, and to clarify ambiguity regarding interpretation of research results. Along with several unfavourable changes in soil chemical, physical and biological properties, reduction in crop yield has been reported. Relative to controls, the yield for biochar-amended soil (application rate 0.2-20% w/w) has been reduced by 27, 11, 36, 74, and 2% for rice (Oryza sativa L.) (control 3.0 Mg ha(-1)), wheat (Triticum spp. L.) (control 4.6 Mg ha(-1)), maize (Zea mays L.) (control 4.7 Mg ha(-1)), lettuce (Lactuca sativa L.) (control 5.4 Mg ha(-1)), and tomato (Solanum lycopersicum L.) (control 265 Mg ha(-1)), respectively. Additionally, compared with unamended soils, gaseous emissions from biochar-amended soils (application rate 0.005-10% w/w) have been enhanced up to 61, 152 and 14% for CO2 (control 9.7 Mg ha(-1) year(-1)), CH4 (control 222 kg ha(-1) year(-1)), and N2O (control 4.3 kg ha(-1) year(-1)), respectively. Although biochar has the potential to mitigate several environmental problems, the data collated herein indicate that a systematic road-map for manufacturing classification of biochars, and cost-benefit analysis, must be developed before implementation of field-scale application.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38d89e6ff8f883fbf3fbdbd3a8a36d51",
  "timestamp": "2025-05-15T03:27:24.968508"
}