{
  "id": 3008,
  "title": "An Advanced Deep Learning Approach for Nickel Price Prediction Model Evading Outliers Using Enhanced Multikernel LSTM",
  "abstract": "Managing Investment Portfolio in commodity trading requires focus on profit making, high earnings and effective investment returns within time bound criteria. The level of risk management is majorly decided by the trader, based on the lot size of purchase during each commodity investment. Based on the previous studies and learning from market trading, it is inferred that commodity pricing is the pivot element for strategic decision making. For the current economic trends and variations, predictions with the conventional neural network models may not provide a long-term sustainable solution. With advanced Gaussian Processes (GP) Long Short Term Memory model, predictions gained attention with higher accuracy levels. To meet advanced market trends and adapt to fluctuations in economic variants, an enhancement over Multiple Kernel - LSTM (MK-LSTM) network model along with drop out regularization with repeated cycles to evade outliers is proposed to predict market price of Nickel commodity. With experimental analysis and results derived, this approach provides better bandwidth of predicted price range as outlier detection is regularized. This study indicates better market price prediction and proposal to achieve higher returns in terms of calculation benefits for trader to respond quickly and effectively to changing market dynamics, evading over fitted and under fitted values from the dataset. This approach proposes to build a model based on Enhanced MK-LSTM with dropout regularization aiming to perform preprocessing, normalization of data, apply multiple kernel layers, evade outliers and aim for noise removal using deep learning approaches thereby enhance performance of price prediction model.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38d975024529f2e30395a92e37fdbf97",
  "timestamp": "2025-05-15T01:12:43.042872"
}