{
  "id": 3650,
  "title": "Effects of pretrial risk assessments on release decisions and misconduct outcomes relative to practice as usual",
  "abstract": "Purpose: We conducted a multi-site, quasi-experimental investigation of the effects of pretrial risk assessments on pretrial release decisions and misconduct outcomes relative to practice as usual. Methods: Using a multiple non-equivalent comparison group design, we matched 2631 pretrial defendants who received a risk assessment during a 1-year pilot period to two comparison groups of defendants who did not receive a risk assessment and were processed in the same year (n = 1580) or in the year prior to the pilot period (n = 3185). Weighted multilevel regression analyses were conducted separately for each comparison to examine effects of the pilot risk assessment condition on pretrial release and pretrial misconduct outcomes. Results: Relative to comparison groups, defendants with risk assessments were more likely to receive non-financial release. When risk assessment-guided decisions adhered to structured guidelines, defendants with risk assessments had higher rates of pretrial release and spent less time in pretrial detention. Risk assessments were associated with slightly higher rates of non-violent and new re-arrests, but not failure to appear, relative to comparison conditions. Conclusions: Pretrial risk assessments can facilitate non-financial release, though with a potentially higher rate of pretrial re-arrest. Structured guidelines may help maximize pretrial release while minimizing misconduct.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38d9756da80bcdb6275bb44633874434",
  "timestamp": "2025-05-15T02:28:29.407959"
}