{
  "id": 5778,
  "title": "Assessment of mental health in adults of the northern part of the city of Kosovska Mitrovica",
  "abstract": "Background/Aim. Mental health disorders lead to disorder of effective functioning of people and deterioration of quality of life. Early detection of individuals at risk of mental health disorders is extremely important from the aspect of mental health disorders prevention. The aim of the research was to determine the frequency of mental health problems among adult residents of northern Kosovska Mitrovica and to examine the association between frequency of mental health problems and socio-demographic and other characteristics of the population obtained by the questionnaire. Methods. The cross-sectional study on the representative sample of adult residents of northern Kosovska Mitrovica was performed in October 2009. To obtain information about the characteristics of mental health the Goldberg's General Health Questionnaire (GHQ-28) was used. For performing survey at site the method of rapid epidemiological assessment was chosen. Statistical analysis included the methods of descriptive statistics, multivariate regression analysis and calculation of the Cronbach's alpha coefficient of internal consistency of the questionnaire. Results. Mental health problems (total score) were present in almost half of the respondents (49.2%). Psychosomatic problems were present in more than half of the respondents (55.4%), while anxiety and insomnia were present in almost half of the respondents (49.2%). Social dysfunction had more than three fifths of the respondents (63.1%) and depression more than a quarter of the respondents (28.5%). More positive responses in the questionnaire were statistically significantly associated with older age, poor financial situation, abuse and assessing of the current political-security situation as high risk. The value of Cronbach's alpha coefficient was 0.705. Conclusions. Almost half of the respondents (49.2%) of North Kosovska Mitrovica had mental health problems. Mental health problems were associated with older age, poor financial situation, abuse and considering the current political-security situation as high-risk factor.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38e222c0136fb8f7cd4a4da89c650339",
  "timestamp": "2025-05-15T02:51:30.009343"
}