{
  "id": 9028,
  "title": "Randomized Trial of Four Financial-Incentive Programs for Smoking Cessation",
  "abstract": "In the 50 years since the release of the first Surgeon General's report on the harmful effects of smoking, national policies and behavioral programs as well as pharmacologic approaches have helped reduce smoking rates in the United States. Despite these interventions, the need for new approaches is clear because smoking is still the leading cause of preventable illness and death. Previous studies have demonstrated that financial incentives can promote a variety of health behaviors. However, effective ways to deliver health incentives are uncertain. A number of online and employer-based behavioral-change programs have been used. One of these programs involves use of deposit (commitment) contracts, whereby participants put some of their own money at risk and recover it if they are successful in changing their behavior. Deposit contracts should be more successful than reward programs because people are usually more motivated to avoid losses than to seek gains. The need to make deposits, however, may deter people from participating in such programs. No studies have directly compared the overall effectiveness of deposit and reward programs. This randomized controlled trial compared 4 financial-incentive programs for smoking cessation. Participants were CVS Caremark employees and their relatives and friends. The incentive programs were compared with usual care (which included informational resources and free smoking-cessation aids). Two of the incentive programs (reward based and deposit based) targeted individuals, whereas the other 2 targeted groups of 6 participants. One individual-oriented program and 1 group-oriented program provided rewards of approximately $800 for smoking cessation; the other 2 entailed refundable deposits of $150 plus $650 for successful participants. Levels of acceptance, overall effectiveness, and efficacy were assessed. The primary efficacy outcome was sustained abstinence for 6 months after the target quit date. A total of 2538 participants were randomized to 1 of the 4 incentive programs or to usual care. Participants in the 2 reward-based incentive programs were much more likely to accept the assignment (combined acceptance rate, 90.0%) than those in the 2 deposit-based programs (combined acceptance rate, 13.7%; P < 0.001). Intention-to-treat analyses using logistic regression showed that rates of sustained abstinence from smoking through 6 months were higher for each of the 4 incentive programs (range, 9.4%-16.0%) than usual care (6.0%) (P < 0.05 for all comparisons). Moreover, the superiority of reward-based programs was sustained through 12 months. The proportion of participants with sustained abstinence was similar at 6 months for participants assigned to group-oriented and individual-oriented programs (13.7% and 12.1%, respectively; P = 0.29). At 6 months, the proportion of participants with sustained abstinence was greater with reward-based incentives than with deposit-based incentives (15.7% vs 10.2%, P < 0.001). However, the rate of abstinence at 6 months in instrumental-variable analyses (accounting for differential acceptance) was 13.2 percentage points higher (95% confidence interval, 3.1-22.8) in the deposit-based programs than in the reward-based programs among the 13.7% of smokers who would accept participation in either type of program. These findings show that, among several financial-incentive programs for smoking cessation, rewards for smoking cessation achieve higher rates of sustained abstinence from smoking than deposit-based contracts owing to much higher rates of acceptance. Group-oriented programs are no more effective than the programs for individuals.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38ebd94879bccf7ed38d1e95d8ec61c4",
  "timestamp": "2025-05-15T03:24:54.888683"
}