{
  "id": 505,
  "title": "AN EFFICIENT WAY TO PREDICT THE DISEASE USING MACHINE LEARNING",
  "abstract": "For the management of a hospital's administrative, financial, and clinical components, a system is essential in the healthcare sector. Thanks to developments in data mining in the biomedical and healthcare fields, accurate analysis of medical data support early sickness identification, patient treatment, and community services. The accuracy of the investigation degrades when the medical data is of low quality. Additionally, various localized illnesses manifest differently in different places, which may make predicting disease outbreaks more challenging. The suggested method includes machine learning approaches for accurate sickness incidence prediction in groups that are prone to illness. On the basis of actual hospital data, it evaluates the various estimating methods. To solve the problem of incomplete data, it employs a latent component model to rebuild missing data. It was put to the test on a chronic localized ailment called cerebral infarction. To evaluate the hospital's structured and unstructured data, it uses the Machine Learning Decision Tree approach. To predict potential illnesses and hospitals, it mines data sets. To our knowledge, neither form of data has been the focus of any previous study in the field of medical big data analytics. Our proposed method has a calculation exactness of 94.8 percent and a convergence time that is quicker than the Decision tree disease risk prediction algorithm when compared to different widely used estimation techniques.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "38eb703102cb0754d7eb5706e6db752a",
  "timestamp": "2025-05-15T01:51:31.329761"
}