{
  "id": 6391,
  "title": "Emerging Market Return Pricing: an Intertemporal and Interquantile Approach",
  "abstract": "The objective of this study is to analyze the return pricing dynamics in six Latin American countries based on the ICAPM model of (Merton, 1973; Bekaert & Harvey, 1995). We analyze Argentina, Brazil, Chile, Colombia, Mexico and Peru market return and a world market proxy return as a measure of systematic risk. However, instead of traditional covariance, we used the Dynamic Conditional Correlation (DCC) model of Engle (2002) to measure the volatility correlation between each Latin market and the world market. We based the DCC model on marginal volatilities estimated by the GJR-GARCH model (Glosten et al., 1993), using a copula function. The copula-DCC-GARCH model was proposed with a financial application by (Jondeau & Rockinger, 2006). The univariate volatility and an autoregressive vector were also included as independent variables in the model, which coefficients were estimated by quantile regression. The results reveal a breakthrough because the model can capture relationships that were previously masked by the coefficients steadiness and by the lack of consideration over the differences in extreme quantiles pricing. In the lower quantile, negative risk premium was found, reflecting the leverage effect. Furthermore, we found that the quantile correlation coefficients between each market return proxy and the world return proxy were not significant, i.e, only the market own risk is priced, what indicates that Latin markets may present a good diversification opportunity.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3908beab442b441830cec70749edf421",
  "timestamp": "2025-05-15T02:57:38.769607"
}