{
  "id": 1453,
  "title": "A grapevine leaves dataset for early detection and classification of esca disease in vineyards through machine learning",
  "abstract": "Esca is one of the most common disease that can severely damage grapevine. This disease, if not properly treated in time, is the cause of vegetative stress or death of the attacked plant, with the consequence of losses in production as well as a rising risk of propagation to the closer grapevines. Nowadays, the detection of Esca is carried out manually through visual surveys usually done by agronomists, requiring enormous amount of time. Recently, image processing, computer vision and machine learning methods have been widely adopted for plant diseases classification. These methods can minimize the time spent for anomaly detection ensuring an early detection of Esca disease in grapevine plants that helps in preventing it to spread in the vineyards and in minimizing the financial loss to the wine producers. In this article, an image dataset of grapevine leaves is presented. The dataset holds grapevine leaves images belonging to two classes: unhealthy leaves acquired from plants affected by Esca disease and healthy leaves. The data presented has been collected to be used in a research project jointly developed by the Department of Information Engineering, Polytechnic University of Marche, Ancona, Italy and the STMicroelectronics, Italy, under the cooperation of the Umani Ronchi SPA winery, Osimo, Ancona, Marche, Italy. The dataset could be helpful to researchers who use machine learning and computer vision algorithms to develop applications that help agronomists in early detection of grapevine plant diseases. (C) 2021 Published by Elsevier Inc.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "392e768152075d9e43df3cfc92fd9ff0",
  "timestamp": "2025-05-15T02:03:00.806267"
}