{
  "id": 9357,
  "title": "Why do men go to the doctor? Socio-demographic and lifestyle factors associated with healthcare utilisation among a cohort of Australian men",
  "abstract": "Background: Men use health services less often than women and frequently delay seeking help even if experiencing serious health problems. This may put men at higher risk for developing serious health problems which, in part, may explain men's higher rates of some serious illnesses and shorter life span relative to women. This paper identifies factors that contribute to health care utilisation in a cohort of Australian men by exploring associations between socio-economic, health and lifestyle factors and the use of general practitioner (GP) services. Methods: We used data from Ten to Men, the Australian Longitudinal Study on Male Health. Health care utilisation was defined in two ways: at least one GP visit in the past 12 months and having at least yearly health check-ups with a doctor. Associations between these two measures and a range of contextual socio demographic factors (education, location, marital status, country of birth, employment, financial problems etc.) as well as individual health and lifestyle factors (self-rated health, smoking, drinking, healthy weight, pain medication) were examined using logistic regression analysis. The sample included 13,763 adult men aged 18 to 55 years. Analysis was stratified by age (18 to 34 year versus 35 to 55 years). Results: Overall, 81 % (95 % CI: 80.3-81.6) of men saw a GP for consultation in the 12 months prior to the study. The odds of visiting a GP increased with increasing age (p < 0.01), but decreased with increasing remoteness of residence (p < 0.01). Older men, smokers and those who rate their health as excellent were less likely to visit a GP in the last 12 months, but those on daily pain medication or with co-morbidities were more likely to have visited a GP. However, these factors were not associated with consulting a GP in the last 12 months among young men. Overall, 39 % (95 % CI: 38.3-39.9) reported having an annual health check. The odds of having an annual health check increased with increasing age (p < 0.01), but showed no association with area of residence (p = 0.60). Across both age groups, the odds of a regular health check increased with obesity and daily pain medication, but decreased with harmful levels of alcohol consumption. Conclusion: The majority of men (61 %) did not engage in regular health check-up visits, representing a missed opportunity for preventative health care discussions. Lower consultation rates may translate into lost opportunities to detect and intervene with problems early and this is where men may be missing out compared to women.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39409d380520b4eb5fbf03f947c9e567",
  "timestamp": "2025-05-15T03:27:53.430522"
}