{
  "id": 3318,
  "title": "Banking credit worthiness: Evaluating the complex relationships",
  "abstract": "In developing economies agriculture and farming play crucial roles for economic sustainable development. Farmer credit risk evaluation is an important issue when determining financial support to farmers, improving agricultural supply chain performance, and ensuring profitability of financial institutions. Credit risk evaluation, or creditworthiness, is not a trivial exercise due to various complexities. Honoring complexity is necessary to effectively evaluate and predict farmer creditworthiness. A methodology using fuzzy rough-set theory and fuzzy C-means clustering is used to evaluate and investigate the complex relationships between farmer characteristics, competitive environmental factors, and farmer credit level. The methodology is detailed using actual bank data from 2044 farmers within China. This empirical methodology generates decision rules that provide insight to more complex relationships than can be found through standard econometric multivariate approaches. A rule-based methodological outcome can be used to predict the creditworthiness of farmers and to aid in agricultural loan decision making. Prediction accuracy of the rule-base was 81.16%. A central finding is that education and skills related characteristics are important for determining farmer credit-worthiness. Other implications are presented along with study limitations and future research directions. (C) 2018 Elsevier Ltd. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3941e908fc19608f6bb64d71d855dfca",
  "timestamp": "2025-05-15T02:25:13.621959"
}