{
  "id": 3844,
  "title": "Towards green recovery: Can banks achieve financial sustainability through income diversification in ASEAN countries?",
  "abstract": "Establishing sustainable and balanced development for green financing is critical for improving financial sustainability and banks' capability. Banks struggle to achieve economic sustainability in the current highly competitive business environment. This research examines the impact of income diversification on financial sustainability proxy by return on assets (ROA) by applying the quantile regression technique to the data from banks of ASEAN countries over the period 2008-2019. In addition, liquidity risk, bank size, interest and non-interest incomes, and market capitalization are studied as control variables. The empirical findings indicate that income diversification positively impacts return on assets at all countries' lower, middle, and upper quantiles, even though sizes can differ across countries and quantiles. Moreover, market capitalization, non-interest income, and banks' size favorably impact banks' performance. In contrast, liquidity risk and interest incomes are negatively linked to the performance of banks for all countries at each quantile. These results have significant strategic implications for managers, regulators, and policymakers who share a common interest in boosting financial sustainability and performance and significantly shaping green recovery. (c) 2022 Economic Society of Australia, Queensland. Published by Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3945292df05db9337c88d0f4d81e0279",
  "timestamp": "2025-05-15T02:30:28.747742"
}