{
  "id": 4569,
  "title": "Socioeconomic disparities in risk of financial toxicity following elective cardiac operations in the United States",
  "abstract": "Background While insurance reimbursements allay a portion of costs associated with cardiac operations, uncovered and additional fees are absorbed by patients. An examination of financial toxicity (FT), defined as the burden of patient medical expenses on quality of life, is warranted. Therefore, the present study used a nationally representative database to demonstrate the association between insurance status and risk of financial toxicity (FT) among patients undergoing major cardiac operations. Methods Adults admitted for elective coronary artery bypass grafting (CABG) and isolated or concomitant valve operations were assessed using the 2016-2019 National Inpatient Sample. FT risk was defined as out-of-pocket expenditure >40% of post-subsistence income. Regression models were developed to determine factors associated with FT risk in insured and uninsured populations. To demonstrate the association between insurance status and risk of FT among patients undergoing major cardiac operations. Results Of an estimated 567,865 patients, 15.6% were at risk of FT. A greater proportion of uninsured patients were at risk of FT (81.3 vs. 14.8%, p<0.001), compared to insured. After adjustment, FT risk among insured patients was not affected by non-income factors. However, Hispanic race (Adjusted Odds Ratio [AOR] 1.60), length of stay (AOR 1.17/day), and combined CABG-valve operations (AOR 2.31, all p<0.05) were associated with increased risk of FT in the uninsured. Conclusion Uninsured patients demonstrated higher FT risk after undergoing major cardiac operation. Hispanic race, longer lengths of stay, and combined CABG-valve operations were independently associated with increased risk of FT amongst the uninsured. Conversely, non-income factors did not impact FT risk in the insured cohort. Culturally-informed reimbursement strategies are necessary to reduce disparities in already financially disadvantaged populations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3976031d2c4549b5e6a1ba57bbf1bd58",
  "timestamp": "2025-05-15T02:38:56.201381"
}