{
  "id": 8066,
  "title": "Revisiting equity in healthcare spending through capability-approach: assessing the effectiveness of health-insurance schemes in reducing OOPE and CHE in India",
  "abstract": "Purpose This paper aims to draw theoretical insight from Sen's capability-approach and attempts to examine the effectiveness of health-insurance-schemes in reducing out-of-pocket-expenditure (OOPE) and catastrophic-health-expenditure (CHE) in India. Design/methodology/approach Data were extracted from the National-Sample-Survey-Organization, 71st round on Health-2014. Generalized-linear-regression-model was used to investigate the impact of social-protection-schemes on OOPE and CHE. Findings A notable segment of the Indian population is still not covered under any health-insurance-schemes. The majority of the insured population was covered by publicly-financed-health-insurance-schemes (PFHIs), with a trivial-share of private-insurance. Households from 16-59 age-group, urban, literate, richest, southern-regions, using private-facilities and having ear and skin ailments have reported higher insurance coverage. Reimbursement was higher among elderly, literates, middle-class, central-regions, using private-facilities/insurance and for infections. Access to PFHIs significantly reduces the risk of OOPE and CHE. Unavailability of reimbursement exposes the population to a higher risk of CHE. Research limitations/implications Being a study based on secondary data sources, its applicability may vary as per the other social indicators. Practical implications Extending insurance-coverage alone cannot answer the widespread inequalities in health care. Rather, an efficiently managed reimbursement-mechanism could condense OOPE and CHE by enhancing the capability of the population to confront the undue financial burden. Social implications Extending the health-insurance-coverage to the entire population requires a better understanding of the underlying-dynamics and health-care needs and must make health-care affordable by enhancing the overall capability. Originality/value This research brings a theoretical and conceptual analysis for improving the health-insurance coverage among the community as a public health strategy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "397faa196ffa1393d68291299106528f",
  "timestamp": "2025-05-15T03:15:09.308990"
}