{
  "id": 3324,
  "title": "Application of Big Data Complexity Analysis Hedging Operation of Derivative Financial Products",
  "abstract": "This study is based on the situation of Taiwan listed companies as derivative financial products from 2015 to 2017, analyzing the relationship between the hedging of derivative financial products and characteristics of enterprises and the factors that affect the hedging decision-making of companies. It is found that even after the announcement of Taiwan's No. 34 and No. 36 bulletins, there are still some problems that are needed to improve in the disclosure of derivative financial product investment information by Taiwan's listed companies, at least in the disclosure of the reasons for this conduct which is still insufficient. In this study, two-stage regression analysis method is applied to empirical analysis, and it is found that hedging activities are related to corporate characteristics, such as expected financial crisis costs, corporate size, equity issues, growth investment opportunities, and information asymmetry. In the investment of derivative financial products, enterprises should evaluate their own financial characteristics as a reference for the risk avoidance decision. At the same time, it is necessary to investigate different natures of hedging tools used in appropriate risk categories, so as to fully achieve the hedging effect and maximize the hedging benefits. This study also found that companies with higher growth investment opportunities, larger size, and higher financial crisis costs will tend to use derivative financial products for hedging. As for the impact of other industries, it is found that the electronic and electrical machinery industries are more active than other industries in hedging behaviors of undertaking derivative financial products' transaction.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3999cc57b0a18e9420d7093f9a6743d6",
  "timestamp": "2025-05-15T02:25:13.648785"
}