{
  "id": 7336,
  "title": "Correlates of Prenatal Diet Quality in Low-Income Hispanic Women",
  "abstract": "Background Low-income Hispanic women are at-risk of poor prenatal diet quality. Correlates associated with prenatal diet quality in this group of women are understudied. Objective The objective of this study was to examine the associations between financial, cultural, psychosocial, and lifestyle correlates and prenatal diet quality in low income Hispanic women. Design This cross-sectional analysis used data from pregnant women enrolled in the Starting Early Trial, a randomized-controlled trial of a primary-care based child obesity prevention program beginning in pregnancy. The trial enrolled women from clinics affiliated with a large urban medical center in New York City from 2012 to 2014. Financial, cultural, psychosocial, and lifestyle variables were collected using a comprehensive baseline questionnaire. Usual dietary intakes over the past year were assessed using the Block Food Frequency Questionnaire 2005 bilingual version. Participants The study enrolled low-income Hispanic women between 28 and 32 gestational weeks (N=519). Main outcome measures Prenatal diet quality was measured by the Healthy Eating Index 2015. Statistical analyses performed Unadjusted and adjusted multivariable linear regression analyses were performed to determine independent associations between financial, cultural, psychosocial, and lifestyle correlates and Healthy Eating Index 2015 total score. Results Overall prenatal diet quality was poor (mean Healthy Eating Index 2015 total score=69.0 +/- 9.4). Most women did not meet the maximum score for total vegetables (65.3%), whole grains (97.1%), dairy (74.8%), fatty acids (84.4%), refined grains (79.8%), sodium (97.5%), saturated fats (92.9%), and added sugars (66.5%). Women who reported screen time <= 2 hours/day, physical activity before and/or during pregnancy, and being born outside the United States had higher mean Healthy Eating Index 2015 total score than women with screen time >2 hours/day, no physical activity, and those born in the United States. Conclusions Prenatal diet quality of low-income pregnant Hispanic women was sub optimal. This cross-sectional study revealed associations between cultural and lifestyle factors and prenatal diet quality in low-income Hispanic women. Longitudinal studies are needed to determine long-term influences and specific behaviors to target for effective intervention studies.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "399cf3cc27598b8bf2253c6f4b3112f1",
  "timestamp": "2025-05-15T03:07:31.889263"
}