{
  "id": 2079,
  "title": "The Effect of ESG Scores on Portfolio Performance. Evidence from Europe",
  "abstract": "The purpose of this study is to examine the performance of eight portfolios constructed based on environmental, social and governance scores. The main question I explore is whether portfolios that integrate ESG values generate a significant additional return. The sample consists of 1095 European stocks from 23 countries, and the period analyzed is 2021-2022. To form portfolios, all stocks are first ranked according to one-year lagged ESG scores (Total ESG score, Environmental score, Social score and Governance score) in a decreasing way. Then 10% of the highest-scoring stocks are included in the Top portfolio, while 10% of the lowest-scoring stocks are included in the Bottom portfolio. Portfolio evaluation was performed using two techniques: CAPM and Fama French five-factor regression. In addition, the Sharpe ratios of the portfolios have been calculated. The Sharpe ratio is positive for the top portfolio, showing that investors are compensated more per unit of risk. The Top Environmental portfolio is found to be the best performer for positive values. In contrast, the Sharpe ratio is negative for the Bottom portfolios. This means that these portfolios underperform the risk-free rate. The CAPM results show that all portfolios using ESG-based scores underperformed the market. The results of the Fama-French five-factor model are similar to those of the CAPM. The general findings of this study indicate that using ESG-based scores in the selection investment process does not add a significant additional return. These findings provide additional evidence to the literature on the relationship between ESG and portfolio performance in the recent European context.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39aafc8ee38a70dfedc2bb5cc6075ea8",
  "timestamp": "2025-05-15T01:02:32.931794"
}