{
  "id": 7394,
  "title": "SENIORS IN THE SOUTH KOREAN WORKFORCE: THE CHALLENGES OF AN AGEING POPULATION",
  "abstract": "Population ageing is associated with many challenges, one of those most frequently discussed is the sustainability of social and pension systems. In the context of increasing life expectancy, a common issue, for example, is the age of entitlement to retirement pensions and the possibility of motivating people to stay longer in the labour market. The population of South Korea, one of the fastest ageing populations in the world, which also has a high level of senior participation in the labour market, can serve as an important inspiration and source of information for European populations. The aim of this paper is to provide a brief description of the labour market position of the elderly in South Korea, along with identifying key factors that can influence the economic activity of older people. Using data from the Korean Longitudinal Study of Ageing sample survey and applying binary logistic regression analysis, the research this article is based on, confirms that the high labour market participation of Korean seniors is likely associated more with their need to improve their financial security than with a personal interest or need for self-fulfilment. This can be seen as a reflection of the pension and welfare systems' inadequate preparedness for a fundamental change in the age structure. The chances of participating in the labour market are lower for women, people with poor health, and, logically, older people. It is these groups of the population that are at increased risk of poverty. European countries can take advantage of the lower pace of population ageing to prepare more effectively for the challenges that this process is likely to bring in terms of financial security once the workforce is no longer economically active.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39ad8e24fae88147f9554cad67a929ea",
  "timestamp": "2025-05-15T03:08:00.837628"
}