{
  "id": 8765,
  "title": "Assessment of the nutritional status of preschool-age children during the Second Intifada in Palestine",
  "abstract": "Background. The Palestinian economy has dramatically deteriorated at all levels since the Al-Aqsa Intifada (uprising) began in 2000, resulting in an unprecedented catastrophe to the livelihoods of the Palestinians residing in the West Bank and Gaza. It was also marked by lack of household physical and financial access to food and health care, which placed children at increased risk of malnutrition and poor health. This prompted a significant increase in food aid from 2002 until the summer of 2003. Objectives. To assess the nutritional status of children 6 to 59 months of age after I year of food assistance. Methods. In the West Bank and Gaza, a nationally representative sample of children 6 to 59 months Of age was randomly selected with a validated multistage clustered design, with the Health Survey 1999 sample used as the sampling frame. The sample was stratified according to governorate, place of residence (urban, nonurban, or refugee camp), locality, and size of locality (number of households). A cross-sectional survey of nutritional status was carried out. Data were collected by interviews with the primary caregivers of the children. Measurements were made of children weight and height or length. Food-intake data were collected by the 24-hour food-recall method with the use of a booklet of photographs of foods commonly eaten in Palestine. Results. A total of 3,089 children were assessed, of whom 3.1% in the West Bank and 3.9% in the Gaza Strip were suffering from acute malnutrition; the prevalence of chronic malnutrition was 9.2% in the West Bank and 12.7% in the Gaza Strip (p = .02). Sex, refugee status, locality, and maternal education were not significantly associated with acute malnutrition by logistic regression analysis, whereas infants 6 to 23 months of age were significantly at risk. Calorie and protein intakes were generally lower than recommended dietary allowances. Conclusions. The prevalence rates of both acute and chronic malnutrition among children in the West Bank and Gaza are significantly higher than the national Palestinian averages. There is a need to establish nutritional surveillance systems to monitor the nutritional status Of children in conflict areas.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39c5af72506a0678b4019bae98379a4b",
  "timestamp": "2025-05-15T03:22:25.964673"
}