{
  "id": 6140,
  "title": "Politically connected business and real earnings management: the moderating role of family control and audit quality",
  "abstract": "PurposeThis study examines whether real earnings management (REM) choices are connected with the ownership structure of politically connected businesses (PCBs). The authors also discuss the moderating role of audit quality (AQ) and family control (FC) on the relationship between PCBs and REM.Design/methodology/approachThe authors' study sample comprises firms registered on the Pakistan Stock Exchange (PSE). The sample examines the financial data of the firms that remained listed for the last eight years, i.e. from 2011 to 2018, excluding nonfinance companies and firms with incomplete data. The authors test the hypothesis using feasible generalized least squares (FGLS) regression methods.FindingsThe authors find that PCBs show a high level of involvement in income-decreasing REM compared to nonPCBs due to lower litigation risk in REM. However, the authors' results also show that two monitoring mechanisms, AQ and FC, curb the opportunistic behavior of PCBs and reduce the intensity of REM in PCBs.Practical implicationsThe findings of the study are beneficial in decision-making for both internal and external stakeholders, such as creditors, shareholders and competitors. In countries like Pakistan, which fall in the category of emerging economies, PCBs show involvement in income-decreasing REM to change the accurate picture of financial information to attain personal goals, and investors in such countries have a low level of knowledge about earnings management strategies; thus, this study offers detailed knowledge and information to investors and shareholders about political connections and REM. This plays a crucial role for regulators in stiffening the rules and regulations to further assist in more secure financial reporting.Originality/valueThis study contributes to the literature by providing a nuanced understanding of the interplay between political connections, REM, FC and AQ in the business context. Second, family-controlled businesses often exhibit distinct characteristics and governance structures compared to nonfamily-controlled firms. Exploring the moderating role of FC in the following relationship could provide valuable insights into how family dynamics influence the financial reporting practices of PCBs. Third, AQ is a critical factor in ensuring financial reporting transparency. However, the interaction between AQ, political connections, and REM remains relatively unexplored. This study explains how audit oversight affects the earnings management behavior of PCBs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39cc7283823a8bfa705b23038a8a0a3e",
  "timestamp": "2025-05-15T02:55:12.905760"
}