{
  "id": 4509,
  "title": "Financial hardship and social assistance as determinants of mental health and food and housing insecurity during the COVID-19 pandemic in the United States",
  "abstract": "Background: While social assistance through the U.S. federal CARES Act provided expanded unemployment insurance benefits during the COVID-19 pandemic until the summer of 2020, it is unclear whether social assistance was sufficient in subsequent months to meet everyday spending needs and to curb the adverse health-related sequelae of financial hardship. Methods: Using multivariable Poisson log-binomial regression and repeated cross-sectional Household Pulse Survey data between September and December 2020 on 91,222 working-aged U.S. adults and 28,842 adult housing renters, this study explored the associations of financial hardship with mental health outcomes and food and housing insecurity after accounting for receipt of social assistance. Results: Financial hardship rose progressively from September to December 2020, and disproportionately affected Black non-Hispanic and Hispanic Americans and lower-income households. Experiencing considerable financial hardship (vs no hardship) predicted nearly 3-fold higher risks of anxiety and depressive symptoms (e.g., adjusted prevalence ratio, PR of depression = 2.75, 95% CI = 2.54-2.98, P <.001), a 23-fold higher risk of food insufficiency (PR = 22.71, 95% CI = 15.62-33.01, P <.001), and a 27-fold higher risk of a likely eviction (PR = 27.20, 95% CI = 10.63-69.59, P <.001). Across outcomes, these relationships were stronger at each successively higher level of financial hardship (all P values for linear trend <0.001), and more than offset benefits from social assistance. Conclusions: Even after accounting for social assistance receipt, working-aged adults experiencing financial hardship had markedly greater risks of anxiety and depressive symptoms, food insufficiency, and an anticipated housing eviction. These findings point to the urgent need for direct and sustained cash relief well in excess of current levels of social assistance to mitigate the pandemic's adverse impacts on the well-being of millions of Americans, including vulnerable minority and low-income populations.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39cced4da3d7f5b999a919d655cc9eac",
  "timestamp": "2025-05-15T02:37:47.598203"
}