{
  "id": 4675,
  "title": "Cost-effectiveness of an educational healthcare circuit for bariatric surgery in France",
  "abstract": "Objectives: An educational healthcare circuit (EHC) is proposed with the objective of preventing weight recovery of patients after bariatric surgery through education and lifestyle change. The objective of this study was to measure the viability of the EHC (shared medical appointments [SMAs] combined with bariatric surgery) through cost-effectiveness analysis. The EHC presented in this study is innovative because it offers a multidisciplinary approach based on medical, psychological and dietetic expertise to combat obesity. The strategy is to give the patient a diagnosis and then a personalised follow-up. Study design: A mathematical model based on a decision tree (1 year) and a Markov model (10 years) to measure the efficiency and cost of an EHC in comparison with the customary care offered in France were built. Methods: The effects of the EHC were observed for the prevalence of type 2 diabetes and the risk of cardiovascular disease. The chosen financial perspective is from the point of view of the French social security system. Results: The EHC records an incremental cost-effective ratio (ICER) of (sic) 48,315.43 per quality-adjusted life year (QALY) over a 1-year horizon and (sic) 28,283.77 per QALY over 10 years (with discount rate of 8%: (sic) 25,362.85 per QALY). Conclusion: The results suggest that an EHC is more expensive yet more effective than usual care. That is, in the short term, the costs are high, but at 10 years, the treatment is cost-effective, representing a feasible alternative for those patients who qualify for bariatric surgery in France. (C) 2019 The Royal Society for Public Health. Published by Elsevier Ltd. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39cee73ee98804b2eef10ad152f23dbb",
  "timestamp": "2025-05-15T02:39:57.433887"
}