{
  "id": 3930,
  "title": "Financial Hardship and Sleep Quality Among Black American Women With and Without Systemic Lupus Erythematosus",
  "abstract": "Objective: To compare dimensions of financial hardship and self-reported sleep quality among Black women with versus without systemic lupus erythematosus (SLE). Methods: Participants were 402 Black women (50% with validated diagnosis of SLE) living in Georgia between 2017 and 2020. Black women with SLE were recruited from a population-based cohort established in Atlanta, and Black women without SLE were recruited to be of comparable age and from the same geographic areas as SLE women. Financial hardship was measured using three different scales: financial adjustments, financial setbacks, and financial strain. Sleep was assessed continuously using the Pittsburgh Sleep Quality Index (PSQI) scale. Each dimension of financial hardship was analyzed separately in SLE-stratified multivariable linear regression models and adjusted by sociodemographic and health status factors. Results: Dimensions of financial hardship were similarly distributed across the two groups. Sleep quality was worse in Black women with, versus without, SLE (p < .001). Among Black women with SLE, financial adjustment was positively associated with a 0.40-unit increase in poor sleep quality (95% CI = 0.12-0.67, p = .005). When accounting for cognitive depressive symptoms, financial setbacks and strain were somewhat attenuated for Black women with SLE. Overall, no associations between financial hardships and sleep quality were observed for the women without SLE. Conclusions: Black women with SLE who experience financial hardships may be more at risk for poor sleep quality than Black women without SLE. Economic interventions targeting this population may help improve their overall health and quality of life.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39eb6d16daf9802da815da16559a0eb4",
  "timestamp": "2025-05-15T02:31:28.375653"
}