{
  "id": 6403,
  "title": "Risk Factors for Problem Drinking among Evacuees in Fukushima following the Great East Japan Earthquake: The Fukushima Health Management Survey",
  "abstract": "Many studies have consistently reported the bidirectional relationship between problem drinking and psychological distress following a disaster, but the risk factors of problem drinking following a disaster remain unclear. In this study, we therefore aimed to explore the risk factors associated with the incidence of problem drinking among evacuees after the Great East Japan Earthquake of March 11, 2011. We used the data for evacuees of the Fukushima Daiichi nuclear power plant accident, obtained from the Mental Health and Lifestyle Survey. A total of 12,490 individuals from 13 municipalities, which included the evacuation order areas after the accident, completed surveys between 2012 and 2013. The CAGE (Cutting down, Annoyed by criticism, Guilty feeling, and Eye-opener) questionnaire was used to screen the participants for alcohol dependence, and a score >= 2 indicated problem drinking. Logistic regression models were applied to investigate the possible predictors of problem drinking. The results showed that insufficient sleep and heavy drinking (>= 4 drinks per day) were significant risk factors for the incidence of problem drinking in both men and women. Additional risk factors included family financial issues due to the disaster and trauma symptoms among men and a diagnosed history of mental illness among women. Other remaining variables were not significantly associated with problem drinking. The present study is the first to identify the risk factors for problem drinking following a compound disaster. Our findings could be used to develop a primary intervention program to improve evacuees' health and lives following a disaster.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "39fa2c644d7059155915d7df51cacf7d",
  "timestamp": "2025-05-15T02:57:38.837890"
}