{
  "id": 4204,
  "title": "IFRS and FPI nexus: does the quality of the institutional framework matter for African countries?",
  "abstract": "Purpose The institutional framework of an African country may influence the effectiveness of the International Financial Reporting Standards (IFRS) on foreign investment inflows. The purpose of this paper is to argue that the quality of a country's institutional framework impacts the effectiveness of IFRS to an adopting country and ultimately influences the levels of Foreign Portfolio Investment (FPI). Design/methodology/approach Employing country-level data. A sample of 15 countries from Africa is used. Data is collected over a period of 22 years (1994-2014). The authors employ the General Method of Moments (GMM) panel regression technique to examine whether the quality of a country's institutional framework has an impact on the relationship between IFRS and FPI and the Propensity Score Matching (PSM) technique to assess the level of impact. Findings The findings reveal that the quality of a country's institutional framework moderates the strength of the association between IFRS and FPI. Overall, the authors find that the quality of the institutional frameworks in African countries has a negative effect on the IFRS and FPI nexus. Research limitations/implications The study focuses exclusively on African countries; using an exclusively African sample limits the generalisation of results to other continents like Latin America with similar environments to Africa. Practical implications This study provide evidence that IFRS alone cannot ensure the intended capital market benefits but encourages the development of strong institutions in African countries to realise the most from IFRS adoption. The emphasis on institutional development is an essential contribution that this study makes. Originality/value This study is unique since it emphasises the importance of institutional framework quality when considering the impact of IFRS on foreign investment inflows in an African setting.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a14e67d49fb46b2e6878a4999b7bab0",
  "timestamp": "2025-05-15T01:24:51.431534"
}