{
  "id": 2803,
  "title": "Executive team risk appetite, financial development and re-innovation strategy after enterprise innovation failure: evidence from China",
  "abstract": "PurposeThis article empirically tests the impact of risk appetite of the executive team on the re-innovation strategy after technological innovation failure using a panel regression model from the perspective of regional financial development level of enterprises.Design/methodology/approachBy means of time series global principal component analysis and panel regression model method, the study validated and analyzed the impact of risk appetite of the executive team on the re-innovation strategy after enterprise technological innovation failure.FindingsThe research found that the higher the risk appetite of executive team, the more inclined the enterprise is to choose the focusing on quantity, ignoring quality re-innovation strategy after technological innovation failure. The better the financial development level of the region where the enterprise is located, the better it can effectively reduce the re-innovation strategy of focusing on quantity, ignoring quality of the enterprise due to the high risk appetite of the executive team.Originality/valueThe findings of this study are helpful in improving the financial development level of the region where the enterprise is located. It can help the executive team of the enterprise to more objectively choose the innovation strategy after technological innovation failure, and reduce the phenomenon that the executive team of the enterprise only pays attention to the quantity of re-innovation and underestimates the quality of re-innovation after technological innovation failure due to its high risk appetite.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a144ad505f531adb3914cd0aa1acc6f",
  "timestamp": "2025-05-15T02:19:08.492899"
}