{
  "id": 6702,
  "title": "Factors influencing attitudes and willingness to pay for data protection and sustainability in e-waste management of laptop/personal computer",
  "abstract": "This study explores the factors affecting citizens' willingness to pay (WTP) for e-waste management, particularly concerning data protection for laptops and PCs in Jakarta. Employing a multi-method approach that includes Exploratory Factor Analysis (EFA), cluster analysis, and binary logistic regression, the research identifies significant determinants shaping public attitudes and behaviors regarding e-waste management practices. A total of 567 valid samples were gathered from residents across various districts in Jakarta, ensuring diverse representation. The EFA findings highlighted three main components: passion for data protection, risk perception related to data, and access to recycling and disposal facilities, which together account for a considerable amount of variance in the data. Cluster analysis divided respondents into four distinct groups, revealing different levels of engagement with e-waste management for laptops and PCs. Furthermore, binary logistic regression indicated that a strong commitment to best data protection practices, heightened concern for data security, and improved access to recycling facilities significantly enhance WTP. In contrast, lower income, more frequent laptop/PC replacements, and younger age groups correlate with lower WTP. These results emphasize the necessity of raising public awareness, enhancing infrastructure, and implementing targeted educational and financial initiatives to foster sustainable e-waste management practices for laptops and PCs. The study's findings can guide policy and practical measures aimed at increasing public engagement and support for sustainable e-waste management in urban settings.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a21be4e1d71fb10f5cb62f7ca8ac00a",
  "timestamp": "2025-05-15T03:00:35.516715"
}