{
  "id": 3552,
  "title": "Understanding the multifaceted impact of COVID-19 on migrants in Kerala, India",
  "abstract": "Motivation COVID-19 has disrupted the lives of millions of people worldwide. Migrants in developing economies have been among the most affected. This vulnerable population faces a threat to their livelihood and way of life. Hence, there is an urgent need to understand the impact of the pandemic on their lives to be able to tackle subsequent waves of the pandemic or similar future exogenous shocks. Purpose We delve into the economic and social disruptions caused by the COVID-19 pandemic on the employment, sources of income, and lives of different categories of migrant labourers in the Indian state of Kerala. Methods and approach Using the livelihood portfolio theory, we dissect this impact in relation to a wide range of issues. This was corroborated by in-depth semi-structured interviews with three categories of respondents. The interview data was analysed by using the directed qualitative content analysis method. We created themes from the data and juxtaposed them with the livelihood portfolio theory in addressing the research objectives. Findings Results highlight the impact on livelihood, lifestyles, migration prospects, and gender aspects. First, households dependent on international migrants were more severely affected than those with family members who were internal migrants. Second, a considerable lifestyle change (more reliance on a plant-based diet) and borrowing patterns (more reliance on informal money lending) was reported. Third, opinions on future migration prospects were pessimistic, and a trend towards reverse migration was noted. We also captured resilience measures for each of the themes. Policy implications We find that blanket responses to mitigate migrants' hardships could be counterproductive. Policy-makers ought to implement tailor-made policies keeping in mind the migrants' classification and socioeconomic demographics. Further, we recommend specific measures to address challenges that women face, to ease their workload and mitigate the loss of income. Specific measures aimed at initiating attitudinal change such as creating mental health awareness, curbing misinformation, and providing counselling services could also add immense value in tackling the pandemic.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a27893ee2b4de29c2484db026f8c7ae",
  "timestamp": "2025-05-15T01:18:20.532325"
}