{
  "id": 4039,
  "title": "The interplay of financial toxicity, health care team communication, and psychosocial well-being among rural cancer patients and survivors",
  "abstract": "BackgroundFinancial toxicity contributes to psychosocial distress among cancer patients and survivors. Yet, contextual factors unique to rural settings affect patient experiences, and a deeper understanding is needed of the interplay between financial toxicity and health care team communication and its association with psychosocial well-being among rural oncology patients. PurposeWe examined associations between financial toxicity and psychosocial well-being among rural cancer patients, exploring variability in these linkages by health care team communication. MethodsUsing data from 273 rural cancer patients who participated in Cancer Support Community's Cancer Experience Registry, we estimated multivariable regression models predicting depression, anxiety, and social function by financial toxicity, health care team communication, and the interplay between them. ResultsWe demonstrate robust associations between financial toxicity and psychosocial outcomes among our sample of rural cancer patients and survivors. As financial toxicity increased, symptoms of depression and anxiety increased. Further, financial toxicity was linked with decreasing social function. Having health care team conversations about treatment costs and distress-related care reduced the negative impact of financial toxicity on depressive symptoms and social function, respectively, in rural cancer patients at greatest risk for financial burden. ConclusionsFinancial toxicity and psychosocial well-being are strongly linked, and these associations were confirmed in a rural sample. A theorized buffer to the detrimental impacts of financial toxicity-health care team communication-played a role in moderating these associations. Our findings suggest that health care providers in rural oncology settings may benefit from tools and resources to bolster communication with patients about costs, financial distress, and coordination of care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a2d03f382295b5029f64aabdb01e6a7",
  "timestamp": "2025-05-15T02:32:27.552016"
}