{
  "id": 26,
  "title": "A hybrid approach of wavelet transform, ARIMA and LSTM model for the share price index futures forecasting",
  "abstract": "In this study, a novel hybrid model for share price index futures forecasting named WT-ARIMALSTM is proposed. In this hybrid model, share price index futures are decomposed to extract data characteristics at different time scales by the wavelet transform and the ARIMA-LSTM model are applied to predict the close price of futures. The findings of the study are as follows. 1) The DWT hybrid model and the MODWT hybrid model have higher forecasting accuracy than some commonly used forecasting models under the three metrics of MAE, MAPE and RMSE. The DWTARIMA-LSTM model has better forecasting performance when the forecasting performance in different markets and the operational efficiency of the method are combined. 2) The DWT method is more applicable than the MODWT method in forecasting models of futures closing price series; the approximate signals obtained from the DWT decomposition have lower volatility and can better characterise the original signals. 3) The LSTM model has better prediction performance for noisy residual series, while the ARIMA model has better prediction performance for less noisy approximate signals. 4) Based on the forecasting results, a timing trading strategy is constructed that can maintain a robust return performance under different market conditions, especially on the risk side with significant advantages. In addition, this work examines the impact of the unexpected event of the COVID-19 epidemic on the forecasting performance of the model, and the results show that the model can adapt to different data structures to achieve more robust forecasting performance. This work provides insights into the integration of deep learning methods with econometric methods in the field of asset pricing.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a32e46a33afbaacfbcb9b745c5d4f8f",
  "timestamp": "2025-05-15T01:26:26.423666"
}