{
  "id": 1060,
  "title": "Early warning research on enterprise carbon emission reduction credit risk based on deep learning model under unbalanced data",
  "abstract": "To enhance the precision of predicting enterprise credit risk related to carbon emission reduction, this study focuses on publicly traded companies. It introduces a risk early warning model grounded in MLP deep learning. Primarily, this research employs the FA-TOPSIS fusion model to comprehensively assess the credit risk associated with carbon emission reduction in enterprises. Subsequently, it employs K-means clustering to compute enterprise similarities, which forms the basis for supervised learning in the MLP model to assign credit risk grade labels. Furthermore, the study tackles the challenge of imbalanced enterprise grade distribution using the ADASYN over-sampling algorithm. Ultimately, the effectiveness of the model proposed herein is confirmed through a series of multi-model comparison experiments. The results show that: First, carbon emission reduction indicators exhibit differing degrees of influence on enterprises at various credit risk levels. Notably, the most influential indicator is carbon emission intensity, while the development capacity indicator exerts the least influence. Second, the adoption of the XGBoost algorithm for screening carbon emission reduction indicators significantly enhances the prediction accuracy of the early warning model by 4.27%. Third, compared to other models, the MLP model achieves an impressive prediction accuracy of 99.48%, representing an average improvement of 15.24%. These results underscore the model's feasibility and its potential to provide technical support for financial institutions and government entities in conducting credit ratings for enterprise carbon emission reduction.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a39921a8f159b2bfc15e4e432b11eae",
  "timestamp": "2025-05-15T01:58:08.680190"
}