{
  "id": 5984,
  "title": "Azacitidine access program for Belgian patients with myelodysplastic syndromes, acute myeloid leukemia or chronic myelomonocytic leukemia",
  "abstract": "Objective: Azacitidine (Vidaza*) is approved in Europe for treatment of myelodysplastic syndromes (MDS), acute myeloid leukemia (AML) with 20-30% bone marrow (BM) blasts, and chronic myelomonocytic leukemia (CMML) with 10-29% BM blasts and no myeloproliferative syndrome (i.e. 513.000/mL white blood cells). In Belgium, the azacitidine reimbursement process can take several months, and is often delayed at submission for medical assessment by the Belgian National Institute for Health and Disability Insurance of incomplete patient dossiers, due to disease complexity and classification, and administrative burden. We describe the Vidaza Access Program and its application to an initial 175 patients. Individual medical dossiers were reviewed for completeness to facilitate patient access to treatment in Belgium. Methods: A standardized anonymized patient information form is completed by the physician and sent for review to the Belgian Celgene Medical Department. The form is reviewed within three working days and, for complete dossiers, Celgene grants a financial guarantee for treatment with azacitidine. The patient can then be treated without the hospital being subjected to financial risk. Results: Between January 2013 and June 2014, 63 physicians (53 Belgian hospitals) recruited 175 patients. In total, 163 patient dossiers were approved by Celgene (120 MDS, 36 AML, and 7 CMML), of which 104 dossiers were also approved by the review committee and 49 have been waiting for a final decision for a median of 6 months; no information is currently available for the remaining 10. No dossiers approved by Celgene have been rejected by the review committee. Conclusions: The Celgene Vidaza Access Program offers support to healthcare professionals in the appropriate use of azacitidine. By facilitating the assessment of patient dossiers and providing a financial guarantee for prescribers and hospitals, treatment can be initiated more rapidly and patients may better benefit from azacitidine treatment.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a5f32546c54bfde7291dee3589c82fc",
  "timestamp": "2025-05-15T02:53:33.410165"
}