{
  "id": 5306,
  "title": "BUILDING A RESILIENT ORGANIZATION WITHIN THE COUNTRY RISK'S ENVIRONMENT",
  "abstract": "In considering the current global economic instability, new markets and the economy, increasing regulatory requirements, emerging risks and procedures will continue to change and be more complex. As the growing risks consider macroeconomic, strategic and operational risks, on top of which are cyber risks and managing of cyber threats, to research county risks is found challenging. So, the subject of this research is country risk impact on the revenues of the business entities. A total of 92 questionnaires have been distributed to collect the data on the impact of country risk to businesses of enterprises and financial institutions in Balkan countries. There are also desk research results on country risk given for Croatia, Bosnia and Herzegovina, Macedonia, Montenegro and Serbia. Within the variables of country risk, political and macroeconomic stability are of most concern of these enterprises. Half of the respondents confirm the positive impact of this risk on the sustainability of their revenues in previous years. The result found that Western Balkans banks and enterprises are efficient in country risk analysis, risk monitoring and understanding the country risk in the most significant variables of risk management. For the research have been used statistical methods, linear regression and processing data methods. The contribution of the results can be seen in the support to the importance of shaping the external risks, management and risk culture development.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a72d8b86040ccc252caccaf0d337a9b",
  "timestamp": "2025-05-15T02:46:16.284146"
}