{
  "id": 919,
  "title": "Can machine learning make technical analysis work?",
  "abstract": "Technical analysis is generally regarded as an ineffective investment strategy. However, with the advent of machine learning in finance, it has been suggested that technical indicators can play a role as features when trying to predict asset returns. One direct application of this approach is portfolio selection and optimization. Technical indicators as predictors represent an attractive choice, as they can easily be obtained. However, although some studies addressed this topic, the literature on this subject is still not well developed. In this study, we apply tree-based methods that use technical indicators as predictors for daily stock returns. We describe the procedures employed for the tuning of the models and we then develop some portfolio strategies that build on the predictions provided by such models. Finally, we conduct a detailed empirical analysis to gauge the profitability of the approach considered in this paper. We find that our machine learning model shows predictive power and that its performance greatly increases when feature selection is performed. While the resulting investing strategies do not consistently beat simpler alternatives after accounting for transaction costs, our results look promising and provide new insights on the use of technical indicators as stock return predictors.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a908a15fa712f836c0bcd0cee82984c",
  "timestamp": "2025-05-15T00:49:36.353896"
}