{
  "id": 8989,
  "title": "Evaluation of emergency drills effectiveness by center of disease prevention and control staff in Heilongjiang Province, China: an empirical study using the logistic-ISM model",
  "abstract": "Introduction Emergency drills are critical practices that can improve the preparedness for crisis situations. This study aims to comprehend the evaluation of emergency drill effectiveness by the staff at the Centers for Disease Control and Prevention (CDC) in Heilongjiang Province, China. It identifies potential factors that could influence the personnel's appraisal of outcomes throughout the emergency drill procedure.Methods A cross-sectional survey was conducted among public health professionals from various CDCs in Heilongjiang, a northeastern Chinese province. The binary logistic regression analysis identified the factors associated with the CDC staff's assessment of emergency drill efficacy, while the Interpretative Structural Modeling (ISM) elucidated the hierarchical structure among the influencing factors.Results 53.3% (95% CI = 50.6-55.4) of participants perceived the emergency drills' effectiveness as low. Binary logistic regression analysis revealed that the following adverse factors associated with the emergency drills increased the risk of a lower evaluation: lack of equipment and poor facilities (OR = 2.324, 95% CI = 1.884-2.867), poor training quality (OR = 1.765, 95% CI = 1.445-2.115), low leadership focus (OR = 1.585, 95% CI = 1.275-1.971), insufficient training frequency (OR = 1.539, 95% CI = 1.258-1.882), low skill in designing emergency drill plans (OR = 1.494, 95% CI = 1.180-1.890), lack of funding (OR = 1.407, 95% CI = 1.111-1.781), and poor coordination between departments (OR = 1.335, 95% CI = 1.085-1.641). The ISM revealed the hierarchical relationship of the influential factors, which were classified into three levels: Surface, Middle and Bottom. The Surface Level factors were training frequency, training quality, leaders' focus, and inter-departmental coordination. The Middle Level factors were equipment availability and skill in designing emergency drill plans. The Bottom Level factor was funding guarantee.Discussion This survey revealed that over half of the CDC staff rated the effectiveness of public health emergency drills as low. The Logistic-ISM Model results indicated that the evaluation of drill effectiveness was negatively influenced by insufficient facility and equipment support, financial constraints, lack of departmental coordination, and inadequate leadership attention. Among these factors, funding guarantee was the most fundamental one. Therefore, this calls for strategic decisions to increase funding for equipment, leadership training support, and effective emergency coordination.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a93a1918c31d9f231449096aa337016",
  "timestamp": "2025-05-15T03:24:26.355407"
}