{
  "id": 3999,
  "title": "Petrophysical and petrographical delineation for carbonate reservoir rocks in north Western Desert, Egypt",
  "abstract": "Carbonate rocks hold considerable volumes of hydrocarbons in various basins around the globe. Understanding the complex pore systems is a key factor in unlocking the potential of carbonate rocks. Matrix properties are also a challenge in carbonate reservoirs. Exploration geoscientists include the regional portfolio targeting the sweet spots for every basin. This study defines the reservoir quality and character of carbonate rocks with scope to the complete carbonate succession of north Western Desert and Abu Gharadig basin (AGB) as one of the most prolific basins in Egypt. More than 301 core samples are used in this study to represent all carbonate rock types. The workflow includes core data classification (grouping), petrographical investigation, reservoir mineralogy, and matrix parameters integrated with well logs and elastic properties. The provided work investigates the effect of pore structure and mineralogy on the petrophysical properties of the rock and its impact on elastic properties as well. Carbonate reservoirs in AGB are divided into three main categories: type-I, type-II, and type-III. Reservoirs enhancement by dolomitization and dissolution are controlling the distribution of pores, which are the key factors to delineate their potential. This study defines the characteristics of each group and the attractive formations for future exploration and development. The main differences in rock type, composition, diagenetic processes, and elastic properties were described. The rock brittleness index was calculated from dynamic properties for each carbonate type to get more insights about the rock brittleness and elasticity and predict variations of each group for future consideration in the basin.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a9a9c2dacf6d972bdd59d20369f70c9",
  "timestamp": "2025-05-15T01:23:07.264318"
}