{
  "id": 467,
  "title": "From Indication-Based Pricing to Blended Approach: Evidence on the Price and Reimbursement Negotiation in Italy",
  "abstract": "BackgroundNew indications for existing medicines are increasing over time. In most countries, drug pricing and reimbursement conditions are renegotiated every time a new indication is approved. There is a growing interest in the price negotiation model for new indications, specifically comparing an indication-based versus blended approach. However, little evidence currently exists regarding the complexity of these negotiations and their impact on actual prices. Italy has recently transitioned from an indication-based approach to a blended price model. This study aims to measure the impact of price and reimbursement negotiation of new indications on discounts (i.e. actual prices) and on the negotiation duration, used as a proxy of its complexity.MethodsWe considered new indications approved through a European centralized procedure from January 2013 to March 2022 for which the price and reimbursement status was approved in Italy between January 2015 and March 2022, amounting to 52 new indications. Data on the timeframe of the Italian price and reimbursement process and its phases were obtained from publicly available sources. Discounts for the first indication and their subsequent increases for new indications were estimated by comparing ex-factory prices and tendered prices. To calculate p-values, we employed the Mann-Whitney test, and multiple regression models were utilized to examine correlations between negotiation time and the characteristics of the medicines.ResultsThe mean time to reimbursement was 603 days, in contrast to 583 days for the first launch. Price negotiation took longer for rare diseases, cancer drugs, and in case of therapies with minor added therapeutic value. On average, the additional discount (on top of discounts for prior indications) was 13%, significantly lower than the mean discount for the first indications approved (24.9%). The discounts increment was lower, but negotiation took longer if a Managed Entry Agreement accompanied the final agreement. Additionally, discounts have increased over the years.ConclusionThe negotiation for new indications takes longer than the first one, and provides, on average, an additional discount of 13%. While our findings bear the potential for significant policy implications, they necessitate prudent interpretation due to a limited number of observations. The increasing trend in additional discounts over time applied to all indications in recent negotiations, may suggest a descending trend of value for new indications and a shift from an indication-based pricing approach to a blended model. Otherwise, budget impact considerations might have outweighed a value-based approach in the recent negotiations. If so, two potential options for restoring a value-based approach are returning to an indication-based pricing or giving explicit and higher weight to value within a blended model.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a9d1228f9f0240010988505a81e32f4",
  "timestamp": "2025-05-15T01:32:30.164390"
}