{
  "id": 6655,
  "title": "The effect of market competition on corporate cash holdings: An analysis of corporate innovation and financial constraint",
  "abstract": "This study investigates the impact of market competition on corporate cash holdings. Specifically, we focus on the corporate innovation and financial constraint channels. Based on a sample of the Chinese stock market from 1998 to 2019, our empirical results show that cash holdings are negatively impacted by market competition, corporate innovation partially mediates this effect, and financial constraint exhibits full mediation. Moreover, the mediating effect of corporate innovation is moderated by financial constraints. Furthermore, the impact of market competition reveals an increasing trend as cash holdings increase with quantile regression. In addition, this impact is mitigated for state-owned enterprises, and firms with larger total assets are impacted to a lesser degree. 1. Introduction There is a growing body of literature on the theme of cash holdings, and previous research shows that the growing trend of corporate cash holdings originates from the following four motives: tax, transaction, precaution, and agency problems (Bates, Kahle, & Stulz, 2009; Opler, Pinkowitz, Stulz, & Williamson, 1999). Several recent studies have focused on macroeconomic factors such as economic policy uncertainty (Demir & Ersan, 2017; Phan, Nguyen, Nguiyen, & Hegde, 2019; Xu, Chen, Xu, & Chan, 2016), oil price uncertainty (Zhang, Zhang, & Zhou, 2020), grabbing hand effects (Caprio, Faccio, & Mcconnell, 2013; Fan, Titman, & Twite, 2012; Frye & Shleifer, 1997); and government quality (Chen, Li, Xiao, & Zou, 2014; Kusnadi, Yang, & Zhou, 2015; Xie & Zhang, 2020), among others. In addition to these macroeconomic factors, the impact of market competition is studied extensively. Haushalter, Klasa, and Maxwell (2007) build a link between industry concentration and cash holdings of manufacturing firms through interdependent growth opportunity channels, showing that corporate cash holdings decrease with market competition because cash holdings can be used for risk management. They argue that firms with higher interdependence growth opportu-nities with rivals face greater predation risk and that interdependence is more significant for more concentrated industries. Consequently, firms in less competitive markets tend to hold more cash to mitigate predation risk. As the second largest economy globally, China's economic issues have drawn significant attention. Chinese economic reforms started in 1978, with the principal objective of relaxing government regulation, accelerating market liberalization, and building a market-based price system and economy. Based on these economic reforms, China's econ-omy has expanded over the last 30 years. Even though product market competition (PMC) remains restrictive, most industries have market- based price systems (Conway, Herd, Chalaux, He, & Yu, 2010). China is experiencing reforms, and market competition differs from that of the U.S.; thus, other channels exist through which cash holdings are impacted. From the perspective of corporate innovation, at the early stage of economic reforms, the technologies are imported directly because the R&D capability of Chinese firms is relatively weak. With the develop-ment of the Chinese economy, market competition is enhanced, Chinese firms start to invest in R&D, and cash holdings provide a crucial source of funds. Consequently, cash holdings and market competition are tightly linked through corporate innovation channels in China. In addition, from the perspective of financial constraints, market compe-tition is negatively correlated with firms' profitability (Schumpeter, 1950). Moreover, the flow of external funds is associated with the * Corresponding author. E-mail address: 9120181113@nufe.edu.cn (H. Zhou). Contents lists available at ScienceDirect International Review of Financial Analysis journal homepage: www.elsevier.com/locate/irfa https://doi.org/10.1016/j.irfa.2022.102163 Received 14 November 2021; Received in revised form 11 March 2022; Accepted 15 April 2022",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a9f151c693e2693bb8449897a3425f2",
  "timestamp": "2025-05-15T03:00:05.075880"
}