{
  "id": 7379,
  "title": "Treatment burden for patients with multimorbidity: cross-sectional study with exploration of a single-item measure",
  "abstract": "Background Treatment burden is the effort required of patients to look after their health, and the impact this has on their wellbeing. Quantitative data on treatment burden for patients with multimorbidity are sparse, and no single-item treatment burden measure exists. Aim To determine the extent of, and associations with, high treatment burden among older adults with multimorbidity, and to explore the performance of a novel single-item treatment burden measure. Design and setting Cross-sectional postal survey via general practices in Dorset, UK. Method Patients >= 55 years, living at home, with three or more long-term conditions (LTCs) were identified by practices. Treatment burden was measured using the Multimorbidity Treatment Burden Questionnaire. Data collected were sociodemographics, LTCs, medications, and characteristics including health literacy and financial resource. Associations with high treatment burden were investigated via logistic regression. Performance of a novel single-item measure of treatment burden was also evaluated. Results A total of 835 responses were received (response rate 42%) across eight practices. Patients' mean age was 75 years, 55% were female (n = 453), and 99% were white (n = 822). Notably, 39% of patients self-reported fewer than three LTCs (n = 325). Almost one-fifth (18%) of responders reported high treatment burden (n = 150); making lifestyle changes and arranging appointments were particular sources of difficulty. After adjustment, limited health literacy and financial difficulty displayed strong associations with high treatment burden; more LTCs and more prescribed regular medications were also independently associated. The single-item measure discriminated moderately between high and non-high burden with a sensitivity of 89%, but a specificity of 58%. Conclusion High treatment burden was relatively common, underlining the importance of minimising avoidable burden. More vulnerable patients, with less capacity to manage, are at greater risk of being overburdened. Further development of a single-item treatment burden measure is required.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3a9f9e995c32c17dd227c9b3964ebbe8",
  "timestamp": "2025-05-15T03:08:00.771066"
}