{
  "id": 4014,
  "title": "Influence of non-financial indicators and ESG voluntary disclosure on the market value of entities",
  "abstract": "This study aims to analyze the relationship between the disclosure of nonfinancial information presented in sustainability reports and the market value of companies involved in B3's ISE index. The sample is made up of 47 companies designated in the ISE portfolio. The research data was collected in the Econom & aacute;tica databases and in the sustainability, reports made available by the companies. For data analysis, a non-parametric test was carried out to verify the existence of a significant statistical difference in the level of non-financial disclosure between the companies involved in the ISE, as well as an analysis of a multiple linear regression model (MQO) with the aim of verifying whether the value of companies influences the disclosure of non-financial information related to sustainability practices and ESG actions of companies involved in B3's Corporate Sustainability Index (ISE). The results demonstrated that there is no statistically significant difference in the level of non-financial disclosure between specific companies in the ISE. As well as a negative relationship was found between the non-financial disclosure of sustainability information and ESG practices in companies. Therefore, it is inferred that the market value of companies significantly influences the level of disclosure of non-financial information, however this relationship is inverse to what is expected in the literature. The analysis of these relationships using financial and non-financial indicators expands the analysis of the impact of sustainability information.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ab09850b9ee717423b2bba6e6e7fb92",
  "timestamp": "2025-05-15T01:23:07.341819"
}