{
  "id": 1738,
  "title": "Peculiarities of Digital Transformation of the System of Bank's Economic Security",
  "abstract": "Purpose: The purpose of the article is to evaluate the systems of economic security of credit organizations and to increase their effectiveness by implementing new innovational methods in view of digitization of national economy. For this purpose, the situation with state interference with the work of banking system in modern conditions was analyzed, the level of digitization of the banking system in view of the current situation according to the Bank of Russia was studied, and dynamics of transformation of the indicators of economic security of the systems of financial establishments was tracked. Growth of popularity of Internet banking leads to the growth of the number of cyber attacks on web-sites of credit and financial establishment, so in order to reduce the risk of accounts hacking, the banks have to constantly update their security systems. Innovational tools of identification will allow recognizing specific customer and minimize the risks of unsanctioned access. Methodology: The research is performed with application of the methods of graphical presentation of information, neural network analysis, trend analysis, method of comparison, analogy, and systematization. Results: According to the peculiarities of formation of the model of information economy, we considered the main directions of development of cybercrimes and analyzed statistics and dynamics of fraud in Internet environment. The directions of increase of economic security of the system of Internet banking include implementation of the tools of neural network analysis. This mechanism will allow for precise and effective evaluation of the system of security of credit organization and for reduction of probability of assigning a password or access key. This indicative model of economic security of credit organization will allow saving bank's resources on production of electronic keys and passwords. Recommendations: the studied directions of the indicative model for increasing the security of Internet systems of credit organizations allow expanding the possibilities of remote banking services. Implementation of neural network analysis will allow for maximum reduction of the risk of unsanctioned access to customers' accounts. The directions of development of the systems of economic and information security of credit and payment operators could be used as methodological directions for further optimization of remote financial tools.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ab83011c6fa8663c48a10dbbd0d4f0d",
  "timestamp": "2025-05-15T02:06:52.699885"
}