{
  "id": 6591,
  "title": "Applying Mathematics in Estimating Weighted Beta CAPM for Vietnam Banking Industry and Building Better Risk Management Information System (RMIS)",
  "abstract": "Risk management information system (RMIS) is becoming an important element in MIS system of banking sector in Vietnam in recent years and in future. We can use mathematics formulas applied in risk model to strengthen RMIS for banks. Nowadays, mathematics functions expressed high roles in economics and finance fields. Under effects from Covid 19 and industry 4.0, Vietnam banks realie need to enhance risk management and corporate governance system with MIS channels to deliver proper risk information to clients and investors to attract more capitals via enhancing financial accounting data transparency. This study mainly use combination of quantitative methods including mathematics applied to calculate weighted beta CAPM, a common systemic risk measurement, and qualitative methods including synthesis, inductive and explanatory methods. And it emphasizes again sustainable modern bank management, using 5 bank cases: Eximbank (EIB) and Saigon Hanoi Bank (SHB), Asia Commercial Bank (ACB), Sacombank (STB) and Saigon Hanoi bank (SHB), 5 big listed banks in our country. Research results show us that risk model in banks can be done via some steps. First, calculating weighted beta CAPM or systemic risk via support of mathematics formula applied from market value and beta values of banks. Second, we run OLS regression for weighted beta and found out: for external impacts, exchange rate has negative correlation with weighted beta and for internal effects, CPI and R (lending rate) have negative relationship with weighted beta, so that policy makers can adjust policies to manage risks. Besides, this study also give out recommendations for enhancing management information system (MIS) for upgrading roles of banks in Vietnam economic development. Then, we can suggest suitable plans for sustainable management strategies. Our research limitation is within bank sector, then we can expand for other industries and markets as well.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3abb4e1cb06af1abae24b4d9ad551042",
  "timestamp": "2025-05-15T02:59:37.061113"
}