{
  "id": 5688,
  "title": "Cost-effectiveness analysis of the Optifast 52 program in patients with grade III obesity and type 2 diabetes mellitus",
  "abstract": "Background Obesity is a major risk factor for many other diseases, including diabetes mellitus type 2 (DMT2). DMT2 as an obesity-associated secondary disease means a high burden for the German health care system both from a medical and an economic point of view. The aim of therapeutic measures for weight reduction in patients with DMT2 is therefore always also to improve the diabetic metabolic situation. For patients with obesity grade III (BMI & GE;40 kg/m (2) ), a structured, multimodal therapy programme (Optifast 52 programme) can be offered as an alternative to metabolic bariatric surgery. Methods A cost-effectiveness analysis will determine the health economic impact of the Optifast 52 programme compared to metabolic surgery in obese patients (BMI 40-50 kg/m (2) ) with DMT2 as an obesity-associated comorbidity. The goal of both treatment options is remission of DMT2 due to weight reduction. A decision tree model is used to model the treatment of DMT2 for a period of three years. The direct medical costs from the perspective of the statutory health insurance in Germany are taken into account. Results The cumulative treatment costs of DMT2 using the Optifast 52 programme are on average euro 9,425.01 for the total period of three years compared to euro 13,727.94 for patients with metabolic surgery. Taking into account the effectiveness of the two treatment options, the Optifast 52 programme is shown to be cost-effective at euro 11,536.33 compared to euro 14,908.56 for metabolic surgery. Conclusion The reduction of body weight in obese patients is essential for a successful therapy of DMT2. Metabolic surgery can lead to significant weight loss, but is to be viewed critically due to the comparatively higher complication rates and the high financial burden for the German health care system. From a health economic perspective, the Optifast 52 programme is therefore a cost-effective alternative to metabolic surgery.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3acac2b3ff21fb6bba76ef5d393745e8",
  "timestamp": "2025-05-15T02:50:21.257046"
}