{
  "id": 5848,
  "title": "Incorrect and incomplete coding and classification of diabetes: a systematic review",
  "abstract": "P>Aims To conduct a systematic review to identify types and implications of incorrect or incomplete coding or classification within diabetes or between diabetes and other conditions; also to determine the availability of evidence regarding frequency of occurrence. Methods Medical Subject Headings (MeSH) and free-text terms were used to search relevant electronic databases for papers published to the end of August 2008. Two researchers independently reviewed titles and abstracts and, subsequently, the full text of potential papers. Reference lists of selected papers were also reviewed and authors consulted. Three reviewers independently extracted data. Results Seventeen eligible studies were identified, including five concerned with distinguishing between Type 1 and Type 2 diabetes. Evidence was also identified regarding: the distinction between diabetes and no-diabetes, failure to specify type of diabetes, and diagnostic errors or difficulties involving maturity-onset diabetes of the young, latent autoimmune diabetes in adults, pancreatic diabetes, persistence of foetal haemoglobin and acquired immune deficiency syndrome (AIDS). The sample was too heterogeneous to derive accurate information about frequency, but our findings suggested that misclassification occurs most commonly in young people. Implications relating to treatment options and risk management were highlighted, in addition to psychological and financial implications and the potential impact on the validity of quality of care evaluations and research. Conclusions This review draws attention to the occurrence and implications of incorrect or incomplete coding or classification of diabetes, particularly in young people. A pragmatic and clinically relevant approach to classification is needed to assist those involved in making decisions about types of diabetes.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3acc91346a72a5bc783802704b6e4f17",
  "timestamp": "2025-05-15T02:51:58.656064"
}