{
  "id": 5801,
  "title": "Digitalization, natural resources rents, and financial market risk: Evidence from G7 countries",
  "abstract": "Natural resources are major economic assets and play a critical role in creating jobs, promoting economic growth, and enhancing the quality of life for people worldwide. Some countries have had success stories; however, many resource-rich countries have been unable to realize the benefits of their resources. Many theoretical analyses have been carried out on the natural resource rent-led growth phenomena. Several studies have already been conducted on the impact that the rent paid for natural resources has on the expansion of the economy as a whole. This research examines the effect of natural resource rent, digitalization, financial market risk, and globalization on economic growth in the case of G7 economies from 1990 to 2020. Quantile regression is used to examine the impact of these potential indicators on economic performance. The study finds that natural resource rent negatively affects economic growth in countries with low GDP and positively affects economic growth in countries with high GDP. Hence, the resource curse hypothesis is valid in relatively low-income countries, and the resource blessing hypothesis is valid in countries with relatively high GDP. The study further finds that the economy as a whole benefits from the advent of digitalization in its various forms. Hence, digitalization is having a beneficial effect on all levels of the economic system. Further, we find that a slower rate of economic growth characterizes the initial stages of the process of globalization. Hence, developed countries stand to benefit from globalization. Last, we find an inverse connection between financial risk and economic development.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3aec911a9e14f7f8ae0359bcd0496c15",
  "timestamp": "2025-05-15T02:51:30.098920"
}