{
  "id": 4134,
  "title": "How risk spillover network structure affects VaR: A study using complex networks and quantile regression",
  "abstract": "In early 2020, the global economy was hit by the black swan event of the COVID-19 pandemic, which triggered ups and downs in international financial markets. Volatility in financial markets is often due to price fluctuations and the fluctuations have a significant linkage effect, which makes it easy to form systemic risks. Systemic risk leads to a slight move in one part that may affect the overall situation, and the structural characteristics of the network also change with uncertainty, which has a different impact on its own risk. Mining plays a role in promoting the goal of carbon neutrality, which is likely to lead to the risk of large fluctuations in stock prices. Synthetically adopting DCC-GARCH, complex network, and quantile regression models, our research uncovers significant insights into how network structures affect Value at Risk (VaR) in this volatile market. (1) Under the influence of the COVID-19 pandemic and the US-China trade war, the network structure changes significantly, the stock price fluctuates sharply in the mining stock market, and the risk spillover probability increases. (2) The spillover range, spillover intensity, and spillover media power of stocks negatively impact VaR. They play essential roles in reducing overall risk in the network. (3) The scope and intensity of risk spillover of middle and upstream stocks are enormous, especially in some large coal and metal smelting and processing enterprises. This study provides some suggestions for market managers and policymakers on risk control.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3af18171fc0910eaedd4db6b3f9a3de8",
  "timestamp": "2025-05-15T02:33:42.048699"
}