{
  "id": 8625,
  "title": "Market value, book value and earnings: is bank efficiency a missing link?",
  "abstract": "Purpose - This paper examines whether earnings and its components are relevant and sufficient to bridge the gap between banks' market and book values, and also considers if bank efficiency is value relevant'' for banks valuation. Design/methodology/approach - This paper follows the value relevance literature methodology which tests for the difference between book and market values using a variety of indicators including net income and its components as well as bank efficiency (derived using DEA) and risk indicators. The regression models are estimated using OLS, random and fixed effects approaches for a sample of listed Jordanian banks between 1993 and 2004. Findings - The main findings of this paper are twofold. First, it is found that earnings (and its components) are value relevant and explain the gap between market and book values. Secondly, cost efficiency, as an economic performance measure, provides incremental information, not contained directly in banks financial statements, to the market. Overall it is found that the components of net income are more important than aggregate net income in explaining bank value. Furthermore, bank operational efficiency adds incremental information in explaining the gap between market and book value. These results support the view that stock prices aggregate signals received by the market as well as from firm's accounting systems. Practical implications - The study shows that bank efficiency indicators (along with more traditional accounting measures) help explain market values. Originality/value - This is one of only a limited number of studies that link bank efficiency to market valuation. It is the first, we believe, to do this for banks operating in an emerging economy.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3afdec6391c810438fc87102d8c6b6de",
  "timestamp": "2025-05-15T03:20:55.853484"
}