{
  "id": 7580,
  "title": "Evaluating the Predictive Accuracy of Socioeconomic Metrics on Heart Failure Risk and Outcomes in Maryland",
  "abstract": "Introduction Annually, a significant number of Americans are hospitalized due to heart failure (HF), marking it as an important contributor to morbidity and mortality. It also poses a substantial financial burden and leads to considerable losses in productivity. Socioeconomic disparities may intensify the risk of hospital admissions following HF and worsen patient outcomes. Objective This study investigates the predictive accuracy of different socioeconomic metrics on the risk and outcomes of HF in Maryland. Methodology To evaluate the predictive accuracy of various socioeconomic metrics on the risk of HF, we utilized data from the Maryland State Inpatient Database. Our retrospective analysis covered hospital admissions for HF from 2016 to 2020, correlating these with poverty indicators derived from U.S. Census data at the zip code level with socioeconomic metrics like race/ethnicity, insurance, household median income, and neighborhood distress (Distressed Communities Index (DCI)). Multivariate logistic regression models adjusted for confounders and isolated the impact of socioeconomic factors. Result During the study period, a total of 389,220 cases of HF were reported in the Maryland State Inpatient Database (SID). The majority of these patients were White individuals (56.8%) and female (51.1%), with a median age of 73 years (interquartile range (IQR) 62-82 years). The in-hospital mortality rate was 5.1%, while rates of atrial fibrillation, cardiac arrest, and prolonged hospital stay were 34.4%, 0.3%, and 48.4%, respectively. The studied socioeconomic metrics showed varying predictive power for the risk of HF-related admissions and selected outcomes, with the highest predictive accuracy for neighborhood distress on the risk of HF (AUC = 0.53, 95% CI 0.530-0.532), atrial fibrillation (AUC = 0.479, 95% CI 0.477-0.480), cardiac arrest (AUC = 0.511, 95% CI 0.498-0.525), prolonged hospital stays (AUC = 0.531, 95% CI 0.530-0.532), and mortality (AUC = 0.499, 95% CI 0.496-0.502). Conclusions The Distressed Communities Index demonstrates significant predictive power for assessing the risk of hospital admissions following HF and outcomes among individuals with HF, exceeding factors like insurance, race/ethnicity, and household median income.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b23ad428b0007b927d83f295d6e756e",
  "timestamp": "2025-05-15T03:10:05.540498"
}