{
  "id": 4788,
  "title": "Time-frequency analysis and machine learning models for carbon market forecasting",
  "abstract": "As a follow-up to the recommendations of the Kyoto Protocol to reduces climate change, the European Union has created carbon financial markets (such as European Union Emissions Trading Scheme) allowing the introduction of a cap and trade system where mandated companies are granted carbon dioxide emission permits. These markets allow companies to trade carbon permits. The Paris Agreement of December 2015 has also highlighted the importance of the allocation of capital from the carbon market to achieve a global reduction in CO2 emissions. Therefore, an in-depth analysis of carbon market mechanisms could provide some flexibility as to where and when greenhouse gas emissions are reduced, and thus could reduce the costs of climate change mitigation. climate change, but also enable anticipate the behavior of market stakeholders concerning risk and expected return. There are several variables or institutional characteristics that may explain the formation or volatility of carbon prices in these markets. Thus, carbon prices somtimes exhibit non-stationary characteristics which makes them particularly hard to predict. In this paper, we introduce an hybrid forecasting model, incorporating multiscale analysis techniques, and other machine learning models to improve prediction accuracy of carbon prices. The proposed model for carbon price prediction outperforms other comparative models. The mean squared error(MSE), goodness of fit (R2) and the Wilmott index of agreement of the proposed model are 0.0047, 0.9185 and 0.9801 respectively 5.06285, 0.97959 and 0.99480",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b36507b9566239555e18faff525aad8",
  "timestamp": "2025-05-15T02:41:00.862319"
}