{
  "id": 8665,
  "title": "Financial and Health Literacy Predict Incident Alzheimer's Disease Dementia and Pathology",
  "abstract": "Background: Domain specific literacy is a multidimensional construct that requires multiple resources including cognitive and non-cognitive factors. Objective: We test the hypothesis that domain specific literacy is associated with Alzheimer's disease (AD) dementia and AD pathology after controlling for cognition. Methods: Participants were community-based older persons who completed a baseline literacy assessment, underwent annual clinical evaluations for up to 8 years, and agreed to organ donation after death. Financial and health literacy was measured using 32 questions and cognition was measured using 19 tests. Annual diagnosis of AD dementia followed standard criteria. AD pathology was examined postmortem by quantifying plaques and tangles. Cox models examined the association of literacy with incident AD dementia. Performance of model prediction for incident AD dementia was assessed using indices for integrated discrimination improvement and continuous net reclassification improvement. Linear regression models examined the independent association of literacy with AD pathology in autopsied participants. Results: All 805 participants were free of dementia at baseline and 102 (12.7%) developed AD dementia during the followup. Lower literacy was associated with higher risk for incident AD dementia (p < 0.001), and the association persisted after controlling for cognition (hazard ratio = 1.50, p = 0.004). The model including the literacy measure had better predictive performance than the one with demographics and cognition only. Lower literacy also was associated with higher burden of AD pathology after controlling for cognition (beta = 0.07, p = 0.035). Conclusion: Literacy predicts incident AD dementia and AD pathology in community-dwelling older persons, and the association is independent of traditional measures of cognition.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b4ff4cc08c7ed7cae4bc37870538129",
  "timestamp": "2025-05-15T03:21:24.606472"
}