{
  "id": 63,
  "title": "Portfolio Rebalancing Model Utilizing Support Vector Machine for Optimal Asset Allocation",
  "abstract": "Achieving an optimal asset allocation strategy is critical for investors aiming to maximize returns while managing risk in a dynamic financial market. This research presents a portfolio rebalancing model that leverages the power of Support Vector Machine (SVM) algorithms to optimize asset allocation decisions and enhance portfolio performance. For this purpose, initially, the assets are classified based on the SVM technique to identify the most favorable assets. Secondly, a widely accepted mean-variance optimization technique is employed by this method to balance risk and return objectives, accommodating diverse transaction costs, time horizons, and other realistic conditions, thus facilitating the selection of assets and their respective weights for both initial investment and the rebalancing of the existing portfolio. Further, to assess the effectiveness of the portfolio rebalancing model incorporating SVM, comprehensive historical testing and performance analyses are conducted using historical data from the Indian Stock Market. This evaluation is contrasted with outcomes derived from other prevalent machine learning techniques such as K-Nearest Neighbors, Naive Bayes, Random Forest, and Decision Tree. By comparing the results from different methodologies, the study highlights the superior efficacy of the SVM-based portfolio rebalancing model in achieving optimal asset allocation in a dynamic financial landscape.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b507fb4882d2db725d3284a67446fe0",
  "timestamp": "2025-05-15T01:46:39.438715"
}