{
  "id": 2659,
  "title": "Financial toxicity in cancer patients treated with radiotherapy in Germany-a cross-sectional study",
  "abstract": "Purpose Financial toxicity arises in cancer patients from subjective financial distress due to objective financial burden from the disease or treatment. Financial toxicity associates with worse outcomes. It has not been described in cancer patients undergoing radiotherapy in Germany and its publicly funded health system. In this context, we therefore investigated the prevalence of financial toxicity, associated risk factors, and patient preferences on communication of financial burden. Methods We conducted a preregistered (https://doi.org/10.17605/OSF.IGIKH6VX) cross-sectional study surveying patients at the end of their course of radiotherapy in two institutions. Objective financial burden was assessed by direct costs and loss of income. Financial toxicity was measured by subjective financial distress per EORTC QLQ-C30. We used Spearman's correlation and Fisher's exact test for univariate analysis, an ordinal regression for multivariate analysis. A p-value <0.05 was considered statistically significant. Results Of the 100 patients participating in the study, 68% reported direct costs, 25% loss of income, and 31% subjective financial distress. Per univariate analysis, higher subjective financial distress was significantly associated with active employment, lower quality of life, lower household income, higher direct costs, and higher loss of income. The latter three factors remained statistically significant in the multivariate analysis. A relative majority of the patients welcomed communication regarding financial burden with their radiation oncologist. Conclusion Financial toxicity is prevalent in cancer patients treated with radiotherapy in Germany. The reported risk factors may help to identify patients at risk. Future studies should validate these results and investigate interventions for financial toxicity to potentially improve outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b5ce7297a02ed7a5ecbd76671304916",
  "timestamp": "2025-05-15T02:17:32.305228"
}