{
  "id": 8791,
  "title": "Environmental Enrichment and Health Outcomes Among Low-Grade Glioma Brain Tumor Survivors",
  "abstract": "BACKGROUND: Brain tumor survivors who received radiotherapy (RT) are at a disproportionately increased risk of accelerated aging and symptom burden. We aim to examine the association between environmental enrichment (EE) and health outcomes among low-grade glioma survivors who received brain RT. METHODS: The study used a cross-sectional cohort design, enrolling participants approximately 5 years from diagnosis. The construct of EE consisted of social network, physical activity, employment status, and financial stability. Berkman-Syme Social Network Index, International Physical Activity Questionnaire, Vocational Index Scale, and a Socioeconomic Questionnaire were used to measure the construct of EE. Health outcome measures included the Montreal Cognitive Assessment, Symbol Digit Modality Test, clinical brain magnetic resonance images (pre-RT, approximately 2-3 years after RT, and approximately 5 years after RT), Karnofsky Performance Status Scale, and the MD Anderson Symptom Inventory Brain Tumor Module. Ordinal logistic regression estimated the association between levels of EE and health outcomes. RESULTS: Thirty-nine participants completed the study and experienced varying levels of EE. The median age was 44 years old, ranging from 26 to 78 years old. Nineteen individuals were diagnosed with oligodendroglioma, and 18 were diagnosed with astrocytoma. Thirteen participants had low EE, 17 had moderate EE, and 9 had high EE. Although not statistically significant, we observed patterns of increasing health outcomes (Montreal Cognitive Assessment, Symbol Digit Modality Test, and Karnofsky Performance Status Scale) related to increasing levels of EE. CONCLUSION: This study is an initial exploration into the role of EE in health outcomes and survivorship programs for persons with glioma. Future research should assess EE before treatment or at the time of diagnosis and be longitudinal to accurately ascertain the association between EE and health outcomes. Comprehensive neuro-oncology survivorship programs structured to facilitate EE may reduce symptom burden, promote neuroplasticity, and improve cognitive and functional outcomes after brain radiation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b62228f19337b9632c0d09984c9356e",
  "timestamp": "2025-05-15T03:22:26.066505"
}