{
  "id": 7117,
  "title": "High School Pupils' Relationships with Their Parents, Schoolmates, and Friends, and Health-Related Risk Behaviors",
  "abstract": "Purpose: The aims of this study were to evaluate high school pupils' relationships with their parents, schoolmates, and friends, and the presence of health-related risk behaviors among the family members and friends on the pupils' smoking and binge drinking status. Materials and Methods: The study was a cross-sectional population-based study that involved a questionnaire, and the sample involved 2908 pupils at high schools in Timis county, Romania. In our study, the following factors related to family members and friends and the living environment were identified. First, there were issues with the relationships with parents among some pupils, with 23.2% being neither satisfied nor unsatisfied and 4.9% being unsatisfied. Second, there were also issues regarding some pupils' satisfaction with the financial situation of their family, with 21.8% being neither satisfied nor unsatisfied and 16.4% being unsatisfied. An odds ratio (OR) is a statistic that quantifies the strength of the association between two events. Results: There were 1495 (51.5%) girls and 1407 (48.5%) boys aged 14-20 years, and 79.2% came from organized families. Among the pupils, 71.1% reported that they were satisfied with their relationship with their parents, while 4.9% were unsatisfied. Additionally, 46.2% were satisfied with the financial status of their families, while 16.4% were unsatisfied. Moreover, 59.2% were satisfied with their relationship with their schoolmates and 80.2% were satisfied with their relationship with their friends, while only 1.8% were unsatisfied with their relationship with their friends. The logistic regression model of the pupils' smoking status identified two moderate predictive factors: this was defined >1 friends who smoke (odds ratio [OR]=2.875) and smoking status of siblings (OR=2.222). The major predictive factor in the logistic regression model of occasional alcohol consumption in high quantities by pupils was male gender (OR=5.148). Conclusion: The predictive model of pupils' smoking status identified the following moderate predictors: high number of friends who smoke and smoking status of siblings The major predictor in the model of occasional alcohol consumption in high quantities by pupils was male gender.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b6de5a29782ef5afc46ebd2771a6a9c",
  "timestamp": "2025-05-15T03:05:32.006895"
}