{
  "id": 6406,
  "title": "Problem Gambling Among International and Domestic University Students in Australia: Who is at Risk?",
  "abstract": "Young people are a high risk group for gambling problems and university (college) students fall into that category. Given the high accessibility of gambling in Australia and its association with entertainment, students from overseas countries, particularly those where gambling is restricted or illegal, may be particularly vulnerable. This study examines problem gambling and its correlates among international and domestic university students using a sample of 836 domestic students (286 males; 546 females); and 764 international students (369 males; 396 females) at three Australian universities. Our findings indicate that although most students gamble infrequently, around 5 % of students are problem gamblers, a proportion higher than that in the general adult population. Popular gambling choices include games known to be associated with risk (cards, horse races, sports betting, casino games, and gaming machines) as well as lotto/scratch tickets. Males are more likely to be problem gamblers than females, and almost 10 % of male international students could be classified as problem gamblers. Hierarchical regression analysis showed that male gender, international student status, financial stress, negative affect and frequency of gambling on sports, horses/dogs, table games, casino gaming machines, internet casino games and bingo all significantly predicted problem gambling. Results from this study could inform gambling-education programs in universities as they indicate which groups are more vulnerable and specify which games pose more risk of problem gambling.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b7264b873f0f52808af404782be7352",
  "timestamp": "2025-05-15T02:57:38.853954"
}