{
  "id": 9333,
  "title": "Integrating Event-and Trend-Based Analyses to Improve Detection of Glaucomatous Visual Field Progression",
  "abstract": "Purpose: To present and evaluate a new method of integrating event-and trend-based analyses of visual field progression in glaucoma. Design: Observational cohort study. Participants: The study included 711 eyes of 357 glaucoma patients or suspects followed up for an average of 5.0 +/- 2.0 years with an average of 7.7 +/- 2.3 standard automated perimetry visual fields. An additional group of 55 eyes of 55 glaucoma patients underwent repeated tests over a short period to test the specificity of the method. Methods: Event-based analysis of progression was performed using the Guided Progression Analysis (GPA; Carl-Zeiss Meditec, Inc., Dublin, CA). Trend-based assessment used the visual field index (VFI). A hierarchical Bayesian model was built to incorporate results from the GPA in the prior distribution for the VFI slopes, allowing the event-based method to influence the inferences made for the trend-based assessment. Main Outcome Measures: The Bayesian method was compared with the conventional ordinary least squares (OLS) regression method of trend-based assessment. Results: Of the 711 eyes followed up over time, 64 (9%) had confirmed progression with GPA. Bayesian slopes of VFI change were able to detect 63 of these eyes (98%). An additional group of 49 eyes (7%) had progression by Bayesian slopes, but not by GPA. Slopes of VFI change calculated by the OLS method were able to identify only 32 of the 64 eyes (50%) with GPA progression. The agreement with GPA was significantly better for the Bayesian compared with the OLS method (kappa = 0.68 vs. 0.43, respectively; P<0.001). Eyes progressing only by the Bayesian method had faster rates of change than those progressing only by the OLS method. When applied to the 50 eyes in the stable glaucoma group, both the Bayesian and the OLS methods had a specificity of 96%. Conclusions: A Bayesian hierarchical modeling approach for integrating event-and trend-based assessments of visual field progression performed better than either method used alone. Estimates of rates of change obtained from the Bayesian model had increased precision and may be superior to the conventional OLS method for providing information on the risk of development of functional impairment in the disease. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2012;119:458-467 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b75cea079dd24d2d649e72ee301af63",
  "timestamp": "2025-05-15T03:27:53.339778"
}