{
  "id": 3145,
  "title": "Impact of short-term labor contracts on financial health: Evidence from migrant worker households in China",
  "abstract": "The increasing prevalence of short-term labor contracts in China's labor market, especially among migrant worker households, has raised significant concerns regarding their impact on financial health. This study examines the relationship between short-term labor contracts and the financial health of migrant worker households using data from the 2017 China Household Finance Survey (CHFS). Financial health is assessed using a comprehensive index that includes five dimensions: income and expenditure management, asset and liability management, liquidity management, risk protection, and retirement planning. To enhance the accuracy of the assessment, we employed the double-boundary method and applied ordinary least squares (OLS) and two-stage least squares (2SLS) regression models to address endogeneity concerns and ensure robustness. The results indicate that short-term contracts significantly reduce the financial health of migrant worker households, and the negative effect becomes more pronounced as contract durations decrease. This adverse impact is particularly evident among young, female-headed, small households, and those with high-risk preferences. Further analysis shows that short-term contracts predominantly affect financial health by reducing insurance participation, household income, and financial market engagement. Additionally, financial literacy is found to mitigate these negative effects, suggesting its important role in enhancing financial resilience. This study underscores the detrimental effects of short-term contracts on the financial health of migrant worker households and highlights the role of financial literacy as a mitigating factor. The findings provide valuable insights for policymakers and social organizations in developing targeted strategies to improve the financial well-being of this vulnerable group.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b83d1063e270ae87e752c46ee9a613a",
  "timestamp": "2025-05-15T02:22:56.774114"
}