{
  "id": 8035,
  "title": "Higher Benefit for Greater Need: Understanding Changes in Mental Well-being of Young Adults Following the ACA Dependent Coverage Mandate",
  "abstract": "Background: Beginning in late 2010, private health insurance plans were required to allow dependents up to age 26 to remain on a parent's plan. Known as the dependent coverage or young adult mandate, this provision increased coverage substantially within the group of 19-25 year-olds affected by the policy change. Subsequent work evaluating whether increased coverage had a positive effect on mental health found mild improvements in self-reported mental health. This work focused exclusively on average effects among young adults in the years after the policy change, leaving open the question of how young adults fared depending on where they reside in terms of the distribution of risk for mental health issues. Aims of the Study: We assess the effects of the dependent coverage mandate on young adult mental well-being focusing on the distribution of mental health issues. We seek to understand how potential improvements (or degradations) differ across the entire risk profile. Gains among individuals who are at low risk for severe mental health issues may send a far different signal than gains among those with higher risks. Methods: Using MEPS data from 2006 through 2013, we use quantile regression within a difference-in-differences design to compare pre/post outcomes across the distribution of risk for young adults ages 23-25 affected by the mandate to 27-29 year-olds not affected by the mandate. Further, we evaluate differences in the effect of the mandate by sex, given well-known disparities in incidence and prevalence of mental illness between men and women. To gauge the effects of the mandate on mental health, we use the Mental Component Score measure within the MEPS, ideal for our quantile regression given the broad range of scores. The key premise in our evaluation is that individuals with higher risks for mental health problems due to biological or socioeconomics factors are more likely to rank at locations of the mental health score distribution indicating worse outcomes. Results: We find significant improvements in self-reported mental health in the 23-25 year-old group following the mandate. However, the gains were not equal across the risk distribution. For individuals at the 0.1 quantile (worse self-reported mental health), the improvement in MCS scores was significant, a 6.1% increase compared to the pre-mandate baseline at that quantile. Effects were smaller but still significant at the median but there was no apparent effect for those that were at higher levels of self-reported mental health. Our results also suggest improvements for women (+9% relative to baseline at the 0.1 quantile, e.g.) but limited evidence of an effect for men. Implications for Future Research: The finding that increased insurance coverage led to improved self-reported mental health foremost for young adults with the highest risk of mental health problems is encouraging. However, the mechanism for this effect is unclear and in need of further study. Whether improvements in the mental health status of the population depend more on increased access to services or derive primarily from improved financial security is an important research area.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3b9e94d6451a244a89bd7c2e306b7683",
  "timestamp": "2025-05-15T03:14:37.334980"
}