{
  "id": 5227,
  "title": "Personal characteristics and risk tolerance in a natural experiment",
  "abstract": "Purpose This paper examines students' decisions when playing an in-class version of the TV game, Deal or No Deal (DOND), to study the relation between personal characteristics and individual decision-making under risk. Design/methodology/approach This study analyzes DOND game play data collected from 374 students in 13 university finance classes, and their personal characteristics collected in a post-game survey. It uses ordered probit, OLS and probit regression analysis to examine the impact of personal characteristics on an individual's risk tolerance. Findings The key finding is that international students are significantly more risk averse than US domestic students. Additionally, given the natural control for age and education, the study finds that gender, race and religion have a limited impact on an individual's risk tolerance. Finally, the study provides evidence that the structure of the DOND game, in general, rewards risk-taking as long as it is not excessive. Once participant behavior becomes risk-seeking, the correlation between risk-taking and game payoff becomes negative. Research limitations/implications The homogeneous set of contestants (business students) analyzed in this study presents some limitations yet provides opportunities to examine risk tolerance differences between the US and international students, and whether gender, race or religious affiliation has an impact on the level of risk tolerance given a natural control for age and education level. Practical implications The evidence suggests that culture and environmental unfamiliarity may impact an individual's risk tolerance. This finding is useful when providing financial advice to diverse clients or when conducting international business. Additionally, understanding that education and financial literacy reduces differences in risk tolerance across gender, race and religion can impact the way we interact with others. A broader practical implication for all investors is that, while under normal circumstances, risk-taking is rewarded with a higher expected return, excessive risk-taking may harm their investment performance. Originality/value This paper utilizes a unique data set, collected through a class activity and post-class survey. While there have been empirical studies using DOND data, this is the first study that examines the impact of personal characteristics on game participants' behavior, thereby generating unique findings not reported in previous studies employing DOND data.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bb84ee7e74b5a433ef4243de5b28fc7",
  "timestamp": "2025-05-15T02:45:47.366221"
}