{
  "id": 8844,
  "title": "A retrospective observational study of length of stay in hospital after colorectal cancer surgery in England (1998-2010)",
  "abstract": "The National Health Service (NHS) is facing financial constraints and thus there is considerable interest in ensuring the shortest but optimal hospital stays possible. The aim of this study was to investigate patterns of postoperative length of stay (LOS) stay across the English NHS and to identify factors that significantly influence both optimal and prolonged LOS. Data were obtained from the National Cancer Data Repository (NCDR). National patterns of LOS were examined and multilevel mixed effects logistic regression was used to study factors associated with an ideal (<= 5 days) or a prolonged (>= 21 days) LOS in hospital after major resection. Funnel plots were used to examine variation across hospitals in both risk-adjusted and unadjusted LOS. All 240,873 individuals who underwent major resection for colorectal cancer were diagnosed between 1998 and 2010 in the English NHS. The overall median LOS was 10 (interquartile range [IQR] 7-14 days) days, but it fell over time from 11 (IQR 9-15) days in 1998 to 7 (IQR 5-12) days in 2010. The proportion of people experiencing ideal LOS increased dramatically from 4.9% in 1998 to 34.2% in 2010, but the decrease in the proportion of patients who experienced a prolonged LOS was less marked falling from 11.2% to 8.4%, respectively. Control charts showed that there was significant variation in short and prolonged LOS across NHS trusts even after adjustment for case-mix. Significant variation in LOS existed between NHS hospitals in England throughout period 1998 to 2010. Understanding the underlying causes of this variation between surgical providers will make it possible to identify and spread best practice, improve services, and ultimately reduce LOS following colorectal cancer surgery.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bc884df37ed605077fad975a1e1571f",
  "timestamp": "2025-05-15T03:22:57.922018"
}