{
  "id": 8357,
  "title": "The gendered relationship between illicit substance use and self-harm in university students",
  "abstract": "Purpose To estimate associations between multiple forms of substance use with self-harming thoughts and behaviours, and to test whether gender is an effect modifier of these associations, both independently and along with perceived risk of cannabis use. Methods Data were drawn from the 2018 Norwegian Students' Health and Wellbeing Study (SHoT 2018). A national sample of n = 50,054 full-time Norwegian students (18-35 years) pursuing higher education completed a cross-sectional student health survey, including questions on past-year self-harm: non-suicidal thoughts of self-harm, non-suicidal self-harm, suicidal thoughts, and suicide attempt. Students reported their frequency of past-year alcohol use (range: never to >= 4 times/ week), illicit substance consumption, and perceived risk of cannabis use. The AUDIT and CAST screening tools measured problematic alcohol and cannabis consumption, respectively. We used logistic regression modelling adjusted for age, symptoms of depression and anxiety, and financial hardship (analytic sample range: n = 48,263 to n = 48,866). Results The most frequent alcohol consumption category (>= 4 times/ week) was nearly always associated with more than a two-fold increased likelihood of self-harm. Less frequent alcohol consumption was associated with reduced odds of suicidal thoughts [monthly or less: OR = 0.87 (95% CI: 0.75-1.00), 2-4 times/month: OR = 0.79 (95% CI: 0.69-0.91), and 2-3 times/ week: OR = 0.83 (95% CI: 0.71-0.98)]. Problematic alcohol consumption was associated with most outcomes: odds ranging from 1.09 (95% CI: 1.01-1.18) for suicidal thoughts to 1.33 (95% CI: 1.00-1.77) for suicide attempt. There was evidence of multiple illicit substance by gender interactions: consumption of all but one illicit substance category (other drug use) was associated with all four forms of self-harm for women, but findings among men were less clear. Among men, only one illicit substance category (stimulant) was associated with most forms of self-harm. Women, but not men, who perceived cannabis use as a health risk were more likely to experience non-suicidal thoughts as cannabis consumption increased, and with harmful consumption patterns. Conclusion Frequent alcohol consumption is associated with increased risk of self-harm and suicidality for young women and men. Associations between illicit substance use and self-harm and suicidality appear stronger in women compared to men.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bcbe31f4e59835d740a9635a842a317",
  "timestamp": "2025-05-15T03:17:49.204315"
}