{
  "id": 2580,
  "title": "Does gold act as a safe haven against exchange rate fluctuations? The case of Pakistan rupee",
  "abstract": "Investors often look for a refuge to avoid undesirable exposures to risk during period of extreme downturns in currency returns. We investigate daily gold and rupee exchange rates depreciation against set of currencies over the period of 1992-2015. Using wavelets at multiple time horizons; we find that gold act as a consistent short run hedge against exchange rate hence validating the exchange rate destruction hypothesis. This finding is helpful for speculators in their decision making while taking long and short positions accordingly. This finding suggests that central bank also need to keep other safe haven assets in reserves because the hedging ability of gold is only limited to short run. Further, the role of gold in providing protection against currency risks is also confirmed using quantile regression. These results assist portfolio managers and governments in formulating effectual diversification strategy for preserving investment portfolio during extreme event condition. Our results also suggest that gold has a lead relationship with exchange rate; however, this relationship switches over specific time intervals. This finding is of major concern for policy makers in determining the extent of stabilization in gold prices to bring consistency to exchange rate. Finally, the Granger coherence coefficients confirm that the strength of the causal relationship varies across over all frequencies. These conclusions have important implications for policy makers, economic analysts, portfolio managers and institutional investors. (C) 2018 The Society for Policy Modeling. Published by Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bf0a8764de73da18685aafad1bae281",
  "timestamp": "2025-05-15T01:08:10.930735"
}