{
  "id": 6107,
  "title": "Types of Elder Abuse and Dementia Onset among Older Adults in Japan: A 6-year Longitudinal Study from the Japan Gerontological Evaluation Study",
  "abstract": "Objectives: Elder abuse is a growing global public health concern. Previous studies have reported that elder abuse increases the risk of dementia; however, to the best of our knowledge, no studies have investigated the association between different types of abuse and dementia onset yet. This study, therefore, investigated the association between physical, psychological, and financial abuses and dementia onset in independent older adults in Japan. Methods: A 6-year prospective cohort data from the Japan Gerontological Evaluation Study (JAGES) were collected in 2010 through a mail survey conducted among 5,674 men and 6,562 women aged >= 65 years across Japan. Dementia was assessed using the nationally standardized dementia scale proposed by the Ministry of Health, Labor and Welfare. Poisson regression analysis was performed separately for each type of abuse to calculate the incidence rate ratios and 95% confidence intervals. Results: During follow-up, 552 (9.7%) men and 728 (11.1%) women developed dementia. After adjusting for potential confounders, participants who experienced financial abuse were 1.53 (1.09-2.16) times more likely to develop dementia than those who did not. On the other hand, participants who experienced physical abuse were 1.53 (0.92-2.56) times more likely and those who experienced psychological abuse were 0.98 (0.82-1.17) times less likely to develop dementia than participants who did not experience such abuses. However, the difference was not significant. Conclusion: Financial abuse may promote dementia among older adults in Japan, suggesting that preventing this abuse may help prevent dementia onset. However, further studies with larger data sets are warranted.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bf9e059fc0c0950137f2bafdd6edcc1",
  "timestamp": "2025-05-15T02:54:39.144909"
}