{
  "id": 3866,
  "title": "The effect of the adoption of International Financial Reporting Standards on foreign portfolio investment in Africa",
  "abstract": "The adoption and implementation of International Financial Reporting Standards (IFRS) are anticipated to enhance the quality and credibility of financial statement in terms of reliability, transparency and comparability. Consequently, it presupposes improving the functioning of the capital market and influence foreign investments to flow into adopting countries. This study examines the effect of the adoption of IFRS on foreign portfolio investment (FPI) in Africa. Annual FPI data from the Balance of Payments and International Investment Position from 1994 to 2015 were employed. The panel data regression considered fixed-effects and random-effects models. Besides, the system generalised method of moments estimator is employed for the robustness of the model and to address the problem of endogeneity. In correspondence with the decision-usefulness theory, our findings indicate that FPI is promoted in the African countries that apply IFRS-based financial statement. The adoption of IFRS is assumed to be an informational change that would eliminate information barriers facing the users of financial statements. Therefore, the development of IFRS is aimed at improving the usefulness of financial reporting by facilitating the comparability and reliability of financial information in African countries. This will influence foreign investors to shift their capital to such an economy, consequently increasing the inflow of FPI.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3bff4861406011bcb2fa7034eadf0e71",
  "timestamp": "2025-05-15T01:21:41.366308"
}