{
  "id": 6659,
  "title": "What Information in Financial Statements Could Be Used to Predict the Risk of Equity Investment?",
  "abstract": "Theoretically, accounting earnings could be used to estimate the intrinsic value of equity. If accounting earnings could be predicted accurately, then, so could be the value of equity, thereby, creating much less risk in equity investment. However, earnings surprises are common, and therefore so is the risk in equity investment. To quantify the risk in the investment implied from accounting earnings, I propose to use financial statements to construct abnormal sales growth rates (ABG) and abnormal changes in profit margins (ABPM) to measure the uncertainty embedded in the accounting earnings. I measure ABG (ABPM) as the difference between the current value of sales growth rate (profit margin) and its benchmark, a weighted value of the three preceding years' sales growth rate (profit margin). Then, I quantify whether and to what extent the news of ABG and ABPM are material enough to change the expected earnings (proxied by analysts' forecasted earnings revisions [FREV] and predicted unexpected earnings [UE], and future stock returns [SAR]). Fama-MacBeth regression results show that, together, solely ABPM and ABG could explain 8.2% (2.3%) (5.4%) of the variation of FREV (UE) (SAR). The risk-predictability of ABPM and ABG is robust to the presence of abnormal growth in net operating assets and accruals quality, which, suggested by previous literature, might influence unexpected earnings. Further contingent analyses indicate that the capital market reacts more strongly to the bad news embedded in the ABPM/ABG (with negative signs) than the good news in ABPM/ABG (with positive signs).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c0e0a2b7a16879ff6c3fdef070ebd47",
  "timestamp": "2025-05-15T03:00:05.088489"
}