{
  "id": 6731,
  "title": "Negative Life Events and Attempted Suicide in Rural China",
  "abstract": "Objective This study aimed to examine the association between negative life events (NLEs) and attempted suicide in rural China. Methods Six rural counties were selected from disease surveillance points in Shandong province, China. A total of 409 suicide attempters in rural areas between October 1, 2009, and March 31, 2011, and an equal number of matched controls were interviewed. We compared negative life events experienced within 1 month, 1-3 months, 3-6 months, and 6-2 months prior to attempted suicide for cases and prior to interview for controls. We used multivariate logistic regression to examine the association between NLEs and attempted suicide. Results Suicide attempters experienced more NLEs within the last year prior to suicide attempt than controls prior to interview (83.1% vs. 33.5%). There was a significant dose-response relationship between NLEs experienced within the last year and increased risk of attempted suicide. Timing of NLEs analysis showed that NLEs experienced in the last month and 6-12 months prior to suicide attempt were significantly associated with elevated risk of attempted suicide, even after adjusting for mental disorders and demographic factors. Of NLEs, quarrelling with spouse, quarrelling with other family members, conflicting with friends or neighbors, family financial difficulty, and serious illness were independently related to attempted suicide. Conclusion NLEs are significantly associated with increased risk for attempted suicide in rural China. Stress management and intervention may be important to prevent suicidal behavior in rural China.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c221da7c03eee80b7dc1266ab397743",
  "timestamp": "2025-05-15T03:01:03.568168"
}