{
  "id": 1724,
  "title": "Risk analysis of China's financial market collapse based on cloud computing and machine learning algorithms",
  "abstract": "In recent years, with the rapid advancement of hardware and software algorithms, information technology has penetrated every aspect of our lives, creating waves of digital transformation in enterprises represented by four underlying technologies, namely: 'artificial intelligence, big data, cloud computing, and blockchain'. As a result, digital technology has emerged as the primary force behind industrial transformation and upgrading, as well as high-quality development. Using the data of Shanghai and Shenzhen A-share listed companies from 2007 to 2020, this paper empirically examines the impact of the digital transformation of listed companies on their stock price crash risk and its mechanism using a two-way fixed effect model with time and individual effects. It can be seen from the research results that, overall, enterprise digital transformation can significantly reduce the risk of a stock price crash. Further analysis reveals that this risk-inhibiting effect is more apparent for private enterprises and small and medium-sized enterprises. In terms of impact mechanism, digital transformation can reduce the risk of a stock price crash by improving the quality of enterprise information internally, while the more analysts pay attention to an issue, the more obvious the role of digital transformation in reducing the risk of a stock price crash for enterprises externally. However, it is worth noting that if the stock price of an enterprise crashes, blindly implementing digital transformation may increase the crash risk. The paper illustrates the practical importance of digital technology from the perspective of enterprises in stabilizing the crash risk of stock prices and improving the performance of the capital market. Meanwhile, it contributes to theoretical research on the impact of digital transformation on microeconomic entities and provides practical knowledge and evidence for enterprises to accelerate digital transformation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c23d7799c4f1996894c4ecd74416e91",
  "timestamp": "2025-05-15T02:06:52.667184"
}