{
  "id": 2111,
  "title": "Has financial inclusion made the financial sector riskier?",
  "abstract": "Purpose This paper aims to examine whether high levels of financial inclusion is associated with greater financial risk. Design/methodology/approach The study uses regression methodology to estimate the effect of financial inclusion on financial risk. Findings The findings reveal that higher account ownership is associated with greater financial risk through high non-performing loans and high-cost inefficiency in the financial sector of developed countries, advanced countries and transition economies. Increased use of debit cards, credit cards and digital finance products reduced risk in the financial sector of advanced countries and developed countries but not for transition economies and developing countries. The findings also show that the combined use of digital finance products with increased formal account ownership improves financial sector efficiency in developing countries while the combined use of credit cards with increased formal account ownership reduces insolvency risk and improves financial sector efficiency in developing countries. Research limitations/implications The paper offers several implications for policy and financial regulation. It suggests policies that would reduce the financial risk that financial inclusion poses to the financial sector. Originality/value The recent interest in financial inclusion and the unintended consequences of policy-driven financial inclusion in some parts of the world is raising concern about the risks that financial inclusion may introduce to the formal financial sector. Little is known about the risks that financial inclusion may pose to the financial sector.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c35fac609304fdac170f92e560c1616",
  "timestamp": "2025-05-15T02:10:59.122364"
}