{
  "id": 4951,
  "title": "Suicidal ideation and thoughts of self-harm during the COVID-19 pandemic: The role of COVID-19-related stress, social isolation, and financial strain",
  "abstract": "Background: There are significant concerns about mental health problems occurring due to the coronavirus disease 2019 (COVID-19) pandemic. To date, there has been limited empirical investigation about thoughts of suicide and self-harm during the COVID-19 pandemic. Methods: A national survey was conducted May 2020 to investigate the association between mental health symptoms, social isolation, and financial stressors during the COVID-19 pandemic and thoughts of suicide and self-harm. A total of 6607 US adults completed an online survey; survey criteria included an age minimum of 22 years old and reported annual gross income of $75,000 or below. Statistical raking procedures were conducted to more precisely weight the sample using US Census data on age, geographic region, sex, race, and ethnicity. Results: COVID-19-related stress symptoms, loneliness, and financial strain were associated with thoughts of suicide/self-harm in multivariable logistic regression analyses, as were younger age, being a military veteran, past homelessness, lifetime severe mental illness, current depressive symptoms, alcohol misuse, and having tested positive for COVID-19. Greater social support was inversely related to thoughts of suicide/self-harm whereas running out of money for basic needs (e.g., food), housing instability (e.g., delaying rent), and filing for unemployment or disability were positively related. Conclusions: Public health interventions to decrease risk of suicide and self-harm in the wake of the COVID-19 pandemic should address pandemic-related stress, social isolation, and financial strain experienced including food insecurity, job loss, and risk of eviction/homelessness.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c4527e5cbdb16c10ad752d60f5593b7",
  "timestamp": "2025-05-15T02:42:36.249481"
}