{
  "id": 4316,
  "title": "Corporate Social Responsibility Disclosure (CSRD) and Financial Distressed Risk (FDR): Does Institutional Ownership Matter?",
  "abstract": "This study aims to investigate the effect of corporate social responsibility disclosure (CSRD) on financial distressed risk (FDR) among firms listed on the Tehran Stock Exchange (TSE). This paper also examines whether there is a negative linkage between institutional ownership as a corporate governance mechanism and corporate bankruptcy. The final research purpose is to analyze if there is a moderating effect of institutional owners on the relationship between CSRD and FDR too. The study sample consists of 200 firms listed on the TSE between 2013 and 2018, and the statistical model is logistic regression. When FDR is assessed under both Article 141 of Iran's business law and the Altman Z-score model, our results on the main research hypotheses are quite similar. Considering the social and cultural conditions and economic situation of the Iranian market, the results show that firms with a high level of CSR disclosure are not able to make themselves more creditworthy and do not have better access to financing, resulting in more financial insolvency. Our findings confirm institutional shareholders play a vital role in facilitating a firm's emergence from bankruptcy. The results also demonstrate financial distress risk is less seen among companies with more institutional owners that disclose more CSR information. In other words, since the goals related to CSR are long-term and Iranian institutional investors have a long-term horizon towards the company, the presence of more institutional owners within a firm push managers to provide additional voluntary CSR disclosure so firms can maintain the trust of their shareholders at the highest possible level and prevent financial distress. Our additional analysis indicates there is a positive association between financial leverage and firm failure, whereas the current ratio and ROA are negatively connected with corporate bankruptcy. Finally, when FDR is assessed on the Altman Z-score model, our evidence supports a negative relation between purchase and sale-related party transactions and bankruptcy risk, which is consistent with the efficient transaction hypothesis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c49eff3176cf744612de6ef6b7a1bd6",
  "timestamp": "2025-05-15T02:36:05.139367"
}