{
  "id": 6313,
  "title": "Risk and Protective Factors for Suicide Mortality Among Patients With Alcohol Dependence",
  "abstract": "Objective: People with alcohol dependence suffer from poor health outcomes, including excessive suicide mortality. This study estimated the suicide rate and explored the risk and protective factors for suicide in a large-scale Asian population. Method: We enrolled patients with alcohol dependence (ICD-9 code 303**) consecutively admitted to a psychiatric center in northern Taiwan from January 1, 1985, through December 31, 2008 (N = 2,793). Using patient linkage to the national mortality database (1985-2008), we determined that 960 patients died during the study period. Of those deaths, 65 patients died of suicide. On the basis of risk-set sampling for the selection of controls, we conducted a nested case-control study and collected the information by means of a standardized chart review process. We estimated the standardized mortality ratio (SMR) for suicide mortality. Conditional logistic regression was employed for exploring the risk and protective factors for suicide. Results: The study subjects had excessive suicide and all-cause deaths, with SMRs of 21.2 and 12.7, respectively. We pinpointed auditory hallucination (adjusted risk ratio [aRR] = 1.80, P =.04) and attempted suicide (aRR = 7.52, P =.001) as the risk factors associated with suicide. In contrast, protective factors included financial independence (aRR = 0.11, P =.005) and being married (aRR = 0.16, P =.02). Intriguingly, those with physical illnesses had a lower risk of suicide (aRR = 0.15, P =.01). Conclusions: Compared with the general population, those with alcohol dependence faced excessive suicide mortality. For a comprehensive approach to suicide prevention, recognizing and improving the protective factors could have equal importance in mitigating the risk of suicide. (C) Copyright 2015 Physicians Postgraduate Press, Inc.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c5750037898e1bf9b9f47597c143e06",
  "timestamp": "2025-05-15T02:57:07.646622"
}