{
  "id": 2403,
  "title": "Research on venture capital based on information entropy, BP neural network and CVaR model of digital currency in Yangtze River Delta",
  "abstract": "In 2008, the financial crisis caused by the SUBPRIME mortgage crisis and the development of information technology showed that people's life was gradually networked and digitized, and the digital currency represented by Bitcoin was generated. This paper discusses the investment opportunities and risks brought by the rise of digital currency and its importance to the development of One Belt and One Road. We propose a currency digital venture capital model based on information entropy, BP neural network and CVaR model. The model is divided into two parts. Part A is the research on the risk index model of digital currency based on the information entropy change of CVaR model. Part B is by BP neural network toolbox and CVaR model changing weights of digital currency risk index model, and analyse the development of digital currency weighted score to get the advantage of the Yangtze river delta region. It is of practical significance to build a venture capital model to predict the future development prospect of digital currency and get an investment model with more beneficial returns for investors to avoid risks. (C) 2021 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (https://creativecommons.org/licenses/by-nc-nd/4.0) Peer-review under responsibility of the scientific committee of the International Conference on Identification, Information and Knowledge in the internet of Things, 2020.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c71bfc6f01ed390e15b0f26d8eace32",
  "timestamp": "2025-05-15T02:14:50.348411"
}