{
  "id": 5062,
  "title": "Is the association between precarious employment and mental health mediated by economic difficulties in males? Results from two Italian studies",
  "abstract": "Background: Flexible employment is increasing across Europe and recent studies show an association with poor mental health. The goal of the current study is to examine this association in the Italian population to assess the possible mediating role of financial strain. Methods: Data were obtained by two Italian cross-sectional studies (PASSI and HIS) aimed at monitoring the general population health status, health behaviours and determinants. Mental health status was assessed using alternatively two validated questionnaires (the PHQ-2 and the MCS-12 score) and Poisson regression models were performed to assess if precarious work was associated with poor mental health. A formal mediation analysis was conducted to evaluate if the association between precarious work and mental health was mediated by financial strain. Results: The analyses were performed on 31,948 subjects in PASSI and on 21,894 subjects in HIS. A nearly two-fold risk of depression and poor mental health was found among precarious workers, compared to workers with a permanent contract, which was strongly mediated by financial strain. Conclusions: Even with the limitations of a cross-sectional design, this research supports that precarious employment contributes through financial strain to reduce the mental health related quality of life and to increase mental disorders such as symptoms of depression or dysthymia. This suggests that when stability in work cannot be guaranteed, it would be appropriate to intervene on the wages of precarious jobs and to provide social safety nets for ensuring adequate income.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c7cd7a57afdb5cbb50ef7386f05e929",
  "timestamp": "2025-05-15T02:43:40.310068"
}