{
  "id": 8483,
  "title": "Geography and the Burden of Care in Pediatric Cancers",
  "abstract": "BackgroundChildhood cancers typically require rigorous treatment at specialized centers in urban areas, which can create substantial challenges for families residing in remote communities. We evaluated the impact of residence and travel time on the burden of care for families of childhood cancer patients. ProcedureWe conducted a cross-sectional, self-administered survey of 354 caregivers of pediatric cancer patients at a children's hospital serving a seven state area. Measures included the impact of cancer treatment on relocation, employment, schooling, and finances. We evaluated these domains by rural/urban residence and travel time (>1hour and >2hours) to the hospital in multivariable regression models. ResultsOf the 29% of caregivers who reported moving residences as their child was diagnosed, 33% reported that the move was due to their child's cancer. Rural and remote (e.g., >1hour travel time) caregivers missed more days of work during the first month after diagnosis than did urban and local caregivers, however, these differences did not persist over the first 6 months of therapy. One-third of caregivers reported quitting or changing jobs as a direct result of their child being diagnosed with cancer. Rural respondents had greater out-of-pocket travel expenses and reported a significantly greater perceived financial burden. Rural patients missed more school days and were at an increased risk of having to repeat a grade. ConclusionsChildhood cancer has an appreciable impact on the lives of patients and caregivers. The burden is greater for those living far from a treatment center. Pediatr Blood Cancer 2014;61:1918-1924. (c) 2014 Wiley Periodicals, Inc.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c842a415f61d56a3da379851507075a",
  "timestamp": "2025-05-15T03:19:21.319286"
}