{
  "id": 4048,
  "title": "The opportunity cost of household transport expenditure in South Africa",
  "abstract": "Background: Transport affordability is a significant concern for South African households, who spend nearly a fifth of their budgets on transport. Contributing factors include a lack of affordable public transport options and spatial mismatch. Since 2015, stagnating national budgets and a declining share allocated to the transport portfolio have exacerbated household transport expenses, limiting economic mobility. Objectives: This article examines how changes in household transport expenses impact other essential expenses such as food, housing, clothing, recreation and education. Understanding these expenditure trade-offs provides insights for policy, especially as the National Public Transport Subsidy Policy is being prepared. Method: Using data from the Living Conditions Survey of 2014/2015, the study applies fractional logit regression models to estimate the impact of varying household transport expenses on other expenditure categories across diverse household demographics. Results: Findings indicate that increased household transport expenses significantly reduces allocations to essential items, notably food and housing, with the effects varying by income level, settlement type, and household composition. Conclusion: A core recommendation is to reduce transport expenses for low-income households through government intervention as this will increase these, mostly previously disadvantaged households', economic mobility. Contribution: Results show that if low-income households allocate no more than 10% of their expenditure budgets to transport, they could potentially increase their expenditure share on food (+1.30%) housing (+1.18%) clothing (+0.86%) recreation (+0.31%) and education (+0.08%).",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3c95fb157124f186b5a252c1a7d9dd38",
  "timestamp": "2025-05-15T01:23:27.284403"
}