{
  "id": 30,
  "title": "The non-uniform pricing effect of employee stock options using quantile regression",
  "abstract": "Issuing employee stock options (ESOs) transfers equity claims from current stockholders to employees, and thereby dilutes existing shareholder interests. Because employees are motivated to exert additional effort toward better performance, the value of transferred ownership claims proxied by ESO expense represents a cost of generating firm value. There are several econometric issues, most notably including the fact that the disclosed ESO expense is an endogenous variable. Without controlling for the simultaneity problem, inferences based on results from OLS analyses may be misleading. More importantly, a considerable amount of ESO expense data is censored at zero. Such a censoring problem can make the population distribution severely skewed, resulting in estimation bias. Therefore, we need to take into account the censored data issue. No prior studies have considered these two issues simultaneously. Failure to control for both censoring problem and endogeneity could explain the inconsistent results documented in prior studies. In this paper, we use the two-stage quantile regression (QR) proposed by Amemiya (1982) and Powell (1983) to examine possible nonlinear relationships, especially whether conditionally higher-stock price (or better performing) firms show a stronger negative pricing effect of ESO expense (that is, the relation between ESO expense and share price) than conditionally lower-share price firms. Our results suggest that the linear regression model greatly underestimates this negative pricing effect at higher quantiles, so the nonlinear relationship is obscure when using the standard linear model. We also consider alternative interpretations as to why heterogeneity exists in the pricing effect of ESO expense and assess whether our results concur with these explanations. (C) 2013 Elsevier Inc. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ca96dea47fb1530f04a7c468a51fc5e",
  "timestamp": "2025-05-15T01:27:29.514551"
}