{
  "id": 808,
  "title": "Swiss Hypertension and Risk Factor Program (SHARP):: Cardiovascular risk factors management in patients with type 2 diabetes in Switzerland",
  "abstract": "The prevalence of hypertension in type 2 diabetics is high, though there is no published data for Switzerland. This prospective cohort survey determined the frequency of type 2 diabetes mellitus associated with hypertension from medical practitioners in Switzerland, and collected data on the diagnostic and therapeutic work-up for cardiovascular risk patients. The Swiss Hypertension And Risk Factor Program ( SHARP) is a two-part survey: The first part, I-SHARP, was a survey among 1040 Swiss physicians to assess what are the target blood pressure ( BP) values and preferred treatment for their patients. The second part, SHARP, collected data from 20,956 patients treated on any of 5 consecutive days from 188 participating physicians. In I-SHARP, target BP <= 135/85 mmHg, as recommended by the Swiss Society of Hypertension, was the goal for 25% of physicians for hypertensives, and for 60% for hypertensive diabetics; values >140/90 mmHg were targeted by 19% for hypertensives, respectively 9% for hypertensive diabetics. In SHARP, 30% of the 20,956 patients enrolled were hypertensive ( as defined by the doctors) and 10% were diabetic ( 67% of whom were also hypertensive). Six per cent of known hypertensive patients and 4% of known hypertensive diabetics did not receive any antihypertensive treatment. Diabetes was not treated pharmacologically in 20% of diabetics. Proteinuria was not screened for in 45% of known hypertensives and in 29% of known hypertensive diabetics. In Switzerland, most physicians set target BP levels higher than recommended in published guidelines. In this country with easy access to medical care, high medical density and few financial constraints, appropriate detection and treatment for cardiovascular risk factors remain highly problematic.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cafc8e4873cd6ce3e64b43a3b0ef4fb",
  "timestamp": "2025-05-15T01:42:44.496802"
}