{
  "id": 4249,
  "title": "Nexus between Sustainability Reporting and Firm Performance: Considering Industry Groups, Accounting, and Market Measures",
  "abstract": "The relationship between Sustainability Reporting and corporate financial performance is overlapping and multifaceted and it has been an interesting issue for both academics and professionals since the beginning of the millennium. Studies have found divergent results on this relation and the industrial differences are omitted in many papers. Moreover, studies considering developing countries are scarce. The purpose of this study is to shed light on the relationship between sustainability reporting and firm performance in a developing country context. The impact of sustainability reporting is investigated using pooled ordinary least square (OLS) method for panel data regression through two models based on Tobin's Q and ROA. A total of 920 observations for 46 companies with 3 different impact levels based on their environmental effect and 5-year quarterly panel data between 2016-2020. The research used data from Borsa Istanbul (Istanbul Stock Exchange) and also independent variables such as leverage, risk, size, current ratio, growth, sustainability reporting, and the environmental impact level of companies. The results showed that sustainability reporting has a significant positive impact on financial performance according to the ROA model, and a significant negative correlation between risk and financial performance according to both ROA and Tobin's Q models. Considering the environmental impact of companies, the results also reveal a positive relationship between high impact companies' sustainability reporting and short-term financial performance as ROA is an accounting-oriented measure that reveals the company's short-term financial performance. Further research should investigate the impact of sustainability reporting in different markets based on the impact level of companies and the development degree of countries.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cb1d0ac302b6ef12c10ee26edd793c5",
  "timestamp": "2025-05-15T02:34:48.938705"
}