{
  "id": 2745,
  "title": "The relationship between earnings volatility and corporate risk disclosures",
  "abstract": "Background: Corporate risk management theory argues that effective hedging with derivatives should reduce earnings volatility and enhance firm value. However, studies that have examined the relationship between the use of derivatives and earnings volatility, particularly from developed markets have reported mixed results. Aim: This study investigates the relationship between corporate risk management practices such as the use of derivatives and earnings volatility. More specifically, it examines whether the use of derivatives by non -financial firms listed on the JSE has an effect of smoothing earnings volatility. Setting: The setting includes 135 JSE listed non -financial companies during the period 2005-2021. Method: Firm level data were obtained from financial data depositories, IRESS and Thomson Reuters Datastream. This study made use of panel estimated generalised least squares method (period seemingly unrelated regression) regression model in the analysis. Results: The findings of this study contradict the prediction of corporate risk management theory. The empirical findings showed that derivatives use measured by a dichotomous variable was positively associated with earnings volatility, meaning that derivatives were not effective in smoothing earnings volatility. However, when derivatives use is measured by a continuous variable, the empirical findings showed a weak association. Conclusion: The present study rejects the null hypothesis based on the results of the regression models. However, the results of this study do not suggest that JSE listed firms are ineffective in managing risks and cannot conclude that these firms used derivatives for speculative purposes, exposing themselves to additional risks and volatility.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cda2259c1ad6897f0b4e1015a4fc462",
  "timestamp": "2025-05-15T02:18:37.190843"
}