{
  "id": 2414,
  "title": "Financial performance under influence of credit risk in non-financial firms: evidence from Pakistan",
  "abstract": "Purpose The main purpose of this study is to examine the relationship between credit risk and financial performance in non-financial firms. Design/methodology/approach In order to test the relationship between Altman Z-score model as a credit risk proxy and the Return on Asset and Equity as indicator for financial performance with control variables leverage, liquidity and firm size. Least Square Dummy Variable regression analysis is opted. This research's sample included 69 non-financial companies from the Pakistan Stock Exchange KSE-100 Index between 2012 and 2017. Findings This study establishes the findings that Altman Z-score, leverage and firm size significantly impact the financial performance of the KSE-100 non-financial firms. However, liquidity is found to be insignificant in this study. Altman Z-score and firm size have shown a positive relationship to the financial performance, whereas leverage is inversely related. Practical implications This study brings in a new and useful insight into the literature on the relationship between credit risk and financial performance. The results of this study provide investors, businesses and managers related to non-financial firms in the KSE-100 index with significant insight about credit risk's impact on performance. Originality/value The evidence of the credit risk and financial performance on samples of non-financial firms has not been studied; mainly it has been limited to the banking sector. This study helps in the evaluation of Altman Z-score's performance in the non-financial firms in KSE-100 index as well.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ce6ff2c8f8d017e9e463681bc79b80b",
  "timestamp": "2025-05-15T02:15:26.923755"
}