{
  "id": 110,
  "title": "Early warning of enterprise financial risk based on improved BP neural network model in low-carbon economy",
  "abstract": "The concept of low-carbon economic development has led to changes in the business environment and financial environment of enterprises, leading to increased financial risks faced by enterprises. How to help enterprises better warn, prevent and control financial risks from the perspective of low-carbon economy has become a hot issue worth studying. Based on this, this paper is based on the perspective of low carbon economy, on the basis of analyzing the financing risk, investment risk, capital operation risk and growth risk faced by enterprises under the requirements of low carbon economy development. A set of financial risk management framework with clear hierarchy and strict vertical logic has been constructed. Ten financial early-warning indicators are constructed from four aspects. The risk prediction model of the indicator system is established using the research method of BPNN (Back Propagation Neural Network). The model is trained and simulated through the MATLAB neural network toolbox. After 10 indicators passed Bartlett's correlation test, the BPNN financial early warning model was programmed using MATLAB software. The accuracy rate was 84.3%. The neural network training results show that when the layer node is 8, the best correct recognition rate can be obtained. Incorporate low carbon into the financial risk early warning indicator system that meets the requirements of low carbon economic development in the design of enterprise financial risk early warning indicators. This paper is expected to provide reference and reference for low-carbon economy enterprises to deal with financial risks under the new situation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cea66d7003e09485e3e1c81d005ee97",
  "timestamp": "2025-05-15T01:46:39.642700"
}