{
  "id": 323,
  "title": "Towards a Type-2 Fuzzy Logic Based System for Decision Support to Minimize Financial Default in Banking Sector",
  "abstract": "The recent global financial economic crisis led to the collapse of several companies from all over the world. This created the need for powerful frameworks which can predict and reduce the potential risks in financial applications. Such frameworks help organizations to enhance their services quality and productivity as well as reducing the financial risk. The widely used techniques to build predictive models in the financial sector are based on statistical regression which are deployed in many financial applications such as risk forecasting, customers' loan default and fraud detection. However, in the last few years the use of Artificial Intelligence (AI) techniques has increased in many financial institutions because they can provide powerful predictive models. However, the vast majority of the existing AI techniques employ black box models like Support Vector Machine (SVMs) and Neural Network (NNs) which are not able to give clear and transparent reasoning to explain the extracted decision. However nowadays crystal transparent reasoning models is highly needed. This paper explains our work in progress to develop a novel Genetic Type-2 Fuzzy Logic model for decision support to minimize financial default in the banking sector. The proposed system will use evolutionary computing in order to gain the ability to optimize the huge number of rules which are expected to be generated by the type-2 fuzzy inference engine and summarize them in rational number of rules which can provide powerful performance and crystal transparent reasoning model.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cea93971a8e1c6d968dca9f03a3965b",
  "timestamp": "2025-05-15T01:49:40.973925"
}