{
  "id": 3427,
  "title": "Does audit committee characteristics a driver in risk disclosure?",
  "abstract": "Risk disclosure is one of the practices of corporate governance. Disclosure of risk is an important aspect of a company's financial reporting since it provides information on how various risks can occur, the company's response to these risks, and the impact these risks have on the company's future. By sharing risk information, the corporation has attempted to be more transparent in delivering information to its stakeholders. Based on risk disclosure information, stakeholders are anticipated to make better judgments. This study aimed to examine the influence of audit committee characteristics on risk disclosure. This analysis includes 202 bank statements from 2017 to 2021, the observation period for banks listed on the Indonesia Stock Exchange. Regression was used for data extracted from annual reports, corporate governance reports, and company websites. The results demonstrated that the audit committee's expertise positively impacted risk disclosure. Risk disclosure is unaffected by the size and frequency of the audit committee. The audit committee plays a crucial role in providing information regarding risks; therefore, the corporation must pay close attention to the audit committee's quality. The knowledge of audit committees with a background in accounting or financial education can promote risk disclosure.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cf0f6d65f11d39758d8175c845cc10b",
  "timestamp": "2025-05-15T02:26:09.135382"
}