{
  "id": 8050,
  "title": "Prenatal, Obstetric and Perinatal Factors Associated With the Development of Childhood-Onset Type 2 Diabetes",
  "abstract": "Objective: To explore associations among prenatal, obstetric and perinatal factors and the development of childhood-onset type 2 diabetes. Methods: This retrospective, case-control study utilized administrative data housed at the Manitoba Centre for Health Policy. De-identified health records were examined from a sample of 270 children (aged 10 to 17 years at time of diagnosis) with type 2 diabetes and 1341 children without type 2 diabetes matched for age, sex and geographic location. Patients and control subjects were linked to their de-identified biological mothers' health records. Prenatal, obstetric and perinatal factors were investigated. Univariate and multivariable conditional regression analyses were conducted to identify key factors associated with the development of type 2 diabetes in children. Results: The mean age at diagnosis was 13.1 years, and 61% of patients were girls. The majority (71.1%) of children with type 2 diabetes resided in rural areas. Exposure to maternal pregestational diabetes increased the odds of childhood-onset type 2 diabetes nearly 6-fold, and exposure to gestational diabetes carried a 4-fold increased risk. Breastfeeding was found to be protective, decreasing the risk of childhood-onset type 2 diabetes (odds ratio = 0.52, 95% confidence interval = 0.36-0.74). Low maternal income was significantly associated with development of childhood-onset type 2 diabetes (odds ratio = 6.67, 95% confidence interval = 3.01-14.79). Conclusions: Health and social policies and programs are needed to provide financial, educational and clinical resources that target women whose pregnancies are affected by poverty, type 2 diabetes or gestational diabetes. Breastfeeding should be encouraged to aid in the prevention of childhood-onset type 2 diabetes. (C) 2017 The Author(s). Published on behalf of the Canadian Diabetes Association.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3cf2afaa0d8024fda9fc9235f5639b56",
  "timestamp": "2025-05-15T03:14:37.396895"
}