{
  "id": 6689,
  "title": "Religious affiliation and acute coronary syndrome: a population-based case-control study in Tirana, Albania",
  "abstract": "Background: Our aim was to assess the association of religious affiliation (Muslim versus Christian) with acute coronary syndrome (ACS) in Albania, a predominantly Muslim country in Southeast Europe. Methods: A population-based case-control study was conducted in Tirana, the Albanian capital, in 2003-2006. Of non-fatal consecutive ACS patients, 467 were recruited (370 men aged 59.1 +/- 8.7 years and 97 women 63.3 +/- 7.1 years, 88% response). The coronary heart disease-free control group comprised 469 men (53.1 +/- 10.4 years) and 268 women (54.0 +/- 10.9 years) (69% response), 452 and 237 of whom were fully examined. Information collected included sociodemographic, psychosocial and behavioural characteristics by structured interview and anthropometric measurements. Furthermore, data on religious affiliation was available for all but 20 of the non-respondents. Multivariable-adjusted logistic regression was used to assess the association of religious affiliation (Muslim versus Christian) with ACS. Results: Of ACS patients, 77.1% were Muslims compared with 65.8% of the entire control group. Muslims in both sexes were at higher risk of ACS than Christians (age-and sex-adjusted OR = 1.8, 95% CI = 1.4-2.3, P < 0.01). The association persisted (OR = 1.6, 95% CI = 1.1-2.3, P = 0.02) upon further adjustment for marital status, family size, education, income, employment status, social position, emigration of close relatives, financial loss and coronary risk factors. Conclusions: In this transitional country, we found a higher risk of ACS in Muslims than Christians, independent of the socioeconomic circumstances and conventional coronary risk factors assessed. This finding requires replication and the determinants of the excess risk sought.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d01f76ec09cd874bf2224353eefc7c1",
  "timestamp": "2025-05-15T03:00:35.449081"
}