{
  "id": 651,
  "title": "Dynamic managerial capability portfolios in early internationalising firms",
  "abstract": "It is acknowledged that dynamic capabilities can underlie internationalisation of firms, yet extant research has tended to examine the role of capabilities in international entrepreneurship in separate studies, neglecting that international enterprises tend to develop different bundles or portfolios of capabilities that may have differing impacts on their internationalisation. Applying the concept of dynamic managerial capabilities, this study il-lustrates how different capability portfolios of entrepreneurial decision-making and network capabilities explain early internationalisation of small-and medium-sized enterprises (SMEs). Employing a machine learning method through artificial neural network (ANN) analysis, the findings show how early internationalisation is predicted by a portfolio of different dynamic managerial capabilities. This study thus contributes to the international entrepreneurship literature by outlining the capability portfolios necessary for early internationalisation and proposing a taxonomy for capability portfolios for early and late internationalising firms, by clarifying the role of dynamic managerial capabilities in early and successful entrepreneurial internationalisation and by introducing the ANN methodology as a useful tool in the research corpus of the international entrepreneurship domain.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d2870479600383d4f6331ce1116f21b",
  "timestamp": "2025-05-15T00:46:24.403377"
}