{
  "id": 8788,
  "title": "Exploring Return to Productivity Among People Living With Burn Injury: A Burn Model System National Database Report",
  "abstract": "Burn survivors experience barriers to returning to work. For those who do return to work, little is known regarding whether they achieve preinjury productivity (i.e., equivalent or gain in income compared to preinjury income). Identifying patients at risk of not achieving preinjury productivity is important for targeting services that support this population. They extracted occupational and income data through 24 months postinjury from the multicenter, longitudinal Burn Model System National Database. Annual income was reported in six groups: <$25k, $25k-50k, $50k-99k, $100k-149k, $150k-199k, and $>199k. Participants were classified by change in income at each follow-up (i.e., gain, loss, and equivalent). Explanatory variables included demographics, injury characteristics, insurance payer, employment status, and job type. Multilevel, multivariable logistic regression was used to model return to productivity. Four hundred fifty-three participants provided complete income data at discharge and follow-up. Of the 302 participants employed preinjury, 180 (60%) returned to work within 24 months postinjury. Less than half (138) returned to productivity (46% of participants employed preinjury; 77% of those who returned to work). Characteristics associated with return to productivity included older age (median 46.9 vs 45.9 years, OR 1.03, P = .006), Hispanic ethnicity (24% vs 11%, OR 1.80, P = 0.041), burn size >20% TBSA (33.7% vs 33.0%, OR 2.09, P = 0.045), and postinjury employment (54% vs 26%, OR 3.41, P < 0.001). More than half of employed people living with burn injury experienced loss in productivity within 24 months postinjury. Even if they return to work, people living with burn injuries face challenges returning to productivity and may benefit from vocational rehabilitation and/or financial assistance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d290e6f864ddd1135eb945f31520da5",
  "timestamp": "2025-05-15T03:22:26.057930"
}