{
  "id": 8442,
  "title": "Understanding social needs screening and demographic data collection in primary care practices serving Maryland Medicare patients",
  "abstract": "Background Health outcomes are strongly impacted by social determinants of health, including social risk factors and patient demographics, due to structural inequities and discrimination. Primary care is viewed as a potential medical setting to assess and address individual health-related social needs and to collect detailed patient demographics to assess and advance health equity, but limited literature evaluates such processes.Methods We conducted an analysis of cross-sectional survey data collected from n = 507 Maryland Primary Care Program (MDPCP) practices through Care Transformation Requirements (CTR) reporting in 2022. Descriptive statistics were used to summarize practice responses on social needs screening and demographic data collection. A stepwise regression analysis was conducted to determine factors predicting screening of all vs. a targeted subset of beneficiaries for unmet social needs.Results Almost all practices (99%) reported conducting some form of social needs screening and demographic data collection. Practices reported variation in what screening tools or demographic questions were employed, frequency of screening, and how information was used. More than 75% of practices reported prioritizing transportation, food insecurity, housing instability, financial resource strain, and social isolation.Conclusions Within the MDPCP program there was widespread implementation of social needs screenings and demographic data collection. However, there was room for additional supports in addressing some challenging social needs and increasing detailed demographics. Further research is needed to understand any adjustments to clinical care in response to identified social needs or application of data for uses such as assessing progress towards health equity and the subsequent impact on clinical care and health outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d2d7594c0e4e0a0a5d4ae4c45dbbabd",
  "timestamp": "2025-05-15T03:18:51.632448"
}