{
  "id": 526,
  "title": "Chinese Value Investing Theory and Quantitative Technology",
  "abstract": "After nearly three decades of a hard journey, China's capital market has more and more clearly demonstrated the right value of value investing. A-share market participants - retail investors and institutions - are in urgent need of a value investing theory in line with China's national conditions. We realize that China's value investing system must be the joint value investing of China and the world. This paper proposes a value investing theory and quantitative realizing technology system with China as the main body and taking both China and the world conditions into account. The main contents include: 1) under the framework of big data, using the credit risk analysis for filtering out stocks with mediocre or poor credit; 2) multi-factor models of quantitative investment for selection of value and growth stocks; 3) deep learning financial market prediction model for capturing dynamic margin of safety and profit opportunities; 4) deep intelligent portfolio trading technology for implementing value investing into super intelligent systems of quantitative investment. The characteristics and innovations of the theory are: expanding the big data holographic credit risk analysis for Chinese enterprises to value investing analysis; developing comprehensive multi-factor models for selecting value and growth stocks into portfolios; developing big data-driven deep learning financial market prediction models; innovating and developing deep intelligent trading strategies and systems.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d39f974c93814262b78d1e11fe72311",
  "timestamp": "2025-05-15T01:39:38.170594"
}