{
  "id": 3769,
  "title": "Why do older adults avoid seeking financial advice? Adviser anxiety in the Netherlands",
  "abstract": "Why is it that many people fail to seek retirement planning advice when doing so is clearly indicated? Distrust of financial intermediaries is often presented as the common answer. But this paper shows that trust issues are only part of the answer; an appreciable proportion of individuals experience anxiety at the prospect of visiting a financial adviser. In the present investigation, financial adviser anxiety is studied among 950 Dutch adults over the age of 50. Anxiety levels were measured using a six-item scale that was administered as part of a larger nationwide investigation on retirement attitudes and behaviour. Findings revealed that nearly one-third of respondents reported having moderate to severe levels of anxiety at the prospect of visiting a financial professional. Furthermore, a hierarchical regression analysis revealed that strong predictors of anxiety included one's educational level, income, age, level of future time perspective, risk tolerance, financial knowledge and scepticism regarding whether advice from a financial professional can be trusted. A cluster analysis using demographic and psychological covariates identified three separate groups of older adults that were found to differ in terms of their mean level of anxiety. Those who had low levels of education and low incomes were found to disproportionately display high levels of financial adviser anxiety.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d3dc7fc4138c2bb49e00c4a59623d5d",
  "timestamp": "2025-05-15T02:29:59.113144"
}