{
  "id": 3730,
  "title": "Did COVID-19 hurt consumer financial well-being? Factors associated with consumer bankruptcy risks during the pandemic",
  "abstract": "PurposeThe COVID-19 pandemic resulted in millions of lives lost. Beyond its devastating impact, did it also hurt consumer financial well-being? Consumer bankruptcy is often seen as a sign of experiencing extremely overextended debt burdens. This study aimed to identify factors associated with bankruptcy risks, specifically focusing on insolvency (when total debt exceeds total assets) and debt delinquency (being late in debt payments for 60 or more days).Design/methodology/approachData were from the US 2022 Survey of Consumer Finances. Two bankruptcy risk variables included insolvency and debt delinquency. Potential influencing factors included in the analyses were COVID-19-induced shocks, financial capability, ownership of various debts and demographics. Logistic regression models were used to detect potential factors associated with bankruptcy risks.FindingsFirst, a COVID-19-induced shock variable, new work schedule, reduced the risk of insolvency and four shock variables (COVID infection with serious persistent symptoms, work disruption due to childcare responsibilities, work reduction and work increase) increased the risk of debt delinquency. Second, financial capability factors played a crucial role. Desirable financial behavior reduced both risks of insolvency and debt delinquency. Subjective financial knowledge only reduced the risk of debt delinquency. Third, the types of debts held mattered. Holding credit card debt, student loans and other debts increased the risks of both insolvency and debt delinquency. Interestingly, holding auto loans reduced the risk of insolvency.Research limitations/implicationsThe data are limited to cross-sectional so that findings are only correlational. The data are from one developed economy, and the results may not be generalized to other economies, especially developing economies. Also, due to the lack of direct measure of consumer bankruptcy, only bankruptcy risks are measured in the study, but the findings can still be informative for understanding consumer bankruptcy behavior.Practical implicationsThe results of this study have practical implications for government, business and nonprofit organizations to help consumers reduce the bankruptcy risks. The results suggest that when facing external shocks such as the COVID-19 pandemic, any work-related adjustments may help workers maintain income levels and reduce consumer bankruptcy risks, especially debt delinquency risk. Also, consumers should be encouraged to engage in desirable financial behaviors, such as spending within their income, seeking information before making financial decisions, using financial professionals and planning ahead, to reduce both insolvency and debt delinquency risks.Originality/valueThis study is the first to examine COVID-19-induced factors on bankruptcy risks, enriching the literature of COVID-19 impacts on consumers. Bankruptcy risks are used as negative indicators of consumer well-being, expanding the literature of consumer well-being. The study also examines if financial capability has the potential to reduce bankruptcy risks, an advancement in the literature of financial capability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d618d707dd1099b72b72ff551cbed6b",
  "timestamp": "2025-05-15T02:29:28.004518"
}