{
  "id": 7540,
  "title": "Multipartner Fertility in Nicaragua: Complex Family Formation in a Low-Income Setting",
  "abstract": "CONTEXT: Multipartner fertility (having children with more than one partner) is an important topic in demographic research, but little is known about its incidence and correlates in low-income settings, where rates may be high because of poverty, union instability and early childbearing. METHODS: Data from the 2011-2012 Encuesta Nicaraguense de Demografia y Salud were used to calculate the prevalence of multipartner fertility among 8,320 mothers and 2,141 fathers with two or more children. Logistic and multinomial regression were used to identify individual and family characteristics associated with multipartner fertility. RESULTS: Among those with multiple children, 33% of mothers and 41% of fathers had had children with more than one partner. The prevalence of multipartner fertility was elevated among less-educated women, nonreligious men, and women and men who had grown up in urban areas (odds ratios, 1.3-1.6). Multipartner fertility was associated with lower current household wealth among mothers, and with increased risk of single parenthood and higher fertility among mothers and fathers. Fathers who had had multiple fertility partners were six times as likely as fathers with one fertility partner to report not providing financial support to, or sharing their surname with, at least one of their biological children. CONCLUSION: Multipartner fertility is a critical demographic and social phenomenon that may contribute to and reflect important gender and family structure inequalities in Nicaragua. Mothers with multipartner fertility may be at especially high risk of raising children without the children's fathers and with low levels of economic support.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d66574646d5743920c8bb7e5f24172b",
  "timestamp": "2025-05-15T03:09:36.919604"
}