{
  "id": 8763,
  "title": "Prevalence, awareness, treatment, and control of hypertension in rural adults from Liaoning Province, northeast China",
  "abstract": "Liaoning Province is located in northeast China, which has distinct weather conditions, geographic characteristics and lifestyles compared with other regions of the country; the lifestyle differences are especially pronounced in the rural parts of this region, where there is a dearth of financial and other resources. However, information on the prevalence, awareness, treatment, and control of hypertension in these impoverished areas is very scarce. We therefore performed multistage cluster random sampling of a group of 29,970 adult residents (>= 5 years of residency; >= 35 years of age) of the rural portions of Liaoning Province from 2005 to 2006. The sampling included a survey on blood pressure and associated risk factors. The overall prevalence of hypertension in the community was 36.2%, and 73.0% of hypertensives were unaware of their condition. Among the total group of hypertensives, only 19.8% were taking prescribed medication to lower their BP, and 0.9% had controlled hypertension. Of all subjects, 46.4% did not think that high blood pressure would endanger their lives. As to the reasons given by hypertensives who were aware of their hypertension for not taking antihypertensive medication, 47.4% reported that they lacked knowledge about the mortality of hypertension. The average salt intake in hypertensives was 16.6 +/- 9.9 g/day, and the percentages of smoking (44.3%), drinking (31.7%) and salt intake >6 g/day (86.8%) in hypertensives were high. Logistic regression analysis indicated that the relative risks (95% confidence interval [CI]) of overweight, obesity, smoking, drinking, increased salt intake and family history of hypertension for hypertension were 1.95 (range, 1.82-2.08), 2.92 (2.40-3.55), 1.19 (1.12-1.27), 1.16 (1.08-1.25), 1.26 (1.20-1.33) and 2.85 (2.66-3.05), respectively. A higher education level was found to be a protective factor. In conclusion, the prevalence of hypertension in adults living in the rural parts of Liaoning Province was high, and the rates of awareness, treatment, and control were unacceptably low, which may have been due to unique geographical characteristics, unwholesome lifestyles, greater sodium intake, lower education levels, and genetic risk factors.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d818c7cfeb1abcca7ba6b2b9c035c62",
  "timestamp": "2025-05-15T03:22:25.958602"
}