{
  "id": 5451,
  "title": "Negative self-appraisal: Personal reasons for dying as indicators of suicidality",
  "abstract": "Reasons for dying (RFD) are one of the most authentic factors illustrating the lived experience of suicidal individuals. However, the field has been criticized for inadequate evaluation of risk factors and suicidal symptoms, such as RFD, to develop more robust theoretical models and risk assessments. In this study, we aimed to critically examine RFD themes as predictors of suicidal symptoms to improve our understanding of the suicidal mind, test suicide theory validity and improve risk assessment. This cross-sectional mixed-method study included anonymous survey data (N = 713) with a subsample (n = 474; 77% female; age M = 31.48, SD = 13.53) who provided RFD. Participants were asked to write down five RFD (ranked 1(st) to 5(th) most important) and completed the Suicidal Affect-Behavior-Cognition Scale (SABCS). Thematic analysis revealed eight valid RFD themes-Negative Self-appraisal, Hopelessness, Desire to Escape, Escape Pain, Relationships, Loneliness, Financial Hardship, and Physical Health. Themes were quantified by rank and total endorsements of the theme. Hierarchical regression modelling, statistically controlling for demographics, showed all RFD themes, except Physical Health, were positive predictors of suicidality, accounting for 26% of variance in suicidal symptoms. Negative Self-appraisal was the strongest predictor. RFD differences were also found by gender, age and education. From these findings, we determined current suicide theories do not fully account for suicidal persons' RFD. There is a pressing need for more critical review of current theories, as current theories only partially represent this key attribute of the suicidal mind, and none of the reviewed theories accurately reflected suicidal participants' RFD. Clinical implications include integrating financial therapies into suicide prevention treatments and incorporating RFD into assessments and treatments. To aid research and risk assessment efforts, we propose a new RFD Index, with eight five-point response items.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d842216cc39a9d42f354c18c6d11bbe",
  "timestamp": "2025-05-15T02:47:43.071973"
}