{
  "id": 3508,
  "title": "Occupational characteristics and risk factors associated with endometriosis among Korean female workers",
  "abstract": "Endometriosis is a chronic and debilitating condition that affects daily working life. Characterization of the factors associated with endometriosis in the working population can facilitate the development of prevention and intervention strategies for those at risk of endometriosis. This population-based retrospective study was conducted using the 2007-2015 National Health Insurance Service-Female Employees database. Overall, 151,386 female workers aged 15-64 years were included in the study. Participants with endometriosis were identified using the diagnosis codes in the claims data. Multivariable Cox regression analyses were used to evaluate the effect of sociodemographic, lifestyle, health, and occupational factors on endometriosis risk. Of the 151,386 participants, 4,457 were diagnosed with endometriosis. The risk of endometriosis was significantly higher in 41-60 years group (HR = 1.47 (95% CI, 1.06-2.04)) and in those with body mass index (BMI) < 18.5 kg/m(2) (HR = 1.16 (95% CI, 1.05-1.27)) than 15-20 years group and those with normal BMI, respectively. According to the international standard industrial classification, occupational groups with financial and insurance activities, public administration and defence, compulsory social security, and manufacturing were at a higher risk of endometriosis. Although there was no significant association between the risk of endometriosis and type of work, the cumulative prevalence of endometriosis from 2007 to 2015 continued to rise in office workers, manual workers, and both types of workers together. The risk of endometriosis was closely linked to the occupational characteristics of female workers. This study provides a foundation for developing occupational safety and health guidelines for female workers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d88077bf9fc96170dbaa0f1b0dfab2c",
  "timestamp": "2025-05-15T02:26:48.603937"
}