{
  "id": 8713,
  "title": "Failure to complete a functional restoration program for chronic musculoskeletal disorders: A prospective 1-year outcome study",
  "abstract": "Objective: To compare comprehensively the likelihood of various socioeconomically relevant outcomes between functional restoration completers and noncompleters, while simultaneously identifying risk factors for noncompletion. Design: A prospective cohort study of patients with chronic disabling occupational musculoskeletal disorders (CDOMD). Setting: Chronic pain management facility. Participants: A total of 1440 patients with CDOMD were consecutively divided into 2 groups-one with 303 patients who did not complete the prescribed treatment program (noncompleters [NC]) and a second with 1137 patients who did (completers). Intervention: The Interdisciplinary Functional Restoration: Rehabilitation program. Main Outcome Measures: Validated questionnaires about pain, disability, and depression were added to results of a structured 1-year posttreatment telephone interview on socioeconomic outcomes covering work status, health utilization, recurrent injury claims, and resolution of financial disputes. Results: The 1-year posttreatment socioeconomic outcomes were most striking. The NC group was 7 times more likely to have postrehabilitation surgery in the same area, and nearly 7 times more likely to have more than 30 visits to a new health provider in persistent health care-seeking efforts. The NC group also had only half the rates ostatus and health utilization outcomes. These outcomes are of great relevance to societal, medical, and indemnity costs and future worker productivity. Several risk factors of possible importance in identifying potential noncompleters early in the treatment program were identified that may yield more effective interventions tailored to maintain compliance and decrease the percentage of drop-outs.f work return and work retention, being 9.7 times less likely to have returned to any type of work, and 7 times less likely to have retained work at the end of the year. Regression analysis also revealed that work return, surgery in a compensable injured area, more health care utilization from a new provider, and more overall health care utilization (> 30 visits) were most reliably predicted by whether the rehabilitation program was completed. Conclusions: This large prospective study determined that noncompleters of interdisciplinary tertiary rehabilitation for CDOMDs had comparatively poor socioeconomic outcomes in the year after discharge from treatment, especially on work status and health utilization outcomes. These outcomes are of great relevance to societal, medical, and indemnity costs and future worker productivity. Several risk factors of possible importance in identifying potential noncompleters early in the treatment program were identified that may yield more effective interventions tailored to maintain compliance and decrease the percentage of drop-outs.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d927f97a53df59556cba056c2469b3d",
  "timestamp": "2025-05-15T03:21:56.549792"
}