{
  "id": 2322,
  "title": "Sudden shock and stock market network structure characteristics: A comparison of past crisis events",
  "abstract": "Studying the correlation structure of the stock market is crucial for systemic risk and portfolio optimization. We construct the price volatility network of the Shanghai and Shenzhen 300 index components in China's stock market in the period 2007-2020. We select three representative major emergencies: the global financial crisis in 2008, the stock disaster in 2015, and the COVID-19 epidemic in 2020. First, we find that when the stock market is impacted by the major events, the network shows a cluster phenomenon. The cluster effect of the financial crisis events is smallest, while that of the epidemic events occurs most rapidly. Second, the key nodes in the stock market network have greater risk transmission ability. The manufacturing plays a crucial role during the later stages of events, while the financial industry plays an important role during the epidemic's recovery period. Third, the network structure of the stock market has an indicator effect on the systemic risk contributions. Generally, the greater a stock's eigenvector centrality, the greater its systemic risk contribution, while its closeness centrality and clustering coefficient have opposite effects. The study has important enlightenment significance for market regulators to prevent risk diffusion and reduce portfolio risk for market participants.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3d94020dc3637be6a3ed8975dc91d88d",
  "timestamp": "2025-05-15T02:14:19.552702"
}