{
  "id": 6119,
  "title": "Using Ensemble-Based Systems with Near-Infrared Hyperspectral Data to Estimate Seasonal Snowpack Density",
  "abstract": "Estimating the seasonal density of the snowpack has many financial and environmental benefits. Rapid assessment and daily monitoring of its evolution are therefore key to effective prevention. Traditionally, the physical characteristics of snow are measured directly in the field, which involves high costs and personnel mobilization. Hyperspectral imaging is a reliable and efficient technique to study and evaluate this physical property. The spectral reflectance of snow is partly defined by changes in its physical properties, particularly in the Near infrared (NIR) part of the spectrum. Recently, a hybrid snow density estimation model allowing retrieval of density from NIR hyperspectral data was developed, based on an a priori classification of snow samples. However, in order to obtain optimal density estimates with the Hybrid model (HM), the sources of classification and estimation error must be controlled. Following the same principle as the HM, an Ensemble-based system (EBS) was developed. This model reduces the number of misclassification errors produced by the HM. The general concept of EBS algorithms is based on the principle that obtaining more opinions before making a decision is part of human nature, especially when economic and environmental benefits are at stake. This approach has helped to reduce the risk of classification and estimation errors and to develop more robust density results. One hundred and fourteen snow samples collected during three winters (2018-2020) were used to calibrate and validate the EBS. The performance of the EBS was validated using an independent database and the results were satisfactory (R-2 = 0.90, RMSE = 44.45 kg m(-3), BIAS = 3.87 kg m(-3) and NASH = 0.89).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3dae205037402e48b3343c0e46733e92",
  "timestamp": "2025-05-15T02:55:12.824727"
}