{
  "id": 6390,
  "title": "Determinants of Patient-Centered Financial Stress in Patients With Locally Advanced Head and Neck Cancer",
  "abstract": "Purpose To prospectively estimate patient-centered financial stress and its relationship with health care utilization in patients with head and neck cancer. This was a survey-based, longitudinal, prospective study of treatment-naive patients with stage III, IVa, or IVb locally advanced head and neck cancer at a single-institution tertiary care hospital fromMay2013 to November 2014. With 121 patients approached, 73 (60%) agreed to participate. Methods Self-reported data were collected on demographics, income, wealth, cost-coping strategies, out-of-pocket costs, supportive medication compliance, and perceived social isolation. Health care utilization was measured by hospital admissions and outpatient appointments on a 6-month timeline. Logistic regression models were constructed to identify factors associated with use of cost-coping strategies. Covariates included all demographics, measures of income, wealth, out-of-pocket costs, indirect costs, and perceived social isolation. Results Fifty-one patients (69%) relied on at least one coping strategy. On multivariable analysis, Medicaid patients were more likely than privately insured patients to use cost-coping strategies ( odds ratio, 42.3; P =.0042). Decreased wealth ( P =.002) and higher total out-ofpocket costs (P =.003) were independently associated with using cost-coping strategies. Patients with high perceived social isolation were also more likely to use cost-coping strategies (odds ratio, 11.5; P=. 01). Patients with high perceived social isolationweremore likely to report nonadherence to supportive medications (21.4 v 5.45 days over 6 months; P =.0278) and missed appointments (seven v three; P =.0077). Conclusion A majority of patients used at least one cost-coping strategy during their treatment, highlighting the financial stress that patients experience. Perceived social isolation is an important social determinant of increased medication nonadherence, missed appointments, and use of cost-coping strategies. Interventions should be investigated in at-risk patients who may suffer from financial stress.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3dc1f5cd42b988cc09485b6054de28db",
  "timestamp": "2025-05-15T02:57:38.762536"
}