{
  "id": 9420,
  "title": "Factors associated with euthanasia in horses and ponies enrolled in a laminitis cohort study in Great Britain",
  "abstract": "Euthanasia is a complex topic, with animal owners using multiple factors to shape their decision-making process. Previous epidemiological studies have described causes of equine mortality in specific populations, but there is limited evidence regarding factors contributing specifically to equine euthanasia in Great Britain (GB). This observational study used a prospective cohort design: the objectives were to describe owner-reported reasons for euthanasia, estimate the rate of euthanasia and identify associated factors in horses/ponies enrolled in a web-based epidemiological study of laminitis in GB. Self-selected horse/pony owners submitted regular management and health data over 29 months and reported dates and reasons for euthanasia during this period. The overall incidence of euthanasia was estimated and associated factors were identified using multivariable Cox regression modelling, adjusted for age, with variables retained in the final model if P <= 0.05. Data were available for 1070 horses/ponies contributing 1093 horse-years at risk (HYAR), with 80 owner-reported euthanasias. The incidence of euthanasia was 7.3 euthanasias per 100 HYAR (95 % confidence interval [CI] 5.9, 9.1). The most frequently reported health reasons contributing to euthanasia were laminitis-related consequences (25.0 %; CI 16.8, 35.5 %), colic (21.3 % ; CI 13.7, 31.4 %), non-laminitic lameness (20.0 % ; CI 12.7, 30.1 %) and age-related deterioration, including owner-perceived compromised quality of life (20.0 %; CI 12.7, 30.1 %). Health-related factors associated with significantly higher rates of euthanasia were colic (hazard ratio [HR] 26.4; CI 12.5, 55.8), pituitary pars intermedia dysfunction (HR 3.0; CI 1.7, 5.4) and lameness due to navicular syndrome (HR 5.9; CI 1.8, 20.0), soft tissue injury (HR 6.5; CI 2.7, 15.6) or laminitis (HR 2.7; CI 1.3, 5.7). Further factors included being pure bred (HR 1.7; CI 1.0, 2.8), female (HR 1.7; CI 1.0, 2.9), having poor owner-perceived hoof quality (HR 2.4; CI 1.1, 5.2), being entirely stabled (HR 5.0; HR 2.1, 12.0), being on loan or under temporary care of the study participant (HR 2.3; CI 1.2, 4.4) and participating in affiliated or professional competitions (HR 5.9; CI 2.4, 14.8). Euthanasia rates were significantly higher in the first two study years compared to the third (P < 0.001). Animals whose owners used the study's custom-designed weight tracker tool had significantly lower rates of euthanasia (HR 0.6; CI 0.3, 0.95). This study has identified a number of, arguably preventable, health-related factors associated with higher rates of euthanasia. Data on owners' decision-making process regarding euthanasia, including emotive and financial impacts, were not recorded but are important contributors to euthanasia that require better understanding.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3dc8b46aa8dc8226bb3b1a4e184a8e23",
  "timestamp": "2025-05-15T03:28:46.247591"
}