{
  "id": 1852,
  "title": "Cost-Effectiveness Analysis of Interventions to Reduce Risk of Aspiration in Elderly Cancer Survivors Residing in Skilled Nursing Facilities",
  "abstract": "Background: Aspiration can occur in patients of any age group, but it can be prevented. The primary population at risk is made up of survivors of cancer because of their increased risk of mucositis, mucosal atrophy, and dysphagia associated with chemotherapy, radiotherapy, and the disease process itself. The rate of incidence of aspiration cannot be quantified, because minor cases of aspiration often go unreported. Sequelae ensuing from aspirations can include pneumonia, end-stage kidney disease, dialysis, and death. Methods: Analyses of cost, decision-tree modeling, and cost effectiveness were performed to compare a hypothetical, interventional model based on best practices with usual (standard) care. A societal perspective was used as the economic view point. Direct costs, caregiver time, and market values for wages were estimated for the 2 interventions. Effectiveness values for the cost-effectiveness and decision-tree analyses were obtained from the literature. The incremental-cost-effectiveness ratio was calculated and used to compare the intervention with usual care. Results: The interventional method was more costly but more effective than usual care. A sensitivity analysis considered the uncertainty of event probability (aspiration vs no aspiration). The interventional protocol for aspiration reduction continued to be more cost effective than usual care. Conclusions: Aspiration takes a financial toll on all facets of health care, including on nurses, skilled nursing facilities, patients, their families, and insurers, among others. Implementing guidelines that describe best practices for aspiration appears to be a cost-effective strategy for reducing aspirations among cancer survivors - especially elderly patients - who live in skilled nursing facilities.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3dfa78380211ed812e0527a4522653ca",
  "timestamp": "2025-05-15T02:08:04.005155"
}