{
  "id": 9161,
  "title": "Farmers' perspective towards climate change vulnerability, risk perceptions, and adaptation measures in Khyber Pakhtunkhwa, Pakistan",
  "abstract": "Pakistan has become a highly vulnerable country with considerable exposure to climate change. Over the past few decades, Pakistan has endured many severe floods, droughts, and storms. However, limited research was conducted into farmers' perspectives towards climate change vulnerability, risk perceptions, and adaptation measures at the farm level in Pakistan. The current research uses a dataset of 600 farm households collected through a structured questionnaire from four districts of Khyber Pakhtunkhwa province of Pakistan. The study identified the farm level climatic risks perceived by the farm households including flood (60%), crop pest (56%), insect attacks (55%), extreme temperatures (54%), human diseases (54%), and livestock diseases (46%). The farm households also reported negative impacts (decrease in crop production, waterlogging, and changes in cropping calendars and positive effects (e.g., better crop production) arising from changing climate and associated threats. Further, this study identified different adaptation strategies adopted at the farm level to mitigate the adverse effects and related risks of rising climatic conditions that include changing crop varieties (37%), planting shade trees (32%), changing planting dates (31%), changing methods of fertilizer usage (26%), changing crop type (14%), soil conservation measures (11%) and crop diversification (9%). The logistic regression analysis revealed that the farm experience, education, land area, ZTBL credit, and climatic information from the relevant government department were important factors that influenced farm household adaptation measures in the study areas. Also, the study found that farm households had faced numerous constraints that could influence adaptation decisions, including financial constraints (28%), lack of knowledge and information (25%), inadequate farm resources (23%) in the study areas. Other restrictions to adaptations included the lack of public or private institutional support (14%), and lack of irrigation water (10%). The present research shows the need to implement policies that tackle adaptation barriers, and ensure that local institutions are available and ready to provide farmers with more up-to-date information and farm advisory to combat climate change and its negative consequences.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e0f6a874f2311db9a0369b24b8f91d6",
  "timestamp": "2025-05-15T03:25:54.696362"
}