{
  "id": 2180,
  "title": "The Relationship of Types of Exploration Activities with Originality of Visual Arts Designs",
  "abstract": "This study examines specific exploration activities in students' visual arts portfolios from secondary education. Creating original visual arts products requires exploration according to Getzels and Csiksentmihalyi (The creative vision. A longitudinal study of problem finding in Art. New York: John Wiley & Sons Inc., 1976). Obtaining insight about the contribution of specific exploration activities to the originality of arts products is important for designing and supporting learning in arts education. The aim of this study is to examine the contribution of activities within three types of exploration: association, combination, and abstraction to originality of visual arts designs. Data consist of 196 portfolio events showing exploration activities and art designs, from 11 Grade 11 visual arts students. Portfolio events were coded for three different types of exploration: association, combination, and abstraction, on a dimension of ascending abstractness. We coded activities within each of these types, on a scale of remoteness, to determine the metaphorical distance. Visual originality of each portfolio event was assessed using the comparative judgment method. Multilevel regression analyses showed all three types of exploration significantly contributed to originality of visual designs. In total, 31% of the variance in originality at portfolio events level was explained by these types of exploration. In general, the more remote exploration activities were, the more original the visual design. These findings are discussed related to the literature on creative processes.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e2949c880b1af48d2be33c85156d929",
  "timestamp": "2025-05-15T01:03:36.740686"
}