{
  "id": 8430,
  "title": "Types of multidimensional vulnerability and well-being among the retired in the U.S",
  "abstract": "Background: An extensive study investigated the risk factors for low well-being in post-retirement. Most previous studies have taken a unidimensional perspective, focusing on single factors such as financial status, physical health, and mental health. Objective: Drawing on the vulnerability framework, we first identify and describe the empirical subgroups of vulnerability among retirees in the United States across four major domains of later life: material, physical, social, and mental vulnerability. Then, we investigate the association between vulnerability profiles and well-being. Method: The sample included 3,158 retirees aged 65+ who participated in the Health and Retirement Study (HRS). Latent class analysis was utilized to identify the heterogeneous subgroups of vulnerability, and then a series of OLS regression analyses was conducted to examine the relationship between patterns of vulnerability and well-being. Results: Five vulnerability patterns were identified: material vulnerable (12%), health & social vulnerable (14%), material, health & social vulnerable (6%), least vulnerable (34%), and social vulnerable (35%). The health & social vulnerable group had the strongest negative influence on well-being among all subgroups. As the largest subgroup, the social vulnerable group's negative influence on well-being stood out, with a stronger effect than that of material privation experienced by those in the material vulnerable group. Conclusion: By empirically identifying subgroups of differential vulnerability patterns among retirees, this study showed that post-retirement vulnerability reflects complex interactions among multiple disadvantages. Findings of this study enhance understanding of the disparities in well-being within the retired population, pointing to the possibility of targeted policy and program development.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e2b4c9e9dbe42f7975f1b9e509d4130",
  "timestamp": "2025-05-15T03:18:51.570659"
}