{
  "id": 6339,
  "title": "Assessment of the credit risk of Poland based on sovereign credit default swap spreads during the Covid-19 pandemic",
  "abstract": "Motivation: SCDS contracts, based on treasury bonds, are used to assess credit risk. Observation of changes in these instruments provides information on the current economic situation of individual countries. By correlating them with the economic assessment of individual countries, SCDS indicate the risk level of bankruptcy of a given country and thus play an informative role on the global financial market. Aim: The objective of the study is to investigate the impact of the Covid-19 pandemic on the level of credit risk in Poland. This aim will be achieved by determining the level and the dynamics of changes of SCDS spreads, and by identifying the determinants of changes in the level of SCDS spreads before and after the pandemic. The study hypothesises that as a result of the supply and demand shocks caused by the outbreak of the Covid-19, the level of Polish SCDS spreads increased due to macroeconomic factors. Results: The results of the study confirmed that due to the panic, Poland's credit risk increased dynamically in the first stage of the Covid-19. However, over time, the level of credit risk in Poland decreased. Nevertheless, the reduction in Poland's credit risk is accompanied by an increase in public debt, with a simultaneous deterioration in macroeconomic indicators. This evidence suggests that SCDS spreads are not capable of reflecting the foundations of the economy during uncertainty. The results of this study indicate that the fundamental determinants of credit risk changes occurred before and during the pandemic. However, the results showed that the magnitude of their impact on credit risk is different. Multiple linear regression analysis also showed that during the Covid-19, macroeconomic factors showed a significantly higher degree of correlation with credit risk compared to non-economic factors directly related to the effects of the pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e3a1d0a17ba466c9115c41bf813501b",
  "timestamp": "2025-05-15T02:57:07.702292"
}