{
  "id": 8456,
  "title": "Correlates of smoking discarded cigarettes in a sample of low-income adults",
  "abstract": "Introduction: Unconventional smoking behaviors such as smoking used or discarded cigarettes may increase the risk of nicotine dependence and exposure to toxins. To better understand low-income smokers who smoke discarded cigarettes and to inform effective tobacco cessation strategies, the current study examined potential correlates not considered in prior studies. Methods: This secondary analysis examined baseline data from 1936 low-income smokers participating in a randomized cessation trial. To assess smoking discarded cigarettes, participants were asked: In the past 30 days, have you smoked what's left of a cigarette that someone else left behind? Unadjusted and adjusted logistic regression were used to explore associations between smoking discarded cigarettes and social needs, social environment, mental and physical health, other smoking-related behaviors, and demographic characteristics. Results: One in six participants reported smoking discarded cigarettes. Younger smokers, men, smokers with lower incomes and those who were not employed were more likely to smoke discarded cigarettes. Other correlates included having unmet social needs (transportation, food, housing, physical safety, and neighborhood safety), living with other smokers, worse mental health, greater perceived stress, heavier smoking, using other tobacco products, and bumming cigarettes from others. In a multivariable model, income, social environment, and other smoking behaviors emerged as significant correlates. Conclusions: In addition to financial hardship, mental health, and nicotine dependence, the social needs, social environment, and other smoking behaviors of low-income smokers are important correlates of smoking discarded cigarettes. Future research to understand and address tobacco health disparities should examine these relationships longitudinally.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e45f73f58b690ae571647fc309d629a",
  "timestamp": "2025-05-15T03:18:51.722865"
}