{
  "id": 5576,
  "title": "DIGITALIZATION AND THE TOO BIG TO FAIL DILEMMA: MECHANISMS AND ASYMMETRIC EFFECTS OF BANKS' FINTECH INNOVATION ON TOTAL FACTOR PRODUCTIVITY",
  "abstract": "Fintech is driving the revolution of finance and profoundly affecting the development of the financial sector. However, few studies examined how commercial banks' fintech innovation affects total factor productivity (TFP). To build up the fintech index of commercial banks, we use web crawler technology to accumulate news related to the fintech innovation of commercial banks in Baidu news. We use the panel data of 72 banks in China from 2010 to 2020 to explore the impacts and mechanisms of fintech on commercial banks' TFP. The results show that fintech innovation effectively improves TFP after a series of robustness tests. Further, we find that fintech innovation can improve commercial banks' TFP by promoting innovations of financial products, increasing risk control capability, reducing cost, and improving profit. Also, the utility of fintech is more significant in banks with more assets, facilities, and human capital, which means that fintech innovation creates a bigger is better mindset. Meanwhile, the result of quantile regression shows that the higher the fintech innovation, the more significant the increase in TFP, which further reveals that there is 'too big to fail' among commercial banks under digitalization.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e59fa2849f7fb944ad786bc7ae33149",
  "timestamp": "2025-05-15T02:49:21.616785"
}