{
  "id": 2359,
  "title": "Technology-driven transformations in agri-food global value chains: The role of incumbent firms from a corporate venture capital perspective",
  "abstract": "Agri-food global value chains (GVCs) are failing to provide healthy and affordable diets within planetary boundaries. Many cutting-edge technologies are being developed to address the sustainability challenges throughout agri-food GVCs. While several studies seek to analyze the impacts of specific innovations on socioeconomic and environmental dimensions, the relationship between industry structure and the process of technological change has not received much attention in the value chain literature. Here, we focus on the entrepreneurial landscape of innovation in agri-food GVCs to 1) identify which technologies have been receiving most support from investors and 2) analyze the corporate strategies of the largest agri-food multinational companies regarding their investments in new technologies. Using Crunchbase as our primary data source and machine learning for natural language processing, we have identified around 15,500 companies developing innovations linked to agri-food GVCs, from farming to last-mile delivery. However, our analyses show an imbalanced scene in which downstream technologies capture most investors' interest. Then, we use these results to explore the direction of investments by dominant agri-food firms, where we identify three trends: upgrading strategies to improve their core activities, defensive strategies to control technologies competing with their core business, and corporate portfolio strategies to seize profit opportunities.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e7210f560d8f6c46247d47e957ac045",
  "timestamp": "2025-05-15T01:06:10.691078"
}