{
  "id": 8517,
  "title": "Poor Social Network, Not Living Alone, Is Associated With Incidence of Adverse Health Outcomes in Older Adults",
  "abstract": "Objective: Although it has been suggested that living alone is a social risk factor for adverse health outcomes, poor social network may confound the association. This study aimed to examine whether the interactive effects of living alone and poor social network contribute to adverse health outcomes. Design: A 4-year prospective observational study. Setting and Participants: Four hundred community-dwelling older adults living in Itabashi ward, an urban community in Tokyo. They participated in a health checkup (held in 2015 and 2017) and completed all the assessments. Methods: Participants were classified into 4 groups according to their living arrangements (living alone or not living alone) and social network size, which was assessed using an abbreviated version of the Lubben Social Network Scale-6. Poor social network was defined as the lowest quartile (4th quartile) of the Lubben Social Network Scale-6 score. Adverse health outcomes including disabilities, depressive symptoms, and physical and cognitive functions were measured. Results: Multiple and logistic regression models, adjusted for covariates such as financial status and educational level, showed that living alone and having a poor social network at baseline were significantly associated with increased depression symptoms, reduced grip strength, and disabilities of intellectual activity and social role at follow-up. Furthermore, older adults who did not live alone but had poor social networks showed significantly higher odds of subsequent homebound status and disability in activities of daily living. Conclusions and Implications: We found that living alone among older adults is not always a social risk factor for health, and adverse health outcomes among older adults living alone may be confounded by poor social network. Our results also suggest that the effect of poor social network on health status may exceed the effects of living alone. Health professionals must, thus, pay attention to poor social network among older adults. (C) 2019 AMDA - The Society for Post-Acute and Long-Term Care Medicine.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e80c2807d7c556ad5ebf7034181779e",
  "timestamp": "2025-05-15T03:19:51.985941"
}