{
  "id": 8348,
  "title": "Development and Validation of a Prediction Model for Dysphagia in Community-Dwelling Older Adults",
  "abstract": "Objectives. Dysphagia is a geriatric syndrome, which may lead to complications such as dehydration, malnutrition, aspiration, pneumonia, and a significant reduction in quality of life. The purpose of this study was to construct and validate a prediction model for dysphagia in community-dwelling older adults and provide an assessment tool for the prevention and control of dysphagia. Design. Cross-sectional study. Setting. The community-dwelling Chinese older adults. Participants. 3655 participants aged 65 years and older were involved, who were randomly divided into the training set and the validation set. Methods. Data were collected and analyzed from June 2022 to September 2022. Univariate and multivariate logistic regression analysis were used to identify independent risk factors for dysphagia. We applied R software to develop a nomogram model to predict dysphagia in community-dwelling older adults. The predictive value of the model was assessed by the area under the ROC curve (AUC), the calibration curve was used to evaluate the reliability of the nomogram model for predicting dysphagia in community-dwelling older adults. The model's clinical utility was further evaluated using a Decision Curve Analysis (DCA). Results. The incidence of dysphagia was 11.8% (320/3655). Maximum tongue pressure, number of molars, pneumonia, ADL, sarcopenia, age, neurological diseases, and rheumatic immune diseases were selected as risk predictors for dysphagia. The prediction model demonstrated fair discriminative ability with the AUC was 0.709 (95%CI: 0.679-0.739) in the training set and 0.693 (95%Cl: 0.640-0.747) in the validation set, the calibration is adequate, and the Hosmer and Lemeshow test showed p values of 0.163 and 0.415, respectively. The DCA curve of our model shows a positive clinical net benefit. Conclusions. The prediction model established in this study was of a certain predictive value for the risk of dysphagia in community-dwelling older adults. By estimating the likelihood of future outcomes or the onset of certain diseases, it can assist medical personnel in formulating preventive strategies, lessening the workload of nurses, and also diminishing the financial burden on patients, thereby enhancing their overall quality of life.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e8473e0962fb997015603df69203409",
  "timestamp": "2025-05-15T03:17:49.181884"
}