{
  "id": 3730,
  "title": "Do US sectoral contagion and news-based economic policy uncertainty cause fear or greed behavior in Bitcoin investors?",
  "abstract": "We explore whether spillover of shocks between U.S. sectoral stocks, Dynamic Conditional Correlations (DCCs) and U.S. Economic Policy Uncertainty (U.S. EPU) increase Bitcoin investors' fear and greed Sentiment Indices (BSI) by using the daily time series data from 1st February 2018 towards 1st February 2025. Initially, we explore the overall and frequency domain short-and long-term spillover of shocks between 11 major U.S. sectoral stock returns by using the time and frequency domain Generalized Vector Auto-regression approach. For further robustness, we also extract the DCCs using the DCC-GARCH-t copula approach between 55 pairs of U.S. sectoral stock returns and regress BSI on these DCCs and U.S.EPU with a series of quantile regression models. For portfolio optimization, this study also examines the hedging effectiveness (HE) of different US sectors under high vs low U.S. EPU regimes based on the hedge ratios. Findings present the consistent adverse effect of overall and frequency domain short-and long-term U.S. sectoral stock returns' total connectedness indices on the BSI. However, the long-term spillover of shocks between U.S. sectors increases Bitcoin investors' fear (higher selling behavior) with more magnitude than the short-term investment horizon. Furthermore, a series of quantile regressions further reinforce this adverse effect, and DCCs between all 55 pairs of U.S. sectors increase the extreme fear of Bitcoin investors. This study provides concrete recommendations for investors to exercise caution in Bitcoin trading when the shock spillover mechanism between U.S. sectors is stronger.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e8e492c8b35eb04bcf44d2af731dac1",
  "timestamp": "2025-05-15T01:20:03.612878"
}