{
  "id": 3080,
  "title": "Reflection on the history, coordination, and funding trends for US public meat research: Information to enhance resource allocation",
  "abstract": "A study was conducted to analyze resource allocation for public meat research in the United States and characterize the portfolio of meat research investments. Trends in the amount of public resources provided for meat research (beef, pork, lamb, and poultry) were analyzed for fiscal years 1980, 1985, 1990, 1995, and 1997. An in-depth analysis was conducted for data from fiscal year 1998 to characterize the profile of the research portfolio. Funding levels and scientist-year equivalents were aggregated to represent the measures of resource allocation for three mutually exclusive research categories: 1) meat quality, 2) food safety, and 3) product development and processing. Data for the 1998 profile analysis were derived from a computer search based on the combination of key words and research classification codes to avoid duplication and cluster research projects. Individual research projects were individually reviewed and a percentage was assigned to four mutually exclusive research categories: 1) meat quality, 2) food safety, 3) product development and processing, and 4) marketing. As meat research evolved over the past century, considerable efforts were expended by researchers and administrators to ensure the coordination of research and program relevance. This is demonstrated by the establishment of numerous multistate research committees. Total funding for meat science increased only modestly when adjusted for inflation during the two decades of this study; however, notable changes occurred in the distribution of resources in the portfolio. Funding for meat quality and product development and processing remained virtually unchanged when adjusted for inflation, whereas funding for food safety increased considerably. The total number of scientists conducting meat research remained virtually unchanged during the period, but the proportion allocated to food safety research increased substantially. The federal portion of total funding decreased from 61.3% to 51.6% between 1980 and 1997, whereas the percentage from both state appropriations and private sources increased. Modifications in research emphasis were influenced by industry problems such as meat quality, public perceptions about food safety, the availability of research funding, scientific advances occurring in molecular biology and genetic manipulation, and the changing meat industry. The information in this paper provides administrators and researchers the opportunity to make better informed decisions about resource allocation for meat research.",
  "year": 2002,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e8fcd9dd85f8e4f83951b267fa6bc1c",
  "timestamp": "2025-05-15T01:13:09.906981"
}