{
  "id": 7691,
  "title": "What Are the Variables That Are Associated with the Patient's Wish to Sue His Physician in Patients with Acute and Chronic Pain?",
  "abstract": "Although there is limited research on patient attributes that may be related to reasons for launching a malpractice suit, no such research has been performed in acute pain patients (APPs) or chronic pain patients (CPPs). The objective of this study was then to develop some statistical models that would describe such patients' attributes. A statement about having thoughts of suing a physician (sue medical doctor [MD]) is the focus of this study, and was contained within the Battery for Health Improvement (BHI) research version (BHI-R). The BHI-R was administered to 1,487 community subjects (1,329 healthy and 158 nonhealthy) and 777 patients in rehabilitation of whom 326 were APPs, 341 were CPPs, and 110 had no pain. In addition, descriptive data, such as whether the patient had an attorney for a worker's compensation claim, was collected. The sue MD Likert scale responses were dichotomized, and the relative risks for the sue MD wish were calculated for the aforementioned groups utilizing the healthy community group as the reference group. With APPs and CPPs, those patients responding alternatively affirmatively to the sue MD statement were compared with those patients responding negatively on all available categorical variables and BHI 2 scales via appropriate statistics. If a BHI 2 scale was statistically significant at P < 0.001, then all the questions from this scale were analyzed for significance by chi-square. Significant categorical variables (P < 0.001) and significant BHI 2 questions were then utilized as independent variables in a logistic regression model to assess the predictability of the independent variables for sue MD. Variety of settings. The relative risks for affirming the sue MD statement relative to the healthy community sample for various groups were as follows in order of ascending risk: APPs in rehabilitation; nonhealthy community members; rehabilitation patients in general; rehabilitation patients without pain; CPPs in rehabilitation; and with the highest risk being rehabilitation patients with worker's compensation litigation. For APPs, the logistic regression model utilized three variables: trusting physicians (protected against sue MD); physicians appearing to be motivated by financial incentives; and being upset over one's health (depression variable). This model classified 96% of the patients correctly. For CPPs, the logistic regression model also utilized three variables: being in worker's compensation litigation; being coerced to see a distrusted physician; and being angry with the physician. This model classified 93% of the patients correctly. CPPs are at a greater risk than patients without pain and APPs for harboring the sue MD wish. Some patient attributes and the referral/treatment situation appear to be important predictors for harboring the sue MD wish, but differ between APPs and CPPs.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3e97597b69233a937892497a4474693e",
  "timestamp": "2025-05-15T03:11:04.571847"
}