{
  "id": 9432,
  "title": "Educational Level Is Related to Physical Fitness in Patients with Type 2 Diabetes - A Cross-Sectional Study",
  "abstract": "Introduction Low educational level (EL) and low physical fitness are both predictors of increased morbidity and mortality in patients with type 2 diabetes. It is unknown if EL is related to physical fitness. This would have important implication for the treatment approach of patients of low EL. Materials and Methods In 2011/12, we invited participants of a new nationwide Swiss physical activity program for patients with type 2 diabetes to participate in this study. EL was defined by self-report and categorized as low (mandatory education), middle (professional education) or high (high school/university). Physical fitness was determined using 5 validated measures that assessed aerobic fitness, functional lower limb muscle strength, walking speed, balance and flexibility. Potential confounder variables such as other socio-cultural factors, physical activity level, body composition, diabetes-related parameters and complications/co-morbidities as well as well-being were assessed. Results All invited 185 participants (mean age 59.6 +/- 9.8 yrs, 76 women) agreed to be included. Of all patients, 23.1% had a low, 32.7% a middle and 44.2% a high EL; 41.8% were professionally active. The study population had a mean BMI of 32.4 +/- 5.2 kg/m(2) and an HbA1c of 7.3 +/- 1.3%. The mean diabetes duration was 8.8 +/- 7.4 years. In the baseline assessment, higher EL was associated with increased aerobic fitness, increased functional lower limb muscle strength, and increased walking speed using linear regression analysis (values for low, middle and high EL, respectively: 91.8 +/- 27.9, 116.4 +/- 49.7 and 134.9 +/- 60.4 watts for aerobic fitness (p = 0.002), 15 +/- 4.7, 13.9 +/- 2.7, 12.6 +/- 2.9 seconds for strength (p = 0.001) and 8.8 +/- 1.6, 8.3 +/- 1.4, 7.8 +/- 1.4 seconds for walking speed (p = 0.004)). These associations were independent of potential confounders. Overall, aerobic fitness was 46%, functional limb muscle strength 16%, and walking speed 11% higher in patients of high compared to those of low EL. EL was not related to balance or flexibility. Discussion A main strength of the present study is that it addresses a population of importance and a factor (EL) whose understanding can influence future interventions. A second strength is its relatively large sample size of a high-risk population. Third, unlike studies that have shown an association between self-reported fitness and educational level we assessed physical fitness measures by a quantitative and validated test battery using assessors blinded to other data. Another novelty is the extensive evaluation of the role of many relevant confounder variables. Conclusions In conclusion, we show that in patients with type 2 diabetes EL correlates favorably and independently with important health-related physical fitness measures such as aerobic fitness, walking speed, and lower limb strength. Our findings underline that diabetic patients with low EL should be specifically encouraged to participate in physical activity intervention programs to further reduce social disparities in healthcare. Such programs should be structured and integrate the norms, needs and capacities (financial, time, physical capacities and self-efficacy) of this population, and their effectiveness should be tested in future studies.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ec1a0acb5cc63ea05b1ffe4e20fc5b6",
  "timestamp": "2025-05-15T03:28:46.293454"
}