{
  "id": 7287,
  "title": "New Mothers' Interest in Web-Based Health Promotion: Association with Healthcare Barriers, Risk Status, and User Characteristics",
  "abstract": "Objective: Our first aim was to assess the contributions of health-related risks, barriers to healthcare, and user characteristics to new mothers' interest in two Web-based health programs: postpartum weight loss or parenting advice. Our second aim was to determine if the preceding proximal variables diminished associations of income level with interest in Web-based health programs. Subjects and Methods: A mail survey of a stratified random sample was conducted with a resulting analytic sample that included 121 white/Anglo, African American, or Hispanic women of higher and lower income. Weight risk (being overweight or obese) and psychosocial/behavioral risk (alcohol use, depression, smoking) were the predictors of interest in a weight loss program and parenting advice, respectively. Financial, structural, and function factors served as barriers to care. Frequency of Internet use assessed user characteristics. Hierarchical logistic regression analysis was used to evaluate predictors. Results: Being overweight (adjusted odds ratio [OR], 5.55; 95% confidence interval [CI], 2.18, 14.11) was the only variable to affect likelihood of interest in an Internet-based weight loss program; income level was not a significant predictor. Having two or more psychosocial/behavioral risks (adjusted OR, 0.22; 95% CI, 0.50, 0.92) was the only predictor of interest in Internet-based parenting advice; income level was not a significant predictor after adjusting for other variables (OR, 0.55; 95% CI, 0.19, 1.55). Conclusions: The type of risk and program topic decreased or increased likelihood of interest in Internet-based programming. Weight risks increased interest in weight loss programming, but psychosocial/behavioral risks deceased interest in parenting advice.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ec3aaadcccfe548ffb55259f0e72f6d",
  "timestamp": "2025-05-15T03:07:02.627252"
}