{
  "id": 8932,
  "title": "Do FEARS drive Bitcoin?",
  "abstract": "Purpose This study examines the prediction power of investor sentiment on Bitcoin return. Design/methodology/approach We construct a Financial and Economic Attitudes Revealed by Search (FEARS) index using search volume from Google's search engine to reveal household-level (bankruptcy, unemployment, job search, etc.) and market-level sentiment (bankruptcy, unemployment, job search, etc.). Findings Using a variety of quantitative methodologies such as the transfer entropy model as well as threshold regression and OLS, GLS and 2SLS estimations, we find that (1) investor sentiment has strong predictive power on Bitcoin, (2) household-level sentiment has larger effects than market-level sentiment and (3) the impact of sentiment is greater in low sentiment regimes than in high sentiment regimes. Based on these information, we build a hypothetical trading strategy that outperforms a simple buy-and-hold strategy both on an absolute and risk-adjusted basis. The results are consistent across cryptocurrencies and regions. Research limitations/implications The findings contribute to the ongoing debate in the literature on the efficiency of cryptocurrency markets. The results reveal that the Bitcoin market is not efficient in the sense of the efficient market hypothesis - asset prices do not fully reflect all available information and we were able to beat the market. In addition, it sheds further light on the debate whether Bitcoin can be considered a medium of exchange, i.e. a currency or an investment product. Because investors are reallocating their Bitcoin holdings during times of increased market sentiment due to liquidity needs, they obviously consider bitcoin an investment product rather than a currency. Originality/value This study is the first to examine the impact of investor sentiment measured by FEARS on Bitcoin return.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3eccfa12e4d96a1062d63b9029c81850",
  "timestamp": "2025-05-15T03:23:56.064137"
}