{
  "id": 3795,
  "title": "Progress towards universal health coverage in Myanmar: a national and subnational assessment",
  "abstract": "Background Attainment of universal health coverage is a global health priority. The Myanmar Government has committed to attainment of universal health coverage by 2030, but progress so far has not been assessed. We aimed to estimate national and subnational health service coverage and financial risk protection. Methods We used nationally representative data from the Myanmar Demographic and Health Survey (2016) and the Integrated Household Living Condition Assessment (2010) to examine 26 health service indicators and explored the incidence of catastrophic health payment and impoverishment caused by out-of-pocket payments. We used logistic regression models of inequalities in, and risk factors for, indicators of universal health coverage. Findings Nationally, the coverage of health service indicators ranged from 18.4% (95% CI 14.9-21.9) to 96.2% (95.9-96.5). Coverage of most health services indicators was below the universal health coverage target of 80%. 14.6% (95% CI 13.9-15.3) of households that used health services faced catastrophic health-care payments. 2.0% (95% CI 1.7-2.3) of non-poor households became poor because of out-of-pocket payments for health. Health service coverage and financial risk protection varied substantially by region. Although the richest quintiles had better access to health services than the poorest quintiles, they also had a higher incidence of financial catastrophe as a result of payments for health care. Of the indicators included in the study, coverage of adequate sanitation, no indoor use of solid fuels, at least four antenatal care visits, postnatal care for mothers, skilled birth attendance, and institutional delivery were the most inequitable by wealth quintile. Interpretation Attainment of universal health coverage in Myanmar in the immediate future will be very challenging as a result of the low health service coverage, high financial risk, and inequalities in access to care. Health service coverage and financial risk protection for vulnerable, disadvantaged populations should be prioritised. Copyright (C) 2018 The Author(s). Published by Elsevier Ltd.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ed51fcdfda66395f09bbb8a84ec8640",
  "timestamp": "2025-05-15T02:29:59.206102"
}