{
  "id": 9238,
  "title": "Knowledge about neonatal danger signs and associated factors among mothers of children aged 0-12 months in a rural county, Southwest of China: a cross-sectional study",
  "abstract": "Background Delay in care seeking is one of the causes for neonatal death. Mothers' knowledge of neonatal danger signs is imperative to promote early recognition of neonatal illness and reduce the delay in care seeking. Currently, no study has been conducted on the knowledge about neonatal danger signs in China, especially in economically less developed areas. This study aimed to examine the knowledge of neonatal danger signs and risk factors of poor knowledge among mothers in a rural county of southwest of China. Methods A cross-sectional study was conducted in Wenshan, a rural county of southwest of China. A total of 112 respondents were included from November 2020 to February 2021 among women who had babies aged 0-12 months and brought their babies to health care centers for immunization within the study period. A questionnaire with 18-item key neonatal danger signs was used to measure their knowledge about these signs. Mothers who scored above average were considered to have relatively good knowledge whereas those who scored below average were considered to have relatively poor knowledge. Independent predictors of mothers' knowledge were identified by multivariable logistic regression analysis. Results The mean knowledge score of neonatal danger signs of mothers was 18.1 (SD = 8.6). Fifty-eight percentage of mothers (65/112) had poor knowledge of neonatal danger signs. Danger signs of bluish or pale skin, chest indrawing, and convulsion were mostly recognized, whereas danger signs of not able to feed since birth, or stopped feeding well, excessive crying and eyes draining pus were recognized poorly. Less than four antenatal visits [AOR = 4.348], younger than 25 years old [AOR = 3.839], ethnic minority [AOR = 3.956] and family financial difficulty [AOR = 4.944] were significant indicators of relatively poor knowledge. Conclusions Mothers' knowledge about neonatal danger signs in rural China is poor even though the coverage of maternal and child health care services are expanded. Existing efforts should be enhanced for antenatal care visits, avoiding early marriage as well as early childbearing. More attention should be paid to low-income ethnic minority mothers. Educating and training should be strengthened for danger signs, especially those who are predicted to have insufficient knowledge.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ed7d983b30c3b2df71679cda2fd99f0",
  "timestamp": "2025-05-15T03:26:54.573085"
}