{
  "id": 7885,
  "title": "Proximal hip fractures in 71,920 elderly patients: incidence, epidemiology, mortality and costs from a retrospective observational study",
  "abstract": "BackgroundThe risk of proximal femoral fractures increases with aging, causing significant morbidity, disability, mortality and socioeconomic pressure. The aims of the present work are (1) to investigate the epidemiology and incidence of these fractures among the elderly in the Region of Lombardy; (2) to identify the factors influencing survival; (3) to identify the factors influencing hospitalization and post-operative costs.MethodsThe Region of Lombardy provided anonymized datasets on hospitalized patients with a femoral neck fracture between 2011 and 2016, and anonymized datasets on extra-hospital treatments to track the patient history between 2008 and 2019. Statistical evaluations included descriptive statistics, survival analysis, Cox regression and multiple linear models.Results71,920 older adults suffered a femoral fracture in Lombardy between 2011 and 2016. 76.3% of patients were females and the median age was 84. The raw incidence of fractures was stable from year 2011 to year 2016, while the age-adjusted incidence diminished. Pertrochanteric fractures were more spread than transcervical fractures. In patients treated with surgery, receiving treatment within 48 h reduced the hazard of death within the next 24 months. Combined surgical procedures led to increased hazard in comparison with arthroplasty alone, while no differences were observed between different arthroplasties and reduction or fixation. In patients treated conservatively, age and male gender were associated with higher hazard of death. All patients considered, the type of surgery was the main factor determining primary hospitalization costs. A higher number of surgeries performed by the index hospital in the previous year was associated with financial savings. The early intervention significantly correlated with minor costs.ConclusionsThe number of proximal femoral fractures is increasing even if the age-adjusted incidence is decreasing. This is possibly due to prevention policies focused on the oldest cohort of the population. Two policies proved to be significantly beneficial in clinical and financial terms: the centralization of patients in high-volume hospitals and a time limit of 48 h from fracture to surgery.Trial registrationNon applicable.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f1cfa62c1eba130881409164921b018",
  "timestamp": "2025-05-15T03:13:04.922113"
}