{
  "id": 8023,
  "title": "DEVELOPMENT OF THE MODEL FOR FORECASTING INDICATORS OF BANKING MICROCREDITING OF SMALL BUSINESS ENTITIES",
  "abstract": "In the context of the need to rebuild the economy of Ukraine, one of the important tasks is to support domestic business structures in terms of providing them with a suf-ficient amount of financial resources for the development of competitive business. The article proposes a model for forecasting the main indicators of microcrediting of small business entities carried out by domestic commercial banks, defines its functional struc-ture and main structural components. In the process of analysis, basic, easy-to-calculate and adapt models of forecasting indicators of microcrediting of small business subjects by domestic banks were used using linear regression, which made it possible to establish the influence of certain types of banking products on complex indicators of microcredit-ing. Calculations were made on the basis of data obtained as a result of a survey of employees of commercial banks (JSB Ukrgasbank, JSC Idea Bank, JSC Kredobank, JSC ProCredit Bank) and their clients -representatives of small businesses. Based on the results of the analysis, the forecast values of the specific weight of specific micro -credit products in the portfolios of the four investigated banks were determined.The optimization parameters of the bank's microloans portfolio are substantiated. The calculation and optimization of the overall efficiency of the bank and its portfolio of microloans were carried out. It has been proven that this method makes it possible to adjust the placement of bank funds in different areas of activity in order to minimize risk at a satisfactory level of bank performance in general. The authors have developed and proposed for use at all levels of the credit system a risk level optimization model: for each individual microcredit contract; for each individual type of microcredit; for the microcredit portfolio of each individual bank. The proposed risk optimization models are simple and universal, it is possible and appropriate to use them at any stage of the credit process.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f23c081150d8147dd475db4bfec1d62",
  "timestamp": "2025-05-15T03:14:37.281148"
}