{
  "id": 7319,
  "title": "Health insurance for patients with HIV/AIDS in Vietnam: coverage and barriers",
  "abstract": "Background: Health insurance (HI) plays an important role in ensuring the financial equity by the risk pooling mechanism and reducing the economic burden of healthcare for HIV/AIDS patients. However, there is a lack of evidence to clearly understand HI coverage in regard to people living with HIV (PLWH). We conducted this study to explore the coverage and barriers of HI among PLWH in Vietnam. Methods: A cross-sectional study was conducted in multi-sites including 3 hospitals and 5 outpatient clinics in Hanoi and Nam Dinh in 2013. A convenience sampling approach was used to recruit the participants. A structured questionnaire was used to examine current status of using HI, lacking information about HI, feeling difficulties in accessing, using and paying HI. Multivariate logistic regression was conducted to examine factors associated with HI use and barriers. Results: Among 1133 HIV/AIDS patients, the coverage of HI was 46.0%. About 36.4% lacked information about HI, 21.0% felt difficulty in accessing HI. Meanwhile, the proportions of patients feeling difficulty in using HI and paying HI were 19.9 and 18.6%, respectively. Multivariate regression found that lacking information about HI and feeling difficulty in accessing HI were main barriers of having HI among PLWH. Conclusion: This study found a high proportion of PLWH was not covered by HI. Lacking information about HI and feeling difficulty in accessing HI were primary barriers that should be resolved via timely educational campaigns and consultations as well as supports from families in order to expand effectively the HI coverage.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f29a2615a9bf0994b4e62f6cb5b5f84",
  "timestamp": "2025-05-15T03:07:31.852038"
}