{
  "id": 348,
  "title": "Clustering-based return prediction model for stock pre-selection in portfolio optimization using PSO-CNN plus MVF",
  "abstract": "Incorporating return prediction in portfolio optimization can make portfolio optimization more efficient by selecting the stocks expected to perform well in the future. This paper proposes a hybrid method that integrates a convolutional neural network (CNN) with optimized hyperparameters by the particle swarm optimization (PSO) for stock pre-selection and a mean-variance with forecasting (MVF) model for portfolio optimization. In the stock pre-selection step, to reduce the computational complexity of the model, the CNN network is trained on the clustered stocks via the K-means method instead of training on each stock. The proposed model also includes a novel feature selection method that weighs features based on their impact on predicting stock returns for more accurate predictions. The results of implementing this model on 21 stocks from the New York Stock Exchange (NYSE) market demonstrate that the proposed method for training the CNN network on clustered stocks does not signicantly differ in prediction accuracy to conventional methods. Moreover, in the portfolio optimization step, the returns predicted in the stock pre-selection step are used to optimize the weight of stocks in the portfolio. Compared to other benchmark models, the proposed model exhibits superior financial performance. & COPY; 2023 The Author(s). Published by Elsevier B.V. on behalf of King Saud University. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f35fc76d90d37c5876927daffd8300a",
  "timestamp": "2025-05-15T00:42:32.458966"
}