{
  "id": 9030,
  "title": "Export credit insurance as a part of an environment supporting export performance",
  "abstract": "The author in her paper points out at the importance and necessity of the export credit insurance within the process of supporting exports. The support of exports is implemented in various forms, namely by direct financing or re-financing through commercial banks, granting bank guarantees, as well as by discounted bills. Insurance activities contribute to the support of exports too either by the insurance against political or commercial risks or assurance aiming at the product competitiveness in foreign markets. Credit insurance helps just in this case, and influences therefore significantly export performance. The paper characterises credit insurance systems. Depending on the historic and economic development there exist various insurance and financial schemes in individual countries, and various institution types operate within them. These institutions are either joint stock companies owned fully or partially by the state, or governmental agencies. There are no instructions telling what institutional solution is the best one; at the foundation of credit insurance company each country should respect its own conditions and exporters' needs. Depending on the form that links export insurance and financing with the government support and what linkage exits between them one can in principle talk about the three institution types: eximbanks, credit insurance companies and the so called sui generis institutions. The author next defines the risks in credit insurance. In this context one classifies basically the risks into commercial and political ones. Commercial risks result froth economical or financial situation of the foreign debtor, e. g. through substantiated insolvency (bankruptcy and adjustment) or by payment repulsion. The intensity of commercial risk impact is set by the two factors: The first factor is partner's reliability - from this point of view one should evaluate legal status of the partner, his economic situation, commercial ability, technical and economic ability to honour the obligation etc. The second factor is the degree of the legal assurance of a given contractual relation this means usually a legal perfection of the contract, its conditions, the law under which one evaluates the relevant legal relation, and the character of sanctions in the event of failure to honour the contract. Political risks stem from political events and administrative measures in the country of domicile of the foreign debtor or in the third country and from the point of view of the foreign buyer or debtor are of force majeure character (unpredictable circumstances, jurisdictional risks etc.). Classical political risk is for instance moratorium - the payment and transfer of the due bill to the exporter is not approved by the government by the due date, but only a part of the payoff is approved, eventually the government orders the postponement of the payment. According to the type of insured risk one covers either short-term commercial risk or medium or long-term political risk. At liabilities exceeding one-year period one cannot exclude commercial risk either, and therefore this risk is covered usually at medium and long-term insurance as well. Sometimes is this risk labelled by one word as the territorial risk and insurance companies include into the insurance coverage also such events as for instance earthquake or another natural disaster, which causes liability unpaid. Some insurance companies offer a combination of political and commercial risk also for short-term credits up to 1 year, offering the coverage of the so-called combined risk. There is a specific approach toward the insurance of investments that are not typically credit risk but are narrowly linked to the export activities of insured subjects. The paper pays attention too to the comparison of credit insurance abroad. The author further deals with the characteristics of the credit insurance market in Slovakia in consideration of a short-term commercial insurance and briefly assesses foreign trade development in the Slovak Republic since 1995 up to now. Relating to this analysis the author specifies the institutions that implement export credit insurance in the Slovak Republic. She briefly defines conditions for credit insurance against commercial risks. Export credits may have a form of supplier credit, which is granted by the exporter or buyer's credit, where exporter's bank or another financial institution grants credit to the buyer or his bank. According to export contracts on credit one distinguishes further classification of insurance as short-term, medium-term and long-term insurance. The insurance relates to export contracts implemented by corporate entity with a domicile or natural person with a permanent address on the territory of the Slovak Republic, the exporter is insured. The insurance covers for the Slovak exporter commercial risks connected with claims settlement from abroad originated by substantiated or expected insolvency or by payment repulsion. This insurance can be extended by an additional insurance against political risks. Credit insurance is implemented by general insurance contract and by the statement on granting credit limit for each foreign buyer at regularly repeated expeditions during a certain time period (for instance one year period). Insurance premium amount is set depending on the country of the foreign buyer, delay of payment and the arrangement of supplies (revolving or one-time). The author briefly suggests the territorial structure of the insured exports of the Slovak Republic and its commodity structure. She compares Slovak subjects within the framework of the credit insurance, namely: Eximbank SR, Insurance Gerling Slovakia, j. s. c. and Allianz Insurance Company j. s. c. In the conclusion the paper suggests certain trends of credit insurance within the process of globalisation. The author states that at the support of exports, development and improvement of service aiming at higher competitiveness of Slovak exporters one should orientate oneself mainly at the improvement and insurance price reduction in various forms. She lists the following forms: increased insurance coverage extent, marked decrease of insurance rates, systematic introduction of bonus system and discounts in insurance rates for exporters, the possibility to pay insurance premium gradually, preferred credit insurance granted by commercial banks and utilisation of all forms of international co-operation including active reinsurance. All cited measures mean some improvement of insurance, above all in insurance price reduction and thus improvement of competitiveness of exporters at achievement export contracts. It is important to mention that one has to respect the macro-economic and micro-economic possibilities of the country and competing environment in the market. The author states that the concept of the strategic destination of Slovakia in the field of export credit insurance should be based on the measures providing more efficient activities of significantly higher quality backed by domestic legal system and currently used international habits. In any case the starting point for the definition of extent one should adhere to the rules accepted by the EU, OECD and WTO. These steps are also necessary while preparing Slovakia to enter the EU. In this respect it is important to know that the export credit insurance against commercial risks is an inseparable part of the support of export performance of the economy. The role of the state within the framework of the foreign trade in market economy countries is based on the rule that state administration should not intervene into the foreign trade operations of individual entrepreneuring subjects, must however, provide optimum conditions for them - stimulating export friendly environment and must offer its exporters efficient export supporting policy.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f42d582862ecb298c4d822dffb0a656",
  "timestamp": "2025-05-15T03:24:54.890693"
}