{
  "id": 6700,
  "title": "Correlation analysis between work-related musculoskeletal disorders and the nursing practice environment, quality of life, and social support in the nursing professionals",
  "abstract": "We aim to analyze the correlated influential factors between work-related musculoskeletal disorders (WMSDs) and nursing practice environment and quality of life and social support.From January 2015 to October 2015, cluster sampling was performed on the nurses from 12 hospitals in the 6 areas in Xinjiang. The questionnaires including the modified Nordic Musculoskeletal Questionnaire, Practice Environment Scale (PES), the Mos 36-item Short Form Health Survey, and Social Support Rating Scale were used to investigate. Multivariate logistic regression analysis was used to explore the influential factors of WMSDs.The total prevalence of WMSDs was 79.52% in the nurses ever since the working occupation, which was mainly involved waist (64.83%), neck (61.83%), and shoulder (52.36%). Multivariate logistic regression analysis indicated age (26 years), working in the Department of Surgery, Department of Critical Care, Outpatient Department, and Department of Anesthesia, working duration of >40 hours per week were the risk factors of WMSDs in the nurses. The physiological function (PF), body pain, total healthy condition, adequate working force and financial support, and social support were the protective factors of WMSDs.The prevalence of WMSDs in the nurses in Xinjiang Autonomous Region was high. PF, bodily pain, total healthy condition, having adequate staff and support resources to provide quality patient care, and social support were the protective factors of WMSDs in the nurses.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f46a07addba4034a4bb902e87519ed1",
  "timestamp": "2025-05-15T03:00:35.513763"
}