{
  "id": 3687,
  "title": "Modeling approaches for Silent Attrition prediction in Payment networks",
  "abstract": "Predicting customer attrition (churn) is a well-known problem in industries that provide services, like financial institutions, telecommunications, e-commerce, and retail. There are two kinds of attrition - active and passive (silent). Active attrition is usually associated with subscription-based business models, commonly seen in telecommunications and internet industries like Netffix. In industries like finance, retail, and e-commerce, we see the other kind of attrition - silent attrition where customers stop doing business without formal notice. This makes the silent attrition prediction problem even more challenging because it is difficult to differentiate between attrited and inactive customers. We focus our work on predicting silent attrition which is still under-explored in the payment card industry (i.e. Mastercard, Visa). The contribution of our work is threefold. First, we present a data-driven approach to define silent attrition as customer inactivity. Second, we discussed multiple procedures to generate synthetic data thereby preserving customers' privacy. At last, we presented a comprehensive view of various machine learning (ML) pathways in which this churn prediction problem can be framed and solved; each requiring a specific feature engineering. We presented experimental results corresponding to each pathway to comparative analysis. We believe that this work to be beneficial to the researchers and ML practitioners who often have to deal with sensitive financial data but have limited permission to use it. In this direction, we demonstrated the use of synthetic data generation to reduce the risk of data leakage and other privacy concerns relating to ML models development.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f4f2529f67ca3c609809238adcbae84",
  "timestamp": "2025-05-15T02:29:00.141420"
}