{
  "id": 26,
  "title": "Application of Features and Neural Network to Enhance the Performance of Deep Reinforcement Learning in Portfolio Management",
  "abstract": "Portfolio management is the decision-making process of allocating a certain amount of funds to multiple financial assets and continuously changing the distribution weights to increase returns and reduce risks. With the advance in artificial intelligence technology, it has become possible to use computers for self-learning and large-scale calculations, and to achieve optimized portfolio management. This paper mainly studies and analyzes the problem of portfolio optimization in the digital currency market, uses Poloniex's historical transaction data of digital currency to conduct experiments, and proposes a strategy based on the framework of deep reinforcement learning algorithms. The investment strategy framework uses Convolutional Neural Network and Visual Geometry Group Network. In addition to the closing price, highest price and lowest price, we also consider other internal or external features such as Network Value to Transaction Volume Ratio, Market Value to Realized Value Ratio, Return on Investment and Volatility. The results show that the return rate of our algorithm based on VGG with NVT as feature is 11.05% better than the work of Jiang et al. and at least 110% better than investment strategies such as Moving Average Reversion and Robust Median Reversion.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f505bfe2d125f8ac3e5517b8ba75281",
  "timestamp": "2025-05-15T00:38:16.288134"
}