{
  "id": 6966,
  "title": "Prevalence and associated factors of ADHD-like symptoms among pharmacy students at Prince of Songkla University, Thailand in 2024: a crosssectional study",
  "abstract": "Objectives: This study investigated the prevalence of attention-deficit hyperactivity disorder ( ADHD ) and its associated factors among pharmacy students at Prince of Songkl a University in 2024.It was hypothesized that the prevalence of ADHD would be associated with various demographic, socioeconomic, historical, and behavioral factors. Methods: This cross-sectional descriptive study involved pharmacy students from years 1-5 at Prince of Songkla University in Thailand.Data were g athered from 761 students using a self-administered q uestionnaire that included the Adult ADHD Self-Report Scale ( ASRS Screener V1.1). Descriptive statistics, the chi-square test, the Fisher exact test, and multiple logistic regression were employed for data analysis. Results: In total, 526 students participated in the study ( participation rate: 69%), with an average age of 21 +/- 1.57 years. The risk of ADHD was prevalent in 14.4% of the respondents ( 76 students; 95% CI: 11.4%-17.5%).Significant factors associated with an increased risk of ADHD included identifying as not disclosed or preferring not to report g ender ( ad j usted OR [ORadj], 3.32; 95% CI, 1.04-10.57), having insufficient monthly income (ORadj, 2.02; 95% CI, 1.13-3.61), and recent traffic violations (ORadj, 2.02; 95% CI, 1.09-3.76).It was also found that difficulties with executive functioning, such as organization and procrastination, were highly prevalent among pharmacy students. Conclusion:The study identified a substantial prevalence of ADHD risk among pharmacy students, with factors including g ender, financial challenges, and behavioral patterns such as traffic violations significantly associated with this risk.These findings underscore the necessity for targeted mental health interventions in university settings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f5ac2d867acd2fb68b10d8838385ba1",
  "timestamp": "2025-05-15T03:03:55.674509"
}