{
  "id": 2440,
  "title": "Basel III Effects on Bank Stability: Empirical Evidence from Emerging Countries",
  "abstract": "This article examines the influence of Basel III reforms, risk management, and banking sector efficiency on banks' financial stability in emerging countries. The data for this study is collected from various sources. Based on the GDP classification of IMF, the top 22 countries were selected as the sample. The sampling frame includes all six regions of the world including 482 banks and 3022 observations in total. The empirical analysis is carried out by estimating the random effects models. It is found that the effects of capital buffer, liquidity, and risk management practices are significant on financial stability. It is also noticed that the capital buffer has a constructive and significant influence on financial stability. However, liquidity management shows a mixed impact, as in some countries, its impact is positive and significant while, in other countries, it is insignificant. Risk management practices have an overall positive influence on financial stability in the case of large economies. However, results are insignificant in the case of small economies. Bank-specific variables, namely profitability, size, and efficiency have a positive whereas, loan quality has a negative impact on financial stability in the emerging countries. GDP has a positive impact on financial stability whereas inflation and unemployment both have a negative effect on financial stability.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f62183bddbbb95124ba65cda3392c14",
  "timestamp": "2025-05-15T02:15:27.031109"
}