{
  "id": 5131,
  "title": "Predictors of Lung Cancer Screening Utilization in a Population-Based Survey",
  "abstract": "Purpose: Annual low-dose CT (LDCT) screening in high-risk individuals has been recommended to detect lung cancer earlier and reduce mortality. The objective of this study was to identify demographic, financial, and health care factors associated with screening uptake in a population-based survey. Methods: Data from the Lung Cancer Screening Module and core modules of the 2017 Behavioral Risk Factor Surveillance System, a population-based survey administered via cell phone and landline, were analyzed to examine demographic, health, and financial factors associated with screening uptake among the 10 states that administered the screening module. Weighted frequencies and confidence intervals (CIs) were produced, and weighted Wald chi(2) tests were used to compare differences in screening utilization by patient characteristics. A multivariate logistic mixed-effects model was constructed, in which participant clustering by state was accounted for with a random intercept. Results: The uninsured were less likely to undergo LDCT screening (odds ratio [OR], 0.28; 95% CI, 0.12-0.65). LDCT screening uptake was higher for participants with chronic respiratory conditions (OR, 4.14; 95% CI, 2.33-7.35); those who were divorced, separated, widowed, or refused to answer (OR, 1.41; 95% CI, 1.05-1.86); those who had previous cancer diagnoses (OR, 1.90; 95% CI, 1.40-2.56); and those aged 65 to 69 years (OR, 1.23; 95% CI, 1.06-1.44) or 70 to 74 years (OR, 1.17; 95% CI, 1.00-1.37). Utilization also varied significantly across states. Conclusions: Having a related health condition whereby participants were sensitized to the benefits of early screening (ie, another cancer diagnosis, presence of chronic respiratory conditions) and having insurance coverage were associated with higher LDCT screening uptake. Providers should engage LDCT-eligible patients through informed and shared decision making to increase preference-sensitive screening decisions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f671f35e57fd661c0e20609b11aa47b",
  "timestamp": "2025-05-15T02:44:43.842222"
}