{
  "id": 4137,
  "title": "Identifying poorly performing listed firms using data analytics",
  "abstract": "This study presents a teaching case that analyzes the applicability of the Z-Score bankruptcy prediction model to manufacturing firms listed in Hong Kong. Although the Z-Score model has been studied extensively, there are very few studies in the context of the Hong Kong stock market. Given that the Hong Kong stock market has high retail investor participation and low liquidity, whether the Z-Score model is relevant to Hong Kong investors is an important but unanswered question. The Z-Score model predicts the bankruptcy of firms by considering financial ratios involving firm liquidity, solvency, profitability, leverage, and activity. Financial and stock return data on the manufacturing firms listed in the Hong Kong Stock Exchange from 1981 to 2020 are collected from Thomson Reuters Datastream to examine the applicability of the Z-Score model in Hong Kong. Firms are then classified into bankrupt or non-bankrupt groups based on their Z-Scores. The annual stock returns in the subsequent year are analyzed for the two groups after classification. When the Z-Score threshold is set at 0, investing in the non-bankrupt group and short-selling the bankrupt group earns an annual return of 11.99% in the subsequent year. The results are robust to alternative periods and lagged values of the Z-Score. This suggests that stock prices do not reflect all the accounting data and that investors can increase their returns using the Z-Score model. As retail investors have limited resources, it may be difficult for them to fully implement the Z-Score model for a portfolio that consists of thousands of stocks. However, they can still avoid substantial losses by not investing in firms with low Z-Scores.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f695bee1d7ce48e666e2a2e474b56e6",
  "timestamp": "2025-05-15T01:23:58.194981"
}