{
  "id": 8046,
  "title": "THE ASSOCIATION OF POOR ECONOMIC CONDITION AND FAMILY RELATIONS IN CHILDHOOD WITH LATE-LIFE DEPRESSION",
  "abstract": "Background: Late-life depression encompasses both patients with late-life onset of depression (>60 years) and older adults with a prior and current history of depression. The aim of the study was to analyze the impact of the economic condition and family relations in childhood as risk factors for late-life depression. Subjects and methods: This was an analytical cross-sectional study comprising 120 subjects, 60 patients with unipolar depression and 60 subjects without depressive disorders, diagnosed in accordance with the 10-th International Classification of Mental and Behavioural Disorders. All participants in the study were above the age of 60 and there was no significant statistical difference in the sex proportion in both groups (p>0.05). Data for the examination were taken from a self-reported questionnaire designed for our aim. The Geriatric Depression Scale was used to measure depressive symptoms. Results: Our results have shown that severe financial difficulties are important events in childhood and are risk factors for depression in the elderly (Chi-square=12.68, df=2, p=0.0018). Our investigation has found the association of family relations with late-life depression. In fact, conflictual relations in the family were more common in the experimental group than in the control group (Chi-square=14.32, df=3, p=0.0025). Furthermore, father's addiction to alcohol in childhood was associated with depression in later life (p=0.013). The difference in childhood emotional neglect and unequal treatment between siblings in both groups was insufficient to be confirmed statistically, but the examinees with this trauma had a threefold higher chance of having depression later in life (Odds ratio=3.04, 95% CL0.92 < OR< 10.65; Yates chi-square=3.2, df=1, p=0.07). Subjects who have estimated their mother (p=0.019) or father (p=0.046) having negative personal character traits had a significantly greater risk for development of late-life depression. Conclusions: Negative socio-economic circumstances as well as family conflicts during childhood are associated with late-life depression. Father's addiction to alcohol and parents' negative personal character traits are associated with depression in the elderly.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f6f621ed0332e27759d9450afa49d49",
  "timestamp": "2025-05-15T03:14:37.378808"
}