{
  "id": 3399,
  "title": "The use of quantitative methods in research on the evaluation of the implementation of health information systems",
  "abstract": "This paper aims to identify the main quantitative methods used in research on evaluating the implementation of health information systems. This is a bibliographic study, which analyzed a sample of 11 articles published between 2010 and 2019 on the theme. For the composition of the portfolio, the application of the instrument Proknow-C - Knowledge Development Process - Constructivist was used in national and international databases. The analysis of this research is bibliographic and its results show that descriptive statistics was the most used statistical technique, followed by hypothesis tests and multiple regression analysis. However, the techniques of: structural equation modeling, logistic regression analysis and confirmatory factor analysis were also present. The SAS software was the only one mentioned in 2 different researches, but in different versions. The presence of questionnaires was verified in all studies and the use of the Likert scale was observed in 36.36% of the papers. The Cronbach's alpha coefficient was the method mentioned for validating and adhering to the questionnaires and was present in 27.27% of the analyzed articles. The study contributed to broaden the understanding about the use of quantitative methods in research on the subject and to point out some directions that may help in future studies.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f7175e4611007dcb80d5bb5774fb36f",
  "timestamp": "2025-05-15T01:16:55.405903"
}