{
  "id": 4381,
  "title": "Financial innovation: Credit default hybrid model for SME lending",
  "abstract": "Credit risk evaluation is an integral part of any lending process, and even more so for financial institutions involved in lending to SMEs. The importance of credit scoring has increased recently because of the financial crisis and increased capital requirements for banks. There are, however, only few studies that develop credit coring models for SME lending. The objective of this study is to introduce a novel, more accurate credit risk estimation approach for SMEs business lending. Based on traditional statistical methods and recent artificial intelligence (AI) techniques, we proposed a hybrid model which combines the logistic regression approach and artificial neural networks (ANN). In order to test the effectiveness and feasibility of the proposed hybrid model, we use the data of Finnish SMEs from the fiscal years 2004 to 2012. Our results suggest that the proposed ANN/logistic hybrid model is more accurate than either of the initial models ANN or logistic regression. This improvement in the accuracy of the credit scoring model decreases evaluation errors and has thereby many potential practical implications. First of all, a more accurate credit scoring model can result in better performance of the whole SME loan portfolio. Second, it can also result in lower capital requirements from the banks perspective and lower interest rates from the individual firm's perspective. Combined, these effects will enhance the banks competitiveness in the market for SME loans. (C) 2016 Elsevier Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f72c91c279c603cad8854ec8ac0c33b",
  "timestamp": "2025-05-15T02:36:38.441979"
}