{
  "id": 3877,
  "title": "Onset Detection of Epileptic Seizures From Accelerometry Signal",
  "abstract": "Epileptic seizures are the result of any abnormal asynchronous firing of cortical neurons. Seizures are abrupt and pose a risk of injury and fatal harm to the patient. Epilepsy affects patients quality of life (QOL) and imposes financial, social, and physical burden on the patient. The unpredictability associated with seizures further adds to the reduced QOL and increases dependence on caregivers and family members. A seizure triggered alarm system can reduce the risk of seizure-related injuries and aid in improving patient's QOL. This study presents real-time onset detection of seizures from accelerometry signal. An automated approach based on statistical machine learning is employed to learn the onset of seizures. To search for the optimal parameter that simultaneously maximizes detection sensitivity (sens) while minimizing false alarm rate (FAR) and latency, the epoch length is varied from t = {1,..., 10s}. Linear and non-linear time-varying dynamical patterns were extracted from every epoch using Poincar ' e plot analysis. The correlation patterns were learned using a kernalized support vector data descriptor. The preliminary analysis on accelerometry data collected from 8 epileptic patients with 9 generalized tonic-clonic seizures (GTCS) shows promising results. The proposed algorithm detected all GTCS events (sens: 100%, FAR: 1.09/24h) at 8s from onset. The proposed algorithm can lead to a sensitive, specific, and a relatively short-latency detection system for real-time remote monitoring of epileptic patients.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f765e08a89e2872fb530dbad9afec1c",
  "timestamp": "2025-05-15T02:30:58.237117"
}