{
  "id": 4563,
  "title": "Predictors of Financial Toxicity Among United States Prostate Cancer Survivors: Results From a National Survey",
  "abstract": "Introduction: Despite increasing attention to financial toxicity associated with prostate cancer, national rates of subjective and objective financial toxicity have not been well characterized, and it remains unknown which prostate cancer survivors are at highest risk for undue financial burden.Methods: Men with a history of prostate cancer were identified from the Medical Expenditure Panel Survey. The proportion of men reporting catastrophic health care expenditures (out-of-pocket spending >10% of income) and other measures of financial toxicity were assessed. Multivariable logistic regression was used to identify independent predictors of financial toxicity.Results: Of a weighted estimate of 2,349,532 men with a history of prostate cancer, 13.5% reported catastrophic health care expenditures, 16% reported subjective worry about ability to pay medical bills, and 15% reported work changes due to their cancer diagnosis. Significant predictors of catastrophic expenditures included private insurance (OR 4.62, 95% CI 1.29-16.49) and medical comorbidities (OR 1.38, 95% CI 1.05-1.82), while high income was protective (>400% vs <100% federal poverty level, OR 0.06, 95% CI 0.02-0.19). Each year of older age was associated with decreased odds of subjective worry about medical bills. Only 12% of men reported their doctor discussed the costs of care in detail.Conclusions: Nearly 1 in 7 prostate cancer survivors experience catastrophic health care expenditures, and a larger proportion report subjective manifestations of financial toxicity. Many men report their physicians did not address the financial side effects of treatment. These results highlight the patient characteristics associated with this important side effect of prostate cancer care.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f7a60f80194e74ba603f9bc8eeab597",
  "timestamp": "2025-05-15T02:38:56.168934"
}