{
  "id": 8730,
  "title": "Prognostic Significance of Tumor-Associated Lymphangiogenesis in Malignant Melanomas of the Conjunctiva",
  "abstract": "Purpose: To evaluate whether tumor-associated lymphangiogenesis contributes to prognosis of conjunctival malignant melanomas and to study its association with other tumor characteristics. Design: Nonrandomized, retrospective case series. Participants: A total of 109 consecutive patients with primary conjunctival malignant melanoma. Methods: Proliferating lymphatic vessels were identified immunohistochemically using lymphatic vascular endothelial hyaluronan receptor-1 and podoplanin as specific lymphatic endothelial markers and Ki-67 as proliferation marker. Baseline tumor characteristics included tumor location, tumor thickness, tumor diameter, tumor origin, and tumor growth pattern. Kaplan-Meier and Cox regression analyses of the risk of local recurrence, lymphatic spread, distant metastasis, and melanoma-related death were performed. Main Outcome Measures: Intratumoral lymphatic vascular density and its association with tumor characteristics and recurrence-free, lymphatic spread-free, distant metastasis-free, and melanoma-specific survival. Results: Intratumoral and peritumoral proliferating lymphatic vessels could be detected in all of the 109 conjunctival melanoma samples. High intratumoral lymphatic density was significantly associated with palpebral tumor location (P<0.001), greater tumor thickness (P<0.001), larger tumor diameter (P = 0.001), tumor origin de novo (P= 0.002), and nodular tumor growth pattern (P = 0.037). Patients with high intratumoral lymphatic density revealed significantly lower recurrence-free, lymphatic spread-free, distant metastasis-free, and melanoma-specific survival rates (P<0.001 for all). By multivariate Cox regression, factors predictive of local recurrence included palpebral tumor location (hazard ratio [HR] 2.66, P = 0.014), large tumor diameter (HR 5.48, P<0.001), and high intratumoral lymphatic density (HR 2.48, P = 0.043); factors predictive of lymphatic spread included palpebral tumor location (HR 4.13, P = 0.009), high tumor thickness (HR 12.17, P<0.001), and high intratumoral lymphatic density (HR 6.79, P = 0.019); factors predictive of distant metastasis included palpebral tumor location (HR 7.63, P<0.001), high tumor thickness (HR 8.60, P<0.001), large tumor diameter (HR 0.30, P = 0.029), and high intratumoral lymphatic density (HR 8.90, P = 0.047); and factors predictive of melanoma-related death included palpebral tumor location (HR 7.74, P<0.001), high tumor thickness (HR 10.88, P<0.001), large tumor diameter (HR 0.28, P = 0.018), and, with borderline significance, high intratumoral lymphatic density (HR 8.46, P = 0.052). Conclusions: Tumor-associated lymphangiogenesis seems to be associated with an increased risk of local recurrence, lymphatic spread, distant metastasis, and melanoma-related death in patients with conjunctival malignant melanomas. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 2351-2360 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f81235368c070df3bc64d4cfde04b69",
  "timestamp": "2025-05-15T03:21:56.607127"
}