{
  "id": 3252,
  "title": "Health Behavior and Behavioral Economics: Economic Preferences and Physical Activity Stages of Change in a Low-Income African-American Community",
  "abstract": "Purpose. To examine the relationship between physical activity stages of change and preferences for financial risk and time. Design. A cross-sectional, community-based study. Setting. A low-income, urban, African-American neighborhood. Subjects. One hundred sixty-nine adults. Measures. Self-reported physical activity stages of change-precontemplation to maintenance, objectively measured body mass index and waist circumference, and economic preferences for time and risk measured via incentivized economic experiments. Analysis. Multivariable ordered logistic regression models were used to examine the association between physical activity stages of change and economic preferences while controlling for demographic characteristics of the individuals. Results. Individuals who are more tolerant of financial risks (odds ratio [OR] = 1.31, p < .05) and whose time preferences indicate more patience (OR = 1.68, p < .01) are more likely to be in a more advanced physical activity stage (e. g., from preparation to action). The likelihood of being in the maintenance stage increases by 5.6 and 10.9 percentage points for each one-unit increase in financial risk tolerance or one-unit increase in the time preference measure, respectively. Conclusion. Greater tolerance of financial risk and more patient time preferences among this low-income ethnic minority population are associated with a more advanced physical activity stage. Further exploration is clearly warranted in larger and more representative samples.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f8d3ca1e1491ffcf331c856a35fcd52",
  "timestamp": "2025-05-15T02:24:05.244948"
}