{
  "id": 8150,
  "title": "The Complement Component 5 Gene and Age-Related Macular Degeneration",
  "abstract": "Objective: To investigate the association between variants in the complement component 5 (C5) gene and age-related macular degeneration (AMD). Design: Separate and combined data from 3 large AMD case-control studies and a prospective population-based study (The Rotterdam Study). Participants: A total of 2599 AMD cases and 3458 ethnically matched controls. Methods: Fifteen single nucleotide polymorphisms (SNPs) spanning the C5 gene were initially genotyped in 375 cases and 199 controls from The Netherlands (The Amsterdam/Rotterdam-Netherlands [AMRO-NL] study population). Replication testing of selected SNPs was performed in the Rotterdam Study (NL) and study populations from Southampton, United Kingdom (UK), and New York, United States (US). Main Outcome Measures: Early and late stages of prevalent and incident AMD, graded according to (a modification of) the international grading and classification system of AMD. Results: Significant allelic or genotypic associations between 8 C5 SNPs and AMD were found in the AMRO-NL study and this risk seemed to be independent of CFH Y402H, LOC387715 A69S, age, and gender. None of these findings could be confirmed consistently in 3 replication populations. Conclusions: Although the complement pathway, including C5, plays a crucial role in AMD, and the C5 protein is present in drusen, no consistent significant associations between C5 SNPs and AMD were found in any of these studies. The implications for genetic screening of AMD are discussed. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2010; 117: 500-511 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3f97c7d9c26d8abca4f1e309b7066bd7",
  "timestamp": "2025-05-15T03:15:38.453320"
}