{
  "id": 3743,
  "title": "Are credit ratings a good measure of capital adequacy?",
  "abstract": "Focus on capital adequacy intensified since the onset of the Global Financial Crisis (GFC), with many US and other global banks experiencing capital shortages over this time. The Basel standardised approach uses credit ratings as a determinant for corporate capital adequacy requirements. A problem with credit ratings is that they were designed to be a measure of relative, as opposed to absolute credit risk, and do not ratchet up or down with changes in economic circumstances. This paper examines how credit risk as indicated by credit ratings (and their associated capital requirement) changed pre and post Global Financial Crisis for US firms, as compared to market measures of credit risk including credit default swaps and fluctuating market asset values. The increases in credit risk shown by the credit ratings and the market indicators are compared to actual bad debt levels of banks. We use an extensive database comprising investment as well as speculative grade US firms. In order to measure the fluctuations in market asset values of these firms, we apply quantile regression and Monte Carlo simulation to the Merton structural credit model. This model uses asset fluctuations in conjunction with balance sheet structure to estimate Distance to Default (DD) and Probability of Default (PD). The use of quantile regression allows modelling of the extreme quantiles of a distribution which facilitates measurement of PDs at the most extreme points of downturn, when companies are most likely to fail. The study shows how the quantile analysis can be used to estimate capital buffers required by banks to deal with increases in credit risk. We find that changes in capital requirements over the GFC as measured by credit ratings are very small in relation to the increase in credit risk identified by market based measures and our quantile regression analysis. These findings can be important to banks and regulators in determining capital adequacy in volatile economic circumstances.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fa518072567c5f5eac312395c9027d0",
  "timestamp": "2025-05-15T02:29:28.056295"
}