{
  "id": 8917,
  "title": "Mortgage possessions, spatial inequality, and obesity in large US metropolitan areas",
  "abstract": "Objectives: As social determinants of health, mortgage possessions (primarily foreclosures in the US context) and housing instability have been associated with certain mental and physical health outcomes at the individual level. However, individual risks of foreclosure and of poor health are spatially patterned. The objective of this study is to examine the extent to which area-specific social and economic characteristics help explain the relationship between mortgage possessions and obesity prevalence in 75 of the 100 most populous US metropolitan areas. Study design: This is a cross-sectional study. Methods: The study relies on three sources of data: the Selected Metropolitan/Micropolitan Area Risk Trends (SMART) project, RealtyTrac foreclosure data, and the American Community Survey. Focal social and economic characteristics include foreclosure rates, levels of racial residential segregation, and poverty. Obesity prevalence and several control measures for each metropolitan area are also used. Ordinary least squares regression, weighted using the SMART project data, is used, and statistical significance is set at 0.05. Results: The results suggest that mortgage possessions are independently associated with higher obesity prevalence and that foreclosures operate through the specific channel of racial residential segregation and its tie to the racial composition of a metropolitan area. Socio-economic status of an area, and not poverty, is related to foreclosures and obesity prevalence. Conclusion: Mortgage possessions not only are socio-economic but also have negative health consequences, such as obesity. The findings provide an empirical base for other researchers to uncover the relationships between segregation, mortgage possessions, and obesity at the individual level of analysis. The public health community should be engaged in addressing the issue of foreclosures in the US because the failure to engage may have broad financial and health consequences across large cities. (c) 2019 The Royal Society for Public Health. Published by Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fa74b1e883e54be259c969619bd2805",
  "timestamp": "2025-05-15T03:23:56.033859"
}