{
  "id": 6050,
  "title": "The cost of virtual wins: An examination of gambling-related risks in youth who spend money on social casino games",
  "abstract": "Background and aims: Social casino games (SCGs) are not technically considered a form of gambling but they do enable players to spend money in a game that is gambling themed or structurally approximate to gambling. It has been theorized that SCGs could be a gateway to gambling activities or otherwise normalize the experience of gambling for young people, particularly when money becomes involved. The aim of this study was to investigate whether adolescents' financial expenditure in SCGs was associated with broader gambling activity, including level of participation, expenditure, and problem gambling symptoms. Methods: An online survey was administered to 555 adolescents, including 130 SCG players (78 non-paying and 52 paying users). Results: Paying SCG users tended to be employed males who play more frequently and engage in more SCG activities, who report more symptoms of problem gambling and higher psychological distress than non-paying SCG users. Paying SCG users reported more frequent engagement and spending in monetary gambling activities, and two-thirds of SCG payers recalled that their SCG use had preceded involvement in financial gambling. Discussion and conclusions: Spending in simulated gambling activities by adolescents may be a risk factor for problem gambling. Although SCGs may currently defy classification as a form of gambling, these activities will likely continue to be scrutinized by regulators for the use of dubious or exploitative payment features offered in a gambling-themed format that is available to persons of all ages.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fafa10b9e7efd8064f27c1e59802320",
  "timestamp": "2025-05-15T02:54:03.496437"
}