{
  "id": 217,
  "title": "A Novel Fuzzy Unsupervised Quadratic Surface Support Vector Machine Based on DC Programming: An Application to Credit Risk Management",
  "abstract": "Unsupervised classification is used in credit risk assessment to reduce human resource costs and make informed decisions in the shortest possible time. Although several studies show that support vector machine-based methods have better performance in unlabeled datasets, several factors still negatively affect these models, such as unstable results due to random initialization, reduced effectiveness due to kernel dependencies, and noise points and outliers. This paper introduces an unsupervised classification method based on a fuzzy unsupervised quadratic surface support vector machine without a kernel to avoid selecting related kernel parameters for credit risk assessment. In addition, we propose an innovative fuzzy membership function for reducing noise points and outliers in line with the direction of sample density variation. Fuzzy Unsupervised QSSVM (FUS-QSSVM) outperforms well-known SVM-based methods based on numerical tests on public benchmark credit data. In some real-world applications, the proposed method has significant potential as well as being effective, efficient, and robust. The algorithm can therefore increase the number of potential customers of financial institutions as well as increase profitability.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fcdc362ce221a87c121d97c6f3917c7",
  "timestamp": "2025-05-15T01:48:30.637098"
}