{
  "id": 4026,
  "title": "Financial Toxicity Following Surgical Treatment for Breast Cancer: A Cross-sectional Pilot Study",
  "abstract": "Background Despite growing national attention, there is limited understanding of the patient- and treatment-level characteristics related to treatment cost-associated distress (financial toxicity) in breast cancer patients. Our aim is to identify risk factors for financial toxicity amongst breast cancer patients undergoing surgical treatment. Methods This is a single-institution cross-sectional survey of adult female breast cancer patients who underwent lumpectomy or mastectomy between January 2018 and June 2019. Financial toxicity was measured via the 11-item comprehensive score for financial toxicity (COST) instrument. Responses were linked with data on patient demographics and clinical history abstracted from the corresponding medical record. Multivariate regression was used to identify patient- and treatment-level factors associated with worsening financial toxicity. Secondary outcome measures included self-reported coping strategies for high treatment costs. Results A total of 571 patients were included; overall, these individuals were mostly white (76.0%), in-state residents (72.3%), and married (73.0%). Following multivariate analysis, lower financial distress was associated with the use of supplemental insurance, increasing annual household income, and a higher credit score (score > 740). Conversely, work reduction or cessation, increased out-of-pocket spending, advanced tumor stage, and being employed at the time of diagnosis were associated with increased financial distress. Patients with higher reported financial distress were more likely to decrease their spending on food, clothing, and leisure activities. Conclusions Financial toxicity was associated with baseline demographic, disease, and treatment characteristics in our cohort of insured patients. These characteristics may be critical opportunities for interventions related to financial navigation along the treatment continuum.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fd39ce50e612af4454d427b71f4e80f",
  "timestamp": "2025-05-15T02:32:27.488331"
}