{
  "id": 4464,
  "title": "Service mix and financial performance in rural hospitals: A contingency theory perspective",
  "abstract": "BackgroundRural hospitals are increasingly at risk of closure. Closure reduces the availability of hospital care in rural areas, resulting in a disparity in health between rural and urban citizens, and it has broader economic impacts on rural communities as rural hospitals are often large employers and are vital to recruiting new businesses to a community. To combat the risk of closure, rural hospitals have sought partnerships to bolster financial performance, which often results in a closure of services valuable to the community, such as obstetrics and certain diagnostic services, which are viewed as unprofitable. This can lead to poor health outcomes as community members are unable to access care in these areas.PurposeIn this article, we explore rural hospital service offerings and financial performance, with an aim to illuminate if specific service offerings are associated with positive financial performance in a rural setting.MethodsOur study used hospital organization data, as well as county-level demographics with periods of analysis from 2015 and 2019. We employed a pooled cross-sectional regression analysis with robust standard errors examining the association between total margin and service lines among rural hospitals in the United States.ResultsThe findings suggest that some services deemed unprofitable in urban and suburban hospital settings-such as obstetrics and drug/alcohol rehabilitation-are associated with higher margins in rural hospitals. Other unprofitable service lines-such as psychiatry and long-term care-are associated with lower margins in rural hospitals.ConclusionOur results suggest the need of rural hospitals to choose services that align with environmental circumstances to maximize financial performance.Practice ImplicationHospital administrators in rural settings need to take a nuanced look at their environmental and organizational specifics when deciding upon the service mix. Generalizations regarding profitability should be avoided to maximize financial performance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fdb80e755313be9f19e2759ce1cc034",
  "timestamp": "2025-05-15T02:37:47.470586"
}