{
  "id": 1562,
  "title": "Risk assessment of equity-based conventional and islamic stock portfolios",
  "abstract": "This study attempts to explore and compare the risk-return relationship and risk premia of the two parallel financial systems in Pakistan, i.e. Islamic (Sharia-compliant) and Conventional (non- Islamic) using two different asset pricing models, namely CAPM and Fama and French (FF) three-factor model. After initial classification, both systems have been split into four subcategories. So conventional stocks portfolios of banks, insurance companies, investment banks, and mutual funds have been compared with Islamic banks, leasing, Modarabah, and Islamic mutual funds stocks in terms of return, risk, and conditional volatility. These results depict significant variations in returns and/or risks (unconditional variance) between these comparable financial systems. The risk premia of conventional stocks are considerably higher than their Islamic compeers. The hypothesis of efficient risk-return relationship is supported for all portfolios, but the relationship is much stronger for the Islamic stocks as compared to the conventional ones. Moreover, the lower reward of Islamic stocks is associated with lesser conditional volatility. The nonsynchronous effect and persistence in the volatility of returns are apparent in all stocks except Modarabah and Islamic mutual funds. Further, the impact of volatility clustering on returns of all stock portfolios is quite larger than external shock. (C) 2022 Published by Elsevier Inc. on behalf of Board of Trustees of the University of Illinois.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fdf3689cee03a7dcb1a4bce92c93fa7",
  "timestamp": "2025-05-15T02:04:20.148341"
}