{
  "id": 7093,
  "title": "Home on the Digital Range: Ranchers' Web Access and Use",
  "abstract": "Access to the Internet continues to grow in rural areas, ensuring ranchers will have increasing opportunities to use the Web to find information about management practices that may provide them ecological and financial benefits. Although past studies have examined the role of the Internet in informing daily decision making by agricultural producers, no studies have focused specifically on the use of the Internet by ranchers in the western United States. This study uses a mixed-methods approach (a survey and semistructured interviews) to assess the extent and patterns of ranchers' Internet use in Colorado and Wyoming, identify barriers to greater use, and establish a typology of Web use behavior by ranchers. Our findings indicate that Internet use is widespread and that age, education, and risk tolerance predict the extent to which a rancher will rely on the Internet for dayto-day ranch management. A duster analysis delineated four distinct types of Web usage among ranchers: unin-fluenced, focused on sales and herd management, moderately influenced, and an Internet-reliant type. Outreach personnel can use this classification to determine the potential utility of digital outreach tools for their programming on the basis of their target audience and outreach topics. (C) 2018 Published by Elsevier Inc. on behalf of The Society for Range Management.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fe20bc915f95352d2a7025a6094b5f3",
  "timestamp": "2025-05-15T03:05:03.514406"
}