{
  "id": 7372,
  "title": "Prevalence of Dry Eye Disease among Japanese Visual Display Terminal Users",
  "abstract": "Objective: To determine the prevalence of dry eye disease (DED) and risk factors among young and middle-aged Japanese office workers using visual display terminals (VDTs). Design: Cross-sectional prevalence survey. Participants: Four thousand three hundred ninety-three Japanese young and middle-aged office workers using VDTs. Intervention: Office workers completed questionnaires sent by e-mail designed to detect dry eye diagnosis and risk factors. Main Outcome Measures: Clinically diagnosed DED was defined as the presence of a previous clinical diagnosis of DED by dry eye specialists or severe symptoms of DED (both dryness and irritation constantly or often). Current symptoms of DIED and possible risk factors such as age, duration of VDT use, type of VDT work, environmental factors, presence of systemic diseases, systemic medicine use, smoking history, and contact lens (CL) use were the main outcome measures. We used logistic regression to examine associations between DED and other demographic factors. Results: Of the 4393 office workers, 3549 (80.1%) completed the questionnaire. Clinically diagnosed DED was present in 266 (10.1%) of 2640 male subjects and in 195 (21.5%) of 909 female subjects. Severe symptoms of DED were observed in 711 male and in 436 female participants. More than 4 hours of VDT use was associated with an increased risk of DED (odds ratio [OR], 1.68; 95% confidence interval [CI], 1.40-2.02). In addition, CL use (OR, 3.91; 95% Cl, 3.37-4.53) increased the risk of severe dry eye symptoms. Conclusions: Dry eye disease leading to a clinical diagnosis or severe symptoms is prevalent among young and middle-aged Japanese office workers. The condition is more prevalent among females, CL wearers, and prolonged VDT users. Relevant measures directed against the modifiable risks could provide a positive impact on public health and quality of life of office workers. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2008;115:1982-1988 (C) 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3fe5b29f11a8c4343143c639f853b85e",
  "timestamp": "2025-05-15T03:08:00.750776"
}