{
  "id": 1517,
  "title": "Intelligent portfolio asset prediction enabled by hybrid Jaya-based spotted hyena optimization algorithm",
  "abstract": "Purpose The purpose of this study is to provide a novel portfolio asset prediction by means of the modified deep learning and hybrid meta-heuristic concept. In the past few years, portfolio optimization has appeared as a demanding and fascinating multi-objective problem, in the area of computational finance. Yet, it is accepting the growing attention of fund management companies, researchers and individual investors. The primary issues in portfolio selection are the choice of a subset of assets and its related optimal weights of every chosen asset. The composition of every asset is chosen in a manner such that the total profit or return of the portfolio is improved thereby reducing the risk at the same time. Design/methodology/approach This paper provides a novel portfolio asset prediction using the modified deep learning concept. For implementing this framework, a set of data involving the portfolio details of different companies for certain duration is selected. The proposed model involves two main phases. One is to predict the future state or profit of every company, and the other is to select the company which is giving maximum profit in the future. In the first phase, a deep learning model called recurrent neural network (RNN) is used for predicting the future condition of the entire companies taken in the data set and thus creates the data library. Once the forecasting of the data is done, the selection of companies for the portfolio is done using a hybrid optimization algorithm by integrating Jaya algorithm (JA) and spotted hyena optimization (SHO) termed as Jaya-based spotted hyena optimization (J-SHO). This optimization model tries to get the optimal solution including which company has to be selected, and optimized RNN helps to predict the future return while using those companies. The main objective model of the J-SHO-based RNN is to maximize the prediction accuracy and J-SHO-based portfolio asset selection is to maximize the profit. Extensive experiments on the benchmark datasets from real-world stock markets with diverse assets in various time periods shows that the developed model outperforms other state-of-the-art strategies proving its efficiency in portfolio optimization. Findings From the analysis, the profit analysis of proposed J-SHO for predicting after 7 days in next month was 46.15% better than particle swarm optimization (PSO), 18.75% better than grey wolf optimization (GWO), 35.71% better than whale optimization algorithm (WOA), 5.56% superior to JA and 35.71% superior to SHO. Therefore, it can be certified that the proposed J-SHO was effective in providing intelligent portfolio asset selection and prediction when compared with the conventional methods. Originality/value This paper presents a technique for providing a novel portfolio asset prediction using J-SHO algorithm. This is the first work uses J-SHO-based optimization for providing a novel portfolio asset prediction using the modified deep learning concept.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "3ffec2dca5f3d8e7202627dd930636a0",
  "timestamp": "2025-05-15T00:56:39.057054"
}