{
  "id": 1313,
  "title": "Risk spillover between cryptocurrencies and traditional currencies: An analysis based on neural network quantile regression",
  "abstract": "The burgeoning prominence of cryptocurrencies within the global financial landscape necessitates a reevaluation of their interplay with conventional currencies. This paper employs neural network quantile regression (NNQR) framework to delineate a risk spillover network encompassing nine cryptocurrencies and eleven traditional currencies. Our findings suggest that cryptocurrencies are less affected by traditional currencies during systemic crises such as COVID-19 pandemic, despite the escalation of system-wide risk. Cryptocurrency exposures also come mainly within their markets during special times, which exhibits a significant degree autonomy. This autonomy positions them as potential short-term hedges against policy-induced risks. Furthermore, our study also finds that cryptocurrencies have less betweenness centrality compared to traditional currencies, but their closeness centrality is not much different from traditional currencies. Our research identifies the Canadian dollar and the Indian rupee being notably vulnerable to risk spillovers emanating from the cryptocurrency sector. However, there are significant differences in the traditional currencies that have a considerable impact on different cryptocurrencies. This study offers novel perspectives for investors considering utilization of cryptocurrencies for out-of-market risk hedging strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "401174dcf4a976abb49c652003f2d2fc",
  "timestamp": "2025-05-15T02:01:44.640202"
}