{
  "id": 7119,
  "title": "The impact of Selic fluctuations on the displacement of investments in ICVM 555 funds in the period from 2016 to 2020",
  "abstract": "One of the great challenges for investors is to identify how, when, and where to invest for a greater return on the money invested and with the lowest possible risk. Following this reasoning, the objective of this paper was to identify the investment funds governed by CVM (Securities and Exchange Commission of Brazil) Instruction No. 555 that were most sensitive to Selic Rate variations in the period from January 2016 to March 2020. The oscillations in the funds are analyzed by the series that capture the displacement of investments: net fundraising, investments, redemptions, and the number of shareholders. The classification established by the Brazilian Association of Financial and Capital Markets Entities was used as a reference, among fixed income, stock, multimarket, and exchange -traded funds. The methodology relied on documental analysis of secondary data, descriptive statistics, Spearman's non -parametric correlation analysis, and Granger's causality test. The results found reveal that total net fundraising in multimarket funds, number of multimarket fund shareholders, number of foreign exchange fund shareholders, total investments in fixed income funds, total investments in multimarket funds, and total redemptions in multimarket funds are the series that are directly preceded by oscillations in the Selic rate, in the period analyzed, indicating that this could help forecast their future movements.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40168ad930baa7e4b300263e6f5985fb",
  "timestamp": "2025-05-15T03:05:32.008420"
}