{
  "id": 6232,
  "title": "Are urban safety-net hospitals losing low-risk Medicaid maternity patients?",
  "abstract": "Objective. To examine data on Medicaid and self-pay/charity maternity cases to address four questions: (1) Did safety-net hospitals' share of Medicaid patients decline while their shares of self-pay/charity-care patients increased from 1991 to 1994? (2) Did Medicaid patients' propensity to use safety-net hospitals decline during 1991-94? (3) Did self-pay/charity patients' propensity to use safety-net hospitals increase during 1991-94? (4) Did the change in Medicaid patients' use of safety-net hospitals differ for low- and high-risk patients? Study Design. We use hospital discharge data to estimate logistic regression models of hospital choice for low-risk and high-risk Medicaid and self-pay/charity maternity patients for 25 metropolitan statistical areas (MSAs) in five states for the years 1991 and 1994. We define low-risk patients as discharges without comorbidities and high-risk patients as discharges with comorbidities that may substantially increase hospital costs, length of stay, or morbidity. The five states are California, Florida, Massachusetts, New Jersey, and New York. The MSAs in the analysis are those with at least one safety-net hospital and a population of 500,000 or more. This study also uses data from the 1990 Census and AHA Annual Survey of Hospitals. The regression analysis estimates the change between 1991 and 1994 in the relative odds of a Medicaid or self-pay/charity patient using a safety-net hospital. We explore whether this change in the relative odds is related to the risk status of the patient. Principal Findings. The findings suggest that competition for Medicaid patients increased from 1991 to 1994. Over time, safety-net hospitals lost low-risk maternity Medicaid patients while services to high-risk maternity Medicaid patients and self-pay/charity maternity patients remained concentrated in safety-net hospitals. Implications for Policy. Safety-net hospitals use Medicaid patient revenues and public subsidies that are based on Medicaid patient volumes to subsidize care for uninsured and underinsured patients. If safety-net hospitals continue to lose their low-risk Medicaid patients, their ability to finance care for the medically indigent will be impaired. Increased hospital competition may improve access to hospital care for low-risk Medicaid patients, but policymakers should be cognizant of the potential reduction in access to hospital care for uninsured and underinsured patients. Public policymakers should ensure that safety-net hospitals have sufficient financial resources to care for these patients by subsidizing their care directly.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "401e0add60d51fd9156e50d9100b8bc9",
  "timestamp": "2025-05-15T02:56:10.901998"
}