{
  "id": 4108,
  "title": "Exploring energy efficiency prediction method for Industry 4.0: a reconfigurable vibrating screen case study",
  "abstract": "The shift towards energy efficiency (EE) programme in accelerating a resource efficient society requires the development of a portfolio for assessing and demonstrating a solution to support decision-making, planning and policy. EE market entails building capacity for industry initiatives in energy savings towards a culture of greater resource efficiency. Many energy predictions have been research by analysing of a large amount of historical and sensing data with high accuracy of the prediction results. However, most of these researches does not apply in practice to energy efficiency and IoT energy management systems, which involves real-time data performance. The proposed methodology is conceptualise on cyber physical systems and application of directed communication approach through a direct and indirect information exchange between agents. This paper explores prediction of energy demands based on measurement data and a statistical regression model using a variable frequency drive (VFD) to control reconfigurable vibrating screen (RVS) machine fixed-speed electric agitating motor. The model acceptance criteria provide a prediction method of energy costs against usage in mining of materials through load testing with measured data every 2 minutes for 24 hours. The logged data prediction accuracy reached 98.47% according to material screening rate, showing close alignment to the measured model and 96.97% coefficient of determination, showing the percentage of variation of independent variables (energy cost with VFD) that affect the dependent variable EED. The study will assist in reducing the energy consumption in conformance to South Africa Department of Energy (DoE) vision to support sustainability in manufacturing. (C) 2020 The Authors. Published by Elsevier Ltd.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "402b85ea148974196f0f9d98543d3abc",
  "timestamp": "2025-05-15T01:23:58.048037"
}