{
  "id": 6106,
  "title": "Incidence of household catastrophic and impoverishing health expenditures among patients with Breast Cancer in Iran",
  "abstract": "Background Breast cancer disease is the most common cancer among Iranian women and imposing a significant financial burden on the households. This study calculated out-of-pocket (OOP), catastrophic health expenditure (CHE), and impoverishing health spending attributed to breast cancer in Iran. Methods In this cross-sectional household study, clinical and financial information on breast cancer and also household information (expenditures and income) were obtained through face-to-face interviews and completing a questionnaire by 138 women with this disease in 2019. We applied three non-food expenditure thresholds of 40, 20, and 10% to defining the CHE. Disease costs included periodical visits, diagnostic services, hospitalization care, treatment and rehabilitation services, home, and informal care. Households were disaggregated into socioeconomic status quintiles based on their Adult Equivalent values standardized monthly consumption expenditures. To identify the factors affecting these indicators, we performed the two different multivariate logistic regression models. Results This study finds that each patient had a monthly average OOP payment of $US 97.87 for the requested services, leading to impoverished of 5.07% and exposed 13.77% of their households to CHE. These indicators have been mainly concentrated among the poor, as they have spent a large part of their meager income on buying the needed services, and for this purpose, most of them forced to sell their assets, borrow, or take a bank loan. Conclusions The patients in lower SES quintiles can be protected from impoverishing and catastrophic health spending by expanding insurance coverage, providing financial risk protection programs, and increasing access to quality and effective public sector services. Alongside, expanding inpatient coverage and adding drug benefits for the poor can significantly decrease their OOP payments.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40323ce93eff681d1c93ab44a1a7da1d",
  "timestamp": "2025-05-15T02:54:39.141933"
}