{
  "id": 3823,
  "title": "Patent portfolio analysis of the cloud computing industry",
  "abstract": "In recent years, cloud computing has become a popular theme in the area of network technology; however, related literature on patent analysis is limited. This study seeks to reveal the technological trends and competition status of cloud computing industry by proposing a hybrid patent portfolio analysis scheme. First, the technique for order preference by similarity to ideal solution (TOPSIS) is adopted to integrate the relevant indicators of patent quality into new indices of patent quality, which are normally evaluated by the cited ratio only. Next, multivariate analysis techniques are employed to provide supplementary information to the R&D decision maker. By conducting factor analysis (FA) on patent class codes under the international patent classification (IPC), this study reveals that there are three mainstream technologies of cloud computing: including virtualization and information retrieval, network system, and commercial data process. This study not only uses multidimensional scaling analysis (MDS) to illustrate the proximity of technologies and firms on a perceptual map, but also applies the grey relational analysis (GRA) method to provide quantitative data for interpreting the perceptual relations. Based on the analysis results, the technological strength and the R&D strategies of several big companies are investigated. The findings of this study can provide valuable references for enterprises that wish to develop technologies and deploy their patent portfolios of cloud computing. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4032fc34d30b9d2bfde0b9d4c57a422f",
  "timestamp": "2025-05-15T01:21:08.249976"
}