{
  "id": 8336,
  "title": "Survey of laparoscopic entry injuries provoking litigation",
  "abstract": "Study Objective. To examine injuries sustained during laparoscopic entry procedures that provoked malpractice claims in order to discern relative vulnerability of specific organs and differences in injury patterns, mortality, and financial awards, and specific entry devices involved in domestic claims versus those in other countries. Design. Survey (Canadian Task Force classification II-2). Setting. Insurance company records. Intervention. Abstracts of malpractice allegations in 135 domestic cases insured by United States member companies of the Physician Insurers Association of America and I I I cases by its non-United States affiliates were examined. Measurements and Main Results. Most cases in the United States involved biliary-gastrointestinal surgery rather than gynecologic procedures; this was reversed for the non-United States database. Major vessel injury was proportionally more common in the domestic group. Small bowel led the group of structures injured. Most injuries involved trocars of various types (185), including blunt types (16); and needle injuries were noted in 39 cases. Injuries were recognized more immediately in the United States, and mortality was related to delay in diagnosis of bowel penetration. Indemnity payments were greater for serious nonfatal injuries versus deaths in the United States, but the opposite was true in other countries. Conclusion. Probably no needle-trocar system can guarantee avoidance of injury during laparoscopic entry, especially when the trajectory of insertion puts great vessels at risk. Bowel injuries occur during open as well as closed techniques of insertion, and with optical trocar systems as well. Vascular injury is usually obvious, but delayed recognition of loss of bowel integrity is related to increased mortality, especially in patients over 60 years of age.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40376e8f5d91d77ddb0e606787940733",
  "timestamp": "2025-05-15T03:17:49.135623"
}