{
  "id": 9282,
  "title": "What factors influence the treatment decisions of women with breast cancer? Does residential location play a role?",
  "abstract": "Introduction: Inequalities in cancer outcomes continue to exist throughout the world. In Australia, rural women diagnosed with breast cancer have significantly poorer 5-year survival, with variations in clinical management additionally observed. While factors impacting clinical management have been identified, there is little understanding about the factors that influence treatment decisions of women diagnosed with breast cancer. Methods: A mixed-methods study was conducted with women diagnosed with either pre-invasive or invasive breast cancer in Australia. The study included qualitative interviews and an online survey utilising Breast Cancer Network Australia's membership. Semi-structured interviews were conducted with rural women focusing on topics such as decision-making and factors influencing this. The online survey amongst metropolitan and rural (including regional, remote, very remote) women examined involvement in, and preference for, decision-making, and to what degree certain factors influenced treatment decisions. Sociodemographics included age, residential location, education and household income. Qualitative interviews were analysed using NVivo, and descriptive analyses were used to examine differences in frequency distributions across survey questions by residential location and age group for the online survey. Multivariable logistic regression analysis was conducted to examine factors associated with treatment decision-making. Results: Nine women participated in the qualitative interviews and 815 (365 metropolitan and 450 rural) completed the online survey. Interviews found most women concurred with the recommendations of their doctor(s) and did not see this experience as 'making a decision'. In the online survey, 83.2% of women indicated at least some involvement in the decision-making with this being similar between rural and metropolitan women. Compared to women educated at an under- or postgraduate level, those educated at high school or less were about 50% less likely to be involved in treatment decision(s) (OR=0.51, 95% confidence interval=0.30-0.86). In both interviews and the online survey, factors having the strongest influence on treatment decisions centred around survival and reducing risk of progression or recurrence. Significantly more rural compared metropolitan women indicated their decision was strongly influenced by treatment service location (42.8% and 28.1%, respectively, p<0.001). Rural women more frequently cited financial costs of treatment influenced their decision compared to metropolitan women (30.4% and 21.3%, respectively, p=0.04). Significantly fewer rural, (162%) compared to metropolitan (23.6%) women, had breast reconstruction (p =0.009). The option of having reconstructive surgery was less frequently cited as influencing treatment decisions for rural compared to metropolitan women (27.7% v 44.1% respectively, p <0.001). Conclusions: The treatment decisions of the majority of women were strongly influenced by the need to do everything possible to get better, however, rural women additionally indicated their decisions were also influenced by factors such as access to treatment services and the financial costs of treatment. Addressing travel and costs issues for rural women with breast cancer should be prioritised. Additionally, the finding that women with lower levels of education were significantly less likely to be involved in the decision-making process highlights the need to develop new or tailor existing resources. Further work could also examine the reasons why rural women are less likely to consider breast reconstruction important in decision-making.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "404731853d078e98eaf0188724d7f441",
  "timestamp": "2025-05-15T03:27:24.970008"
}