{
  "id": 4066,
  "title": "Dialysis membranes today",
  "abstract": "In recent years, hemodialytic therapies have evolved from the simple, diffusion-dependent removal of small molecular weight substances from blood to advanced therapy modalities involving the convective removal of larger uremic sloutes. The clinical benefits of removal of substances such as beta2-microglobulin (beta2-m) have been reported by several authors: elimination of large-molecular weight uremic toxins is now widely accepted as being beneficial to the overall quality of life of patients. This trend would not have been possible without parallel technical developments, especially that of new membranes having more open pore structures resulting in higher sieving coefficients and increased hydraulic permeability. Not all polymer types are suitable for the manufacture of high-flux membranes required for convective therapies in which large fluid volumes are exchanged. Amongst the more important criteria are: the selected polymer must be able to undergo steam sterilisation, have high endotoxin retention capabilities, be versatile for the fabrication of a range of hydraulic permeabilities and, of course, have high blood compatibility. The aim of this paper is, firstly, to review the major membrane development phases over the last quarter of a century. Secondly, the suitability of current membrane materials to meet the aforementioned requirements will be examined. Thirdly, in view of the recent, rapid proliferation of polysulfone-based membranes, dialysis membranes of the polysulfone 'family' are placed under scrutiny; membranes of this class represent a significant portion of the product portfolio of dialyser manufacturers today, yet, few end-users are able to distinguish between the salient features of the respective products because of a combination of confusing membrane nomenclature, classification, tradenames and product claims.",
  "year": 2002,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "404bf406001d807ca9dc68edf4960b9e",
  "timestamp": "2025-05-15T01:23:27.345817"
}