{
  "id": 8608,
  "title": "Does Urban Road Pricing Cause Hardship to Low-income Car Drivers? An Affordability-Based Approach",
  "abstract": "A major criticism of the principle of urban road pricing (also known as congestion charging and congestion pricing) is that it is regressive, namely, that the implementation of a charging scheme is likely to result in the imposition of a disproportionately large financial burden on low-income car users and their dependents, thereby resulting in hardship. A road pricing proposal in Edinburgh, Scotland, was used as a case study to assess the potential for road pricing-related hardship. Hardship occurs when people are denied access to basic needs. A quantitative definition of hardship was developed on the basis of an affordability measure derived front the utilities sector, supplemented by two additional conditions to account for the fact that transportation in itself is not a basic need. By, using this definition, it was demonstrated that households in the lowest income quintile already spent an unaffordable proportion of their income on motoring costs, as much as about 40%, whereas the affordability threshold was 32.5%. The impact of a 2 pound (approximately $4, in 2008) charge on these low-income households would be negligible if it were paid less than once a week but would have a significant impact if it were paid four or more times a week, taking average aggregate motoring costs to above 50% of a low-income household's total disposable income. A simple regression analysis showed that of the five different basic needs identified in the research literature, work trips were the most likely to be linked to frequent congestion charge payment among low-income car users and, thus, the most likely to be linked to an additional risk of hardship.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4053dc77beaa4b6bc2a71472bdacedee",
  "timestamp": "2025-05-15T03:20:22.405351"
}