{
  "id": 9249,
  "title": "Correlates associated with health insurance on cervical cancer screening in Tanzania: a comparison between the insured and uninsured women using demographic and health survey 2022",
  "abstract": "BackgroundCervical cancer is the most common cancer in women worldwide. This cancer affects more women in low- and middle-income countries (LMICs) including Tanzania. Economic losses related to cervical cancer can lead to a serious threat to collective financial well-being and increased risk for the households to catastrophic health expenditure. In most LMICs, out-of-pocket (OOP) payments are often necessary for utilizing medical care and co-payments of health insurance to access some of the health services. This study aimed to assess the influence of health insurance among women on access to cervical cancer screening by comparing insured and non-insured women in Tanzania.MethodsThis study used secondary data collected through cross-sectional design during the Tanzania Demographic and Health Survey 2022. The study analyzed the information from a total sample of 15,254 women. In the analysis, all data were weighted using individual women sample weight to account for complex sampling design and non-response rate. The analysis of this study used univariate, bivariate and multivariable logistic regression analysis models.ResultsOur analysis revealed that only 7.01% of women were screened for cervical cancer. Health insurance coverage was statistically significant with the cervical cancer screening. This means that the insured women had higher odds than those uninsured women for both the crude model (COR 3.12; CI 2.46, 3.96) and adjusted models (AOR 1.75; CI 1.35, 2.27). Age, education level, currently engaging in income-generating jobs and those who visited the health facility at least once in 12 months influenced the cervical cancer screening for both crude and adjusted models.ConclusionThis study emphasizes the significance of various factors in cervical cancer screening in Tanzania. These factors include being covered by health insurance, socio-economic status and education. Health insurance coverage seems to be a predictor of accessing health services including screening for cervical cancer. Therefore, the government should take these factors, especially health insurance into account when formulating policies and making decisions to enhance access to cervical cancer screening for women in Tanzania including fasterning an ongoing process of establishing a prepayment scheme of mandatory health insurance for all citizens.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4056fb500455498857acf59e3fda52e6",
  "timestamp": "2025-05-15T03:26:54.599080"
}