{
  "id": 8387,
  "title": "Momentum return volatility, uncertainty, and energy prices: evidence from major international equity markets",
  "abstract": "Purpose This paper examines the impact of macroeconomic and risk factors on the profitability and volatility of professional momentum portfolios for the US, the UK, Japan and Germany, for the period 1998-2018. Many of the factors employed, such as energy price changes and economic policy uncertainty, have been largely neglected in the relevant literature. Design/methodology/approach Regression analysis, VECTOR AUTOREGRESSION (VAR), Panel-VAR, Variance Decomposition Analysis Findings The results indicate that, since the financial crises in the US and the EU, energy prices and economic-policy uncertainty have become important return determinants, along with market-related uncertainty that seems to have a stable impact over time, especially for the U.S. and U.K. portfolios. Research limitations/implications - Economic policy uncertainty significantly affects contemporaneous momentum returns in the US, UK and Japan, mainly between 2007 and 2018, while market-related uncertainty affects all markets during all subperiods. In addition, the variance of market-related uncertainty (VIX) explains a large percentage of the variance in the momentum returns for the US, UK and Germany. Practical implications - The main implication of the findings for portfolio managers is that a manager may increase (decrease) exposure to the momentum factor during optimistic (pessimistic) periods and during periods of rising energy prices (high economic policy and market-related uncertainty). Originality/value The paper examines the impact of factors, such as energy prices and economic policy uncertainty, which have been largely neglected in the relevant literature on the possible drivers of the momentum strategies. It employs professional portfolios that are often used in practice as benchmark indexes.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40652b7a1b1d4f017dcca55db61ba7fe",
  "timestamp": "2025-05-15T03:18:19.573187"
}