{
  "id": 643,
  "title": "Quantitative study of storm surge risk assessment in an undeveloped coastal area of China based on deep learning and geographic information system techniques: a case study of Double Moon Bay",
  "abstract": "Storm surges are a common natural hazard in China's southern coastal area which usually cause a great loss of human life and financial damages. With the economic development and population concentration of coastal cities, storm surges may result in more impacts and damage in the future. Therefore, it is of vital importance to conduct risk assessment to identify high-risk areas and evaluate economic losses. However, quantitative study of storm surge risk assessment in undeveloped areas of China is difficult, since there is a lack of building character and damage assessment data. Aiming at the problem of data missing in undeveloped areas of China, this paper proposes a methodology for conducting storm surge risk assessment quantitatively based on deep learning and geographic information system (GIS) techniques. Five defined storm surge inundation scenarios with different typhoon return periods are simulated by the coupled FVCOM-SWAN (Finite Volume Coastal Ocean Model-Simulating WAves Nearshore) model, the reliability of which is validated using official measurements. Building footprints of the study area are extracted through the TransUNet deep learning model and remote sensing images, while building heights are obtained through unoccupied aerial vehicle (UAV) measurements. Subsequently, economic losses are quantitatively calculated by combining the adjusted depth-damage functions and overlaying an analysis of the buildings exposed to storm surge inundation. Zoning maps of the study area are provided to illustrate the risk levels according to economic losses. The quantitative risk assessment and zoning maps can help the government to provide storm surge disaster prevention measures and to optimize land use planning and thus to reduce potential economic losses in the coastal area.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "406633c2aa88b7e5605ebf137556aee8",
  "timestamp": "2025-05-15T01:40:51.151316"
}