{
  "id": 1181,
  "title": "Life-Course Multidisciplinary Psychosocial Predictors of Dementia Among Older Adults: Results From the Health and Retirement Study",
  "abstract": "Background and Objectives: Identifying predictors of dementia may help improve risk assessments, increase awareness for risk reduction, and identify potential targets for interventions. We use a life-course psychosocial multidisciplinary modeling framework to examine leading predictors of dementia incidence. Research Design and Methods: We use data from the Health and Retirement Study to measure 57 psychosocial factors across 7 different domains: (i) demographics, (ii) childhood experiences, (iii) socioeconomic conditions, (iv) health behaviors, (v) social connections, (vi) psychological characteristics, and (vii) adverse adulthood experiences. Our outcome is dementia incidence (over 8 years) operationalized using Langa-Weir classification for adults aged 65+ years who meet criteria for normal cognition at the baseline when all psychosocial factors are measured (N = 1 784 in training set and N = 1 611 in testing set). We compare the standard statistical method (Logistic regression) with machine learning (ML) method (Random Forest) in identifying predictors across the disciplines of interest. Results: Standard and ML methods identified predictors that spanned multiple disciplines. The standard statistical methods identified lower education and childhood financial duress as among the leading predictors of dementia incidence. The ML method differed in their identification of predictors. Discussion and Implications: The findings emphasize the importance of upstream risk and protective factors and the long-reaching impact of childhood experiences on cognitive health. The ML approach highlights the importance of life-course multidisciplinary frameworks for improving evidence-based interventions for dementia. Further investigations are needed to identify how complex interactions of life-course factors can be addressed through interventions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40690a982717551e94b0b4ce26740b17",
  "timestamp": "2025-05-15T01:59:56.272136"
}