{
  "id": 9006,
  "title": "Systemic Oxidative Stress Level as a Pathological and Prognostic Factor in Myopic Choroidal Neovascularization",
  "abstract": "Purpose: To investigate the association of systemic oxidative stress level with myopic choroidal neovascularization (mCNV) and its clinical outcomes. Design: Retrospective case-control study. Participants: This retrospective study included 52 eyes of 52 healthy participants (mean age: 62.5 years), 30 eyes of 30 patients (mean age: 59.6 years) with high myopia (HM) but without mCNV, and 23 eyes of 23 patients (mean age: 61.8 years) with HM and mCNV who received intravitreal anti-VEGF antibody injections (IVIs) using a pro re nata regimen during the 6-month follow-up after the first IVI. Methods: Clinical findings, including oxidative stress parameters, such as diacron reactive oxygen metabolites (dROMs), biological antioxidant potential (BAP), and the BAP/dROM ratio (B/d ratio), were analyzed. Main Outcome Measures: Clinical features and oxidative stress parameters. Results: Both BAP and the B/d ratio were significantly lower in the HM/mCNV group than in the HM/no mCNV group (P = 0.002 and P = 0.012, respectively) and than in the control group (P = 0.001 and P = 0.026, respectively). In a multiple logistic regression analysis, axial length (odds ratio 1.878, P = 0.042) and the B/d ratio (odds ratio 0.470, P = 0.026) were significantly associated with mCNV. Dividing the patients into high and low B/d ratio groups (with a cutoff of 5.2) showed that subfoveal choroidal thickness (SFCT) was lower (P = 0.002) and the number of IVI treatments was higher (P = 0.029) in the low B/d ratio group than in the high B/d ratio group. In multiple regression analyses, only the B/d ratio was significantly associated with SFCT (b b = 0.684, P = 0.006). Conclusions: The oxidative stress level in eyes with HM differed according to mCNV, SFCT, and the number of IVI treatments. Measuring oxidative stress parameters might be useful in eyes with HM both for assessing the risk of developing mCNV and determining disease activity. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2024;4:100550 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4072ebd2c12c622d805d5287d0611fff",
  "timestamp": "2025-05-15T03:24:26.417580"
}