{
  "id": 8067,
  "title": "Predictors of seeking financial compensation following motor vehicle trauma: inception cohort with moderate to severe musculoskeletal injuries",
  "abstract": "Background: Compensation related factors have been repeatedly associated with poor recovery following orthopaedic trauma. There is limited research into the factors associated with seeking financial compensation. Further understanding of these factors could facilitate injury recovery by purposeful compensation scheme design. The aim of this study was to investigate the predictors of seeking financial compensation, namely making a claim and seeking legal representation, following motor vehicle related orthopaedic trauma. The study was conducted in New South Wales (NSW), Australia, in motor vehicle crash and workers' compensation schemes. Methods: Participants were patients admitted with upper or lower extremity factures following a motor vehicle crash to two trauma hospitals. Data were collected at baseline within two weeks of injury. Participants were followed up at six months. Analysis involved: descriptive statistics for baseline characteristics; comparison of compensable and non-compensable participants with Analysis of Variance (ANOVA) and chi-squared tests; and logistic regression for predictor models. Results: The cohort consisted of 452 participants with a mean age 40 years; 75% male; 74% working pre-injury; 30% in excellent pre-injury health; 56% sustained serious injuries with an Injury Severity Score (ISS) 9-15; 61% had a low-middle range household income; and 35% self-reported at fault in the crash. There was no significant difference in pre-injury/ baseline health between compensable and non-compensable participants. Follow up data was available for 301 (67%) participants. The significant predictor of claiming compensation in the adjusted analysis was higher body mass index (BMI) (overweight Odds Ratio [OR] 3.05, 95% Confidence Interval [CI] 1.63-5.68; obese OR 1.63, 95% CI 0.83-3.20). Participants less likely to claim were: involved in a motorcycle crash (OR 0.47, 95% CI 0.28-0.82); socioeconomically less disadvantaged (OR 0.37, 95% CI 0.17-0.82) or least disadvantaged (OR 0.39, 95% CI 0.17-0.90); at risk for short term harm (injury) due to alcohol consumption (OR 0.56, 95% CI 0.32-0.97); and with fair-poor pre-injury health (OR 0.30, 95% CI 0.09-0.94). The predictors for seeking legal representation were speaking a language other than English at home (OR 2.80, 95% CI 1.2-6.52) and lower household income (OR 3.63, 95% CI 1.22-10.72). Participants less likely to seek legal representation were least socioeconomically disadvantaged (OR 0.15, 95% CI 0.04-0.50). Conclusions: Seeking financial compensation was associated with a higher pre-injury BMI rather than injury-related factors. Seeking legal representation was solely related to socio-economic factors.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40844a62c2a3f2c250bbef93b2edc386",
  "timestamp": "2025-05-15T03:15:09.310581"
}