{
  "id": 8515,
  "title": "Insomnia during the COVID-19 pandemic: prevalence and correlates in a multi-ethnic population Singapore",
  "abstract": "Background Globally, the Coronavirus disease 2019 (COVID-19) pandemic had a significant impact on mental health. Sudden lifestyle changes, threatening information received through various sources, fear of infection and other stressors led to sleep disturbances such as insomnia. The current study aimed to assess the prevalence of insomnia and its associated risk factors during the first wave of COVID-19 pandemic among Singapore residents. Methods A cross-sectional study conducted online and in person, from May 2020 to June 2021, recruited Singapore citizens and permanent residents, aged 21 years and above, fluent in English, Chinese or Malay language. Respondents answered an interviewer-administered questionnaire, including Insomnia Severity Index (ISI), Generalised Anxiety Disorder-7 (GAD-7), Physical Health Questionnaire (PHQ-9), stress scale of the Depression, Anxiety and Stress Scales (DASS), chronic conditions checklist and COVID-19 related stressors (exposure to COVID-19, current and future perceived risk of infection). Chi-squared test followed by stepwise logistic regression analysis were conducted to determine factors associated with insomnia. Results The study recruited 1129 respondents. Prevalence of insomnia was noted to be 7.4% in the sample. Insomnia was significantly associated with psychological distress- depression (p < 0.001) and anxiety (p < 0.001), financial loss as a source of stress (p < 0.012), ever been diagnosed with asthma (p < 0.001) and backache (p < 0.002). Conclusion Insomnia was prevalent and associated with higher level of psychological distress among Singapore residents. These findings can be utilised to design effective targeted interventions like cognitive behavioural therapy, therapist assisted relaxation and meditation programs to improve sleep and reduce psychological distress. Interventions like these can be delivered via smartphone applications enabling easy access, delivery, and utilization by the vulnerable groups. Overall, these strategies would not only help people maintain better mental health and sleep quality during a pandemic but also build resilience, enhancing society's ability to cope with future crises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4084eb12c2ca17bb8173c4e212767dca",
  "timestamp": "2025-05-15T03:19:51.972781"
}