{
  "id": 9434,
  "title": "Trends in Allogeneic Hematopoietic Cell Transplantation Utilization and Estimated Unmet Need Among Medicare Beneficiaries with Acute Myelogenous Leukemia",
  "abstract": "Allogeneic hematopoietic cell transplantation (alloHCT) is a resource-intensive procedure and the sole potentially curative treatment available for patients with acute myelogenous leukemia (AML). Although Medicare coverage may help address a major financial barrier to accessing alloHCT, there remains an unmet need for alloHCT owing to sociodemographic disparities. This study examined trends and factors associated with the utilization of alloHCT and the estimated unmet need for alloHCT among Medicare beneficiaries with AML. This retrospective cohort study included patients (age 65 to 74 years) with a diagnosis of AML identified in Medicare claims data from 2010 through 2016. To study trends in utilization, transplantation rates were calculated as the number of patients who underwent alloHCT within 180 days and 1 year of diagnosis (numerator) divided by the total number of patients with AML within each diagnosis year (denominator). A multivariable logistic regression was used to identify fac-tors associated with the likelihood of undergoing alloHCT within 1 year of diagnosis. Two approaches were applied to estimate the unmet need for alloHCT. The first approach used claims data to identify the potential need for alloHCT among patients who achieved complete remission for at least 90 days. The second approach used established National Marrow Donor Program (NMDP) methodology, which considers estimates of risk level, response to treatment, comorbidity, and early mortality, to identify the potential and unmet need for alloHCT. The overall estimated need and unmet need from 2010 to 2015 and over different time periods were evaluated for both approaches. The alloHCT rate within 180 days of diagnosis increased from 8% in 2010 to 15.8% in 2016 (P < .001), and the 1-year alloHCT rate also increased over time, from 11.9% in 2010 to 20.0% in 2015 (P < .001). The likelihood of undergoing alloHCT within 1 year of diagnosis was associated with diagnosis year, age, race, geo-graphic region, Elixhauser Comorbidity Index, and population-level median household income. Between 2010 and 2015, the claims data approach estimated a lower potential need for alloHCT compared with the NMDP meth-odology estimate (27% versus 36%); both approaches estimated that 43% to 44% of patients with a potential need for alloHCT had an unmet treatment need. Despite the differences in estimated potential need between the 2 approaches, both showed a sustained unmet need but with a downward trend over time. Our data show that utilization of alloHCT has increased over time among Medicare beneficiaries with AML. Two approaches of need analysis were con-ducted for validation of estimated need and unmet need for alloHCT using claim-identified remission status, given the lack of cytogenetics and molecular information in claims data. Both approaches to estimating the unmet need for alloHCT found a downward trend over time; however, there are differences in utilization of alloHCT by age, race, geographic region, comorbidity, and socioeconomic status, indicating disparities in access to alloHCT among Medicare beneficiaries with AML. This suggests the need for policy efforts, research, and continued education to improve access to alloHCT and to close the gap between the actual utilization of alloHCT and the unmet need.(c) 2022 Published by Elsevier Inc. on behalf of The American Society for Transplantation and Cellular Therapy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "408be4cd8d8b5ac3211a0ed0dd770a99",
  "timestamp": "2025-05-15T03:28:46.297476"
}