{
  "id": 7339,
  "title": "Incidence and risk factors for medical adhesive-related skin injury in catheters of critically ill patients: A prospective cohort study",
  "abstract": "Background: The skin in contact with the adhesives used to secure catheters is vulnerable to medical adhesive-related skin injury (MARSI). The incidence of these injuries and the risks associated with their development have not been accurately estimated previously in critically ill patients.Aim: The aim of this study was to investigate the incidence and risk factors for MARSI in catheters of critically ill patients.Methods: A prospective cohort study was conducted in adult intensive care units of two Brazilian university hospitals. A total of 150 patients (439 catheters) were included. The skin exposed to the catheter fixation adhesives (central venous, nasogastric, nasoenteral, and indwelling urinary) was examined daily by four trained researchers. The patients' sociodemographic and clinical data were collected from their electronic medical records. The association between independent variables and MARSI was investigated by bivariate statistics, followed by a multiple logistic regression.Results: The MARSI incidence was 42% (86.5 MARSIs per 1000 patient-days). Advanced age, prolonged hospital stay, dry skin, repetitive adhesive removal, low Braden Scale score, and hypoalbuminemia were associated with MARSI (p < .05). According to the multivariate logistic regression, dry skin increased the chance of MARSI by 5.2 times (odds ratio: 5.2; 95% confidence interval: 2.4-11.1), while the Braden Scale score was a protective factor, showing 30% less chance of MARSI for each added score (odds ratio: 0.7; 95% confidence interval: 0.6-0.9). A higher incidence of MARSI was observed in nasoenteral catheters and in those fixed with adhesive using natural rubber. The MARSI types were predominantly mechanical (70.3%): skin stripping (41.3%), skin tear (26.1%), and tension injury or blister (2.9%).Conclusions: MARSI is a common event in adult intensive care units, and most risk factors are modifiable. Preventive actions are potentially capable of reducing incidence, optimising financial resources, and improving clinical results.(c) 2023 Australian College of Critical Care Nurses Ltd. Published by Elsevier Ltd. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4090de8f47e9fdc52261e202592667cf",
  "timestamp": "2025-05-15T03:07:31.894650"
}