{
  "id": 8468,
  "title": "Need Satisfaction and Depressive Symptoms Among University Students in Hong Kong During the COVID-19 Pandemic: Moderating Effects of Positive Youth Development Attributes",
  "abstract": "As studies on the mental health status of university students during the COVID-19 pandemic are almost non-existent in Hong Kong, we examined four research questions in this paper: What is the prevalence of depressive symptoms in university students in Hong Kong? What are the socio-demographic correlates of depressive symptoms? Do need satisfaction and positive youth development (PYD) attributes, including beliefs about adversity, psychosocial competence (resilience and emotional competence) and family functioning predict depression? Do PYD attributes moderate the predictive effect of need satisfaction on depression? We examined the above research questions using the Centre for Epidemiologic Studies Depression Scale Revised (CESD-R) in 1,648 university students in Hong Kong. For PYD attributes, we utilized validated measures of Chinese beliefs about adversity, psychosocial competence (resilience and emotional competence), and family functioning. For need satisfaction, we used a measure derived from two focus group interviews involving university students. Results showed that 48.4% of the respondents (95% confidence interval = [45.9%, 51.1%]) scored 16 or above (i.e., at-risk for clinical depression). As predicted, age, gender, student status (local vs. international), and family financial hardship were significant socio-demographic correlates of depressive symptoms. Besides, need satisfaction and PYD attributes negatively predicted depression scores. Finally, multiple regression analyses controlling for gender, age, and student status as covariates showed that all PYD attributes moderated the impact of need satisfaction on depression. The findings reinforce the theoretical proposition that PYD attributes serve as important factors in protecting the mental health of university students during the pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40a356fcaf9765ea7a5cb80ba4533a69",
  "timestamp": "2025-05-15T03:19:21.261680"
}