{
  "id": 2544,
  "title": "Sports event portfolios: an innovative tool and a new management paradigm",
  "abstract": "Purpose The organization of several small-scale events throughout the year is called event portfolio and may contribute to the development of the city strategy in the touristic, social and economic fields. The organization of a set of sporting events represents an important innovation in the development of city marketing. This paper analyzing the scarce literature on event portfolio provides the main elements to benefit from this innovative strategy to achieve sustainable sports tourism for host cities. Among the innovative strategies, the inclusion of leverage and cross-leverage approaches in the management of event portfolios is studied in depth. Design/methodology/approach The study is divided into two phases. First, the Web of Science (WOS) and SCOPUS databases are searched using keywords. Once the selection of scientific studies that analyze the phenomenon of event portfolios has been obtained, an exhaustive review is carried out, allowing us to obtain novel findings on the field of study. Findings The work provides a classification of the portfolios of sports events analyzed in science considering the configuration (formal vs informal) and whether there is an integrated strategy. Second, the delimitation of the deficiencies and the most important aspects to be developed in sports-events portfolio management. Originality/value This study contributes with a summary of the main elements to consider when managing sports events portfolios. Moreover, the importance of integrated strategies is underlined, as well as the relevance of leveraging the strategies. The contributions are of interest in being a novel field with room for scientific development and with an eminently practical nature.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40ae4d41b5cda48b1aa94fca259fa2da",
  "timestamp": "2025-05-15T01:08:10.702033"
}