{
  "id": 2611,
  "title": "What can increase the default risk in local governments?",
  "abstract": "Concern has been expressed by international organisations and in previous studies about the financial situation of local governments, and the question of debt has been identified as a crucial element in efforts to overcome the current financial crisis. However, the variables that can affect the financial soundness of these governments have not been sufficiently studied, despite their direct relation to the credit risk premium. In this article, we aim to identify risk factors for default by local governments, and provide useful information to municipal financial managers. We conducted an empirical study of 148 Spanish municipalities and analysed data from four years, applying a random effects logistic regression model. Our findings reveal that a lower population density, less dependent population, falling levels of per capita income and the presence of progressive local government are all risk factors for default by local governments. Furthermore, our findings indicate that the general financing structure variable and debt composition and maturity variable do influence the risk of default by local governments. Points for practitioners The findings of this article can provide useful information for managers and politicians responsible for the financial management of local governments, in particular, by enabling them to better understand the risk premiums assigned by banks. Specifically, by identifying the risk factors for default, this article highlights the warning signs of this risk, so that suitable arguments may be expressed in negotiating loan repayment schedules and interest rates, and in designing financial viability and restructuring plans.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40b3e6fb19a48ec2b947528ed6fdfb0b",
  "timestamp": "2025-05-15T02:17:01.811777"
}