{
  "id": 2009,
  "title": "TRANSFORMING INDUSTRY BEST PRACTICES INTO ACTIVE LEARNING AND INTRINSIC MOTIVATION",
  "abstract": "Course designs based on principles of active learning and intrinsic motivation have been increasing, due to correlation between the application of such principles and measurable improvements of student performance, as reported in several cases. However, it is often challenging to adequately apply them in the classroom, because they do not represent a one-size-fits-all toolbox, but rather a flexible framework that needs to be adapted to each learning goal. On the other hand, industry representatives have created practices with similar principles and a proven track record of success in both professional training and production itself. Particularly in the Software Development field, there is a large portfolio of practices with aspects that can be mapped to active learning and intrinsic motivation and effectiveness that can be confirmed by academic research and widespread adoption. In this paper, we describe the design and implementation of the Agile Collaborative Development course, offered to third semester students of a Computer Engineering curriculum. The learning goals of this course are: following principles of agile product development, using concepts of object-oriented programming, applying search algorithms over binary trees, explaining basic concepts of software engineering, and following practices of agile software development. These goals are significantly aligned with the Software Development field, and therefore allow the adaptation of industry practices. Notable examples are Pair Programming, Coding Dojos, Lean Lego Game, and Scrum. In addition to adapting the practices, we used Project-Based Learning (PBL) in the final assignment: developing a full-fledged Android application for a real industry representative. We describe in the paper the assessment criteria, the classroom dynamics, and the feedback received from students, which confirmed that the combination of the practices and the PBL successfully applied both active learning and intrinsic motivation in the classroom.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40b4f7520bf1511dbd0f7a2d8832cc15",
  "timestamp": "2025-05-15T01:02:10.194069"
}