{
  "id": 6100,
  "title": "Cardiometabolic risk factors and MyChart enrollment among adult patients",
  "abstract": "Objectives: The purpose of this study was to assess the relationship between MyChart and cardiometabolic risk factors (i.e., body mass index [BMI], blood pressure [BP], and smoking status) among adult patients. We assessed whether activated MyChart account status and number of MyChart logins differed based on cardiometabolic risk factors, above and beyond demographic covariates. Methods: This study was an electronic medical record review of 137,837 adult patients who were seen during June 2014-June 2015 at all ambulatory outpatient facilities in one large, Midwestern healthcare system. We performed multivariable logistic and multiple linear regression analyses. Results: Of patients, 25.8% had an active MyChart account status. Multivariable regression analyses indicated that overweight patients were 5.0% more likely (OR=1.05, CI = [1.01, 1.08]) to have an active account compared to normal weight counterparts, but patients with hypertension were 18.0% less likely (OR=0.82, CI = [0.79, 0.85]) to have an active account compared to those with normal BR Former smokers were 54.0% less likely (OR=0.46, CI = [0.44, 0.48]) to have an activate account compared to patients who never smoked. Multiple linear regression results indicated obesity (b = 2.65) and active smoking (b = 5.10) positively affected the number of MyChart logins, whereas pre-hypertensive BP negatively affected the number of MyChart account logins (b =-1.20). Conclusions: Healthcare organizations and employees should consider these findings when developing strategies for MyChart enrollment and utilization. Future research should compare system implementation, patient care quality, and financial efficiency of MyChart between healthcare organizations of similar structural makeup and geographic locations. (C) 2017 Fellowship of Postgraduate Medicine. Published by Elsevier Ltd. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40bcbdb4a5b5f448d18dc4ece604dba6",
  "timestamp": "2025-05-15T02:54:39.094263"
}