{
  "id": 591,
  "title": "An application of principal components analysis to portfolio optimization under the sharpe multiple index framework",
  "abstract": "The purpose of this paper is to investigate the behavior of efficient frontiers under two developed multiple index portfolio frameworks, namely the Sharpe Multiple Index (abbreviated as SMI) and the Improved Sharpe Multiple Index (abbreviated as ISMI) portfolio models proposed by Hossain et al [12]. We apply the Principal Components (abbreviated as PC) idea for constructing significant orthogonal components of indices in order to attain efficient frontiers that illustrate a true risk and return structure for a portfolio of stocks on the South African stock exchange under the SMI and ISMI formulations. The empirical evidence shows that the application of PC in efficient frontier construction supports the risk-return structure estimated under the ISMI formulation. Furthermore the empirical results in this study supports the claim from a previous paper by Hossain et al [12] that the Sharpe Multiple Index model gives an inaccurate risk structure of an investor's financial portfolio in the presence of positive correlation between residuals and therefore is consistently under-estimating risk in portfolios with positively correlated residuals. In this paper we demonstrate and explore the consistency of the risk-return structure under four estimation methods namely, GARCH (Genral Autoregressive Conditional Heteroscedastic), ARMA (Autoregressive Moving Average), Least squares and State Space (Kalman Filter) models. We believe that the empirical evidence and discoveries of this paper are of colossal importance and may be quite beneficial to the investment community.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40c7e80a3ecc59e702db49bfa9acba23",
  "timestamp": "2025-05-15T00:45:39.043955"
}