{
  "id": 7450,
  "title": "Hunger in Vulnerable Families in Southeastern Europe: Associations With Mental Health and Violence",
  "abstract": "Background: Hunger can influence healthy development of children and has been shown to be associated with other determinants of child health, such as violence within the family and maternal (mental) health problems. Whilst the majority of research has been conducted in high-income countries with vulnerable populations, less is known about the circumstances in low-and-middle-income countries. This study explored the experience of hunger in vulnerable families in three Southeastern European countries, and simultaneously examined relationships with four sets of risk factors-lack of financial, mental, familial, and social resources. Methods: Families (N = 140) were recruited for a parenting intervention targeting child behavioral problems. Baseline data was collected on hunger, socioeconomic characteristics, mental health and wellbeing, family violence (i.e., child maltreatment and intimate partner violence), and social and emotional support. Univariate and multivariable risk factors of hunger were examined cross-sectionally with regression models. Results: Overall, 31% of families experienced at least one form of hunger in the last month. Worse family functioning, current intimate partner violence, and more instances of child neglect showed univariate associations with family hunger. In hierarchical analysis, five risk factors remained significantly associated with the experience of hunger: lower adult educational, literacy level, emotional support, more children in the household and higher scores on parental depression, anxiety, and stress. Conclusions: Hunger in Southeastern European families, among families with children showing elevated behavioral problems, was associated with more family violence, but specifically poorer mental health and less emotional support above and beyond socio-structural strains. Adapting parenting interventions to support the primary caregiver in getting more access to emotional support may potentially also change hunger and its association with health and violence. However, this hypothetical pathway of change needs explicit testing.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40ccf04a746fe6321f7d8cd7c818d45e",
  "timestamp": "2025-05-15T03:08:37.931342"
}