{
  "id": 32,
  "title": "Machine learning for prediction of acute kidney injury in patients diagnosed with sepsis in critical care",
  "abstract": "Background and objective Acute Kidney Injury (AKI) is a common and severe complication in patients diagnosed with sepsis. It is associated with higher mortality rates, prolonged hospital stays, increased utilization of medical resources, and financial burden on patients' families. This study aimed to establish and validate predictive models using machine learning algorithms to accurately predict the occurrence of AKI in patients diagnosed with sepsis.Methods This retrospective study utilized real observational data from the Medical Information Mart for Intensive Care IV (MIMIC-IV) database. It included patients aged 18 to 90 years diagnosed with sepsis who were admitted to the ICU for the first time and had hospital stays exceeding 48 hours. Predictive models, employing various machine learning algorithms including Light Gradient Boosting Machine (LightGBM), EXtreme Gradient Boosting (XGBoost), Random Forest (RF), Decision Tree (DT), Artificial Neural Network (ANN), Support Vector Machine (SVM), and Logistic Regression (LR), were developed. The dataset was randomly divided into training and test sets at a ratio of 4:1.Results A total of 10,575 sepsis patients were included in the analysis, of whom 8,575 (81.1%) developed AKI during hospitalization. A selection of 47 variables was utilized for model construction. The models derived from LightGBM, XGBoost, RF, DT, ANN, SVM, and LR achieved AUCs of 0.801, 0.773, 0.772, 0.737, 0.720, 0.765, and 0.776, respectively. Among these models, LightGBM demonstrated the most superior predictive performance.Conclusions These machine learning models offer valuable predictive capabilities for identifying AKI in patients diagnosed with sepsis. The LightGBM model, with its superior predictive capability, could aid clinicians in early identification of high-risk patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40db0c6888246cdf89a169d3bbb92f8e",
  "timestamp": "2025-05-15T01:46:03.818986"
}