{
  "id": 3588,
  "title": "Guaranteed Minimum Maturity Benefits in a Self-Exciting Stochastic Mortality Model: Pricing, Estimation and Calibration",
  "abstract": "The guaranteed minimum maturity benefit (GMMB) is quite a popular feature embedded in several unit-linked policies offered by insurance companies. The value of this benefit depends on several processes assumed to describe both the mortality and the financial dynamics, typically represented by interest rates and by the fund associated to the unit-linked policy. A large literature is devoted to the valuation of GMMB for different mortality models, in particular when the mortality dynamics is described by affine models of diffusion type. In the present article we assume a self-exciting behavior for the mortality dynamics, described by a Hawkes-type process with exponential kernel. This allows us to keep both the Markov and affine features but introduces jumps with a stochastic intensity. These types of dynamics, exhibiting a jump clustering property, are quite convenient for describing mortality in some critical situations, like epidemics, where contagion phenomena make the probability of jump arrivals higher whenever a jump occurs. By assuming diffusion-type dynamics for both the fund and the interest rate and introducing all of the possible correlations among the diffusion processes necessary to obtain realistic dynamics, we take advantage of the affine features of the model proposed and compute in a semi-explicit form the value of a GMMB. Lastly, we calibrate our model and perform an empirical analysis to determine the effects of excess mortality on GMMB prices as well as a death benefit portfolio.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "40ed4ea7075bf6711f4fb72152cfba30",
  "timestamp": "2025-05-15T01:18:20.648089"
}