{
  "id": 9428,
  "title": "Potential demand for National Health Insurance in Zimbabwe: Evidence from selected urban informal sector clusters in Harare",
  "abstract": "BackgroundZimbabwe's tax-based healthcare financing model has been characterised by perennial financing deficits and widespread application of user fees and has thus been socially exclusive. The country's urban informal sector population is not spared from these challenges. The study explored the potential demand for National Health Insurance (NHI) among respondents from selected urban informal sector clusters of Harare. The following clusters were targeted: Glenview furniture complex, Harare home industries, Mupedzanhamo flea market, Mbare new wholesale market and Mbare retail market. MethodsA cross-sectional survey was administered to 388 respondents from the selected clusters, and data on the determinants of Willingness to Join (WTJ) and Willingness to Pay (WTP) was gathered. Respondents were recruited via a multi-stage sampling procedure. In the first stage, the five informal sector clusters were purposely selected. The second stage involved a proportional allocation of respondents by cluster size. Finally, based on the stalls allocated by municipal authorities in each area, respondents were selected using systematic sampling. The sampling interval (k) was determined by dividing the total number of allocated stalls in a cluster (N) by the sample size proportionate to that cluster (n). For each cluster, the first stall (respondent) was randomly chosen, and thereafter, a respondent from every 10(th) stall was selected and interviewed at their workplace. Contingent valuation was adopted to elicit WTP. Logit models and interval regression were applied for the econometric analyses. ResultsA total of 388 respondents participated in the survey. The dominant informal sector activity among the surveyed clusters was the sale of clothing and shoes (39.2%), followed by the sale of agricultural products (27.1%). Concerning employment status, the majority were own-account workers (73.1%). Most of the respondents (84.8%) completed secondary school. On monthly income from informal sector activities, the highest frequency (37.1%) was observed in the Zw$(1000 to <3000) or US$(28.57 to <85.71) category. The mean age of respondents was 36 years. Out of the 388 respondents, 325 (83.8%) were willing to join the proposed NHI scheme. WTJ was influenced by the following factors: health insurance awareness, health insurance perception, membership to a resource-pooling scheme, solidarity with the sick, and household recently experiencing difficulties paying for healthcare. On average, respondents were willing to pay Zw$72.13 (approximately US$2.06) per person per month. The key determinants of WTP were household size, respondent's education level, income, and health insurance perception. ConclusionsSince the majority of respondents from the sampled clusters were willing to join and pay for the contributory NHI scheme, it follows that there is potential to implement the scheme for the urban informal sector workers from the clusters studied. However, some issues require careful consideration. The informal sector workers need to be educated on the concept of risk pooling and the benefits of being members of an NHI scheme. Household size and income are factors that require special attention when deciding on the premiums for the scheme. Moreover, given that price instability hurts financial products such as health insurance, there is a need for ensuring macroeconomic stability.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "410e926fbf0c510676b1f5c07a5674c3",
  "timestamp": "2025-05-15T03:28:46.276888"
}