{
  "id": 3372,
  "title": "Shock transmission between climate policy uncertainty, financial stress indicators, oil price uncertainty and industrial metal volatility: Identifying moderators, hedgers and shock transmitters",
  "abstract": "This research initially examines the shock transmission from news-related Climate Policy Uncertainty (CPU), the CBOE crude oil volatility index as a proxy for Oil Price Uncertainty (OPU), and global Financial Stress Indicators (FSI) such as Credit, Equity-Valuation, Funding, Safe-Assets, and Volatility, towards the conditional volatility of global steel, iron ore, and aluminum prices using monthly time series data spanning from January 2004 to September 2023. The study employs novel Extended Joint and Frequency domain Time-Varying Parameter Vector Auto-Regression (TVP-VAR) models. Secondly, hedge ratios and optimal portfolio weights are computed utilizing the DCC-GARCH-t copulas approach to investigate the potential of offsetting long-term volatility in one industrial metal through short-term positioning in another. Thirdly, this research delves into the moderating influence of CPU, OPU, and FSI on overall, short-term, and long-term volatility interconnectedness among industrial metals. Overall, the findings suggest that OPU and CPU transmit higher shocks towards aluminum and steel for both short- and long-term investment periods. However, shocks transmitted in the short term from OPU, CPU, and FSI are higher in intensity compared to the long-term period. In both short- and longterm investment periods, FSI such as Equity Valuation, Funding constraints, and transitions towards Safer Assets transmit higher shocks towards the conditional volatility in industrial metals. The hedge ratios and optimal portfolio selection strategies demonstrate that short-term positioning in steel provides efficient hedging against long-term volatility in aluminum and iron ore. Finally, the positive moderating impact of OPU on volatility interconnectedness between industrial metals has several practical implications for stakeholders.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "412727dd35d514ef27bc8e88c42a7e52",
  "timestamp": "2025-05-15T01:16:22.194611"
}