{
  "id": 9005,
  "title": "Inspection of engineered composite repairs applied to oil and gas pipework and piping to support life extension",
  "abstract": "This paper describes ongoing work carried out on behalf of the HOIS joint industry project (JIP) over the past two years. The work concerns in-service inspection for assessment of the structural integrity of engineered composite repairs applied to pipework and piping. This repair method has been used extensively in the UK North Sea and elsewhere for several years to allow ageing assets, particularly offshore platforms, to continue safe operation. Engineered composite repairs represent an attractive technical and financial proposition compared to unplanned pipe or spool replacements. Engineered composite repairs are designed, manufactured and installed to have defined lives based on the repair risk classification (representing the likelihood and consequences of failure), which are defined in current ISO[1] and ASME[2] standards. A blind trial inspection programme, using a combination of donated ex-service and manufactured components, is described. The capabilities and limitations of existing non-destructive testing (NDT) and inspection techniques are considered. The inspection information collected to date is intended to be used to prepare an inspection guidance document for assessing the condition of the substrate, the adhesive bond and the composite repair laminate. Several blind trials have now been completed, including in-service radiography, using iridium gamma sources with digital detector arrays (DDAs), as well as microwave and shearography inspection techniques. Electromagnetic inspections for three different pulsed eddy current (PEC) techniques and one magnetic eddy current (MEC) technique, using equipment from different vendors, were assessed together with a recently developed natural frequency vibrational technique called dynamic response spectroscopy (DRS)[3]. The main objective of this ongoing work, which is focused on the upstream application to pipework, is the development of an industry guidance document on composite repair inspection. The significance and criticality of defects, the extension of defined life repairs and the improved understanding of the long-term adhesion performance are key parameters required for possible life extension and are beyond the scope of this paper.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "412a3616a90b7ea53b99bdaf0e60116b",
  "timestamp": "2025-05-15T03:24:26.413578"
}