{
  "id": 7815,
  "title": "Kininogen 1 gene polymorphisms are not associated with intracerebral hemorrhage in a Chinese Han population",
  "abstract": "Aim: Little is known about the potential role of genes in the pathogenesis of most intracerebral hemorrhagic stroke. Kininogens (KNG1) are the precursor of potent vasoactive kinin peptides and also function as cysteine proteinase inhibitors which are involved in hypertension and aneurysm. The purpose of this study is to investigate whether KNG1 gene polymorphisms are associated with intracerebral hemorrhage (ICH) in a Chinese Han population. Materials and methods: A hospital based case-control study was conducted and we investigated the rs1656922 and rs2304456 polymorphisms of KNG1 gene from 351 ICH patients and 312 unrelated age- and gender-matched controls by using the multiplex SNaPshot reaction. Results: The results showed that the T allele of rs1656922 was significantly over represented in the ICH patients. However, multiple logistic regression analysis both under recessive and dominant model were failed to confirm the two variants as risk factors for ICH. Furthermore, no gender or hematoma site specific associations were discovered between the two variants of KNG1 gene and ICH. However, the prevalence of the rs2304456 GG genotype (p=0.014) and the frequency of the G allele (p=0.012) were significantly increased among hypertensive patients when compared with normotensive patients. Conclusion: In conclusion, these findings represent an important negative result indicating that rs1656922C/T and rs2304456G/T polymorphisms of KNG1 gene are not associated with ICH while rs2304456 GG genotype may be a risk factor for hypertension in a Chinese Han population. Conflict of interest: There are no any actual or potential conflicts of interest including any financial, personal or other relationships with other people or organizations.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "412ee4ebd726c114aa035fe7cd975d70",
  "timestamp": "2025-05-15T03:12:36.389419"
}