{
  "id": 7773,
  "title": "Investigation of the acute pathogenesis of spondyloarthritis/HLA-B27-associated anterior uveitis based on genome-wide association analysis and single-cell transcriptomics",
  "abstract": "BackgroundPatients with spondyloarthritis (SpA)/HLA-B27-associated acute anterior uveitis (AAU) experience recurring acute flares, which pose significant visual and financial challenges. Despite established links between SpA and HLA-B27-associated AAU, the exact mechanism involved remains unclear, and further understanding is needed for effective prevention and treatment.MethodsTo investigate the acute pathogenesis of SpA/HLA-B27-associated AAU, Mendelian randomization (MR) and single-cell transcriptomic analyses were employed. The MR incorporated publicly available protein quantitative trait locus data from previous studies, along with genome-wide association study data from public databases. Causal relationships between plasma proteins and anterior uveitis were assessed using two-sample MR. Additionally, colocalization analysis was performed using Bayesian colocalization. Single-cell transcriptome analysis utilized the anterior uveitis dataset from the Gene Expression Omnibus (GEO) database. Dimensionality reduction, clustering, transcription factor analysis, pseudotime analysis, and cell communication analysis were subsequently conducted to explore the underlying mechanisms involved.ResultsMendelian randomization analysis revealed that circulating levels of AIF1 and VARS were significantly associated with a reduced risk of developing SpA/HLA-B27-associated AAU, with AIF1 showing a robust correlation with anterior uveitis onset. Colocalization analysis supported these findings. Single-cell transcriptome analysis showed predominant AIF1 expression in myeloid cells, which was notably lower in the HLA-B27-positive group. Pseudotime analysis revealed dendritic cell terminal positions in differentiation branches, accompanied by gradual decreases in AIF1 expression. Based on cell communication analysis, CD141+CLEC9A+ classic dendritic cells (cDCs) and the APP pathway play crucial roles in cellular communication in the Spa/HLA-B27 group.ConclusionsAIF1 is essential for the pathogenesis of SpA/HLA-B27-associated AAU. Myeloid cell differentiation into DCs and decreased AIF1 levels are also pivotal in this process.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "413a2bc6009a3e04ca61cd1a3d681ec6",
  "timestamp": "2025-05-15T03:12:11.496866"
}