{
  "id": 854,
  "title": "The impact of psychological stress on blood pressure in middle school pupils and the role of other risk factors in its occurrence",
  "abstract": "Purpose: Assessing the impact of stress on blood pressure in middle school children and of the socio-economic, familial, genetic, school environment and extracurricular risk factors that may influence this overstress. Methods: I have duplicately measured systolic and diastolic blood pressure at an interval of 5 minutes at least, during the first days after the holiday, during the educational classes for the normal values and during the evaluation of students' knowledge, i.e. before taking tests. Individual study was based on a questionnaire on the identity data, school, grade, address, age and occupation of parents, age and number of brothers, school starting age and schedule. Data on family environment focused on how to prepare homework, sleep duration, bedtimes, wakening-up hour in the morning, differentiated by curricular activity and practicing extracurricular physical activities. School environment targeted the average grade obtained in the semester previous to the investigation, most preferred and most disliked study discipline, activities during the holidays. Data were collected from 203 students from V - VIIIth grades from two schools of Sibiu city. Results: Systolic blood pressure (BP) showed an increase (p = 0.0000) from 100.67 mmHg to 112.48 mmHg during knowledge evaluation period, with a highly significant relation (r = 0.68). Diastolic BP increased from 57.71 mmHg to 64.56 mmHg during overstress, r = 0.62. Systolic BP response to stress was correlated with school starting age (r = 0.57). The waking-up time showed significant variances of basal BP (p = 0.0078) and after stress (p = 0.0227) in the schools pupils from one of the schools. The study of genetic factors represented by the current age of the parents showed that the age group of the father and mother did not cause significant variances of basal systolic BP and diastolic BP and during stress. Economic factors were analyzed based on parental occupation and number of siblings as indicators of the financial situation of the family. Maximum systolic BP values during knowledge evaluation were registered in the students having intellectual fathers (110 +/- 20), followed by those without employment (105 +/- 7) and the unemployed (116 +/- 12). Basal systolic BP increased (r = 0.231) with the average grade, variances (p = 0.033) being within physiological school age limits. Diastolic BP differences in relation to the average grade were preserved (p = 0.035) after stress. Conclusions: Psychological stress produced by evaluating school knowledge causes increased BP in normotensive subjects. Diastolic BP is in line with systolic BP after stress. Hemodynamic answer to stress is higher in the schoolchildren with extreme economic situations, expression of parental occupation.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4152ecd63937c3ae679d6685bceb7a00",
  "timestamp": "2025-05-15T01:43:20.683881"
}