{
  "id": 4003,
  "title": "Survival analysis of a household portfolio of insurance policies:: How much time do you have to stop total customer defection?",
  "abstract": "Customer-side influences on insurance have been relatively ignored in the literature. Using the household as the unit of analysis, this article focuses on the behavior of households having multiple policies of different types with the same insurance company, and who cancel their first policy. How long after the household's cancellation of the first policy does the insurer have to retain the customer and avoid customer defection on all policies to the competition ? And, what customer characteristics are associated with customer loyalty ? Using logistic regression and survival analysis techniques, an assessment is made of the probability of total customer withdrawal, and the length of time between first cancellation and subsequent customer withdrawal. Using a European database spanning 54 months of household multiple policyholder behavior, the results show that cancellation of one policy is a very strong indicator that other household policies will be canceled. Further, the insurer can have time to react to retain the customer after the first cancellation, however, this time is significantly dependent on the method used to contact the company, household demographics, and the nature of the household's insurance policy portfolio. Surprisingly, core customers having three or more policies in addition to the canceled policy are more vulnerable to total defection on all policies than noncore customers. Further, the potential customer repelling effects of premium increases seem to wear out after 12 months. Strategic implications of the results are presented.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "415951b2775f5366a21ff0d4553fc1e4",
  "timestamp": "2025-05-15T01:23:07.285545"
}