{
  "id": 7583,
  "title": "CORRELATION OF FUNDAMENTAL AND TECHNICAL INDICATORS FOR A PARTICULAR STOCK AT THE BANJA LUKA STOCK EXCHANGE",
  "abstract": "The fundamental business indicators are based on an analysis of previous incomes and financial research statements of companies. Unlike the fundamentals, a technical analysis (indicator) is based on the forms related to the movement of stock prices, and determines whether they are repetitive and whether they are predictable. In the capital market in BH, there is a common phenomenon that indicates that certain shares are not traded for more than one day, due to low liquidity, and because of the lack of information and high risk. Also, this paper will analyze one segment of the capital market in BH, i.e. shares of stock index BIRS (Banja Luka Stock Exchange of Securities). The main objective of this research is to determine whether there is a mutual dependence and interdependence in the movement of technical and fundamental analysis indicators, i.e. whether fundamental indicators can affect the movement of stock prices through a multiple linear regression. As independent variables will be used: return on average equity - ROAE, then earnings before interest, taxes, depreciation and amortization - EBITDA, the ratio of total debt to total assets (Leverage) and dividend per share. The price - earnings ratio will be observed as a dependent variable. This study covers the period from 2005 to 2013.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4162b467259c9930c17052e06c8fdd7b",
  "timestamp": "2025-05-15T03:10:05.545501"
}