{
  "id": 4499,
  "title": "Accounting comparability and financial distress",
  "abstract": "PurposeThe purpose of this study is to present the evidence of the association between financial statement comparability and corporate financial distress. Design/methodology/approachThis is an empirical study, and this study uses multiple regression analysis to evaluate hypothesis. FindingsThe authors find a significant decrease in the probability of financial distress as accounting comparability increases. Findings of this study suggest that distressed firms tend to produce financial statements that compare poorly to those of peer firms; the effectiveness of predicting financial distress with accounting ratios may be conditional on comparability with peers; and financial statement comparability may be predictive of financial distress. Research limitations/implicationsFirst, this study only used publicly available financial data, which may not be representative of all countries and could differ because of differences in accounting practices. Second, although this study found a connection between accounting comparability and financial distress, it cannot prove a causal relationship, as other factors that were not controlled for may also have an impact. Third, this study used various measures of financial distress, but other measures could lead to different results. Finally, this study did not include all relevant variables, such as industry-specific factors and macroeconomic conditions, which could influence the relationship between accounting comparability and financial distress. Practical implicationsFor investors and financial analysts, the results imply that accounting comparability can serve as a useful signal for identifying companies that are more likely to remain financially stable in the long run. Thus, they may prefer to invest in or recommend highly comparable firms over their less comparable counterparts. For auditors, this study underscores the importance of promoting and enforcing accounting standards that improve comparability, as this can help mitigate the risk of financial distress among their clients. Regulators may also consider the implications of the study's findings when designing policies and guidelines related to financial reporting and disclosure. Originality/valueTo the best of the authors' knowledge, this is the first study investigating the association between financial statement comparability and corporate financial distress of the US firms. This study uses large, comprehensive and multi-year data. Furthermore, this is the only study that presents the evidence of negative association between comparability and firm financial distress.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "416271d58df9b9879ac93a1a214b4717",
  "timestamp": "2025-05-15T02:37:47.566154"
}