{
  "id": 330,
  "title": "A reduced-dimension feature extraction method to represent retail store electricity profiles",
  "abstract": "Characterising the inter-seasonal energy performance of buildings is a useful tool for a business to under- stand what is 'normal' for its portfolio of premises and to detect anomalous patterns of energy demand. When adding a new building to the portfolio, it will be useful to predict what will be the likely energy use as part of on-going monitoring of the site. For a large portfolio of buildings with, say, half-hourly energy use measurements (48 dimensions), analysis and prediction will require machine learning tools. Even so, it is advantageous to minimise the amount of data and number of dimensions and features required to find useful patterns in the measurement stream. Our aim is to devise a reduced feature set that can gen- erate a statistically reasonable representation of daily electricity load profiles of retail stores and small supermarkets. We then test if our method is sufficiently accurate to predict and cluster measured pat- terns of demand. We propose an automatic method to extract features such as times and average demands from electricity load profiles. We used four regression models for prediction and six clustering methods to compare with the results obtained using all of the readings in the load profile. We found that the reduced feature set gave a good representation of the load profile, with only small prediction and clustering errors. The results are robust as prediction is supervised learning and clustering is unsuper- vised. This simplified feature set is a concise way to represent profiles without using small variances of the demand that do not add useful information to the overall picture. As modern sensor systems increase the volume, availability, and immediacy of data, using reduced dimensional datasets will be key to extracting useful information from high-resolution data streams.(c) 2022 The Author(s). Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4179ca0cd8c850113dc7ad9df0833a42",
  "timestamp": "2025-05-15T00:42:00.473249"
}