{
  "id": 3970,
  "title": "INTERACTION OF ASSET TANGIBILITY ON THE RELATIONSHIP BETWEEN LEVERAGE STRUCTURE AND FINANCIAL DISTRESS IN AGRICULTURE-LINKED NON-FINANCIAL FIRMS",
  "abstract": "This study aims at investigating, from a perspective of agriculture linked firms, the impact of leverage structure on the probability of corporate financial distress with the moderating role of asset tangibility. A panel data logit regression model used to estimate the relationship between capital structure, debt maturity structure, and financial distress while controlling the effects of acclaimed variables like firm size, taxes, and profitability. The data set consists of 187 agriculture linked non financial firms listed on the Pakistan Stock Exchange (PSX) over five years (2013-2017). The results reveal that asset tangibility negatively moderates the relationship between debt maturity structure and the probability of financial distress, but no such evidence found for the relationship between capital structure and financial fragility. Results suggest lessening the reliance on short term debt in the leverage structure. This research implies that policymakers at managerial levels should have less reliance on short term debt to abate rollover risk. Productive fixed assets can act as collateral without a considerable rise in associated fixed costs. The current study evaluated the moderating role of tangible assets on the relationship of debt maturity structure and the possibility of financial distress along with the previously addressed link of capital structure and the chances of financial distress. A sample of agriculture-linked corporate entities is also unexplored in previous literature.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "417c75c055eb14a6938c03f2570c9409",
  "timestamp": "2025-05-15T02:31:58.597712"
}