{
  "id": 4628,
  "title": "The impact of capital structure on financial performance in Romanian listed companies",
  "abstract": "This research aims to establish the relationship between capital structure and financial performance in 196 Romanian companies listed on the Bucharest Stock Exchange and operating in the manufacturing sector, over a period of eight-years (2003-2010). The analysis is based on cross sectional regressions. The capital structure indicators refer to long-term debt, short-term debt; total debt and total equity, while return on assets and return on equity are the performance proxies. Previous studies indicate asset tangibility, tax, risk, liquidity and inflation as capital structure determinants in Romanian manufacturing companies. As long as these factors have an important impact on financing decisions, they will he included in the analysis as they are expected to also influence performance. Results indicate that performance in Romanian companies is higher when they avoid debt and operate based on equity. However, it seems that manufacturing companies do not have sufficient internal funding to undertake profitable investments and do not use their assets effectively. During times of increased taxes and inflation profitable companies divest part of their assets reducing their costs. There is an indication of risk-taking behavior across manufacturing companies. This show a preference for debt when they are in financial difficulties and they face high business risks, or when they cannot settle their debts due to a lack of cash. Due to missing data regarding long-term debt ratios, those regression results are not statistically significant. Moreover, the regression models referring to return on equity explain a reduced proportion of its variation. (C) 2015 Published by Elsevier B.V.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41937b663060c33159de13fb87284a0f",
  "timestamp": "2025-05-15T02:39:26.954921"
}