{
  "id": 7341,
  "title": "Association of Baseline Patient-reported Health-related Quality of Life Metrics with Outcome in Localised Prostate Cancer",
  "abstract": "Aims: Although health-related quality of life (HR-QoL) outcomes are pivotal in oncology, the prognostic significance of patient-reported HR-QoL metrics is largely undefined in localised prostate cancer. We report the association of baseline HR-QoL metrics with overall survival and toxicity in localised prostate cancer. Materials and methods: This was a secondary analysis of a phase III randomised controlled study conducted in a single-payer health system. Patients with Gleason score <7, clinical stage T1b-T3a and prostate-specific antigen <30 ng/ml were randomised to neoadjuvant and concurrent androgen deprivation therapy (ADT) for 6 months starting 4 months before prostate radiotherapy or concurrent and adjuvant ADT for 6 months starting simultaneously with prostate radiotherapy. HR-QoL scores were estimated using the European Organisation for Research and Treatment of Cancer QoL questionnaire. A multistate Markov model was used to determine the association of baseline HR-QoL metrics with overall survival and a multilevel multivariable Cox regression was used to determine the association with the incidence of delayed-onset grade >3 radiotherapy-related toxicities. To adjust for multiple analyses, P < 0.025 was considered as statistically significant. Results: Overall, 393 patients with baseline HR-QoL data were included in this analysis: 194 in the neoadjuvant arm and 199 in the adjuvant arm. Baseline financial difficulty (hazard ratio 1.020, 95% confidence interval 1.010-1.030, P = 0.02) and dyspnoea (hazard ratio 1.020, 95% confidence interval 1.003-1.030, P = 0.01) were associated with inferior overall survival. Baseline dyspnoea was associated with a higher incidence of grade >3 toxicity (hazard ratio 1.020, 95% confidence interval 1.010-1.030, P = 0.023). Conclusion: In a cohort of localised prostate cancer patients treated with radiotherapy and short-term ADT, a 10-point higher baseline financial difficulty or dyspnoea was associated with a 20% increased risk of death. With each 10-point increase in baseline dyspnoea, we noted a 20% increase in the associated risk of grade >3 delayed-onset radiotherapy-related toxicity. (c) 2021 The Royal College of Radiologists. Published by Elsevier Ltd. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41943e145e5ccd5a7bb9dd3327b7f6a0",
  "timestamp": "2025-05-15T03:07:31.897254"
}