{
  "id": 2010,
  "title": "Model of Risk Reduction Behavior and Financial Performance Escalation of Islamic Bank in Indonesia",
  "abstract": "This study aims to examine and analyze the effects of: (a) capital structure on risk; (b) risk intermediary function; (c) operational efficiency against risk; (d) capital structure for financial performance; (e) intermediation function for financial performance; (f) operational efficiency on financial performance and (g) risk to financial performance. Quantitative research approach. This type of research is explanatory research. This study uses secondary data on the financial statements of Islamic banks in Indonesia for the 2014-2018 period with a purposive sampling technique from 14 Islamic banks in Indonesia so that a total sample of 60 was determined during the 2014-2018 observation. The research model used path analysis with regression using SPSS analyzed. The results of the study found that (a) the relationship between capital structure has no significant effect on risk; (b) the intermediation function has a significant and positive effect on risk; (c) operational efficiency has a significant and positive effect on risk; (d) capital structure has no significant effect on financial performance; (e) the intermediation function has no significant effect on financial performance; (f) operational efficiency has a significant and negative effect on financial performance; (g) risk does not have a significant effect on financial performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "419def75bf60b5daa4595661a80dd634",
  "timestamp": "2025-05-15T02:09:48.463697"
}