{
  "id": 5438,
  "title": "SOVEREIGN DEFAULT ANALYSIS THROUGH EXTREME EVENTS IDENTIFICATION",
  "abstract": "This paper investigates contagion in international credit markets through the use of a novel jump detection technique proposed by Chan and Maheu in 2002. This econometrical methodology is preferred because it is non-linear by definition and not a subject to volatility bias. Also, the identified jumps in CDS premiums are considered as outliers positioned beyond any stochastic movement that can and is already modelled through well-known linear analysis. Though contagion is hard to define, we show that extreme discrete movements in default probabilities inferred from CDS premiums can lead to sound economic conclusions about the risk profile of sovereign nations in international bond markets. We find evidence of investor sentiment clustering for countries with unstable political regimes or that are engaged in armed conflict. Countries that have in their recent history, faced currency or financial crises are less vulnerable to external unexpected shocks. First we present a brief history of sovereign defaults with an emphasis on their increased frequency and geographical reach, as financial markets become more and more integrated. We then pass to a literature review of the most important definitions for contagion, and discuss what quantitative methods are available to detect the presence of contagion. The paper continues with the details for the methodology of jump detection through non-linear modelling and its use in the field of contagion identification. In the last sections we present the estimation results for simultaneous jumps between emerging markets CDS and draw conclusions on the difference of behaviour in times of extreme movement versus tranquil periods.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41a474362906c2c3a33082d05fb7e034",
  "timestamp": "2025-05-15T02:47:43.019890"
}