{
  "id": 1308,
  "title": "A Novel Hybrid Forecasting Approach for Customers Churn in Banking Industry",
  "abstract": "Competitive markets and customers' changing needs in the bank industry necessitate accurately predicting customers who may leave the firm in the near future. Consequently, creating an approach to predict precisely and identify churn-leading causes is a part of retention strategies in customer relationship management. The approach that has been utilized in this research to predict customer churn combines decision tree (DT) and multinomial regression (MR) to classify customers with no limitation of binary classification in the churn prediction context. A customer club dataset of a commercial bank case as a real churn problem is used in this study to benchmark the hybrid forecasting approach against its building blocks. The results showed that the hybrid forecasting approach outperformed DT and MR with an average accuracy of 87.66%, 90.74% micro-average, and 90.44% macro-average of AUC. Further analysis of the model performance per class indicated that the hybrid approach's misclassification error for the churn class decreased significantly, which is the most costly error in churn problems. Moreover, due to the structure of hybrid forecasting approach, more interoperability is obtained by assessing the impact of features in different segments, resulting in transforming them into actionable insights. The proposed approach is applied to the banking industry to prevent financial loss by detecting leading churn causes. Accordingly, after predicting the risk of customer churn, marketers and managers can determine appropriate actions that will have the most significant retention impact on each customer by applying proactive retention marketing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41b3bbe3e3cb31c6076bb93dabc6f78e",
  "timestamp": "2025-05-15T02:01:11.923945"
}