{
  "id": 1501,
  "title": "The Nature of Customer Portfolios: Towards New Understanding of Firms' Exchange Contexts",
  "abstract": "Purpose: Customer portfolios represent one of the central contexts for business marketing and thereby an important focus for industrial marketing research. In this article, the authors used the concept of customer portfolio to create new insights into the relational context of exchange where companies operate and manage their business. The study examines the general nature of firms' total customer portfolios in contrast to analytical portfolio studies that focus on value-segmentation of the firm's customer base. The authors contribute to the existing, largely conceptual knowledge on the topic by identifying key dimensions that systematically characterize firms' customer portfolios and building an empirical classification of portfolios. Methodology: The study is based on a nationwide cross-industry survey. The authors use cluster analysis to create the classification and discriminant analysis to investigate the importance of the portfolio dimensions for the identified clusters. Findings: The results show that firms' customer portfolios vary markedly, both in terms of structural and relational complexity. The differences denote a clear emphasis on either focused partnership, dynamic-networked, or broad market-like portfolios, posing significantly different drivers and challenges for customer relationship management. The identified dimensions, their measures, and the empirical classification offer important implications for business marketing research and practice.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41db88798b3c254373aa03d19133c640",
  "timestamp": "2025-05-15T00:56:38.976131"
}