{
  "id": 3548,
  "title": "Volatility index prediction based on a hybrid deep learning system with multi-objective optimization and mode decomposition",
  "abstract": "Advances in volatility index prediction based on computational intelligence have brought wide-ranging benefits to financial risk management. However, current studies in the field remain limited and need further improve-ment due to these research gaps: (1) ignoring the important role of probabilistic prediction in characterizing uncertainty risks; (2) relying on single-objective optimization algorithm to optimize prediction model, thereby ignoring the advantages of multi-objective optimization; (3) emphasizing nonlinear modeling, not considering both nonlinear and linear modeling simultaneously. Aiming to address these gaps, a novel multi-objective hybrid deep learning system, composed of a modified multi-objective optimizer, a clockwork recurrent neural network, and an improved mode decomposition method, is newly proposed to perform deterministic and probabilistic volatility index prediction. Concretely, the volatility index is decomposed into some modes using an advanced data decomposition method; further, the clockwork recurrent neural network is considered a prediction engine to model these modes, which has an excellent ability to model the long-term dependency for linear and nonlinear time series depending on its mechanism of temporal granularity, as compared to traditional recurrent neural networks; finally, the prediction results can be obtained by integrating the predictions from these modes, using the mode weights calculated by an improved multi-objective optimizer with the objectives of prediction accuracy and stability. To validate the performance of the proposed hybrid deep learning system, case studies and cor-responding sensitivity and convergence analyses are carried out. From the perspective of the indicator mean absolute percentage error, the maximum improvements of our proposed system reach 67.50%, 75.82%, and 75.42% in Case I, Case II, and Case III, respectively, thus indicating its superiority and practical feasibility.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41ebbc15025d8611e13abb439bb15cec",
  "timestamp": "2025-05-15T02:27:19.123563"
}