{
  "id": 8600,
  "title": "Economic strain and self-rated health among lone and couple mothers in Sweden during the 1990s compared to the 1980s",
  "abstract": "Objectives: Changes on the labour market and in Swedish welfare policy during the 1990s may have affected lone mothers. This study analysed economic strain and self-rated health (SRH) among lone and couple mothers in Sweden in the 1980s and the 1990s. Participants: 22,308, mothers, 19,122 couple and 3186 lone mothers, who responded to the Swedish Survey of Living Conditions in the years 1979-1998. Methods: Exposure for economic strain was defined as having had difficulties to make ends meet in the last year, the outcome measure was less than good SRH. Prevalence rates were calculated and logistic regression analysis was used in the analysis. Adjustments were made for type of mother, age, time period, socio-economic group, income, born in Sweden/foreign born and employment. Results: Prevalence rates of economic strain and less than good SRH increased during the 1990s compared to the 1980s among lone and couple mothers. A polarisation in SRH was noted among lone mothers, with worsening health in poorer groups and improved health among better off groups. Economic strain had a substantial explanatory value for the excess risk of less than good SRH throughout the period studied. The association between economic strain and SRH did not change between lone and couple mothers between the 1980s and the 1990s or in different income groups. Conclusions: The increased prevalence of less than good SRH among sub-groups of lone mothers may in part be due to an increase of financial problems among these groups in Sweden. Economic strain was an important explanatory factor. (c) 2006 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "41f8bde6a2ae5f40276cd0f0e6bb16bd",
  "timestamp": "2025-05-15T03:20:22.329871"
}