{
  "id": 2767,
  "title": "The psychosocial versus material hypothesis to explain observed inequality in disability among older adults: data from the West of Scotland Twenty-07 Study",
  "abstract": "Objectives: The possible mechanisms for explaining health inequality are subject to debate. This study considers the roles of psychosocial and material mechanisms in observed inequalities in disability among older people. Design: Cross-sectional analysis of cohort study. Participants: 723 respondents aged 63 years from the West of Scotland Twenty-07 Study. Main outcome measure: The Office of Population Census and Surveys Multidimensional Disability Severity Score. Respondents were dichotomised to the highest scoring tertile, and compared with the lowest and mid-tertiles combined. Explanatory measures: Socioeconomic position across adulthood was measured in three ways. Respondents reported perceptions of their own financial position (perceived financial hardship) across four decades of adult life. Data on possession of several indicators of material wealth (eg, ownership of television and washing machine; material conditions) during the same periods were also ascertained. Standard occupational classification was also recorded, based on longest held occupation. The relationship between the measures of socioeconomic position and disability was examined using logistic regression, adjusting for sex, morbidity and lifestyle factors. Results: Perceived financial hardship and material conditions in earlier decades of life were found to be associated with reported disability. However, in the fully adjusted model, there was stronger evidence for material conditions as a predictor of disability: across four decades they remained an independent risk factor for disability after adjustment for sex, morbidity, lifestyle factors and perceived financial hardship. Those in the most deprived material conditions group had 2 1/2 times the odds of reporting severe disability than those in the reference group. After adjustment, evidence for an association between perceived financial hardship and reported disability was not convincing. Conclusion: The data provide evidence to support the material explanation for observed inequalities in reported disability among older people.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "420d2feac4b7e3fe22bb570c4152b46e",
  "timestamp": "2025-05-15T02:19:08.345020"
}