{
  "id": 8100,
  "title": "Exposure to green spaces, cardiovascular risk biomarkers and incident cardiovascular disease in older adults: The Seniors-Enrica II cohort",
  "abstract": "Introduction: The impact of residential green spaces on cardiovascular health in older adults remains uncertain. Methods: Cohort study involving 2114 adults aged >= 65 years without cardiovascular disease (CVD), residing in five dense municipalities (Prince et al., 2015) of the Madrid region and with detailed characterization of their socioeconomic background, health behaviors, CVD biological risk factors, and mental, physical, and cognitive health. Greenness exposure was measured using the Normalized Difference Vegetation Index (NDVI) at varying distances from participants' homes. Traffic exposure, neighborhood environment, neighborhood walkability, and socioeconomic deprivation at the census level were also assessed. Serum N-terminal pro-B-type natriuretic peptide (NT-ProBNP), high-sensitivity troponin T (hs-TnT), interleukin 6 (IL -6), and Growth Differentiation Factor 15 (GDF-15) were measured at baseline, and incident CVD events identified through electronic medical records (International Classification of Primary Care -2 codes K74, K75, K77, K90, and K92). Results: After adjusting for sex, age, educational attainment, financial hardship and socioeconomic deprivation at the census level, an interquartile range (IQR) increase in NDVI at 250, 500, 750, and 1000 m around participants' homes was associated with mean differences in ProBNP of -5.56 % (95 %CI: -9.77; -1.35), -5.05 % (-9.58; -0.53), -4.24 % (-8.19, -0.19), and -4.16 % (-7.59; -0.74), respectively; and mean differences in hs-TnT among diabetic participants of -8.03 % (95 %CI: -13.30; -2.77), -9.52 % (-16.08; -2.96), -8.05 % (-13.94, -2.16) and -5.56 % (-10.75; -0.54), respectively. Of similar magnitude, although only statistically significant at 250 and 500 m, were the observed lower IL -6 levels with increasing greenness. GDF-15 levels were independent of NDVI. In prospective analyses (median follow-up 6.29 years), an IQR increase in residential greenness at 500, 750, and 1000 m was associated with a lower risk of incident CVD. The variables that contributed most to the apparent beneficial effects of greenness on CVD were lower exposure to traffic, improved cardiovascular risk factors, and enhanced physical performance. Additionally, neighborhood walkability and increased physical activity were notable contributors among individuals with diabetes. Conclusion: Increased exposure to residential green space was associated with a moderate reduction in CVD risk in older adults residing in densely populated areas.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4217737077499a05e4286ddede517324",
  "timestamp": "2025-05-15T03:15:09.424798"
}