{
  "id": 8857,
  "title": "Association of household income with home-based rehabilitation and home help service utilization among long-term home care service users",
  "abstract": "Background To examine the association of household income with home-based rehabilitation and home help services in terms of service utilization and expenditures. Methods A secondary data analysis of cross-sectional design was conducted using long-term care (LTC) insurance claims data, medical claims data, and three types of administrative data. The subjects comprised LTC insurance beneficiaries in Kashiwa city, Japan, who used long-term home care services in the month following care needs certification. Household income was the independent variable of interest, and beneficiaries were categorized into low-income or middle/high-income groups based on their insurance premiums. Using a two-part model, the odds ratios (ORs) and 95% confidence intervals (CIs) for the utilization of home-based rehabilitation and home help services in the month following care needs certification were estimated using logistic regression analysis, and the risk ratios (RRs) of service expenditures were estimated using a generalized linear model for gamma-distributed data with a log-link function. Results Among 3770 subjects, 681 (18.1%) used home-based rehabilitation and 1163 (30.8%) used home help services. There were 1419 (37.6%) low-income subjects, who were significantly less likely to use (OR: 0.813; 95%CI: 0.670-0.987) and spend on (RR: 0.910; 95%CI: 0.829-0.999) home-based rehabilitation services than middle/high-income subjects. Conversely, low-income subjects were significantly more likely to use (OR: 1.432; 95%CI: 1.232-1.664) but less likely to spend on (RR: 0.888; 95%CI: 0.799-0.986) home help services than middle/high-income subjects. Conclusion Household income was associated with the utilization of long-term home care services. To improve access to these services, the LTC insurance system should examine ways to decrease the financial burden of low-income beneficiaries and encourage service utilization.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "422717e82e5cf21efb42e3742079f392",
  "timestamp": "2025-05-15T03:22:57.955979"
}