{
  "id": 4024,
  "title": "Lifting the burden: State Medicaid expansion reduces financial risk for the injured",
  "abstract": "BACKGROUND Injuries are unanticipated and can be expensive to treat. Patients without sufficient health insurance are at risk for financial strain because of high out-of-pocket (OOP) health care costs relative to their income. We hypothesized that the 2014 Medicaid expansion (ME) in Washington (WA) state, which extended coverage to more than 600,000 WA residents, was associated with a reduction in financial risk among trauma patients. METHODS We analyzed all trauma patients aged 18 to 64 years admitted to the sole level 1 trauma center in WA from 2012 to 2017. We defined 2012 to 2013 as the prepolicy period and 2014 to 2017 as the postpolicy period. We used a multivariable linear regression model to evaluate for changes in length of stay, inpatient mortality, and discharge disposition. To evaluate for financial strain, we used WA state and US census data to estimate postsubsistence income and OOP expenses for our sample and then applied these two estimates to determine catastrophic health expenditure (CHE) risk as defined by the World Health Organization (OOP health expenses >= 40% of estimated household postsubsistence income). RESULTS A total of 16,801 trauma patients were included. After ME, the Medicaid coverage rate increased from 20.4% to 41.0%, and the uninsured rate decreased from 19.2% to 3.7% (p < 0.001 for both). There was no significant change in private insurance coverage. Medicaid expansion was not associated with significant changes in clinical outcomes or discharge disposition. Estimated CHE risk by payer was 81.4% for the uninsured, 25.9% for private insurance, and less than 0.1% for Medicaid. After ME, the risk of CHE for the policy-eligible sample fell from 26.4% to 14.0% (p < 0.01). CONCLUSION State ME led to an 80% reduction in the uninsured rate among patients admitted for injury, with an associated large reduction in the risk of CHE. However, privately insured patients were not fully protected from CHE. Additional research is needed to evaluate the impact of these policies on the financial viability of trauma centers.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "422ad8da50f4b0505bbed5ef420dac16",
  "timestamp": "2025-05-15T02:32:27.463571"
}