{
  "id": 6933,
  "title": "Disability pension among young women in Sweden, with special emphasis on family structure: a dynamic cohort study",
  "abstract": "Objectives: The influence of family structure on the risk of going on disability pension (DP) was investigated among young women by analysing a short-term and long-term effect, controlling for potential confounding and the 'healthy mother effect'. Design and participants: This dynamic cohort study comprised all women born in Sweden between 1960 and 1979 (1.2 million), who were 20-43 years of age during follow-up. Their annual data were retrieved from national registers for the years 1993-2003. For this period, data on family structure and potential confounders were related to the incidence of DP the year after the exposure assessment. Using a modified version of the COX proportional hazard regression, we took into account changes in the study variables of individuals over the years. In addition, a 5-year follow-up was used. Results: Cohabiting working women with children showed a decreased risk of DP in a 1-year perspective compared with cohabiting working women with no children, while the opposite was indicated in the 5-year follow-up. Lone working women with children had an increased risk of DP in both the short-term and long-term perspective. The risk of DP tended to increase with the number of children for both cohabiting and lone working women in the 5-year follow-up. Conclusions: The study suggests that parenthood contributes to increasing the risk of going on DP among young women, which should be valuable knowledge to employers and other policy makers. It remains to be analysed to what extent the high numbers of young women exiting from working life may be counteracted by (1) extended gender equality, (2) fewer work hours among fathers and mothers of young children and (3) by financial support to lone women with children.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4231f292bb3606c39d65b4100b630827",
  "timestamp": "2025-05-15T03:03:13.457946"
}