{
  "id": 6008,
  "title": "Is It Worth Investing in Tokens? Investment Performance of Digital Tokens in Financial and Axiological Contexts",
  "abstract": "The paper focuses on financial and axiological aspects of the new instrument in the digital economy, such as digital tokens (DTs). The purpose of the article is to examine the investment performance of certain types of DTs. We suggest a categorisation of DTs according to the types of assets that they represent and analyse them in terms of profitability, risk, and effectiveness. The investment performance of different types of DTs was compared with stock market indices and commodity prices. The empirical source of information is data from the coinpaprika platform from January 2018 to July 2022. It occurs that DTs demonstrate, on average, lower investment performance than traditional instruments. However, there is a wide group of the former that can be included in the portfolio as their investment performance is higher than the one represented by stock market assets. Our contribution comprises, first, the extension of existing research on tokenization and tokens to include the investment aspect. Second, we develop and apply the original proposal of DT classification, which takes into account the hitherto neglected aspect of worldview valuation of a given DT type by market participants. Finally, we assess the investment performance of DTs (both in terms of our proposed classification and in the context of stock market indices). We also specify recommendations for investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "423721b2cc6a504ba96d59de8dab5dfb",
  "timestamp": "2025-05-15T02:53:33.504820"
}