{
  "id": 6340,
  "title": "Seroprevalence of camelpox and its associated risk factors in selected districts of Jarar zone, Somali Region, Ethiopia",
  "abstract": "Background: Camelpox is a common viral disease of camelids caused by camelpox virus, which is endemic in most camelid-breeding countries including Ethiopia, and causes major economic losses. This study aimed to quantify the seroprevalence of camelpox and identify associated risk factors to put into practice efficient control strategies for the disease in the study area. Methods: A cross-sectional study was carried out between January and July of 2023. Blood samples were collected from 374 camels of 75 households residing in two districts in six peasant associations. A sandwich enzyme-linked immunosorbent assay was employed to detect camelpox-specific antibodies from sera samples. To identify potential risk factors, camel owners were asked in face-to-face interviews. Results: The overall seroprevalence of camelpox in the study areas was 16.0% (95% confidence interval: 12.0%-20.0%). A multivariable logistic regression analysis revealed risk factors season, age, and sex had an association with seroprevalence of camelpox (p < 0.05). Sex was strongly associated with camelpox seropositivity, with female camels having a 3.2-fold higher risk of infection than male camels. Likewise, age-related vulnerability to infection was observed in young dromedaries, as they were 2.3 times more likely to become infected than adults. Conclusion: This study revealed moderate seroprevalence of camelpox in the study area. Thus, effective preventative strategies, such as vaccination programs to stop the spread of camelpox and reduce the financial losses caused by the disease, should be encouraged.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4237f12c6cae24a3405861009c565d62",
  "timestamp": "2025-05-15T02:57:07.705294"
}