{
  "id": 3589,
  "title": "Household Vulnerability to Climate Change and Identification of Target Beneficiaries to Implement Household-Specific Adaptation Strategies: A Quantitative Assessment",
  "abstract": "This study investigated the climate change vulnerability of 6,214 households in the drought-prone districts of Telangana state in India. Principal component analysis (PCA) and cluster analysis were used to group farm households based on their level of vulnerability to climate change and to suggest a portfolio of adaptation strategies. The PCA revealed the presence of five components from 14 key variables: (1) access to irrigation; (2) credit access, landholding, and income from agriculture; (3) household size and income sources; (4) access to information and climate-smart adaptation practices; and (5) social capital. The first five components (eigenvalue = 1) collectively accounted for 60.42 percent of the total variance. Three clusters emerged after the component scores were analyzed using K-means clustering: extremely vulnerable, moderately vulnerable, and resilient households. The results of the cluster analysis revealed that 79 percent of the households were extremely vulnerable, 11.20 percent were moderately vulnerable, and 9.65 percent were resilient. Moreover, 96 percent of marginal farmers and 94 percent of smallholder farmers were extremely vulnerable, while 19 percent of large farmers and 16 percent of medium farmers were moderately vulnerable. Interestingly, nearly 26 percent in the extremely vulnerable category and 19 percent in the moderately vulnerable category were large farmers, which contradicts previous assumptions. The findings of this study can guide development practitioners, policymakers, and donors in designing evidence-based programs focusing on households vulnerable to climate change.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42408046e689796e957d463987aedfe2",
  "timestamp": "2025-05-15T01:18:20.660937"
}