{
  "id": 5976,
  "title": "Study on Real Estate Industry and Its Contagion to Credit Risk of Commercial Banks",
  "abstract": "The United States subprime mortgage crisis in 2008 ever destructed the financial system, leading to a large number of terrible aftermaths such as the large-scale bank runs, the extreme shortage of money and the bankruptcies of many financial institutions. There exists a strong relationship between the real estate industry and the banking industry, in which the commercial banks provide mortgages to the real estate buyers. And China has seen a rapid development in the real estate business over the last a few years, with the incremental housing loan accounting for more than 50% of the total incremental loans of the banks. Therefore, it's of vital importance to investigate the contagion effects between the two industries in China. This passage, according to the industry classification benchmark set by Shenyin Wanguo, selects 13 real estate companies and 13 commercial banks respectively from Shanghai and Shenzhen stock markets. And it collects the stock prices and some necessary financial data of these companies. After that, based on the data such as equity value E, the stock volatility sigma(E), the point of default DP and the risk-free yield r, this passage uses KMV model and Matlab to calculate the asset value V-A and the vitality of asset value sigma(A), which help to calculate the distances of default, measures of credit risks, from year 2015 to year 2017 of these companies. Finally, setting the minimum support and the minimum confidence, this passage uses Association Rules to do data mining in terms of the figures for distances of default. And I just find that some real estate companies do be strongly relevant to some commercial banks in terms of credit risks. Besides, the contagion effects are stronger within the banking industry than those within the real estate industry.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "424339a4edcb97f3fe9a9d631e9a894b",
  "timestamp": "2025-05-15T02:53:33.369543"
}