{
  "id": 9264,
  "title": "Incremental costs of hospital-acquired infections in COVID-19 patients in an adult intensive care unit of a tertiary hospital from a low-resource setting",
  "abstract": "BackgroundHospital-acquired infections (HAIs) are a global public health problem and put patients at risk of complications, including death. HAIs increase treatment costs, but their financial impact on Serbia's healthcare system is unknown. Our goal was to assess incremental costs of HAIs in a tertiary care adult intensive care unit (ICU) that managed COVID-19 patients.MethodsA retrospective study from March 6th to December 31st, 2020 included patients with microbiologically confirmed COVID-19 (positive rapid antigen test or real-time polymerase chain reaction) treated in the ICU of the Teaching Hospital for Infectious and Tropical Diseases, University Clinical Centre of Serbia. Demographic and HAI-specific data acquired in our ICU were collected, including total and stratified medical costs (services, materials, laboratory testing, medicines, occupancy costs). Median total and stratified costs were compared in relation to HAI acquisition. Linear regression modelling was used to assess incremental costs of HAIs, adjusted for age, biological sex, prior hospitalisation, Charlson Comorbidity Index (CCI), and Glasgow Coma Scale (GCS) on admission. Outcome variables were length of stay (LOS) in days and mortality.ResultsDuring the study period, 299 patients were treated for COVID-19, of which 214 were included. HAIs were diagnosed in 56 (26.2%) patients. Acinetobacter spp. was the main pathogen in respiratory (38, 45.8%) and bloodstream infections (35, 42.2%), the two main HAI types. Median total costs were significantly greater in patients with HAIs (euro1650.4 vs. euro4203.2, p < 0.001). Longer LOS (10.0 vs. 18.5 days, p < 0.001) and higher ICU mortality (51.3% vs. 89.3%, p < 0.001) were seen if HAIs were acquired. Patients with >= 2 HAIs had the highest median total costs compared to those without HAIs or with a single HAI (euro1650.4 vs. euro3343.4 vs. euro7336.9, p < 0.001). Incremental costs in patients with 1 and >= 2 HAIs were euro1837.8 (95% CI 1257.8-2417.7, p < 0.001) and euro5142.5 (95% CI 4262.3-6022.7, p < 0.001), respectively.ConclusionsThis is the first economic evaluation of HAIs in Serbia, showing significant additional costs to our healthcare system. HAIs prolong LOS and influence ICU mortality rates. Larger economic assessments are needed to enhance infection control practices.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "424e061ad1e736b5916d7c6a87e88d39",
  "timestamp": "2025-05-15T03:27:24.904123"
}