{
  "id": 2758,
  "title": "How does venture capital cross-border syndication spur corporate innovation? Evidence from China",
  "abstract": "In recent years, venture capital (VC) cross-border syndication has shown an obvious growth trend. Based on the existing studies, this paper explores the impact of VC cross-border syndication on corporate innovation. We also examine the mediating roles of cross-border quadratic relationship closure (CBQRC) formed by the strategic cooperation relationship between the respective portfolio companies of domestic and foreign VCs. This paper conducted an empirical analysis to test our hypotheses using a sample of first-round investments in domestic firms by domestic VC firms from 2014 to 2016. Results show that the more investment events of VC cross-border syndication or the more partners of VC cross-border syndication, the more likely it is to have a significant positive impact on the innovation of domestic portfolio companies. CBQRC plays a mediating role between VC cross-border syndication on corporate innovation. Results remain robust after removing endogeneity using the instrumental variables approach and removing sample selection bias using Heckman two-stage regression. Results deepen the understanding of the relationship between VC cross-border syndication and corporate innovation and provide essential guidance to domestic VC firms promoting corporate innovation in open partnerships.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42505b1cb62a502af7ccb14bc293067b",
  "timestamp": "2025-05-15T01:10:16.466371"
}