{
  "id": 2099,
  "title": "The best mirror of the students' longitudinal performance: Portfolio or structured oral exam assessment at clerkship?",
  "abstract": "Objective This study aimed to compare the strength of association (i.e., explained variability) of the cumulative grade point average (GPA) with the grades obtained in the clerkship portfolio and the final structured oral exam by dental students. Methods A prospective longitudinal study was designed to analyze quantitative data from three cohorts of dental school students. Univariate and multivariate linear regression models were built to evaluate the association between the students' cumulative GPA with the grades obtained in their clerkship portfolio and the final structured oral exam. Results In total, 171 students in the last year of the undergraduate program were considered (76% women, age average 24.8 +/- 1.6 years). The dental students' grades of both portfolio and structured oral exam were significantly associated with the GPA score but with different strengths of association. The clerkship portfolio was more strongly associated with cumulative GPA than the structured oral exam (R-2 = 19.6% versus R-2 = 7.6%). On the opposite, the association between the structured oral exam and GPA can be interpreted as a lower precision in its practical significance and thus reflecting different concurrent validity. Conclusions Considering the results of this study, it could probably incline the balance toward the portfolio because it may be closer to a programmatic assessment model, with timely feedback, development of metacognition, and the achievement of formative process measurement rather than evidence of a single instance of examination.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "425a2f184f388947517c3db2e4370861",
  "timestamp": "2025-05-15T01:03:03.634280"
}