{
  "id": 3004,
  "title": "The Impact of Artificial Intelligence in the World of Finance: A Bibliometric Study",
  "abstract": "The current research focuses on how artificial intelligence (AI) is influencing decision-making, risk management, and the provision of financial services in the financial industry. The use of sophisticated algorithms, big data analytics, and machine learning has transformed the process of making financial forecasts, detecting fraud, and making investments. Globally, technological innovation has improved the efficiency and availability of top-notch financial services, but it has also brought up moral and legal concerns. The goal of the study, which used a bibliometric technique and the Scopus database, was to identify new scientific trends about the impact of artificial intelligence on finance. The results showed that, in recent years, there has been a notable annual rise in scholarly production on this issue of 3.62%. 464 writers and 207 sources were found to be engaged in these articles; the number of authors increased noticeably in 2020, 2011 and 2023. With 14% of publications, China dominated the world in scientific productivity, followed by the US, India, and other nations. The most pertinent journals in this topic were Sustainability (Switzerland) and Lecture Notes in Networks and Systems, each of which had four articles. Universities that have contributed to the body of knowledge on this subject include Universitas Negeri Semarang, Uttaranchal University, and Spiru Haret University. Lebonte M., Irfan M., and Morrison were the most important authors; all three made a substantial impact. It was discovered that 2.29% of scientists working in this area interacted with scientists abroad. The report concludes by giving a summary of the current level of research on the effects of artificial intelligence in finance, highlighting areas of interest and emphasizing the significance of further research to solve problems and take advantage of opportunities in this rapidly developing field.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42709a97e18fce11e704f4d34c493ef6",
  "timestamp": "2025-05-15T02:21:19.297261"
}