{
  "id": 7154,
  "title": "The efficiency of the European banking groups and its determinants",
  "abstract": "Purpose - The purpose of this paper is twofold. First, it aims to measure and compare the efficiency change of French, German, Italian, Spanish and UK banking groups in a context of financial crisis, over the period 2006-2010; second, it attempts to analyse the internal and environmental determinants of banking groups efficiency. Design/methodology/approach - In this paper the efficiency is estimated by a two-stage semi-parametric procedure. In the first stage, we build a common production frontier across countries using the data envelopment analysis (DEA) (Debreu, 1951; Farrell, 1957). To further analyse the efficiency changes over years we use the Malmquist total factor productivity index, based on DEA technique. In the second stage, in order to determine the factors that impact on bank efficiency, the authors perform a bootstrapped truncated regression model with discretionary inputs as independent variables, following Simar and Wilson (2007). Findings - The empirical results show that overall the large banking groups are more efficient than the small ones. However the Malmquist total factor productivity analysis highlights that during the crisis, in particular between 2007 and 2009, unless Britain, in all countries the small banks show a better cost performance than the larger ones. In general, the authors find a moderate efficiency convergence between countries and between large and small banking groups. As regards the determinants of banking groups efficiency, we find that more liquid, less capitalized banking groups and those more oriented towards the traditional activity of lending are more efficient. Practical implications - The authors find a positive and high statistically significant relationship between both long-and short-term liquidity degree and the cost efficiency of the banking groups. The policy implication of this result is very significative also in the light of the new banking regulation introduced by Basel III that imposes new rules to strengthen the liquidity risk management. Social implications - The authors find that the macroeconomic environment variables have some impact on efficiency: the higher the debt and the GDP per capita of the country the lower the bank's efficiency. Originality/value - Unlike the most literature on this topic, that usually considers individual banks even if they belong to the same financial conglomerate, the authors analyse only banking groups. In particular, the authors consider all banking groups belonging to the most industrialized European countries in a context of financial crisis and cross-border aggregation movements. Furhermore the authors compare cross-country cost performance of small and large groups, considering the loan loss provisions as an additional input in order to correct the efficiency score for credit risk.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42794922f447dcd5900b0dae79e664cb",
  "timestamp": "2025-05-15T03:05:32.101323"
}