{
  "id": 2926,
  "title": "Risk disclosure, income smoothing and firm risk",
  "abstract": "Purpose Evidence on whether firms with higher risk choose a more transparent or more opaque risk reporting strategy in their annual reports is mixed. A potential explanation is that firms choose an alternative reporting strategy to risk disclosure, namely income smoothing. The purpose of this paper is to investigate the association between both strategies in relation to firm risk levels. Design/methodology/approach The authors use a balanced sample of 74 non-financial UK firms from the FTSE100 index over the period 2005-2015, examining the association between firm risk measures and both risk disclosure and income smoothing using a seemingly unrelated regression methodology. Findings The authors find that firm financial risk measures are positively associated with both risk disclosure and income smoothing, implying a complementary association. Furthermore, non-risk-related factors are associated with both lower levels of risk disclosure and higher income smoothing, implying a substitutive effect. Research limitations/implications The authors do not consider other factors such as managerial optimism, managerial financial incentives and analysts' earnings forecasts which might influence the association between risk disclosure and income smoothing, and hence, this may be a limitation of the current study. Practical implications These results are important to regulators, investors and boards of directors who are interested in understanding the alternative reporting strategies that managers select when faced with high risk. The findings signal a need for closer regulatory scrutiny on not only the level of risk disclosure but also the financial reporting choices. Originality/value The authors extend the literature on the reporting versus recognition decisions made by managers.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "427e1eccfa6331aa836bbb120ef13ff3",
  "timestamp": "2025-05-15T02:20:48.134078"
}