{
  "id": 3779,
  "title": "INFLUENCE OF INTERNATIONALIZATION ON THE CORPORATE SUSTAINABILITY INDEX",
  "abstract": "Studies recognize that internationalization can be seen as a key factor for industrial competitiveness and economic growth in the age of globalization. The objective of the study is to verify how the internationalization of Brazilian companies influences the adherence to the corporate sustainability index from 2010 to 2018. A descriptive, documentary and quantitative research was carried out. Data were obtained from the B3 website, the Dom Cabral Foundation website and the Economatica (R) database. The analyzes were made with the aid of the logistic regression technique. The results show that companies with higher levels of internationalization are more likely to adhere to the ISE portfolio of corporate sustainability. The control variables used in the study, return on assets, company size, EBITDA and earnings per share, were not significant in the proposed model. Transnational corporations, by adhering to sustainable practices, can distinguish themselves from others, increasing their technological and innovative strength, as well as their competitiveness in the global market. In this scenario, both national and international stakeholders play a fundamental role regarding their relationship with the economic, environmental and social performance of organizations, corroborating internationalization.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42840458f1afa8ed45c448e2b7c75c46",
  "timestamp": "2025-05-15T01:20:36.115990"
}