{
  "id": 8446,
  "title": "A longitudinal study of psychological distress in the United States before and during the COVID-19 pandemic",
  "abstract": "The COVID-19 pandemic has caused financial stress and disrupted daily life more quickly than any prior economic downturn and on a scale beyond any prior natural disaster. This study aimed to assess the impact of the pandemic on psychological distress and identify vulnerable groups using longitudinal data to account for pre pandemic mental health status. Clinically significant psychological distress was assessed with the Kessler-6 in a national probability sample of adults in the United States at two time points, February 2019 (T1) and May 2020 (T2). To identify increases in distress, psychological distress during the worst month of the past year at T1 was compared with psychological distress over the past 30-days at T2. Survey adjusted logistic regression was used to estimate associations of demographic characteristics at T1 (gender, age, race, and income) and census region at T2 with within-person increases in psychological distress. The past-month prevalence of serious psychological distress at T2 was as high as the past-year prevalence at T1 (10.9% vs. 10.2%). Psychological distress was strongly associated across assessments (X2(4) =174.6, p < .0001). Increase in psychological distress above T1 was associated with gender, age, household income, and census region. Equal numbers of people experienced serious psychological distress in 30-days during the pandemic as did over an entire year prior to the pandemic. Mental health services and research efforts should be targeted to those with a history of mental health conditions and groups identified as at high risk for increases in distress above pre-pandemic levels.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "428508126bc59cc0310a6784c02efcc2",
  "timestamp": "2025-05-15T03:18:51.665234"
}