{
  "id": 4751,
  "title": "Determinants of catastrophic health expenditure in Nigeria",
  "abstract": "Catastrophic health expenditure is a measure of financial risk protection and it is often incurred by households who have to pay out of pocket for health care services that are not affordable. The study assessed the determinants of catastrophic health expenditure among households in Nigeria. Secondary data from the Harmonized Nigeria Living Standard Survey (HNLSS) of 2009/10 was utilized to assess factors associated with catastrophic health expenditure in Nigeria. Household and individual characteristics associated with catastrophic health expenditure were determined using bivariate analysis and multivariate logistic regression. Results showed that irrespective of the threshold for the two concepts of total household expenditure and non-food expenditure, having household members aged between 6 and 14 years, having household members aged between 15 and 24 years, having household members aged between 25 and 54 years, having no education, having primary education, having secondary education, lack of health insurance coverage, visiting a private health facility, households living in north central zone, households living in north east zone and having household members with non-chronic illnesses were factors that increase the risk of incurring catastrophic health expenditure among households. Policy-makers and political actors need to design equitable health financing policies that will increase financial risk protection for people in both the formal and informal sectors of the economy.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4286be75edd03ed563116f99354bdfa4",
  "timestamp": "2025-05-15T02:40:27.979326"
}