{
  "id": 4356,
  "title": "Environmental laws in France: What are the effects of the Grenelle laws on firms?",
  "abstract": "The aim of this paper is to analyze the effects of Grenelle I and Grenelle II laws on financial performance, social performance, and risk-taking in France. The study is focussed on SBF120 (The SBF120 index consists of the 120 largest capitalizations listed on the French Stock Exchange market (SBF: Societe des Bourses Francaises)) firms between 2005 and 2016. It provides the following results: first, it shows that after the introduction of the Grenelle I and II laws, financial performance decreased while corporate risk increased, particularly in low polluting industries. One explanation for this is that Grenelle laws are based on the comply or explain principle which may lead to adaptative and interpretative disclosure strategies. In addition, environmental regulations may involve high costs of compliance. In the short-term, environmental disclosure regulations do not drive businesses to improve their social performance: they have not been able to undertake socially and environmentally responsible projects based on good governance practices. Using the Environmental Policy Stringency EPS index to measure the stringency of environmental policy, we show that international binding laws such as the Paris Agreement, unlike locally binding Grenelle laws, are able to enhance the overall social performance through the environmental, social and governance channels. In the long-term, Grenelle laws show effective results on the environmental performance and the quality of governance which enhance the overall social performance without impairing the financial one. Finally, quantile regression analysis provides evidence that businesses are likely to increase their environmental performance at the expense of low financial and overall social performances.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "428bdd550026594b83f81f4d9b3a6d91",
  "timestamp": "2025-05-15T02:36:05.268111"
}