{
  "id": 8216,
  "title": "Can institutional investors influence media sentiment?",
  "abstract": "PurposeThe dissemination of misleading and false information through media can jeopardize a company's reputation, thus posing a threat to its stock and performance. Institutional investors are known to influence capital markets. Therefore, this paper investigates whether institutional investors engage in shaping the media sentiment stock nexus, stabilize company stocks and enhance performance.Design/methodology/approachWe first investigate the effect of media sentiment on market reactions by using panel regression models. To examine the role of institutional investors, we design a quasi-experiment by exploiting the Financial Crisis of 2008 and go further by examining the heterogeneity across levels of institutional ownership. Due to risk-averse, investors may respond asymmetrically to pessimistic and positive sentiment. Accordingly, we split the sample into two sub-types, good news and bad news, based on keywords representing positive or negative content.FindingsWe find supportive evidence that institutional investors have impacts on how the markets react to media news, and the impacts are heterogeneous in the face of bad and good news. We conjecture that institutional investors act as a stabilizer of stock prices through media sentiment management.Originality/valueThis paper confirms the distinctive effects of institutional investors on capital markets, and uncovers the behind-the-scenes intervention and possible causal link running from institutional investors to media sentiment management. It contributes to the broad field of institutional investors' behavior, media news involvement in capital markets and market efficiency.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42927f01033175fc8b83390d365ea64c",
  "timestamp": "2025-05-15T03:16:48.846866"
}