{
  "id": 3928,
  "title": "Through entrepreneurs' eyes: the Fab-spaces constellation",
  "abstract": "Fabrication spaces (Fab-spaces) provide individuals with access to numerous manufacturing equipment (including additive manufacturing), to carry out different types of projects. Although scholars are starting to speculate about the importance of these new organisational forms and their potential for future distributed innovation and production ecologies, this phenomenon is still largely unexplored. Building on existing multidisciplinary research, this paper offers the first empirical analysis of existing fab-spaces as providers of knowledge and production competencies. Amongst all the possible perspectives to derive a framework, we choose that of fab-space users who have an entrepreneurial intention. After deriving an analytical framework to position fab-spaces in the current academic discourse, the paper develops a classification, which considers the competences available to entrepreneurs, via fab-spaces, in conjunction with how these competences are provided. The resulting map reveals the complementarities amongst the different fab-spaces. It also shows that the current portfolio of fab-spaces supports mainly the distribution of innovation across locations and social groups. Several types of fab-spaces are currently well placed to support the transition from innovation to manufacturing, but their geographical distribution and range of manufacturing capabilities are not yet enough to provide a fully distributed manufacturing model. This study has practical consequences for entrepreneurs, in the better identification of the appropriate fab-spaces for their needs, and for policy-makers, to help position the different types of fab-spaces as elements for national systems of innovation and production.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4298f23b7099aba08882bca14a534893",
  "timestamp": "2025-05-15T01:22:11.941217"
}