{
  "id": 8249,
  "title": "Unintended childbearing, maternal beliefs, and delay of prenatal care",
  "abstract": "Background: Delay of prenatal care is an important risk for poor birth outcome, yet its association with maternal knowledge and beliefs remains insufficiently studied. This research examined the relationship of unintended childbearing and beliefs about the importance of prenatal care with initiation after the first trimester, adjusting for key sociodemographic determinants. Methods: One hundred fifty-four Texas hospitals accounting for 80 percent of state births were asked to collect surveys from all women delivering infants during a one-week interval in 1986. Seventy-four percent of hospitals and 70 percent of women participated (n = 2032). No differences occurred between the sample and the population on rates of delayed care and low birthweight or maternal demographics. Results: Since delayed prenatal care is more frequent among low-income women, analyses were limited to those below the 200 percent poverty level. After adjustment for maternal age, marital status, education, parity, race, and health insurance status employing logistic regression, unintended births were 1.6 times more likely to involve delayed care. Mothers who believed prenatal care was unimportant were 2.1 times more likely to delay care. the coefficients exceeded or about equaled those for the covariates. Conclusions: Preconception education about the value of prenatal care and family planning programs to prevent unintended pregnancies should be conducted together with efforts to overcome financial and structural barriers if progress toward national prenatal care objectives is to be achieved.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4299461dfbeb9bf829b1602d8cdcf94a",
  "timestamp": "2025-05-15T03:16:49.009856"
}