{
  "id": 570,
  "title": "Heavy metals prediction system in groundwater using online sensor and machine learning for water management: the case of typical industrial parK",
  "abstract": "With the expansion of human industrial activities, heavy metal contamination in groundwater environments has become increasingly severe. Environmental management agencies invest significant financial resources into groundwater monitoring, primarily due to its inherent invisibility. Automatic monitoring is a new way to monitor groundwater, the existing sensors often can only achieve simple indicators, and it is difficult to achieve complex indicators such as heavy metals. This study integrated pH and conductivity online monitoring probes with machine learning algorithms to develop a real-time, automated heavy metal prediction system for groundwater. The predictive performance demonstrated that the highest R-2 values for chromium (Cr), nickel (Ni), and copper (Cu) were 0.73, 0.78, and 0.87, respectively, with mean absolute errors of 11.9, 0.83, and 1.02 mu g/L. While random forest and extreme gradient boosting (XGB) models demonstrate greater robustness. To enhance the practicality and management significance of the prediction system, interval prediction is employed. Uncertainty assessment results indicate that the performance order of prediction intervals across different models is XGB > Random Forest > Multiple Linear Regression (MLR) > Backpropagation neural network (BP). We proposed that Groundwater risk is acceptable when the prediction interval of pollutants falls below regional screening levels. The integration of automated sensors with machine learning algorithms can offer advanced recommendations for long-term environmental monitoring.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42a945a831043c2fb45be0e900b32642",
  "timestamp": "2025-05-15T01:52:49.386218"
}