{
  "id": 7,
  "title": "A preliminary test of ChatGPT's ESG literacy",
  "abstract": "PurposeMotivated by recent research on the pivotal role of artificial intelligence (AI) in the interplay of financial activities and ESG issues, we examine ChatGPT's ability to assist the public, investors, corporate boards, shareholders and companies with ESG-related issues.Design/methodology/approachWe conduct a preliminary test of ChatGPT's knowledge of ESG by feeding ChatGPT with questions from three sources: Bloomberg, Corporate Finance Institute and Alison.com. We compare ChatGPT-4o mini to random guessing, Google's Gemini and ChatGPT-4o. We test ChatGPT-4o mini's familiarity with Bloomberg terminal functions related to ESG.FindingsWe find ChatGPT's accuracy is 100% on Bloomberg questions. We also find that ChatGPT-4o mini's performance is slightly better than that of Gemini and ChatGPT-4o. However, we document that ChatGPT-4o mini sometimes fabricates non-existing functions, which is evidence of hallucinations, a built-in flaw of ChatGPT. Lastly, we show that ChatGPT-4o mini can analyze Bloomberg terminal screen images, assess companies' actual ESG reports and draft CEO compensation contracts with integrated ESG metrics.Originality/valueOur study is the first attempt to test ChatGPT's knowledge in the domain of ESG. Our findings suggest the potential use of ChatGPT by the public to educate themselves on ESG issues, by investors to integrate ESG in portfolio construction, by corporate boards to incorporate ESG metrics in CEO compensation contracts, by companies to file ESG reports to regulators, by ESG-conscious shareholders to engage the management, etc.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "LLMs",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42b46a71fa4efd6ff8ed16f8bfc07f44",
  "timestamp": "2025-05-15T00:38:16.142742"
}