{
  "id": 7532,
  "title": "Age and Frailty Influence Hip and Knee Arthroplasty Reimbursement in a Bundled Payment Care Improvement Initiative",
  "abstract": "Background: The Bundled Payment Care Improvement (BPCI) initiative aims to improve quality of patient care while mitigating cost. How patient age and frailty affect reimbursement after hip and knee total joint arthroplasty (TJA) is not known. This study evaluates if patient age and frailty affect cost of care. Methods: A retrospective review of prospectively collected data of 1821 patients undergoing TJA at our institution under the BPCI initiative was performed from 2013 to 2016. We recorded demographics for patients and calculated their modified frailty index (mFI). Cost of care was obtained for each patient. Statistical analyses included t-test and analysis of variance to evaluate age and frailty as independent categorical variables. Beta coefficients were utilized to evaluate age as a continuous variable. Multivariate linear regression models evaluated age and frailty's combined contribution to cost. Results: Age was evaluated as a categorical variable, with the median age of our sample population the categorical cutoff. Age >= 72 years and increasing mFI score were associated with statistically significant increased cost. Increasing age demonstrated a statistically significant increase in cost of 0.68% per incremental age increase. Multivariate evaluation of increasing age and mFI revealed a statistically significant increase in cost for mFI score >= 2. Conclusion: Increasing age and frailty increase cost associated with TJA. The BPCI initiative oversimplifies the cost associated with TJA. Concerningly, this information could deincentivize care to older, higher risk patients. Objective patient-specific and risk-adjusted stratification of BPCI pricing is necessary to be considered as a valid financial model. (c) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42b672a9cb5d37add3be23f08919ca9f",
  "timestamp": "2025-05-15T03:09:36.886104"
}