{
  "id": 6378,
  "title": "Demographic and Clinical Factors Associated With Health-Related Quality-of-Life Profiles Among Prostate Cancer Survivors",
  "abstract": "PURPOSEOur purpose was to describe the prevalence and predictors of symptom and function clusters related to physical, emotional, and social components of general health-related quality of life (HRQOL) in a population-based sample of prostate cancer (PCa) survivors.METHODSParticipants (N = 1,162) completed a baseline survey at a median of 9 months after diagnosis to ascertain the co-occurrence of eight symptom and functional domains that are common across all cancers and not treatment-specific. We used latent profile analysis (LPA) to identify subgroup profiles of survivors with low, moderate, or high HRQOL levels. Multinomial logistic regression models were used to identify clinical and sociodemographic factors associated with survivors' membership in the low versus moderate or high HRQOL profile.RESULTSThe LPA identified 16% of survivors who were categorized in the low HRQOL profile at baseline, indicative of the highest symptom burden and lowest functioning. Factors related to survivors' membership in the low versus higher HRQOL profile groups included less than age 65 years at diagnosis, identifying as non-Hispanic Black race, not working, being a former versus never smoker, systemic therapy, less companionship, more comorbidities, lower health care financial well-being, or less spirituality. Several factors remained associated with remaining in the low versus higher HRQOL profiles on the follow-up survey (n = 699), including younger age, Black race, comorbidity, and lower financial and spiritual well-being.CONCLUSIONAbout one of six PCa survivors experienced elevated physical and psychosocial symptoms that were independent of local curative therapy, but with younger age, race, comorbidity, and lower financial and spiritual well-being as stable risk factors for poor HRQOL over time. About 16% of prostate cancer survivors experience concurrent physical and mental health symptoms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42c3f1c286c016588a7898d1182eaa3e",
  "timestamp": "2025-05-15T02:57:38.723688"
}