{
  "id": 865,
  "title": "Hybridized artificial neural network classifiers with a novel feature selection procedure based genetic algorithms and information complexity in credit scoring",
  "abstract": "The credit scoring is a statistical analysis performed by financial institutions to represent the creditworthiness of an individual or small and medium-sized enterprise. A credit score is a numerical quantity that can be qualified by a rating label showing the potential risk. In order to determine which customers are likely to bring in the most revenue at the exact interest rate and credit limits, the lenders take into accounts these credit scores. In this context, the robust statistical models are inevitable to reduce the number of wrong decisions in the credit evaluation process. Although the machine learning approaches provide superior performance to conventional statistical methods, they are mostly criticized due to the selection of model structure, model complexity, tuning parameters, time consumption in the high-dimensional and excessive nonlinear cases. For this reason, this study introduces an efficient model estimation and feature selection procedure for artificial neural network (ANN) classifiers in the context of credit scoring. Essentially, this procedure hybridizes training of ANNs with a novel feature selection approach based on genetic algorithms and information complexity criterion. In the application, the proposed procedure was performed on a couple of benchmark credit scoring datasets. According to analysis results, the proposed approach not only estimates robust models from ANNs in terms of model complexity, feature selection, and time consumption, but also outperforms the traditional training procedure for the classification accuracies, false positive, and false negative errors overtraining and test datasets.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42dfea0a2d9578d21cf7004b050ce47c",
  "timestamp": "2025-05-15T01:56:17.464381"
}