{
  "id": 6937,
  "title": "At-Risk/Problematic Shopping and Gambling in Adolescence",
  "abstract": "Elevated levels of both pathological gambling (PG) and problem shopping (PS) have been reported among adolescents, and each is associated with a range of other negative health/functioning measures. However, relationships between PS and PG, particularly during adolescence, are not well understood. In this study, we explored the relationship between different levels of problem-gambling severity and health/functioning characteristics, gambling-related social experiences, gambling behaviors and motivations among adolescents with and without at-risk/problematic shopping (ARPS). Survey data from Connecticut high school students (n = 2,100) were analyzed using bivariate analyses and logistic regression modeling. Although at-risk/problematic gambling (ARPG) was not increased among adolescents with ARPS, adolescents with ARPG (vs non-gamblers) were more likely to report having experienced a growing tension or anxiety that could only be relieved by shopping and missing other obligations due to shopping. In comparison to the non-ARPS group, a smaller proportion of respondents in the ARPS group reported paid part-time employment, whereas a greater proportion of respondents reported excessive gambling by peers and feeling concerned over the gambling of a close family member. In general, similar associations between problem-gambling severity and measures of health/functioning and gambling-related behaviors and motivations were observed across ARPS and non-ARPS adolescents. However, associations were weaker among ARPS adolescents for several variables: engagement in extracurricular activities, alcohol and caffeine use and gambling for financial reasons. These findings suggest a complex relationship between problem-gambling severity and ARPS. They highlight the importance of considering co-occurring risk behaviors such as ARPS when treating adolescents with at-risk/problem gambling.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42e129842c8d421692f761b896202954",
  "timestamp": "2025-05-15T03:03:13.475608"
}