{
  "id": 488,
  "title": "BPM governance: a literature analysis of performance evaluation",
  "abstract": "Purpose - The purpose of this paper is to collect data and select a bibliographic portfolio (BP) of the literature on the performance evaluation of business process management (BPM) governance, in order to highlight studies aligned with business process governance, and with scientific recognition and its bibliometric parameters. Design/methodology/approach - The research method is qualitative and the process of identification, selection, and analysis of the articles in the BP took place through evaluation and interpretation by the authors of this research. Regarding data collection, this research used primary data in the selection of the BP, and secondary data when the authors analyzed the articles. Findings - The paper selects a set of 19 articles with scientific recognition and aligned with the research topic, which refers to the performance evaluation of BPM governance. This set is called the BP, and highlights and contains the most often present journals, articles, authors, and keywords found in the search performed by the authors. Originality/value - This research uses thorough procedures for the selection process that differ from traditional procedures: the selection process is structured in a way that allows checking of each research stage; the research topic is fragmented into many areas of study and the search is carried out simultaneously in all these areas; and the researchers interact with the search process and as they expand their learning they adjust the search direction.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "42ef7a40ee9baf9dfbbea8e928bbc7e3",
  "timestamp": "2025-05-15T00:36:26.597869"
}