{
  "id": 7789,
  "title": "Reducing Disparities in Receipt of Genetic Counseling for Underserved Women at Risk of Hereditary Breast and Ovarian Cancer",
  "abstract": "Purpose: Genetic counseling (GC) provides critical risk prediction information to women at-risk of carrying a genetic alternation; yet racial/ethnic and socioeconomic disparities persist with regard to GC uptake. This study examined patterns of GC uptake after a referral in a racially diverse population. Materials and Methods: In an urban academic medical center, medical records were reviewed between January 2016 and December 2017 for women who were referred to a genetic counselor for hereditary breast and ovarian cancer. Study outcomes were making an appointment (yes/no) and keeping an appointment. We assessed sociodemographic factors and clinical factors. Associations between factors and the outcomes were analyzed using chi square, and logistic regression was used for multivariable analysis. Results: A total of 510 women were referred to GC and most made appointments. More than half were white (55.3%) and employed (53.1%). No significant associations were observed between sociodemographic factors and making an appointment. A total of 425 women made an appointment and 268 kept their appointment. Insurance status (p = 0.003), marital status (p = 0.000), and work status (p = 0.039) were associated with receiving GC. In the logistic model, being married (odds ratio [OR] 2.119 [95% confidence interval, CI 1.341-3.347] p = 0.001) and having insurance (OR 2.203 [95% CI 1.208-4.016] p = 0.021) increased the likelihood of receiving counseling. Conclusions: Racial disparities in GC uptake were not observed in this sample. Unmarried women may need additional support to obtain GC. Financial assistance or other options need to be discussed during navigation as a way to lessen the disparity between women with insurance and those without.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43003a289b6b8c1b1bdbbc91328b7dac",
  "timestamp": "2025-05-15T03:12:11.620508"
}