{
  "id": 4129,
  "title": "Asset pricing models in South Africa: A comparative of regression analysis and the Bayesian approach",
  "abstract": "This study investigated the risk-return relationship using the Capital Asset Pricing Model (CAPM), Carhart four-factor Model (C4FM) and Fama and French Multifactor Models (FFMMs): F3FM and F5FM. This study analyzed the JSE ALSI returns of the South African market, in relation to the risk factors constructed by the data of twenty-six emerging markets, over the sample period from October 2000 to October 2021. The methodology employed was a comparison of the conventional regression analysis and novel Bayesian approach. Regression analysis estimated by Ordinary Least Squares (OLS) is one of the foremost methods used in South Africa. However, such an approach does not take into account the properties of the price data, namely, the asymmetric, volatile and random nature. While the Newey-West adjustment is one way to assist in capturing autocorrelation and volatility, it fails to consider asymmetry. The Bayesian approach accounts for all the aforementioned properties, overcoming the fundamental flaws of regression analysis. The additional model diagnostics highlighted in this study improved the Bayesian approach' robustness. The risk factors of the FFMMs estimated by regression analysis, with and without the Newey-West adjustment, were insignificant, whereas the Bayesian test results were significant. This finding clearly highlighted that model choice impacts the significance of parameter estimation and the financial decisions of investors, firms and policymakers. Jensen's alpha revealed CAPM to be optimal but none of the asset pricing models fully captured the risk premia. Thus, returns should be investigated with different risk measures for future research purposes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "430c2e510959c0c962dae63d0fed96e8",
  "timestamp": "2025-05-15T02:33:42.030537"
}