{
  "id": 9257,
  "title": "Psychological factors and asthma quality of life: a population based study",
  "abstract": "Background: Reports of psychological conditions in asthmatic subjects have been limited to certain population groups or convenience samples. A study was undertaken of the prevalence of psychological distress in asthma in the general population and its associations with quality of life. Methods: The WANTS Health and Well-being Survey is a population household interview survey of adults (age >18) in Western Australia, the Northern Territory, and South Australia. Data obtained were weighted to the closest census data to provide population representative estimates. Positive answers to two questions: Have you ever been told by a doctor that you have asthma?'' and Do you still have asthma?'' determined current doctor-diagnosed asthma. Other items included the SF-12, the Kessler-10 index of psychological distress, questions on feelings of lack of control in different areas of life, and on mental health conditions. Results: From the available sample of 10080, 7619 interviews were completed (participation rate 74.8%), with 834 people reporting current doctor-diagnosed asthma (11.2%). Psychological distress was more frequent in those with asthma (17.9% v 12.2%, p<0.01) and a higher proportion with asthma were at higher risk for anxiety or depression (40.5% v 31.2%, p<0.01). Mental health conditions were also more common (16.2% v 10.8%, p<0.01), as was the frequency of those who sometimes or always felt a lack of control over their health (33.5% v 24.3%, p<0.01). People with both asthma and psychological distress had significantly lower scores on the SF-12 physical component summary (PCS) than those with either asthma or distress alone. Among those with psychological distress, mental component summary (MCS) scores did not differ between asthmatic and non-asthmatic respondents. In a multiple regression model the frequency of a feeling of lack of control over health-together with age, family's financial situation, education level, and number of days partially unable to work or perform usual duties-was significantly associated with scores on the PCS (r=0.73, adjusted r(2)=0.54). Conclusion: These results, from a representative population sample, show that psychological distress and decreased feelings of control are common in asthma and are significantly associated with physical health status.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43230ed4106cb98a5273c3c41283d182",
  "timestamp": "2025-05-15T03:26:54.624236"
}