{
  "id": 1442,
  "title": "Developing a Security Risk Assessment based Smart Beta Portfolio Model for Robo Advising",
  "abstract": "Our study develops a unique Security Risk Assessment based Smart Beta (SB) portfolio construction model for Robo Advising investors belonging to different risk categories. This model will cater to the Gen Z tech-savvy retail investors who have become more active and are interested in online investment platforms like Robo Advising. Our study differs from prior studies as it proposes a portfolio construction model for equity investors belonging to different risk categories while traditional approaches map debt portfolios to low risk investors and equity portfolios to high risk investors. Investors are generally risk-averse but prior studies have developed SB portfolios without considering their risk appetite. In this study, we assess the riskiness of stocks and then categorise them into different risk categories by mapping SB factors such as quality, value, alpha, momentum, etc. We further construct SB portfolios that minimise risk for each category of stocks to cater to investors belonging to low, moderate, high, as well as very high risk categories, using Machine Learning (ML) algorithms. Through a wide range of risk and return performance indicators, we provide evidence that our model offers higher returns at lower risk than humanmanaged portfolios. Our model proves to be more reliable and encourages Robo Advisors to offer SB portfolios catering to retail investors' needs and their risk appetite. The study contributes to the evolving literature on Robo Advising, SB investing and to the debate on whether algorithms can replace human portfolio managers. (4)",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43245aac2c0de5f573e59374f7832811",
  "timestamp": "2025-05-15T00:56:08.243473"
}