{
  "id": 7799,
  "title": "Investigating the factors driving the adoption of a combination of water- and nutrient-smart and soil fertility-smart agricultural practices",
  "abstract": "Community food security under climate change can be achieved through the adoption of climate-smart agriculture (CSA) practices and transform agricultural systems into efficient and development-oriented systems. Farmers can adopt a number of CSA practices simultaneously to mitigate the negative effects of climate change. However, the adoption rate of these practices by farmers in developing countries is low, and only a small number of practices have been adopted by farmers. Also, adoption and long-term voluntary use of CSA practices by farmers is affected by a varied range of government policies, technologies, farm structures, environmental, social, financial and capital conditions, and economic characteristics, attitudes and motivations. Accordingly, the present study uses Poisson regression to identify the factors driving farmer behaviour, including socio-economic, environmental, social-capital and psychological elements influencing the number of water- and nutrient-smart (WNS) and soil fertility-smart (SFS) agriculture practices. For this purpose, Jiroft county in Kerman province in Iran was selected as the study area, and data were collected using a questionnaire from 408 farmers during 2020-2021. The results indicated that age, off-farm income and access to water resources have significant negative impacts on the number of WNS practices; that farm size, farm income and rainfall have significant positive impacts on the number of SFS practices; and that climate-related beliefs, risk perception of climate change and access to extension services have significant positive effects on the number of both WNS and SFS practices. We suggest the implementation of policies to improve farmers' income, promote awareness and risk perception of climate change, and develop extension services to increase the adoption of WNS and SFS solutions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43288cdf4d9751162a47b365e98edd68",
  "timestamp": "2025-05-15T03:12:11.677126"
}