{
  "id": 4079,
  "title": "Elder Abuse and Neglect Risk Alleviation in Protective Services",
  "abstract": "Little is known about conditions associated with favorable elder mistreatment (EM) case outcomes. The fundamental goal of EM protective service programs is to alleviate risk associated with substantiated cases of elder abuse and neglect. Using the EM socio-cultural model, this study examined victim, perpetrator, victim-perpetrator relationship, social embeddedness, and socio-cultural factors predicting risk alleviation of EM cases. Data from a random sample of EM protective social service cases (n = 250) at a large community agency in New York City were collected and coded by multiple, independent raters. Multinomial and binary logistic regression were used to examine undifferentiated risk alleviation for the entire sample of EM cases as well as differentiated financial, emotional, and physical abuse sub-types. Undifferentiated EM risk alleviation was associated with male victim gender, older victim age, previous community help-seeking, and victim-perpetrator dyads characterized by a separate living arrangement and shorter term abuse longevity. Financial abuse cases with younger perpetrators were less likely to have risk reduction. Physical abuse risk reduction was less likely when the perpetrator was male and the victim-perpetrator dyad included different genders. Distinct findings across EM sub-types suggest a need to develop targeted practice strategies with clients experiencing different forms of EM. Findings highlight a need to develop EM protective service infrastructure around perpetrator rehabilitation.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4328a9672000fe11e778a72f68a1042f",
  "timestamp": "2025-05-15T02:33:03.390384"
}