{
  "id": 8015,
  "title": "Economic costs of expanded criteria donors in renal transplantation",
  "abstract": "Background. The organ shortage has increased interest in the use of expanded criteria donors (ECDs), Although much has been written concerning the clinical outcomes associated with the use of such donors, little has been published concerning the financial results associated with their use, Methods, A retrospective cost identification study of recipients of kidneys from expanded criteria cadaveric donors was used. Results, Of a total of 78 cadaveric renal transplants in fiscal year 1995, there were 38 kidneys (49%) transplanted from ECDs. Graft survival at 1 year was not statistically different between patients who received kidneys from ECDs and those who received non-ECD kidneys (84% vs, 85%, respectively), Length of stay (P<0.05), serum creatinine at 1 year after transplantation (P<0.01), and the percentage of patients requiring hemodialysis (P<0.05) were all higher among patients who received kidneys from ECDs. Cold ischemic time was significantly longer in patients who received kidneys from ECDs (31.4+/-12 hr vs, 24.0+/-9 hr; P<0.05), The total average and median costs were $12,190 and $10,911 higher in recipients of kidneys from ECDs as compared with non-ECD controls (P<0.01). Stepwise linear regression demonstrated that length of stay was the major clinical determinant of total costs; only the use of antilymphocyte induction was otherwise significantly associated, When kidneys from ECDs were transplanted into high-risk recipients (age >60 or retransplant patient), the average total costs were $15,311 more than when kidneys from ECDs were transplanted into non-high-risk patients (n=16 and 21, respectively; P<0.05) and $20,680 more than when a non-ECD, non-high-risk pairing was undertaken (n=26; P<0.05). Conclusions, Kidney transplantation with organs from ECDs is significantly more expensive than with organs from non-ECDs, even in the face of similar graft survival rates, Further study is needed to determine the cost-effectiveness of renal transplantation utilizing kidneys from ECDs vis-a-vis hemodialysis.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4332e0ce5f43b3c1b3d8240cf8b09b0e",
  "timestamp": "2025-05-15T03:14:37.256172"
}