{
  "id": 4178,
  "title": "Acculturation, self-efficacy and social support among Chinese immigrants in Northern Ireland",
  "abstract": "An opportunity sample of 108 Chinese participants (n(male) = 51 and n(female) = 57; M-age = 29.34) was compared to a second opportunity sample of 98 Northern Irish participants (n(male) = 45 and n(female) = 53; M-age = 23.67) on levels of acculturation, self-efficacy and social support. The administered questionnaire contained three scales to measure the aforementioned constructs. The first was the AMAS-NIC, a version of the Abbreviated Multidimensional Acculturation Scale [Zea, M. C., Asner-Self, K. K., Birman, D., & Buld, L P. (2003). The Abbreviated Multidimensional Acculturation Scale: Empirical validation with two Latino/Latina samples. Cultural Diversity and Ethnic Minority Psychology, 9, 107-126] modified to apply to a population of Chinese immigrants in Northern Ireland. The second measure was Mary Wegner's 1992 English version of the General Self-Efficacy Scale [Wright, S., Johnston, M., & Weinman, J. (1995). Measures in health psychology portfolio. UK: Windsor]. The third was the Social Support Questionnaire (SSQ) whose items emerged through a semi-structured interview and was designed to measure levels of received and sought social support. The purpose of the study was to ascertain the extent to which previous findings concerning acculturation can be generalised to a Chinese immigrant population in Northern Ireland, a country characterised by segregation. T-tests, correlation analyses and a hierarchical regression initially provided support for the generalisability of previous studies on the health benefits of integration as a preferred acculturation strategy [Berry. J. W. (2008). Globalisation and acculturation. International Journal of Intercultural Relations, 32, 328-336], but further interpretation of the results brought to light the shortcomings of this model in the context of a segregated society and the inapplicability of the GSES measure within a collectivistic immigrant population. The limitations of the study are discussed and recommendations for future research are made. (C) 2009 Elsevier Ltd. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4336c2920b1cf094689ffcafc0d74050",
  "timestamp": "2025-05-15T01:24:25.447744"
}