{
  "id": 5687,
  "title": "Prevalence, Features, and Outcomes of Type 1 Neovascularization in Eyes with Angioid Streaks",
  "abstract": "Purpose: This study aimed to delineate the characteristics, prevalence, and outcomes of neovascularization elasticum (PXE), and to introduce a clinical classification based on multimodal imaging. Participants: Eighty-five patients (168 eyes) with AS secondary to PXE at 2 tertiary referral centers. Methods: Data collection included demographic, medical, and ocular histories. Diagnostic methods comprised fundus photography, autofluorescence, indocyanine green angiography, OCT, and OCT angiography. Main Outcome Measures: Prevalence of type 1 NV, visual acuity (VA), risk of exudation. Results: Type 1 NV was identified in 127 eyes (76%), with 85 of these (67%) showing exclusively type 1 NV. These lesions often originated around the disc, at sites of Bruch membrane dehiscences, and followed the path of AS, extending to the macula in 101 eyes (80%). Despite 65% of type 1 NV remaining nonexudative, 35% evolved into exudative over 5 years, and 11 eyes experienced midperipheral subretinal hemorrhages. Aneurysmal dilations, observed in 57% of eyes, substantially increased exudation risk (hazard ratio = 3.86, P = 0.02). Despite treatment, VA significantly deteriorated in exudative type 1 NV (P = 0.02). Type 2 NV, detected in 42 eyes (33%), often coexisted with type 1 NV and was associated with poorer visual outcomes and higher rates of macular atrophy. A classification of AS was developed, ranging from empty AS (stage 0, no NV) to advanced NV (stage 3, Conclusions: Type 1 NV predominates in AS. Although predominantly nonexudative, its progression correlates with substantial visual impairment, similar to the deficits observed with type 2 NV. Aneurysmal type 1 NV poses a significant exudation risk, underscoring the need for vigilant monitoring. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Retina 2025;9:166-179 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4339af0fff1d165997b9ce69824ed23e",
  "timestamp": "2025-05-15T02:50:21.243531"
}