{
  "id": 4331,
  "title": "Patents and small business risk: longitudinal evidence from the global financial crisis",
  "abstract": "Purpose The purpose of this study is to shed light on the relationship between patent applications and long-term risk for small firms across the global financial crisis of 2008. During a crisis, firm risk often skyrockets, and small and medium enterprises face significant dangers to their business continuity. However, managers have a set of strategies that could be implemented to increase a firm's resilience, sustaining competitive advantages and improving access to financial resource. The authors focused on the investigating the impact of patenting activities on small business risk in a time of crisis. Design/methodology/approach This is a quantitative study based on a sample of Italian firms that applied for a patent in 2005. The changes in corporate credit ratings over a five-year period are related to different proxies of patent activity using multivariate regression analysis. Findings Firms that filed for a patent were more resilient, compared to the control sample, during the financial crisis. Innovative activities resulting in patent application seem to deliver strategic resources useful to tackle the crisis rather than increase riskiness. The moderating effect of patents on risk sensitivity is stronger for small firms and when the number of patents or the patent intensity is larger. Originality/value Limited evidence is available on how patent applications are related to risks for small firms during an economic crisis. The authors highlight that the innovative efforts resulting in patent applications can support small business resilience. The authors also point out that the implementation of patent information in small firms' credit score modeling is still an uncommon practice, while it is useful in estimating firm risk in a way more robust to exogenous credit shocks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4361ed17ba717ff8471e691050898fa3",
  "timestamp": "2025-05-15T02:36:05.180656"
}