{
  "id": 386,
  "title": "Towards An Efficient Real-time Approach To Loan Credit Approval Using Deep Learning",
  "abstract": "The last decade has seen an important rise of data gathering, especially in the financial sectors. Banks are indeed one of the biggest producers of big data, as a matter of fact no other company than the bank has so much data gathered on its customers. Gathering and analyzing this data is a key feature for decision making, particularly in banking sector. One of the most important and frequent decision banks has to make, is loan approval. The challenge is to know how to build a proactive, powerful, responsible and ethical exploitation of personal data, to make loan applicant proposals more relevant and personalized. Machine learning is a promising solution to deal with this problem. Therefor, in the last years, many algorithms based on machine learning have been proposed to solve loan approval issue. However, these algorithms have not taken into consideration Real-time paradigm during processing. In this paper, we propose a Real-Time Binary classification model to deal with loan approval. Our proposed model is based on a deep neural network, and it permits to classify loan applicant as good or bad risk. Experimental results prove that our proposed Real-Time model, based on deep neural network, outperforms typical binary classifiers, in terms of precision recall and accuracy.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "436c5e450160a51db8ccd2741dbda70f",
  "timestamp": "2025-05-15T01:50:14.058817"
}