{
  "id": 3751,
  "title": "Exporters' failure predictors and processes: a multi-country analysis based on the theoretical concept of firms' financial crisis types",
  "abstract": "This study aims to identify the financial predictors and processes of (non-)bankrupt exporters' failure in five European countries. A novel theoretical concept of financial processes based on the dynamic evolution of different types of financial crises was created. Relying on gaps in the literature, the study answers five research questions (RQs) by using financial data of 15,551 (non-)bankrupted firms. First, the empirical analysis suggests that from the four crisis types, solvency and profitability crises are the most important failure predictors generally, and second, also in different stages for the majority of studied financial processes. Among the eight financial processes detected based on the failure probability evolvement during 3 years, survived firms are mainly subject to persistent absence of failure risk, while exactly the opposite occurs for half of the bankrupt firms. Concerning firm-level characteristics, firm age mainly determines the prevalence of these processes, while export intensity plays a modest role. The empirical section is finalized with the development of high-accuracy failure prediction models for exporting firms, enabling the extension of the scientific findings to financial practice. As the main contribution to the extant literature, the article presents a holistic analysis of the financial dynamics of (non-)bankrupting exporting firms. Besides developing high-accuracy bankruptcy prediction tools for exporting firms, in the case of which such studies are rare, the scientific and practical impact of the paper is much more multi-faceted. Failure prediction studies usually do not focus on how the values of financial predictors and failure risk evolve in time for different firm types. In addition, financial predictors are usually chosen based on their predictive ability, rather than theoretical nature. Based on the theoretical concept created in the paper combining four financial crisis types (i.e. liquidity, solvency, profitability, revenue creation ability) and eight failure processes, it outlines how and why failure risk evolves dynamically for different types of (non-)failing firms. A major practical takeaway emergent from the latter is that the classification errors in bankruptcy prediction are largely emergent from two types of firms. The first is a surviving firm lengthily in a poor financial status, being dynamically almost constantly characterized by all four crisis types, although in a mild form. The second is a bankrupting firm, which dynamically almost never does not indicate any of the four crises, being therefore very similar to a well-performing surviving firm. Besides this main implication, the paper offers additional rich evidence, including the prevalence of financial processes and accuracies of failure predictors in different European countries, the ranking of the importance of crisis types by financial processes, and the dependencies of financial processes on firm characteristics.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "437438c5b73df5140445e99945adace9",
  "timestamp": "2025-05-15T02:29:28.076239"
}