{
  "id": 8287,
  "title": "Inequalities in cognitive impairment among older adults in China and the associated social determinants: a decomposition approach",
  "abstract": "Background Despite there is growing evidence focusing on health inequalities in China, socioeconomic inequalities in cognitive impairment among older adults have received little attention. This study aims to measure socioeconomic inequalities in cognitive impairment among Chinese older adults, and determine the contributing social factors to the inequalities. Methods A cross-sectional analysis was performed using data from the 2018 Chinese Longitudinal Healthy Longevity Survey (CLHLS). A total of 10,556 older adults aged 65 and over were included in the study. The prevalence of cognitive impairment was measured by using the Chinese version of the Mini-Mental State Examination. The socioeconomic inequalities in cognitive impairment were illustrated and quantified by the concentration curve and normalized concentration index. Multivariate logistic regression was conducted to identify the associated factors of cognitive impairment. And decomposition analysis was further applied to decompose the contribution of each determinant to the observed inequalities in cognitive impairment. Results The study indicated that the prevalence of cognitive impairment among Chinese older adults was 18.95%. The overall concentration index for cognitive impairment was - 0.046, which suggested a higher concentration of cognitive impairment among socioeconomically disadvantaged older adults. The results showed the prevalence of cognitive impairment was associated with sex, age, marital status, education level, occupation, economic status, emotional support, financial support, living arrangement, and participation in informal activities. Decomposition results further revealed the contributions of the determinants to the inequalities in cognitive impairment. Specifically, age (131.61%), marital status (85.68%), emotional support (84.85%), education level (39.73%), occupation (21.24%), sex (17.25%), financial support (- 4.19%), economic status (1.02%), living arrangement (0.88%), and informal activities (0.30%) have varying degrees of contributions to the inequality in cognitive impairment. Conclusion This study sheds light on the pro-rich inequality in cognitive impairment among older adults in China. It suggests that policymakers should pay more attention to older adults who are female, old-old, widowed, illiterate, economically disadvantaged, with no social support, and less socially involved. Also, more targeted interventions should be undertaken to improve the socioeconomic conditions of these vulnerable individuals and strengthen their ability to cope with the risk of cognitive impairment.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "437fbb4b7a2739779182d38489b4b678",
  "timestamp": "2025-05-15T03:17:21.538337"
}