{
  "id": 4967,
  "title": "What Can Influence Iranian Suicide Attempters to Go Through the Process of Non-Fatal Suicide Act Once Again? A Preliminary Report",
  "abstract": "The thrust of this study was to examine some of the psycho-social risk factors for the recurrence of non-fatal suicide attempt in a sample of 1121 inmates admitted between April 2012 to June 2013 at the toxicology emergency ward, Noor Medical Centre, Isfahan, Iran. Out of the total participants, 240 of them reported history of suicide attempt and assumed the status of case group. The remaining 881 patients were admitted first their attempt and constituted the control group. Cases were compared to the controls with respect to select demographic features (i.e. age, sex, education, occupation, marital status, type of residence, and locale), current suicide attempt method, family history of suicide and drug abuse, history of psychiatric disorder, physical ailment and physical disability, substance abuse and alcohol use, psychiatric diagnosis, and recent life hassles (i.e. interpersonal, occupational, financial, medical, and home affairs). We used a structured interview schedule to interview the participants. Psychiatric diagnosis was based on the DSM-IV criteria. Data were computer analyzed using SPSS.21 and administering statistical analysis including Chi Square, t-student, and logistic regression. Demographic risk factors for recurrence of suicide attempts at the univariate level included occupational status [Crud odds Ratio (COR) = 0.53] and type of residence (COR = 1.40). Medical and psychiatric risk factors at the univariate level included substance abuse (COR = 1.97), physical ailment (COR = 1.76), alcohol use (COR = 1.84), psychiatric disorder (COR = 3.69), and history of suicide in the family of origin (COR = 1.86). Recent life hassles risk factors at the univariate level included financial constraints (COR = 1.46) and medical emergencies (COR = 3.48). A multivariate logistic regression model identified five variables (i.e. substance abuse, alcohol use, psychiatric illness, suicide in family, and medical emergencies) that were statistically associated with an increased risk for recurrence of nonfatal suicide attempt. The model predicted chances of repeating suicide attempt correctly 79 % of the time. These observations indicate that people who report to the toxicology emergency ward for nonfatal suicide not only need immediate relief but also careful psychiatric and social assessments which subsequently may lead to psychiatric admission and comprehensive community interventions.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "438bc2bf1653dedfc4c931e15a495436",
  "timestamp": "2025-05-15T02:43:06.682537"
}