{
  "id": 6529,
  "title": "Prevalence and risk factors of depression in patients with drug-resistant tuberculosis in Nepal: A cross-sectional study",
  "abstract": "Background: Patients with drug-resistant tuberculosis (DR TB) have a protracted course of illness and the available treatment has a low success rate. These factors combined with the associated stigma and financial implications put the patients with DR TB at an increased risk of depression. The psychiatric side effects of antituberculosis drugs further aggravate the problem. This study aimed to estimate the prevalence of depression among patients with DR TB in Nepal and identify risk factors. Methods: We conducted this cross-sectional study in April 2018 at all the functioning 11 programmatic DR TB treatment centers across Nepal. We selected 129 patients aged >= 16 years receiving treatment for DR TB by nonprobability quota sampling. Six trained data collectors conducted face-to-face interviews and administered the Nepali language version of Patient Health Questionnaire 9 (PHQ-9) to screen for depression. We summarized sociodemographic and treatment characteristics with median (Interquartile Range [IQR]) and proportions as appropriate. We performed univariate analysis for the variables hypothesized as risk factors for depression. We fitted a multivariable binary logistic regression model with depression as the outcome variable and the variables with a significance level of < 0.25 as explanatory variables. We regarded a p-value of < 0.05 as significant for individual variables in the logistic regression model. Results: Of the 129 patients studied, 92 (71.3%) were male and the median age was 36 years (IQR 25-48). The majority (109, 84.4%) had multi-drug resistant tuberculosis (MDR TB). We identified 81 patients (62.7%, 95% Confidence Interval [CI] 53.7-71) with the PHQ-9 score of 10 or more signifying probable depressive disorder. In univariate analyses, age, treatment center location, DR TB treatment duration, and duration of current illness had a p-value lower than the pre-specified cut-off of 0.25. In the multivariable logistic regression model, we found a statistically significant association of depression with the duration of illness (adjusted Odds Ratio 1.15, 95% CI 1.07-1.26, p < 0.001). Conclusion: This study has found that a large proportion of the patients with DR TB screened have depression suggesting the need for screening and management of comorbid depression within the National TB Control Program.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43a644cf3ef7e684d2eec666031158cf",
  "timestamp": "2025-05-15T02:59:07.481064"
}