{
  "id": 3791,
  "title": "Corporate environmental reputation management and financial performance of environmentally sensitive companies in Nigeria",
  "abstract": "Business activities have direct and indirect effects on their immediate environment. The degree of impact a business venture would have on the environment depends on the nature of business. This work examines the impact of environmental reputation management on the financial performance of environmentally sensitive companies in Nigeria. This work includes an extensive review of relevant literature, hinging this research on stakeholder theory. Data were gathered from corporate annual reports and sustainability reports sourced on-line. The analytical research design was utilised in undertaking the study. A sample of 46 companies was selected from public limited liability companies listed on the Nigerian stock exchange and operating in environmentally sensitive sectors. The corporate reports were analysed from 2008 to 2017 financial years. Linear Regression analysis was employed to test the hypothesis. Findings revealed a significant positive relationship between corporate environmental reporting quality and financial performance; reputation risk management and financial performance of environmentally sensitive companies in Nigeria. The level of environmental reporting quality by environmentally sensitive companies in Nigeria causes 13.1% change in the financial performance of the reporting company. Corporate reputation risk management of environmentally sensitive companies in Nigeria causes 11.4% change in the company's financial performance. It is hereby, recommended that environmentally sensitive companies should ensure high-quality environmental reputation management to achieve their profit maximisation aim. This high-level environmental management contributes to the achievement of the fifteenth sustainable development goal (life on land), set to attain sustainable management of forests, freshwater and ecosystem.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43b3a1afb85af32b003a94a0ed57fdd7",
  "timestamp": "2025-05-15T02:29:59.192553"
}