{
  "id": 7302,
  "title": "Development of an individual index of social vulnerability that predicts negative healthcare events: a proposed tool to address healthcare equity in primary care research and practice",
  "abstract": "PurposeSocially disadvantaged patients may lack self-efficacy to navigate a complex health system making them vulnerable to healthcare inequity. We aimed to develop an Index of social vulnerability that predicts increased risk of negative healthcare events (e.g. emergency hospitalization), independent of chronic disease burden. The analysis illustrates the conceptual and practical steps leading to the development of a pragmatic Index of social vulnerability to limited healthcare self-efficacy.MethodsUsing data from a 3-year cohort of 2507 adult primary care patients in Quebec (Canada), we applied two complementary structural equation modelling approaches-Partial Least Squares Path Modelling (PLS-PM) and Multiple indicators and Multiple Causes (MIMIC) modelling-to identify a minimal set of social characteristics that could be summed into an Index related to limited healthcare self-efficacy. We then used logistic regression to determine if the Index predicted: hospital emergency department use; hospital admissions; unmet need for care, and others. We privileged parsimony over explanatory capacity in our analytic decisions to make the Index pragmatic for epidemiologic and clinical use.ResultsThe Individual Social Vulnerability Index is the weighted sum of five indicators: two indicators of social support; educational achievement; financial status; limited language proficiency. The Index predicts increased likelihood of all negative healthcare outcomes except unmet need, with a clear threshold at Index & GE; 2. The effect is independent of chronic disease burden.ConclusionWhen social deficits outweigh social assets by two or more (Index & GE; 2), there is an increased risk of negative healthcare events beyond the risk attributable to poor health. The Index is a pragmatic tool to identify a minority of patients who will require additional support to receive equitable healthcare.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43bfe31cd939f229db6c2ccece2fd28f",
  "timestamp": "2025-05-15T03:07:02.695157"
}