{
  "id": 8670,
  "title": "Economic hardship and the role of cost in childcare decisions: An exploratory study",
  "abstract": "The high cost of US childcare has become burdensome to most families with young children, yet little is known about how childcare costs shapes parental childcare decisions. This study addresses a critical gap in knowledge by examining how economic hardships shape parental childcare decisions, along with the individual and community characteristics associated with the influence of cost on childcare decisions. Guided by the accommodation model and family stress model, we used data from a statewide consumer survey in Iowa to conduct the first known study to examine associations between household constraints (i.e., economic hardships) and respondent reports that cost influenced their childcare decisions at least once in the previous year (i.e., systemic barriers to childcare). As hypothesized, each form of economic hardship was associated with increased odds of cost influencing childcare decisions. Our logistic regression demonstrated that every standard deviation increase in our financial stress scale resulted in a 110% increase in the odds of cost influence, while each additional experience of material hardship (out of 16) increased the odds of cost influence by 10%. Additionally, we identified demographic variations, with cost playing a more prominent role for people who were Hispanic/any race, unemployed, and were between the ages of 18- to 34-years old. Overall, findings demonstrate that economic hardships are constraints that, coupled with systemic barriers like cost, shape childcare decisions across demographic groups, communities, and income brackets. Findings also suggest the need for more public support to alleviate the costs of childcare among all families, such as expanding childcare subsidies or funding the provision of care, which may mitigate the risk of negative outcomes associated with economic hardship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43cd818933193aaa41de4bb9e8ce803d",
  "timestamp": "2025-05-15T03:21:24.626502"
}