{
  "id": 8407,
  "title": "Gait Adaptations to Physical Fatigue During the Negotiation of Variable and Unexpected Obstacles",
  "abstract": "Objective The purpose of this study was to investigate how physical fatigue impacts one's ability to negotiate unexpected and randomly located obstacles during locomotion. Background Physically demanding occupations place workers at risk of trips and falls-a major health and financial burden. How worker physical fatigue and fitness impacts their ability to navigate through unpredictable environments is not thoroughly explored in current literature. In this exploratory study, we further examine these relationships. Methods Twenty-one young, physically fit participants completed a series of obstacle negotiation trials in the dark, where an obstacle would suddenly be illuminated as they reached it. Participants then engaged in a fatigue protocol, before repeating a series of the same negotiation trials. Results When fatigued, participants exhibited a significant decrease in leading toe and trailing toe clearance, as well as a significant increase in leading heel clearance. Moreover, participants stepped closer to the obstacle with their both feet on the step prior to negotiation. Participants also walked at a faster velocity. Regression analyses revealed that participants' VO2max and height were significant predictors of foot placement metrics. Conclusion Results indicate that physical fatigue negatively impacts crossing mechanics of young, healthy individuals, and that a higher level of VO2 capacity may reduce the occurrences of altered crossing behavior that coincide with physical fatigue. Application These results highlight the effect of fatigue on worker safety during performance of job-related duties and are of interest to professionals seeking to reduce the incidence of slips, trips, and falls in the workplace.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43cdb8c5be69036e06371501d450d3f6",
  "timestamp": "2025-05-15T03:18:19.695460"
}