{
  "id": 8699,
  "title": "Assessment of Real-Time Polymerase Chain Reaction Detection of Acanthamoeba and Prognosis Determinants of Acanthamoeba Keratitis",
  "abstract": "Objective: To evaluate the diagnostic value of real-time polymerase chain reaction (PCR) for detecting Acanthamoeba in eyes diagnosed with Acanthamoeba keratitis (AK) by conventional tests. In addition, to determine the preoperative prognosis-determining factors in eyes with AK. Design: Retrospective, cross-sectional study. Participants: A total of 104 eyes of 103 patients who were diagnosed with AK or with bacterial or bacteria-associated keratitis (BK) by conventional tests. Methods: Twenty-nine eyes with AK and 75 eyes with BK were evaluated for Acanthamoeba and bacterial DNA by real-time PCR. The Acanthamoeba copy numbers, bacterial load, and clinical parameters in the patients with AK were assessed for those significantly associated with poor outcome, that is, final visual acuity of <20/50 or requiring keratoplasty, by logistic regression analysis. Main Outcome Measures: Acanthamoeba DNA copy number, bacterial DNA copy number, and odds ratio (OR) for poor prognosis. Results: The detection of amoebic DNA was 50 times more sensitive by real-time PCR than by conventional cyst counting. The Acanthamoeba copy numbers at the first visit (mean: 4.7x10(5)+/- 3.2x10(5) copies) were significantly correlated with the AK stage, and both were significant risk factors for a poor outcome. The Acanthamoeba DNA copy numbers at the first visit and AK stage had a significantly high risk for poor outcome (OR of Acanthamoeba DNA copy per logarithm of copy numbers: 3.48, 95% confidence interval [CI], 1.04-111.63, P<0.05; OR of AK stage: 2.8 per stage increase, 95% CI, 1.07-7.30, P<0.05, after adjustment of age). In the AK cases with poor outcome, the amoebic DNA was not reduced by more than 90% after 1 month of treatment. The weak amoebic reduction was significantly associated with advanced AK stages or previous use of steroids. Bacterial 16S rDNA was detected in 53.6% of the eyes with AK, but it was not associated with any risk for refractoriness. Conclusions: Real-time PCR was effective in detecting and managing AK. The Acanthamoeba copy number and AK stage at the first visit were significantly associated with poor outcome. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:1111-1119 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43eb9d2c918c78e016bcc448a8809301",
  "timestamp": "2025-05-15T03:21:24.717539"
}