{
  "id": 4818,
  "title": "Financial Assistance for Health Security: Effects of International Financial Assistance on Capacities for Preventing, Detecting, and Responding to Public Health Emergencies",
  "abstract": "Background: Health security funding is intended to improve capacities for preventing, detecting, and responding to public health emergencies. Recent years have witnessed substantial increases in the amounts of donor financial assistance to health security from countries, philanthropies, and other development partners. To date, no work has examined the effects of assistance on health security capacity development over time. This paper presents an analysis of the time lagged effects of assistance for health security (AHS) on levels of capacity. Methods: We collected publicly available health security assessment scores published between 2010 and 2019 and data relating to financial AHS. Using validated methods, we rescaled assessment scores on analogous scales to enable comparison and binned them in quartiles. We then used a distributed lag model (DLM) in a Bayesian ordinal regression framework to assess the effects of AHS on capacity development over time. Results: Strong evidence exists for associations between financial assistance and select capacities on a variety of lagged time intervals. Financial assistance had positive effects on zoonotic disease capacities in the year it was disbursed, and positive effects on legislation, laboratory, workforce, and risk communication capacities one year after disbursal. Financial assistance had negative effects on laboratory and emergency response capacities two years after it was disbursed. Financial assistance did not have measurable effects on coordination, antimicrobial resistance (AMR), food safety, biosafety, surveillance, or response preparedness capacities over the timeframe considered. Conclusion: Financial AHS is associated with positive effects for several core health security capacities. However, for the majority of capacities, levels of funding were not significantly associated with capacity level, though we cannot fully exclude endogeneity. Future work should continue to investigate these relationships in different contexts and examine other factors that may contribute to capacity development.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43f175fbe983be9204255d4329915b2d",
  "timestamp": "2025-05-15T02:41:32.666446"
}