{
  "id": 4488,
  "title": "Cost-effectiveness of two versus three or more doses of intermittent preventive treatment for malaria during pregnancy in sub-Saharan Africa: a modelling study of meta-analysis and cost data",
  "abstract": "Background In 2012, WHO changed its recommendation for intermittent preventive treatment of malaria during pregnancy (IPTp) from two doses to monthly doses of sulfadoxine-pyrimethamine during the second and third trimesters, but noted the importance of a cost-effectiveness analysis to lend support to the decision of policy makers. We therefore estimated the incremental cost-effectiveness of IPTp with three or more (IPTp-SP3+) versus two doses of sulfadoxine-pyrimethamine (IPTp-SP2). Methods For this analysis, we used data from a 2013 meta-analysis of seven studies in sub-Saharan Africa. We developed a decision tree model with a lifetime horizon. We analysed the base case from a societal perspective. We did deterministic and probabilistic sensitivity analyses with appropriate parameter ranges and distributions for settings with low, moderate, and high background risk of low birthweight, and did a separate analysis for HIV-negative women. Parameters in the model were obtained for all countries included in the original meta-analysis. We did simulations in hypothetical cohorts of 1000 pregnant women receiving either IPTp-SP3+ or IPTp-SP2. We calculated disability-adjusted life-years (DALYs) for low birthweight, severe to moderate anaemia, and clinical malaria. We calculated cost estimates from data obtained in observational studies, exit surveys, and from public procurement databases. We give financial and economic costs in constant 2012 US$. The main outcome measure was the incremental cost per DALY averted. Findings The delivery of IPTp-SP3+ to 1000 pregnant women averted 113.4 DALYs at an incremental cost of $ 825.67 producing an incremental cost-effectiveness ratio (ICER) of $ 7.28 per DALY averted. The results remained robust in the deterministic sensitivity analysis. In the probabilistic sensitivity analyses, the ICER was $ 7.7 per DALY averted for moderate risk of low birthweight, $ 19.4 per DALY averted for low risk, and $ 4.0 per DALY averted for high risk. The ICER for HIV-negative women was $ 6.2 per DALY averted. Interpretation Our findings lend strong support to the WHO guidelines that recommend a monthly dose of IPTp-SP from the second trimester onwards. Copyright (C) Fernandes et al. Open Access article distributed under the terms of CC BY-NC-SA.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "43ff1312deda2f8e600d48c09f3a3fd4",
  "timestamp": "2025-05-15T02:37:47.519794"
}