{
  "id": 4166,
  "title": "Factors associated with unmet supportive care needs among adult cancer survivors in South Korea: a cross-sectional survey",
  "abstract": "PurposeThis cross-sectional study assessed the prevalence of unmet supportive care needs and financial burdens among South Korean adult cancer survivors.MethodsA total of 1038 adult cancer survivors were recruited through convenience sampling from the 2022 Korean Population Census. Data were collected online from November 17 to December 15, 2022. Unmet supportive care needs were assessed across three domains: access and continuity of care, coping and emotional needs, and information needs. Ordinal logistic regression analyses were conducted, adjusting for relevant demographic and clinical characteristics.ResultsAmong study participants, 65.7% of those with severe financial toxicity reported high unmet supportive care needs. The most frequently reported unmet need was related to coping and emotional support (44.7%). Cancer survivors diagnosed 6-10 years ago had significantly lower unmet supportive care needs compared with those diagnosed within the past three years (AOR = 0.69, 95% CI: 0.49-0.98). Survivors with stage III/IV cancer (AOR = 1.62, 95% CI: 1.13-2.32) were more likely to report high unmet needs. Additionally, those with severe financial toxicity were at significantly higher risk of reporting unmet needs (AOR = 3.26, 95% CI: 2.13-5.02).ConclusionsUnmet supportive care needs were significantly associated with severe financial toxicity, time since diagnosis, and cancer stage. Survivors with severe financial toxicity or advanced-stage cancer are at an increased risk of experiencing unmet needs.Implications for Cancer SurvivorsThese findings highlight the need for targeted interventions to address the unmet supportive care needs of cancer survivors, particularly those experiencing severe financial burdens or diagnosed with advanced-stage cancer. Interventions should be tailored to different survivorship stages to improve long-term health outcomes and quality of life for cancer survivors in South Korea.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44020675f7ab071bec2a3ac7d66ed64a",
  "timestamp": "2025-05-15T02:34:13.305081"
}