{
  "id": 9111,
  "title": "Adverse Childhood Experiences and Household Out-of-Pocket Healthcare Costs",
  "abstract": "Introduction: Adverse childhood experiences are associated with higher risk of common chronic mental and physical illnesses in adulthood, but little evidence exists on whether this influences medical costs or expenses. This study estimated increases in household medical expenses associated with adults' reported adverse childhood experience scores. Methods: Household out-of-pocket medical cost and adverse childhood experience information was collected in the 2011 and 2013 waves of the Panel Study of Income Dynamics and its linked 2014-2015 Panel Study of Income Dynamics Childhood Retrospective Circumstances Study supplement and analyzed in 2017. Generalized linear regression models estimated adjusted annual household out-of-pocket medical cost differences by retrospective adverse childhood experience count and compared costs by family type and size. Logistic models estimated odds of out-of-pocket costs that were >10% of household income or >100% of savings, as well as odds of household debt. Results: Adverse childhood experience scores were associated with higher out-of-pocket costs. Annual household total out-of-pocket medical costs were $184 (95% CI=$90, $278) or 1.18-fold higher when respondents reported one to two adverse childhood experiences and $311 (95% CI=$196, $426) or 1.30-fold higher when three or more adverse childhood experiences were reported by an adult in the household. Odds of household medical costs >10% of income, >100% of savings, and the presence of household medical debt were 2.48-fold (95% CI=1.40, 4.38), 2.25-fold (95% CI=1.69, 2.99), and 2.29-fold (95% CI=1.56, 3.34) higher when an adult in the household reported three or more adverse childhood experiences compared with none. Conclusions: Greater exposure to adverse childhood experiences is associated with higher household out-of-pocket medical costs and financial burden in adulthood. (C) 2018 American Journal of Preventive Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44042b3bac6b976a8a6cb2ee62269a54",
  "timestamp": "2025-05-15T03:25:27.813687"
}