{
  "id": 3934,
  "title": "A study on the factors affecting household solar adoption in Kerala, India",
  "abstract": "Purpose Recent research on the energy system highlights the need for understanding the bandwidth of drivers and inhibitors of household investor's behaviour in rooftop PV (or photovoltaic power system) and to fit the broader socio-economic context in which they are deployed. However, apart from few exceptions, these newer perspectives have not been duly applied in the research on rooftop PV. This paper aims to fill this gap and to shed new light on rooftop PV investment decisions. Design/methodology/approach This study has been conducted with the primary data collected using two data sets of 237 households and 387 households of Indian southern state Kerala using survey-based questionnaire. The findings from first data set revealed that households considering the adoption of PV were likely influenced by six distinct factors, three motivators and three inhibitors. Second data set for multi-state analytic approach was proposed whereby the research model was tested using structural equation modelling (SEM). The outcomes of SEM were used as inputs for an artificial neural network (ANN) model for forecasting investor investment decision in in renewables. The ANN model was also used to rank the relative influence of significant predictors obtained from SEM. Findings In line with the risk-return framework, government subsidies act as primary motivator which helps in overcoming the initial risk of investment in the new technology. Further, low prices and low cost of maintenance are some of the financial motivators which may likely mitigate the long-term apprehension of returns and maintenance cost. Lastly, the strongest motivators of PV investment come from the environmental and financial motivator in the form of PV subsidies, which further solidifies the role of policy interventions in investment decision. The ANN model identified the technical barrier and knowledge and awareness factors play a significant role in forcasting the investor investing decision. Practical implications The study results will be useful for policymakers for framing strategies to attract and influence their investment in renewable energy. Originality/value Building upon behavioural finance and institutional theory, this paper posits that, in addition to a rational evaluation of the economics of the investment opportunities, various non-financial factors affect the household's decision to invest in renewables.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "440db509f2f32eecad315a543e83735e",
  "timestamp": "2025-05-15T02:31:28.398765"
}