{
  "id": 7457,
  "title": "Educational outcomes in siblings of childhood leukemia survivors: Factors associated with school difficulties and comparison with general population",
  "abstract": "BackgroundTo investigate the educational outcomes of siblings of childhood leukemia survivors, explore determinants of school difficulties, and compare the rates of repeating grades between siblings and the general population.MethodsA cross-sectional study of childhood leukemia survivors' siblings recruited through the Leucemies de l'Enfant et de l'Adolescent cohort, a French long-term follow-up program, was conducted, and education-related data were obtained via self-report questionnaires. Adjusted logistic regression models were used to identify variables associated with school difficulties and time since diagnosis. Rates of repeating a grade in middle school were compared between siblings and the general population of the same generation.ResultsA total of 564 siblings with a mean time from diagnosis of 14.1 +/- 6.4 years were included, among whom 139 (24.6%) repeated a grade, at an average of 6.4 +/- 4.5 years after diagnosis. In multivariate analysis, the risk factors for repeating a grade were older siblings (odds ratio [OR] 2.3, p = 0.006), family financial difficulties (OR 2.8, p = 0.008), and history of repetition in survivors (OR, 2.5, p = 0.001). Sibling hematopoietic stem cell donors were at greater risk of repeating a grade long-term after diagnosis (p = 0.018). Overall, siblings did not have a higher risk of educational delays at the end of middle school than the general population.ConclusionAlthough the results are reassuring, socioeconomic and cancer-related factors may have an impact on siblings' schooling long after diagnosis. Paying attention to siblings contributes to identifying the most vulnerable families, allowing more attention and appropriate resources to avoid long-term repercussions. Additionally, supportive and targeted interventions can be developed to improve the organization of education and the health care system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4425912eb88621ffec8218520b2746db",
  "timestamp": "2025-05-15T03:08:37.985013"
}