{
  "id": 3011,
  "title": "Stressful life events, hypertensive disorders, and high blood sugar during pregnancy",
  "abstract": "The objective of this study was to examine the association of life events stressors with risk of gestational diabetes mellitus (GDM) and hypertensive disorders of pregnancy (HDP) by using the multilevel sample from the 2007 Los Angeles Mommy and Baby (LAMB) survey. Four multilevel logistic regression models were applied while accounting for the multilevel design of the LAMB study. The following demographic variables were used as covariates: maternal age, race/ethnicity, maternal educational attainment, household income level in the previous year, physical exercise, and prepregnancy body weight status. The scale for total number of stressors was positively associated with GDM in Model 1, but the association did not reach the significance threshold of 0.05. In Model 2 where four specific domains of stressors (financial, traumatic, spousal, and emotional stressors) were used as the key exposure variables, the number of financial stressors during pregnancy was significantly associated with a higher risk of GDM. The scale for total number of stressors was associated with HDP in Model 3. Experience of financial stressors during pregnancy was significantly associated with a higher risk of HDP in Model 4. In conclusion, exposure to higher number of financial stressors was associated with an elevated risk of GDM and HDP.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44757811237c028292390ed3f17b431c",
  "timestamp": "2025-05-15T02:21:19.312777"
}