{
  "id": 7089,
  "title": "What do border disputes cost? Evidence from an emerging market",
  "abstract": "PurposeThe study aims to examine the impact of six events related to the escalating Indo-China border conflicts in 2020 on the Indian stock market, including the role of firm-specific variables.Design/methodology/approachThis study employs an event-study method on a sample of 481 firms from August 23, 2019 to March 3, 2022. A cross-sectional regression is employed to examine the association between event-led abnormal returns and firm characteristics.FindingsThe results show that, although the individual events reflect heterogeneous effects on stock market returns, the average impact of the event categories is negative. The study also found that net working capital, current ratio, financial leverage and operating cash flows are significant financial performance indicators and drive cumulative abnormal returns. Further, size anomaly is absent, indicating that more prominent firms are resilient to new information.Research limitations/implicationsThe ongoing conflict between Russia and Ukraine is an example of how these disagreements can devolve into a disaster for the parties to the war. Although wars have an impact on markets at the global level, the impacts of border disputes are local. Border disputes are ongoing, and the study's findings can be used to empower investors to make risk-averting decisions that make their portfolios resilient to such events.Originality/valueThis study provides firm-level insight into the impacts of border conflicts on stock markets. The authors compare the magnitude of such impacts on two types of events, namely injuries and casualties due to country-specific border tensions and a government ban on Chinese apps. Key implications for policymakers, stakeholders and academics are presented.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4485bb043896bcfe989f99c3fed61489",
  "timestamp": "2025-05-15T03:05:03.480945"
}