{
  "id": 7300,
  "title": "Risk factor analysis and nomogram construction for predicting suicidal ideation in patients with cancer",
  "abstract": "Background Suicidal ideation in cancer patients is a critical challenge. At present, few studies focus on factors associated with suicidal ideation, and predictive models are still lacking. This study aimed at investigating the risk factors for suicidal ideation among cancer patients, and developed a predictive nomogram to screen high risk cancer patients for early prevention and intervention. Methods A questionnaire survey was conducted among cancer patients between May 2021 and January 2022. The factors associated with suicidal ideation were used to construct a multivariate logistic regression model, which was visualized as a predictive nomogram to evaluate the risk of suicidal ideation. Areas under the curve, calibration plot, decision curve analysis, and internal and external validation were used to validate the discrimination, calibration and clinical usefulness of the model. Results A total of 820 patients with cancer were recruited for this study and 213 (25.98%) developed suicidal ideation. Levels of demoralization, depression and cancer staging, marital status, residence, medical financial burden, and living condition were influence factors for suicidal ideation. Comparing nomogram with Self-rating Idea of Suicide Scale (SIOSS), the nomogram had a satisfactory discrimination ability with an AUC of 0.859 (95% CI: 0.827-0.890) and 0.818 (95% CI: 0.764-0.873) in the training and validation sets, respectively. The calibration plot and decision curve analysis revealed that this nomogram was in good fitness and could be beneficial in clinical applications. Conclusions Suicidal ideation is common in cancer patients. Levels of demoralization, depression and cancer staging were independent predictors of suicidal ideation. The nomogram is an effective and simple tool for predictive suicidal ideation in cancer patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44952ea32720aa70cb0d0c3ed2d720c8",
  "timestamp": "2025-05-15T03:07:02.689216"
}