{
  "id": 3750,
  "title": "DeTeRMINANTS OF lIQuIDITY RISK: EMPIRICAl evIDeNCe FROM INDIAN COMMeRCIAl BANKS",
  "abstract": "Liquidity risk is a significant financial threat that must be handled carefully. Underestimation or mismanagement of liquidity risk may lead to severe financial losses or even bank failures. Therefore, timely and adequately estimating liquidity risk and examining factors that affect liquidity risk are essential. On that account, this paper aims to examine the determinants of liquidity risk for Indian commercial banks from 2013 to 2022. For this purpose, the study has employed a panel data regression model with pooled OLS, fixed effect, and random effect methods and has considered bank- specific and macroeconomic variables. The findings show that liquidity risk is affected by both bank-specific variables and macroeconomic variables. Bank-specific variables, such as bank age, have a negative impact on liquidity risk at the 1 percent significance using pooled OLS, FE, and RE models. In contrast, bank size and bank capitalization positively impacted liquidity risk. However, the operational efficiency of banks was found to have no significant impact on liquidity risk using both the liquid asset to total assets ratio and the loan to deposit ratio. In addition, the results show that macroeconomic variables such as GDP and inflation have a positive impact on liquidity risk. The study's findings are expected to assist various stakeholders in making appropriate policies, decisions and managing their liquidity risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "449e818befc6cb0579440f0fd2ce161f",
  "timestamp": "2025-05-15T02:29:28.075232"
}