{
  "id": 6693,
  "title": "Disabling musculoskeletal pain in working populations: Is it the job, the person, or the culture?",
  "abstract": "To compare the prevalence of disabling low back pain (DLBP) and disabling wrist/hand pain (DWHP) among groups of workers carrying out similar physical activities in different cultural environments, and to explore explanations for observed differences, we conducted a cross-sectional survey in 18 countries. Standardised questionnaires were used to ascertain pain that interfered with everyday activities and exposure to possible risk factors in 12,426 participants from 47 occupational groups (mostly nurses and office workers). Associations with risk factors were assessed by Poisson regression. The 1-month prevalence of DLBP in nurses varied from 9.6% to 42.6%, and that of DWHP in office workers from 2.2% to 31.6%. Rates of disabling pain at the 2 anatomical sites covaried (r = 0.76), but DLBP tended to be relatively more common in nurses and DWHP in office workers. Established risk factors such as occupational physical activities, psychosocial aspects of work, and tendency to somatise were confirmed, and associations were found also with adverse health beliefs and group awareness of people outside work with musculoskeletal pain. However, after allowance for these risk factors, an up-to 8-fold difference in prevalence remained. Systems of compensation for work-related illness and financial support for health-related incapacity for work appeared to have little influence on the occurrence of symptoms. Our findings indicate large international variation in the prevalence of disabling forearm and back pain among occupational groups carrying out similar tasks, which is only partially explained by the personal and socioeconomic risk factors that were analysed. (C) 2013 International Association for the Study of Pain. Published by Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44b34b5cd63bda9819f41fe33c847419",
  "timestamp": "2025-05-15T03:00:35.473320"
}