{
  "id": 6125,
  "title": "Patterns and Predictors of Health Behaviors Among Racially/ Ethnically Diverse Residents of Low-Income Housing Developments",
  "abstract": "Purpose. Purpose. To examine behavioral patterns and sociodemographic predictors of diet, inactivity, and tobacco use among a diverse sample of residents from low-income housing developments. Design. In this cross-sectional survey study, households and residents were randomly selected using multistage cluster sampling. Setting. The study was conducted in 20 low-income housing developments in the Boston, Massachusetts, metropolitan area. Subjects. Subjects were 828 residents who completed the survey (response rate = 49.3%). Forty-one percent of participants were Hispanic and 38% were non-Hispanic Black Measures. Outcomes measured were diet, inactivity, and tobacco use. Predictors measured were age, race/ethnicity, gender, education, country in which the subject was born, language spoken, and financial hardship. Analysis. Logistic regression analyses were conducted to examine the association of three health behaviors with sociodemographic factors. Results. Age, gender, language spoken, and financial hardship showed significant relationships with all three behaviors. For example, those who reported less financial hardship (odds ratio [OR] = 1.75) were more likely to eat healthier Residents who spoke no English, or at least one language in addition to English, were significantly more likely to report healthier eating (OR= 2.78 and 3.30, respectively) than those who spoke English only. Men were significantly more likely to report less healthy eating (OR= 0.65) than were women. Similar trends emerged for inactivity and tobacco use. Conclusion. Effective health promotion interventions in low-income housing developments that leverage protective factors while addressing risk factors have the potential to reduce income-related health disparities in these concentrated resource-deprived neighborhoods. (Am J Health Promot 2014;29[1]:59-67.)",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44b73c2155647dc1fec5879ffecaf09a",
  "timestamp": "2025-05-15T02:55:12.852949"
}