{
  "id": 4532,
  "title": "Motivations for participating in an HIV vaccine efficacy trial",
  "abstract": "Understanding why people join HIV vaccine efficacy trials is critical for trial recruitment and education efforts. We assessed participants' motivations for joining the VaxGen VAX004 study, a randomized, double-blind, placebo-controlled, phase 3 multicenter trial. Of 5417 participants, 94% were men who have sex with men (MSM) and 6% were women at risk for heterosexual transmission of HIV Most participants gave altruistic reasons for trial participation: 99% reported having joined to help find an HIV vaccine, and 98% reported having joined to help their community. Some gave more personal reasons: 56% joined to reduce risk behavior and 46% joined to get protection from HIV Additional reasons related to receiving services or compensation included to obtain information about HIV (75%), to receive free HIV testing (34%), and for financial reimbursement (14%). Multivariate logistic regression analysis showed that female participants were significantly more motivated than male participants to join the trial for protection and to receive services or compensation (all P < 0.05). Participants with 13 or more sex partners in the 6 months before enrollment were more likely than those with fewer sex partners to report having joined the trial for protection but less likely to have joined to reduce risk behavior (both P < 0.05). Because many participants reported personal protection from HIV as their reason for joining, vaccine trial risk-reduction counseling should continue to emphasize the placebo-controlled trial design and unknown efficacy of the test product, particularly for women and persons with large numbers of sex partners. Because a significant minority of participants reported joining to receive HIV information, HIV testing, and financial reimbursement, a need is indicated for provision of HIV prevention services outside research trials and for monitoring to ensure that participants are not motivated to join trials for financial gain.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44ba658c76b738a52acf989fb1f35c28",
  "timestamp": "2025-05-15T02:38:20.345604"
}