{
  "id": 3190,
  "title": "Examination of Stocks in the Istanbul Stock Exchange 100 Index With Clustering and Association Rules Analysis",
  "abstract": "In this study, the co-movements of the stocks of the companies in the BIST 100 index are analysed by Cluster Analysis and Association Rules Analysis. For the clustering analysis, yield, trading volume, price volatility, market value, beta, market value/book value, equity/paid capital, and market value/net sales (revenue) variables are used; for the association rules analysis, the closing price is taken as a variable. The period 06.12.2012 to- 30.12.2022 was analysed in the study. Cluster Analysis was conducted for this period, and the associations of all stocks and stocks for each cluster were also analysed. The CLARA algorithm was used for the cluster analysis, and the FP-Growth Algorithm was used for the association rules analysis. The R programming language was preferred for the cluster analysis, and the WEKA programme was preferred for the association rules analysis. Because of the study, Cluster Analysis was used to determine the interconnectedness of stocks and Association Rules Analysis was used to determine which stocks move together. This will help both individual and institutional portfolio managers in determining which stocks to focus on in the portfolio diversification process. In addition, identifying stocks that move in tandem with each other during upward or downward price changes in stock markets, which have a very dynamic structure, will provide investors with the opportunity to share in potential profits. The possibility that the upward or downward movement in the price of a stock whose co-movement is detected may be accompanied by other stocks constitutes potential profits. According to the main findings of the research, there is a very intense co-movement among the companies operating in the banking sector. In addition, there is a commonality among pharmaceutical, white goods, iron and steel, retail, energy, petrochemical and manufacturing companies operating in the same sector. There is also an association between family group companies and companies operating in real estate investment trusts.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44bbbc4585a9ba8638864321d02249c7",
  "timestamp": "2025-05-15T01:14:54.785683"
}