{
  "id": 3787,
  "title": "Credit risk prediction of SMEs in supply chain finance by fusing demographic and behavioral data",
  "abstract": "The credit risk of small and medium-sized enterprises (SMEs) in supply chain finance (SCF) is defined as the probability that the SME would default on loans derived from financing for the SCF platform. Traditional models make use of merely the static data of SMEs, such as enterprise demographic data and financial statement data, to predict the credit risk of SMEs in SCF. Nevertheless, behavioral data, which reflect the dynamic financing behavior of SMEs in SCF, are overlooked by these models, which limits the performance of credit risk prediction. To address this problem, a novel approach is proposed called DeepRisk to fuse enterprise demographic data and financing behavioral data to predict the credit risk of SMEs in SCF. We adopt the multi-modal learning strategy to fuse the two different sources of data. The concatenated vectors derived from data fusion are then used as the input of the feed forward neural network to predict the credit risk of SMEs. Experiments on a real SCF dataset demonstrate that the proposed DeepRisk approach outperforms the baseline methods in credit risk prediction in terms of precision, recall, F1-score, area under curve (AUC), and economic loss. The fusion of the two different sources of data is superior to the existing approaches to the credit risk prediction of SMEs in SCF. Both the static enterprise demographic data and the dynamic financing behavioral data are crucial to improve the credit risk prediction of SMEs. Nevertheless, the variables derived from the financing behavioral data have a better predictability than those from the enterprise demographic data. Managerial implications have been identified for decision makers involved in SCF in utilizing the benefits of SCF and in managing their credit risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44c2d1b1890b12cfa7cb461574c9deb9",
  "timestamp": "2025-05-15T02:29:59.176501"
}