{
  "id": 4249,
  "title": "Does the accrual anomaly reflect a risk factor? The case of the Korean stock market",
  "abstract": "This paper examines whether the accrual anomaly exists in Korean stock markets as in the U.S., and tests whether the accrual anomaly is associated with a potential risk factor that can be included in a rational asset pricing model. Accruals are commonly measured by the difference between accounting earnings and operating cash flows, and have been considered the most important accounting variable for measuring the degree of earnings management and earnings quality in the literature. For example, Sloan (1996) studied the stock market responses on the operating accruals produced largely by managers' discretion and found the strong tendency of firms with high operating accruals to earn lower stock returns on average than those with low operating accruals. Since then, many studies report evidence that such an accrual anomaly is a common phenomenon existing in other stock markets, too. There are two explanations for the possible sources of the accrual anomaly. The first one is a risk factor hypothesis based on the market efficiency, which predicts that the accrual anomaly arises from the compensation for a potential risk factor that is not included in the existing asset pricing models. In contrast, the second explanation is a mispricing hypothesis based on the behavioral finance, which says that the accrual anomaly arises from the stock market inefficiency and investors' overreaction, i.e., investors are too optimistic about firms with high accruals and too pessimistic about firms with low accruals. Empirical results of this paper confirm the presence of the accrual anomaly in Korea over the period from 1987 to 2005, irrespective of the alternative accrual measures used. We find that stocks for firms with low accruals outperform significantly those with high accruals by about 16% p.a. over the next three years when the total accrual measure is used, and by about 10% p.a. over the next 1 year when the net operating asset measure is used. This result contrasts to that of Hiershleifer, et al. (2004), who show that the net operating asset measure in the U.S. is more effective in producing larger abnormal returns than the total accrual measure. In order to test whether the accrual anomaly can be regarded as a risk factor, we follow the standard approach of Fama and French (1993) and Daniel and Titman (1997), and construct an accrual-based factor-mimicking portfolio, ALMH (Accrual low minus high). The ALMH factor has a Sharpe ratio of 0.08, which is similar to that of the HML factor of Fama and French (1993) but higher than that of the market factor, and thus, can provide an additional diversification effect when a tangent portfolio is formed with other factors. In a time series regression test, both Fama-French 3-factor model and 4-factor model with this ALMH factor included fail to explain sufficiently the average stock returns on various test asset portfolios based on size and accruals. In addition, after controlling for firm characteristics such as firm size and accruals, the ALMH factor loading does not show any positive relation with stock returns, which suggests a rejection of the risk factor hypothesis. This result is also supported by the cross-sectional test at an individual stock level, where individual stock returns are explained significantly by the accrual characteristic, but not by the ALMH factor loading. In sum, all of the test results consistently indicate that the accrual anomaly is more likely to arise from a mispricing of accruals of individual firms rather than from a potential risk factor, which is consistent with the behavioral explanation based on market inefficiency.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44d175b0593b1e7f950823f38f6c9607",
  "timestamp": "2025-05-15T01:25:23.227218"
}