{
  "id": 5665,
  "title": "Psychological Health, Sleep Quality, Behavior, and Internet Use Among People During the COVID-19 Pandemic: A Cross-Sectional Study",
  "abstract": "Background: The COVID-19 pandemic has led to an increase in the risk of suicide, uncertainty, mental stress, terror, annoyance, weariness, financial issues, and frustration. We aim to determine the prevalence of insomnia, depressive and anxiety symptoms, and their associated factors among Libyan populations during the COVID-19 pandemic and the civil war. Methods: An online cross-sectional survey was conducted among the Libyan population between July 18 and August 23, 2020. The data collected included basic demographic characteristics, level of education, employment status, COVID-19-related questions, and questions about abuse and domestic violence. This study assessed the psychological status of participants who were screened for anxiety symptoms using the seven-item Generalized Anxiety Disorder scale (GAD-7). Depressive symptoms were also screened for using the two-item Patient Health Questionnaire (PHQ-2) and the Insomnia Severity Index (ISI). Binomial logistic regression was used to predict the probability of insomnia, anxiety and depressive symptoms. Results: A total of 10,296 responses were recorded. Among the participants, 4,756 (46.2%) obtained a cut-off score of >= 3 which indicated depressive symptoms. For anxiety, 1,952 participants (19%) obtained a cut-off score of >= 15, which indicated anxiety symptoms. For the ISI, the mean (SD) was 11.4 (6.1) for the following categories: no clinical insomnia (0-7) 3,132 (30.4%), sub-threshold insomnia (1-7) 3,747 (36.4%), moderate severity clinical insomnia (8-14) 2,929 (28.4%), and severe clinical insomnia (15-21) 488 (4.7%). Logistic regression analysis showed that depressive symptoms were statistically associated with age, marital status, education level, occupational category, financial problems during the COVID-19 pandemic, health status, having a COVID-19 infection, current health status, suicide ideation, abuse or domestic violence, and lockdown compliance (p < 0.05). The regression analysis revealed a statistically significant association between anxiety symptoms and age, education level, occupational status, financial problems during the COVID-19 pandemic, having a COVID-19 infection, health status, suicide ideation, abuse or domestic violence, and lockdown compliance (p < 0.05). The regression analysis revealed a statistically significant association between insomnia and all study variables with the exception of age, educational level, and occupational status (p < 0.05). Conclusion: Confronted with the COVID-19 outbreak, the Libyan population exhibited high levels of psychological stress manifested in the form of depressive and anxiety symptoms, while one-third of the Libyan population suffered from clinical insomnia. Policymakers need to promote effective measures to reduce mental health issues and improve people's quality of life during the civil war and the COVID-19 pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44f670931db4da4d1fa7a89d823d40de",
  "timestamp": "2025-05-15T02:50:21.143356"
}