{
  "id": 2054,
  "title": "Predictive Modelling of Financial Distress of Slovak Companies Using Machine Learning Techniques",
  "abstract": "Research background: Financial distress prediction is one of the key tasks of risk management and is still a widely discussed topic by many authors. Identification of the financial distress situation at least one year in advance is necessary for the company's management to implement measures that could alleviate or eliminate this situation. Purpose of the article: The paper aims at predictive modelling of the financial distress of companies operating in the conditions of the Slovak economy, regardless of the economic segment. The models are created using real data from real Slovak companies and can potentially be effective and universal tools for ex-ante analysis in Slovakia. Methods: Models are created using several machine learning techniques, namely Support Vector Machines, k-Nearest Neighbours, Bayesian Networks, and Genetic Algorithms. These algorithms provide a very good predictive ability of the models. A precisely prepared dataset of tens of thousands of Slovak companies is used to create models. The quality of the models is analysed and compared based on several evaluation metrics calculated from the confusion matrix and the value of AUC. Findings & Value added: The achieved results point to the potential of the tools used in modelling financial distress. The model created by the Support Vector Machines technique best identifies the financial distress of Slovak companies because it correctly classifies almost 87% of companies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "44f7e43fd2c7e73a5ebb28892356c232",
  "timestamp": "2025-05-15T02:10:25.836163"
}