{
  "id": 343,
  "title": "Adaptive large-scale group interactive portfolio optimization approach based on social network with multi-clustering analysis and minimum adjustment",
  "abstract": "The mean-variance (MV) model can help large companies identify portfolios that maximize returns and minimize risk. By incorporating an expert's preferences into the solution process of the MV model, a satisfactory portfolio can be obtained. However, investments by large companies involve many stakeholders. Due to the limited rationality and experience of managers, as well as interest conflicts, large-scale experts are required in making portfolio decisions, and social network analysis (SNA) aids in reaching consensus. Notably, selecting an effective clustering result from many clustering algorithms is challenging in large-scale group decision-making (LSGDM). The traditional weight determination methods for subgroups via majority rule do not apply to complex decisionmaking practicalities. Another critical issue is reaching a consensus with limited resources. However, consensus cost management, which considers both global and local network consensus, has not been studied. This research is conducted to develop a large-scale group interactive portfolio optimization method based on a social network (SN-LSGDM-PO) to address these limitations mentioned. First, we propose a multi-clustering analysis algorithm to evaluate the best clustering result. Then, we combine subgroups' cohesions and experts' traits within them to generate weights. To reduce the interaction consensus cost, we develop an adaptive consensus model based on minimum adjustment to achieve local and global consensus. Finally, the experimental and comparative results show that the SN-LSGDM-PO algorithm can effectively help large enterprises make portfolio decisions with a lower interaction consensus cost and generate greater group satisfaction.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "450055eff3c3cf35232397f1fa473f2b",
  "timestamp": "2025-05-15T00:42:32.447052"
}