{
  "id": 316,
  "title": "Stock Selection with a Novel Sigmoid-Based Mixed Discrete-Continuous Differential Evolution Algorithm",
  "abstract": "A stock selection model with both discrete and continuous decision variables is proposed, in which a novel sigmoid-based mixed discrete-continuous differential evolution algorithm is especially developed for model optimization. In particular, a stock scoring mechanism is first designed to evaluate candidate stocks based on their fundamental and technical features, and the top-ranked stocks are selected to formulate an equal-weighted portfolio. Generally, the proposed model makes literature contributions from two main perspectives. First, to determine the optimal solution in terms of feature selections (discrete variables) and the corresponding weights (continuous variables), the original differential evolution algorithm focusing only on continuous problems is extended to a novel mixed discrete-continuous variant based on sigmoid-based conversion for the discrete part. Second, the stock selection model also resolves the gap of the application of differential evolution algorithm to stock selection. Using the Shanghai A share market of China as the study sample, the empirical results show that the novel stock selection model can make a profitable portfolio and significantly outperform its benchmarks (with other model designs and optimization algorithms used in the existing studies) in terms of both investment return and model robustness.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4502d375ec521e6da6f36177767e5170",
  "timestamp": "2025-05-15T00:34:44.341554"
}