{
  "id": 7876,
  "title": "The effects of scale on the costs of targeted HIV prevention interventions among female and male sex workers, men who have sex with men and transgenders in India",
  "abstract": "Background The India AIDS Initiative (Avahan) project is involved in rapid scale-up of HIV-prevention interventions in high-risk populations. This study examines the cost variation of 107 non-governmental organisations (NGOs) implementing targeted interventions, over the start up (defined as period from project inception until services to the key population commenced) and first 2 years of intervention. Methods The Avahan interventions for female and male sex workers and their clients, in 62 districts of four southern states were costed for the financial years 2004/2005 and 2005/2006 using standard costing techniques. Data sources include financial and economic costs from the lead implementing partners (LPs) and subcontracted local implementing NGOs retrospectively and prospectively collected from a provider perspective. Ingredients and step-down allocation processes were used. Outcomes were measured using routinely collected project data. The average costs were estimated and a regression analysis carried out to explore causes of cost variation. Costs were calculated in US$ 2006. Results The total number of registered people was 134 391 at the end of 2 years, and 124 669 had used STI services during that period. The median average cost of Avahan programme for this period was $76 per person registered with the project. Sixty-one per cent of the cost variation could be explained by scale (positive association), number of NGOs per district (negative), number of LPs in the state (negative) and project maturity (positive) (p<0.0001). Conclusions During rapid scale-up in the initial phase of the Avahan programme, a significant reduction in average costs was observed. As full scale-up had not yet been achieved, the average cost at scale is yet to be realised and the extent of the impact of scale on costs yet to be captured. Scale effects are important to quantify for planning resource requirements of large-scale interventions. The average cost after 2 years is within the range of global scale-up costs estimates and other studies in India.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "450b502b09690097317ac7f04000d54b",
  "timestamp": "2025-05-15T03:13:04.892162"
}