{
  "id": 5779,
  "title": "The effect of socioeconomic status on the survival of people receiving care for HIV infection in the United States",
  "abstract": "HIV-infected people with low socioeconomic status (SES) and people who are members of a racial or ethnic minority have been found to receive fewer services, including treatment with Highly Active Antiretroviral Therapy (HAART), than others. We examined whether these groups also have worse survival than others and the degree to which service use and antiretroviral medications explain these disparities in a prospective cohort study of a national probability sample of 2,864 adults receiving HIV care. The independent variables were wealth (net accumulated financial assets), annual income, educational attainment, employment status (currently working or not working), race/ethnicity, insurance status, use of services, and use of medications at baseline. The main outcome variable was death between January 1996 and December 2000. The analysis was descriptive and multivariate adjusted Cox proportional hazards regression analysis of survival. By December 2000, 20% (13% from HIV, 7% non-HIV causes) of the sample had died. Those with no accumulated financial assets had an 89% greater risk of death (RR= 1.89, 95% CI= 1.15-3.13) and those with less than a high school education had a 53% greater risk of death (RR= 1.53, 95% CI= 1.15-2.04) than their counterparts, after adjusting for sociodemographic and clinical variables only. Further adjusting for use of services and antiretroviral treatment diminished, but did not eliminate, the elevated relative risk of death for those with low SES by three of the four measures. The finding of markedly elevated relative risks of death for those with HIV infection and low SES is of particular concern given the disproportionate rates of HIV infection in these groups. Effective interventions are needed to improve outcomes for low SES groups with HIV infection.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "452ad7066e3a105cdd78260e1a1df909",
  "timestamp": "2025-05-15T02:51:30.019402"
}