{
  "id": 7650,
  "title": "Do Firm Characteristics Determine Capital Structure of Pakistan Listed Firms? A Quantile Regression Approach",
  "abstract": "The purpose of this study is to investigate the determinants of the capital structure of firms operating in a developing economy, Pakistan. The quantile regression method is applied on a sample of 183 non-financial companies listed on the Pakistan Stock Exchange during the period of 2008-2017. Specifically, the empirical analysis focuses on changes in the coefficients of the determinants according to the leverage ratio quantiles of the examined listed firms. The findings show that the capital structure of Pakistan listed firms differs between firms in different quantiles of leverage. These differences are significant with the sign of explanatory variables changes with the level of leverage. The research result found tangibility, profitability and age to be positively related to leverage among listed firms in Pakistan. However, size, liquidity and non-debt tax shield (NDTS) are negatively related to leverage. A firm's growth and risk are found to be insignificant predictors of capital structure in Pakistan listed firms. Moreover, the study also found a significant impact of industry characteristic on leverage. The findings of this study indicate that an individual firm's finance policy needs to be responsive to the firm's characteristics and should match with the different borrowing requirements of listed firms.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "454beb6556f120931e9233f2f63e53ed",
  "timestamp": "2025-05-15T03:10:33.100412"
}