{
  "id": 5054,
  "title": "Innocent devils: The varying impacts of trade, renewable energy and financial development on environmental damage: Nonlinearly exploring the disparity between developed and developing nations",
  "abstract": "Global warming has grown to be a significant issue on a global scale and is a result of human activities. As a potential solution, nations are looking for sustainable economic growth and investments in clean energy tech-nologies. Therefore, this study aims to empirically investigate the impact of trade, renewable energy, and financial development on environmental degradation among developed and developing countries in light of the EKC (Environment Kuznets Curve) hypothesis. The influence on carbon emissions from 1990 to 2019 is analyzed and contrasted using the Non-linear Auto Regressive Distributed Lag (NARDL) regression technique. Results show that developed and developing countries emit significantly different amounts of carbon. Consequently, evidence of a non-linear and inverted U-shape relationship supports the EKC hypothesis. Further evidence shows a high risk of carbon emissions among both groups of countries with the increase in financial development and trading activities. However, the usage of renewable energy reduces environmental damage, and the association is non-linear. The study recommends using effective measures to minimize environmental damage by using clean energy sources and strengthening the financial system by offering environment-friendly investment loans. Moreover, policies should be designed that promote sustainable growth and investments in environment-friendly technologies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "454fcff6db1499106dfbdec0d4301e34",
  "timestamp": "2025-05-15T02:43:40.268387"
}