{
  "id": 5954,
  "title": "Does Seasonal Influenza Related Hospital Occupancy Surge Impact Hospital Staff Sickness Presenteeism and Productivity Costs?",
  "abstract": "Background-The workload of public hospital staff is heightened during seasonal influenza surges in hospitals serving densely populated cities. Such work environments may subject staff to increased risk of sickness presenteeism. Presenteeism is detrimental to nurses' health and may lead to downstream productivity loss, resulting in financial costs for hospital organizations. Aims-This study aims to quantify how seasonal influenza hospital occupancy surge impacts nurses' sickness presenteeism and related productivity costs in high-intensity inpatient metropolitan hospitals. Methods-Full-time nurses in three Hong Kong acute-care hospitals were surveyed. Generalized estimating equations (GEE) was applied to account for clustering in small number of hospitals. Results-A total of 71.3% of nurses reported two or more presenteeism events last year. A 6.8% increase in hospital inpatient occupancy rate was associated with an increase of 19% (1.19, 95% CI: 1.06-1.34) in nurse presenteeism. Presenteeism productivity loss costs between nurses working healthy (USD1983) and worked sick (USD 2008) were not significantly different, while sick leave costs were highest (USD 2703). Conclusion-Presenteeism prevalence is high amongst acute-care hospital nurses and workload increase during influenza flu surge significantly heightened nurse sickness presenteeism. Annual presenteeism productivity loss costs in this study of USD 24,096 were one of the highest reported worldwide. Productivity loss was also considerably high regardless of nurses' health states, pointing towards other potential risk factors at play. When scheduling nurses to tackle flu surge, managers may want to consider impaired productivity due to staff presenteeism. Further longitudinal research is essential in identifying management modifiable risk factors that impact nurse presenteeism and impairing downstream productivity loss.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "455ddc29b63dc4ef6d73e689e2d5d7e6",
  "timestamp": "2025-05-15T02:53:03.174420"
}