{
  "id": 7482,
  "title": "Loneliness in US military veterans during the COVID-19 pandemic: A nationally representative, prospective cohort study",
  "abstract": "Loneliness was deemed a behavioral epidemic even prior to the COVID-19 pandemic. The COVID-19 pandemic and the subsequent social distancing policy measures have raised concerns about increased social isolation and loneliness, especially in vulnerable populations such as military veterans. However, little is known about the impact of the pandemic on longitudinal changes in loneliness in veterans, and potential protective psychosocial factors that may mitigate loneliness in this population. We analyzed data from the 2019-2020 National Health and Resilience in Veterans Study, which surveyed a nationally representative, prospective cohort of 3,078 US veterans before and 1-year into the pandemic. Prevalence, and risk and protective factors associated with changes in loneliness were examined. Results revealed that the prevalence of loneliness decreased over the study period-17.3% pre-pandemic to 15.9% peri-pandemic (p = 0.032). A total of 5.4% (n = 164) of veterans reported increased loneliness, 6.4% (n = 196) decreased loneliness, and 10.6% (n = 325) persistent loneliness during the pandemic. Multivariable logistic regression models indicated that not being married/partnered, and scoring lower on pre-pandemic measures of purpose in life and cognitive functioning were most strongly associated with increased loneliness. Pre-pandemic psychiatric disorder, unpartnered marital status, and pandemic-related social restriction and financial stressors were most strongly associated with persistent loneliness. Collectively, these results suggest that, contrary to concerns, the prevalence of loneliness subtly decreased one year into the pandemic. Veterans who are not partnered, have pre-existing psychiatric conditions, and endorse more COVID-related stressors may be at higher risk for experiencing loneliness during the pandemic. Interventions that promote social connectedness, as well as that target the aforementioned risk and protective factors, may help mitigate loneliness in veterans.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45704161dfb4f7b83c4f6f8adb36cc31",
  "timestamp": "2025-05-15T03:09:07.267222"
}