{
  "id": 4278,
  "title": "A Portfolio of Building Solutions Supporting Positive Energy District Transition: Assessing the Impact of Green Building Certifications",
  "abstract": "Positive Energy Districts (PEDs) represent an innovative approach to thinking and designing cities sustainably, in compliance with the European Union energy strategy. This strategy integrates sectors such as urban planning, energy, and construction to synergistically address energy and environmental challenges. Studies on sustainability assessment systems applied in PEDs evidenced that they focus mostly on energy aspects, while few include a comprehensive life cycle assessment of equivalent CO2 emissions, considering the building component and the impacts of the materials used. Additionally, most assessments are conducted on the urban and district scale, such as Neighborhood Sustainability Assessments (NSA), which begin to correlate PEDs with the dynamics of selecting sustainable materials for green-certified projects, analyzed throughout the entire life cycle, relying on the adoption of Green Building Rating Systems (GBRS) at the building scale. To explore the impact of environmentally friendly (i.e., 'green') GBRS certifications in the selection of building materials and products according to sustainability criteria, and to encourage their use in projects explicitly referring to PEDs, this study analyzes the technical solutions implemented in two significant residential building renovation projects in Italy from a PED perspective. It proposes a classification system based on the required targets of energy efficiency, energy production, and energy flexibility. The results include the definition of an expandable portfolio of technical solutions, an analytical comparison between the materials used in the energy renovation projects of the case studies examined, and the sustainability criteria provided by voluntary 'green' certification tools (GBRS). The collected evidence offers an operational framework that confirms the positive impact of GBRS certifications and the related selection of materials on sustainable urban development, contributing to the scientific debate on PEDs. Furthermore, the use of voluntary 'green' certifications at the building scale can be encouraged in the context of the transition towards PEDs, aiming to identify specific criteria and indicators for the selection of building materials to be integrated into future PED certifications. This aims to contribute to creating energy self-sufficient urban areas, focusing on sustainability, efficiency, and innovation, in line with global emission reduction and climate change mitigation goals.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45789b829a551074fdcecd527c840d3c",
  "timestamp": "2025-05-15T01:25:23.347840"
}