{
  "id": 5116,
  "title": "Short term wind speed forecasting using artificial and wavelet neural networks with and without wavelet filtered data based on feature selections technique",
  "abstract": "Wind speed forecasting plays a crucial role in enhancing the efficiency, reliability, and profitability of renewable energy systems. Accurate wind speed forecasting optimizes energy production and grid integration in renewable energy systems. It assists in maintenance scheduling, decision-making in energy markets, and supports risk management for financial planning. This paper investigates the difficult balance between model complexity and forecasting accuracy in wind speed forecasting using Artificial Neural Networks (ANNs) and Wavelet Neural Networks (WNNs). Employing a time series approach, the study develops models for 1-h-ahead wind speed forecasting, utilizing recent averaged data and exploiting correlations between consecutive wind speeds for improved short-term predictions. Models training involve the Backpropagation algorithm, with careful input variable selection to minimize errors. This study emphasizes that simpler ANN and WNN models can outperform complex ones and explores the effectiveness of wavelet filtering techniques and demonstrates the benefits of using wavelet filtering to enhance forecasting accuracy. The robustness of the developed models is validated through K-fold cross-validation, confirming the efficacy of the proposed models. Evaluation across two datasets demonstrates the superiority of the proposed models over the persistence model, with enhancements of 7-14% in RMSE. Additionally, the efficacy of wavelet transforms in enhancing forecasting accuracy compared to regular neural network predictions is emphasized, underscoring the effectiveness of wavelet filtering offering a strategic approach for optimizing wind power management in electrical grids.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "458148c3ad343e3cbce20315a4e758ca",
  "timestamp": "2025-05-15T02:44:43.806036"
}