{
  "id": 1903,
  "title": "Enhancing fraud detection in banking by integration of graph databases with machine learning",
  "abstract": "The banking sector's shift from traditional physical locations to digital channels has offered customers unprecedented convenience and increased the risk of fraud for customers and institutions alike. In this study, we discuss the pressing need for robust fraud detection & prevention systems in the context of evolving technological environments. We introduce a graph-based machine learning model that is specifically designed to detect fraudulent activity in various types of banking operations, such as credit card transactions, debit card transactions, and online banking transactions. This model uses advanced methods for anomalies, behaviors, and patterns to analyze past transactions and user behavior almost immediately. We provide an in-depth methodology for evaluating fraud detection systems based on parameters such as Accuracy Recall rate and False positive rate ROC curves. The findings can be used by financial institutions to develop and enhance fraud detection strategies as they demonstrate the effectiveness and reliability of the proposed approach. This study emphasizes the critical role that innovative technologies play in safeguarding the financial sector from the ever-changing strategies of fraudsters while also enhancing banking security. center dot This paper aims to implement the detection of fraudulent transactions using a state-of-the-art Graph Database approach. center dot The relational graph of features in the dataset used is modelled using Neo4J as a graph database. center dot Applying JSON features from the exported graph to various Machine Learning models, giving effective outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4581421134075392835167974f047a0e",
  "timestamp": "2025-05-15T02:08:39.082236"
}