{
  "id": 4267,
  "title": "Inequity of NIH cancer funding in the United States: an ecological study predicting funding based on disease burden from 2008 through 2023",
  "abstract": "Background Disease burden has been used to predict National Institutes of Health (NIH) funding but included diseases with little underlying relationship. Here we focus on cancers to create a more appropriate model to allow for more targeted scrutinization of funding allocation. Methods An ecological study using NIH funding data (2008-2023) was performed. Inclusion of cancers was based on their presence in the NIH Research Portfolio Online Reporting Tool and the 2021 Global Burden of Disease (GBD) study. Disability-adjusted life years (DALY) were collected and to evaluate the impact of public interest, Google Trends data was used. Multivariable linear regression determined appropriate funding based on disease burden and public interest. To quantify how each cancer's funding differed from model predictions residual values were used to calculate the percent over/under funding. Findings Fifteen cancers met inclusion criteria. Neuroblastoma had the greatest ratio of funding to DALYs per 100,000 people (US$14,000,000) while lung cancer had the lowest (US$300,000). Stomach cancer was the most underfunded (197.9% [95% CI: 136.0%, 276.2%]) while brain cancer was the most overfunded (64.1% [95% CI: 53.8%, 72.1%]). Even at their lowest funding values in the study period brain, breast, and colorectal cancer all had greater than 40% overfunding. Contrarily, the lowest annual funding for leukemia, uterine, and stomach cancer received less than 150% of expected funding. Despite its overfunding brain cancer had an increase in DALYs in the study period. Interpretation Modeling by disease category demonstrated disparities in funding indicating the need for reevaluation for possible funding inequities. The year-by-year approach taken in this study will drive the ability for future research to better understand NIH funding decisions. Additionally, the role of public interest in research funding needs to be further evaluated to ensure that popularity does not override disease burden, in funding decisions.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "458b62039b9457abb5a1474fa1b6ca18",
  "timestamp": "2025-05-15T01:25:23.295072"
}