{
  "id": 9157,
  "title": "People Living with HIV's Worry That the COVID-19 Health Crisis Could Impact Long-Term HIV Care: Lessons From the French Context for Future Disease Epidemics",
  "abstract": "Background: In 2020, people living with HIV (PLHIV) in France were worried that the COVID-19 health crisis would lead to long-term changes in their HIV care. Using data from the anonymous, online, cross-sectional survey ACOVIH, which was completed by PLHIV between July and September 2020, this study explored factors associated with worry about long-term changes to HIV care after the end of the first lockdown (17 March-11 May 2020). Methods: Using multivariate logistic regression, we compared participants who declared they were worried about long-term changes with those who did not, in terms of their demographic, behavioral, and socioeconomic characteristics, as well as their experience of the COVID-19 crisis and access to care. Results: Among the 249 respondents, 61.5% (n = 153) declared having worries about long-term changes to HIV care. Specifically, after adjustment for gender and age, PLHIV born outside of France (adjusted odds ratios (aOR) [95%CI] = 2.57[1.44;6.76]), those whose financial situation deteriorated since the beginning of the pandemic (4.87[1.97;13.20]), those with a history of HIV opportunistic infections (3.27[1.53;7.32]), and respondents who took psychotropic drugs (3.21[1.50;7.22]) were all more likely to declare having worries. In terms of related determinants, a deterioration in communication with their HIV medical team (3.47[1.61;7.94]), having worries about COVID-19 (1.36[1.14;1.62]), and believing that HIV treatment increased the risk of COVID-19 infection (1.52[1.15;2.03]), were all significantly associated with having worries about long-term changes to HIV care. Conclusion: In the context of future disease epidemics, taking into account the profiles of individual PLHIV, and providing clearer, targeted information on HIV care, could help reduce worry in this population about the continuity of HIV care and could foster efficient communication with care providers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "459bbeb7a5cbae39af1f5429625455ac",
  "timestamp": "2025-05-15T03:25:54.680966"
}