{
  "id": 6747,
  "title": "DEVELOPMENT OF FINANCIAL RISK HEDGING STRATEGIES",
  "abstract": "The purpose of the study is to develop the theory of hedging, generalize approaches to the formation of effective risk hedging strategies, and provide recommendations for the implementation of international banks' experience in Ukrainian practice. It is proved that in the process of choosing effective strategies, it is advisable to distinguish three types of financial risk hedging: a) operational hedging (balance sheet) to ensure operational flexibility; b) market hedging (external), which involves the use of derivatives as instruments to hedge profit volatility; c) contract hedging (contractual clauses, embedded derivatives. Based on the analysis of the reports of 250 banks, it was found that Bank of America, JPMorgan Chase & Co., Goldman Sachs, Morgan Stanley, and Citigroup are the market makers in the most developed US futures market. Horizontal analysis of the balance sheets of these banks showed that although the share of derivatives designated as hedging instruments is insignificant (less than 1%) relative to term contracts recognized as trading instruments, the hedging effect is significantly higher than the gains on the trading portfolio. It was found that in international practice, the dominant direction is the hedging of interest rate risk (the share of which varies between banks from 42.52% to 61.26%), in the structure of hedging instruments, interest rate swaps prevail. The share of currency derivatives varies from 18.67% to 41.45%. Interest rate risk is hedged by over -the -counter bilateral term contracts for active operations, currency risk hedging equally covers the risks of passive and active operations. The regression analysis revealed that private credit and trading assets have an inverse effect on regional hedging exposure, and debt instruments have a direct effect. The study provides a basis for assessing the potential of using innovative risk-hedging instruments by Ukrainian banks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45a2d5a5463b691e8b4df309457fc474",
  "timestamp": "2025-05-15T03:01:03.629726"
}