{
  "id": 7504,
  "title": "Differences in Demographic, Risk, and Protective Factors in a Clinical Sample of Children who Experienced Sexual Abuse Only vs. Poly-victimization",
  "abstract": "Children exposed to child sexual abuse (CSA) vary considerably with regards to their presenting concerns and treatment needs. One factor creating heterogeneity amongst children experiencing CSA is their history of experiencing other victimizations (i.e., poly-victimized or not). However, little is known about risk factors for poly-victimization as well as differences in protective factors among these two groups. Additionally, there is currently limited understanding of whether poly-victimization is associated with greater trauma symptoms in children exposed to CSA and being seen for trauma treatment. Using a clinical sample of 117 children who were sexually abused (64 CSA only and 53 poly-victimized) ranging from age 3-18 years, the current study examined demographic characteristics, abuse characteristics, trauma symptoms, and protective factors using casefile review methodology. After accounting for other risk factors, parental abuse history and protective factors were significantly associated with child poly-victimization status. Children exposed to poly-victimization were more likely to have financial concerns chi(2)((1,115)) = 4.16, p = 0.04, parents with abuse histories chi(2)((1,117)) = 8.93, p = 0.003, and parents with histories of mental health or substance use difficulties chi(2)((1,117)) = 4.02, p = 0.045. Although cumulative trauma symptoms scores were higher for children who were poly-victimized compared to CSA only, t((115)) = -2.24, p = 0.03, multiple regression analyses showed that poly-victimization status was not significantly associated with child trauma symptoms after accounting for other demographic and abuse characteristics. Assessing and understanding the extent to which children exposed to CSA have experienced other forms of maltreatment is critical for identifying children who may be most at risk of poor outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45aef77adcbdc9d90b32f687b62ed3e2",
  "timestamp": "2025-05-15T03:09:07.354209"
}