{
  "id": 5453,
  "title": "Emotional Distress and Financial Toxicity in Younger Adult Patients Undergoing Oncologic Surgery",
  "abstract": "Background: There has been an alarming increase in the number of young adults (YA) diagnosed with cancer. The emotional, psychosocial, and financial distress experienced by newly diagnosed YA undergoing cancer surgery remains largely unknown. Methods: A validated biopsychosocial distress screening tool (SupportScreen) was administered to patients diagnosed with cancer before surgery between 2009 and 2017 in a National Cancer Institute Comprehensive Cancer Center. Patients were stratified into YA less than or equal to 45 years and older adults (OA) above 45 years. Descriptive statistics and logistic regression were used to analyze distress outcomes. Results: In total, 4297 patients were identified, with YA comprising 13.3% (n=573) of the cohort. YA reported higher emotional distress, including increased anxiety (33.8% vs 27.4%, P=0.002), greater fear of procedures (26.7% vs 22%, P=0.018), and difficulty managing emotions (26% vs 20.7%, P=0.006). YA struggled more frequently to manage work/school (29.5% vs 19.3%, P<0.001), finding resources (17.8% vs 11.8%, P<0.001), changes in physical appearance (22.2% vs 13.4%, P<0.001), fatigue (36% vs 27.3%, P<0.001), and ability to have children (18.4% vs 3%, P<0.001). Financial toxicity was significantly higher in the YA group (40.5% vs 28%, P<0.001). While income level was strongly protective against emotional distress and financial toxicity in OAs, it was less protective against the risk of financial toxicity in YA. Younger age was an independent predictor of financial toxicity in a model adjusted to income (odds ratio=1.52, P=0.020). Conclusions: YA in the prime of their personal and professional years of productivity require special attention when undergoing surgical evaluation for cancer. Resource allocation and counseling interventions should be integrated as part of their routine care to expedite their return to optimal physical and holistic health and mitigate psychosocial distress and financial toxicity.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45b96e9ce6e45152a553e9421134d9a5",
  "timestamp": "2025-05-15T02:47:43.078473"
}