{
  "id": 5408,
  "title": "Impact of Surgeon and Hospital Volume on Short-Term Outcomes and Cost of Laryngeal Cancer Surgical Care",
  "abstract": "Objective: To evaluate the impact of surgeon and hospital case volume and other related variables on short-term outcomes after surgery for laryngeal cancer. Methods: The Maryland Health Service Cost Review Commission database was queried for laryngeal cancer surgical case volumes from 1990 to 2009. Multivariate logistic regression analyses and multiple linear regression models were used to evaluate for significant associations between surgeon and hospital case volume, as well as other independent variables and the risk of in-hospital death, postoperative wound complications, length of hospital stay, and hospital-related cost of care. Results: Overall, 1,981 laryngeal cancer surgeries were performed with complete financial data available for 1,885 laryngeal cancer surgeries, performed by 284 surgeons at 37 hospitals. The only independently significant factor associated with the risk of in-hospital death was an APR-DRG mortality risk score of 4 (odds ratio [OR] = 10.7, P < .001). Postoperative wound fistula or dehiscence was associated with an increased mortality risk score (OR = 3.1, P < . 001), total laryngectomy (OR = 12.4, P = .013), and flap reconstruction (OR = 3.8, P = .001). Increased mortality risk score, partial or total laryngectomy, flap reconstruction, and Black race were associated with an increased length of stay and hospital-related costs. After controlling for all other variables, a statistically significant negative correlation was observed between surgery at a high-volume hospital and both length of hospital stay and hospital-related costs. Conclusions: After controlling for other factors, high-volume hospital care is associated with a shorter length of hospitalization and lower hospital-related cost of care for laryngeal cancer surgery.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45c431f3b3f7247f28a4ee863854036b",
  "timestamp": "2025-05-15T02:47:14.112910"
}