{
  "id": 2888,
  "title": "Financial risk-taking in adult attention deficit hyperactivity disorder",
  "abstract": "PurposeThis study aimed to examine the financial risk-taking behaviors of adult individuals diagnosed with attention deficit hyperactivity disorder (ADHD).Design/methodology/approachThe study was conducted with adults (n = 80) diagnosed with ADHD and healthy controls (n = 80). In order to measure risk-taking in the financial domain, the items in the investment and gambling sub-dimensions of the Domain-Specific Risk-Taking Scale (DOSPERT) were applied.FindingsAdults with ADHD had higher investment and gambling risk-taking and expected benefits scores than the control group, and there was no difference between the two groups in terms of risk perceptions. In the regression analysis, there was a positive linear relationship between the investment and gambling risk-taking scores and the expected benefits scores in both groups. There was a negative linear relationship between investment risk-taking and risk perceptions scores only in the control group.Originality/valueIn terms of investment and gambling, both risk-taking and expected benefits are greater in individuals with ADHD. It has been observed that while healthy individuals take investment risks, they evaluate according to the expected benefits and risk perceptions, while individuals with ADHD make evaluations only according to the expected benefits, risk perceptions do not predict financial risk-taking in individuals with ADHD. When it comes to risk-taking related to gambling, both groups take risks only according to their expectations of benefits, not their perceptions of risk. The study provides outputs that can contribute to the literature in terms of the effects of ADHD diagnosis on financial decision-making processes in the context of risk-taking.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45d2c403ea5055d1bbaddd58e5648877",
  "timestamp": "2025-05-15T02:20:16.907680"
}