{
  "id": 424,
  "title": "American options with stochastic dividends and volatility:: A nonparametric investigation",
  "abstract": "In this paper, we consider American option contracts when the underlying asset has stochastic dividends and stochastic volatility. We provide a full discussion of the theoretical foundations of American option valuation and exercise boundaries. We show how they depend on the various sources of uncertainty which drive dividend rates and volatility, and derive equilibrium asset prices, derivative prices and optimal exercise boundaries in a general equilibrium model. The theoretical models identify the relevant factors underlying option prices but yield fairly complex expressions which are difficult to estimate. We therefore adopt a nonparametric approach in order to investigate the reduced forms suggested by the theory. Indeed, we use nonparametric methods to estimate call prices and exercise boundaries conditional on dividends and volatility. Since the latter is a latent process, we propose several approaches, notably using EGARCH filtered estimates, implied and historical volatilities. The nonparametric approach allows us to test whether call prices and exercise decisions are primarily driven by dividends, as has been advocated by Harvey and Whaley (1992a. Journal of Financial Economics 30, 33-73; 1992b. Journal of Futures Markets 12, 123-137) and Fleming and Whaley (1994. Journal of Finance 49, 215-236) for the OEX contract, or whether stochastic volatility complements dividend uncertainty. We find that dividends alone do not account for all aspects of option pricing and exercise decisions, suggesting a need to include stochastic volatility. (C) 2000 Elsevier Science S.A. All rights reserved. JEL classification: C14; C51; D52; G13.",
  "year": 2000,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45d2a9e0ce4f78d9bc4b66ba1d3399bb",
  "timestamp": "2025-05-15T01:31:50.735125"
}