{
  "id": 6636,
  "title": "Perceived Impact of COVID-19 Among Callers to the National Suicide Prevention Lifeline",
  "abstract": "Background: Research indicates that the COVID-19 pandemic caused increases in psychological distress and suicidal ideation. Aims: To describe the ways suicidal callers to the National Suicide Prevention Lifeline (Lifeline) perceived COVID-19 to have impacted them and assess whether these callers perceived COVID-19-related stress as contributing to their suicidal thoughts. Method: Telephone interviews were conducted with 412 suicidal callers to 12 Lifeline centers. Logistic regression analyses were used to examine the associations between demographic factors and individual COVID-19 stressors and to determine whether callers who endorsed COVID-19-related stress as contributing to their suicidal thoughts differed from those who did not regarding demographics, current suicide risk, history of suicidality, Lifeline use, or individual COVID-19 stressors. Results: Over half of callers reported that COVID-19-related stress contributed to their suicidal ideation (CRSSI). Callers who endorsed CRSSI had higher odds than those who did not of mentioning financial difficulties when asked how COVID-19 impacted them. The two groups of callers did not differ on the other factors examined. Limitations: Interviewed callers may not be representative of all Lifeline callers. Conclusion: Despite the subjective burden of COVID-19-related stress on suicidal Lifeline callers, this was not associated with new suicidality or heightened suicide risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45dd5a8ed332c9fcd2cac940713df7bd",
  "timestamp": "2025-05-15T03:00:05.006846"
}