{
  "id": 4105,
  "title": "Perceived Vulnerability and Propensity to Adopt Best Management Practices for Huanglongbing Disease of Citrus in California",
  "abstract": "Huanglongbing (HLB) disease of citrus, which is associated with the bacterium 'Candidatus Liberibacter asiaticus', has been confined to residential properties in Southern California 8 years after it was first detected in the state. To prevent the spread of HLB to commercial citrus groves, growers have been asked to adopt a portfolio of voluntary best management practices. This study evaluates the citrus industry's propensity to adopt these practices using surveys and a novel multivariate ordinal regression model. We estimate the impact on adoption of perceived vulnerability to HLB, intentions to stay informed and communicate about the disease and various socio-economic factors, and reveal what practices are most likely to be jointly adopted as an integrated approach to HLB. Survey participants were in favor of scouting and surveying for HLB symptoms, but they were reluctant to test trees, use early detection technologies (EDTs), and install barriers around citrus groves. Most practices were perceived as complementary, particularly visual inspections and some combinations of preventive practices with tests and EDTs. Participants who felt more vulnerable to HLB had a higher propensity to adopt several practices, as did those who intended to stay informed and communicate with the coordinators of the HLB control program, although this effect was modulated by the perceived vulnerability to HLB. Communication with neighbors and the size of citrus operations also influenced practice adoption. Based on these results, we provide recommendations for outreach about HLB management in California and suggest future directions for research about the adoption of plant disease management practices.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45efb71582c1217eb928561e86d95c42",
  "timestamp": "2025-05-15T01:23:58.036723"
}