{
  "id": 6850,
  "title": "Associations of financial strain and unmet social needs with women's bladder health",
  "abstract": "OBJECTIVE: Financial strain and unmet social needs are associated with greater risk for lower urinary tract symptoms. Little research has examined financial strain and unmet social needs in relation to the more holistic concept of bladder health. This study utilizes baseline data from RISE FOR HEALTH: A U.S. Study of Bladder Health to examine whether financial strain, unmet social needs, and meeting specific federal poverty level threshold levels are associated with lower urinary tract symptoms and poorer perceived bladder health, well-being, and function. STUDY DESIGN: Participants were 18 years or older, born female or currently identified as a woman, and from the civilian, noninstitutionalized population residing in 50 counties in the United States that included or surrounded 9 recruitment centers. Data were collected through mailed or internet-based surveys. To address research questions, the 10-item Lower Urinary Tract Dysfunction Research Network- Symptom Index and selected Prevention of Lower Urinary Tract Symptoms Research Consortium bladder health scores were separately regressed on each financial strain, unmet social need, and federal poverty level variable, using linear regression adjusting for covariates (age, race/ethnicity, education, and vaginal parity) and robust variance estimation for confidence intervals (CI). Participants with no missing data for a given analysis were included (range of n=2564e3170). In separate sensitivity analyses, body mass index, hypertension, and diabetes were added as covariates and missing data were imputed. RESULTS: The mean age of participants was 51.5 years (standard deviation=18.4). Not having enough money to make ends meet, housing insecurity, food insecurity, unreliable transportation, and percent federal poverty levels of 300% or less were consistently associated with more reported lower urinary tract symptoms and poorer perceived bladder health. For example, compared to food secure participants, women who worried that their food would run out at the end of the month had a Lower Urinary Tract Dysfunction Research Network- Symptom Index score that was 3.4 points higher (95% CI: 2.5, 4.3), on average. They also had lower mean scores across different bladder health measures, each assessed using a 100-point scale: global bladder health (-8.2, 95% CI:-10.8,-5.7), frequency (-10.2, 95% CI:-13.8,-6.7), sensation (-11.6, 95% CI:-15.1,-8.2), continence (-13.3, 95% CI:-16.7,-9.9), and emotional impact of bladder health status (-13.2, 95% CI:-16.5,-9.9). Across analyses, associations largely remained significant after additional adjustment for body mass index, hypertension, and diabetes. The pattern of results when imputing missing data was similar to that observed with complete case analysis; all significant associations remained significant with imputation. CONCLUSION: Financial strain and unmet social needs are associated with worse LUTS and poorer bladder health. Longitudinal research is needed to examine whether financial strain and unmet social needs influence the development, maintenance, and worsening of lower urinary tract symptoms; different mechanisms by which financial strain and unmet social needs may impact symptoms; and the degree to which symptoms contribute to financial strain. If supported by etiologic research, prevention research can be implemented to determine whether the amelioration of financial strain and social needs, including enhanced access to preventative care, may promote bladder health across the life course.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "45f8c71dc0f2db899a5c99d6e2fa0e73",
  "timestamp": "2025-05-15T03:02:07.546146"
}