{
  "id": 6827,
  "title": "Financial Disclosure and the Cost of Equity Capital: The Empirical Test of the Largest Listed Companies of Kazakhstan",
  "abstract": "Providing information to the public is not a costless task. Among the costs of disclosure are the costs of information production and dissemination; for example, the costs of adopting an information system to collect, process data and report information about the company and the costs of hiring accountants and audits, etc. In this study, a framework for empirical tests of the relation between disclosure and the cost of equity capital is determined. This study extends research into whether disclosure of corporate and financial information is associated with firms' costs of equity capital. Using cost of equity capital estimates derived from capital asset pricing model, we find that firms with higher levels of financial transparency are associated with significantly lower costs of equity capital. Economic theory assumes that by increasing the level of corporate reporting, firms not only increase their stock market liquidity, but also decrease the investors' estimation risk, arising from uncertainty about future returns and payout distributions. The results show that firms on the Kazakhstan market can reduce their cost of equity capital by increasing the level of their voluntary corporate disclosures. Based on the analysis of existing empirical research, the disclosure index for a sample of 37 Kazakh companies has been constructed and regression analysis of the influence of the disclosure index on the cost of equity capital has been conducted. The obtained results show that the received findings correlate with foreign empirical studies, and the disclosure index in this sample has a negative impact on the cost of equity capital.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4604ef73158aa92a70c4c1b805df37c2",
  "timestamp": "2025-05-15T03:02:07.459837"
}