{
  "id": 295,
  "title": "Statistical Learning of Lattice Option Pricing and Traders' Behavior Using Ising Spin Model for Asymmetric Information Transitions",
  "abstract": "Financial fluctuations are one type of complex problem to determine the market behavior. The study of such fluctuations and statistical (machine) learning methods to predict the option price changes has been done by many researchers in the past. With the advancement in technology, one can capture the complexities in the financial systems and use of deep statistical (machine) learning, and apply unique set of rules and principles to these multi-layered complex networks. This paper provides a framework for lattice option pricing to determine the state for choice-sets, as one such unique set, in complex financial networks. This is largely based on human intelligence that learns features of each individual stock, and their trade-off, pay-off, preferential attachment and strategic options in the decision-making process. This paper also focuses on cases where both price and demand fluctuates stochastically and where both buyers and sellers have asymmetric information with limited time for high-quality decisions at their disposal to encourage or deter behavioral change. The situation draws on statistical mechanics and Ising-spin approaches to derive computational methods that infer and explain patterns and themes from high-dimensional data to manage the probable as well as lead the possibilities for multi-stage optimal control in dynamic systems.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "460425ab4fc0773b244cac4edadf0478",
  "timestamp": "2025-05-15T01:30:19.190673"
}