{
  "id": 3519,
  "title": "Searchability and Machine-Readability of the Financial Statements of the Czech Business Corporations and Their Influence on the Financial Performance",
  "abstract": "Financial and non-financial data presented in the financial statements and annual reports represent a valuable information source capturing economic activities in business corporations, accounting units. Machine-readable (or at least searchable) financial statements allow software equipment to find, to recognise and to extract easily data and valuable information about, e.g. ownership of risk-assets, cryptocurrencies or research and development activities. The paper aims to find out whether the Czech business corporations prepare their financial statements in the machinereadable/searchable format and whether the machine-readability/searchability is connected to their financial performance. The examined period was 2015-2017, and logistic regression was used. The data was obtained from the Czech Business Register by using a software script written by the authors and from the database of Czech and Slovak economic entities Bisnode Magnusweb. We discovered that most business corporations prepare non-searchable financial statements (no company prepares machine-readable statements). The ratio of searchable statements decreases each year. More companies change their statements from searchable to non-searchable than vice versa during the examined period. We found out that companies with non-searchable statements are more likely to have higher future long-term performance.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4615703a8183320fbe9157e2e4aeff51",
  "timestamp": "2025-05-15T02:27:19.064869"
}