{
  "id": 9266,
  "title": "Integrating oral PrEP delivery among African women in a large HIV endpoint-driven clinical trial",
  "abstract": "Introduction Global guidelines emphasize the ethical obligation of investigators to help participants in HIV-endpoint trials reduce HIV risk by offering an optimal HIV prevention package. Oral pre-exposure prophylaxis (PrEP) has increasingly become part of state-of-the-art HIV prevention. Here we describe the process of integrating oral PrEP delivery into the HIV prevention package of the Evidence for Contraceptive Options and HIV Outcomes (ECHO) Trial. Methods ECHO was an open-label randomized clinical trial that compared HIV incidence among women randomized to one of three effective contraceptives. In total, 7830 women aged 16 to 35 years from 12 sites in four African countries (Eswatini, Kenya, South Africa and Zambia) were enrolled and followed for 12 to 18 months, from 2015 to 2018. Part-way through the course of the trial, oral PrEP was provided to study participants either off-site via referral or on site via trained trial staff. PrEP uptake was compared between different contraceptive users using Chi-squared tests or t-tests. HIV seroincidence rates were compared between participants who never versus ever initiated PrEP using exact Poisson regression. Results PrEP access in ECHO began through public availability in Kenya in May 2017 and was available at all sites by June 2018. When PrEP became available, 3626 (46.3%) eligible women were still in follow-up in the study, and of these, 622 (17.2%) initiated PrEP. Women initiating PrEP were slightly older; more likely to be unmarried, not living with their partner, having multiple partners; and less likely to be earning their own income and receiving financial support from partners (all p < 0.05). PrEP initiation did not differ across study randomized groups (p = 0.7). Two-thirds of PrEP users were continuing PrEP at study exit. Conclusions There is a need for improved HIV prevention services in clinical trials with HIV endpoints, especially trials among African women. PrEP as a component of a comprehensive HIV prevention package provided to women in a large clinical trial is practical and feasible. Provision of PrEP within clinical trials with HIV outcomes should be standard of prevention.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4621c44487086059d9452bc4584c0530",
  "timestamp": "2025-05-15T03:27:24.922510"
}