{
  "id": 7152,
  "title": "Operational-based annual energy production uncertainty: are its components actually uncorrelated?",
  "abstract": "Calculations of annual energy production (AEP) from a wind power plant - whether based on preconstruction or operational data - are critical for wind plant financial transactions. The uncertainty in the AEP calculation is especially important in quantifying risk and is a key factor in determining financing terms. A popular industry practice is to assume that different uncertainty components within an AEP calculation are uncorrelated and can therefore be combined as the sum of their squares. We assess the practical validity of this assumption for operational-based uncertainty by performing operational AEP estimates for more than 470 wind plants in the United States, mostly in simple terrain. We apply a Monte Carlo approach to quantify uncertainty in five categories: revenue meter data, wind speed data, regression relationship between density-corrected wind speed (from reanalysis data) and measured wind power, length of long-term-correction data set, and future interannual variability. We identify correlations between categories by comparing the results across all 470 wind plants. We observe a positive correlation between interannual variability and the linearized long-term correction; a negative correlation between wind resource interannual variability and linear regression; and a positive correlation between reference wind speed uncertainty and linear regression. Then, we contrast total operational AEP uncertainty values calculated by omitting and considering correlations between the uncertainty components. We quantify that ignoring these correlations leads to an underestimation of total AEP uncertainty of, on average, 0.1 % and as large as 0.5 % for specific sites. Although these are not large increases, these would still impact wind plant financing rates; further, we expect these values to increase for wind plants in complex terrain. Based on these results, we conclude that correlations between the identified uncertainty components should be considered when computing the total AEP uncertainty.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4624bec428d83a38c8f8bdb17cac7e4b",
  "timestamp": "2025-05-15T03:05:32.090815"
}