{
  "id": 7611,
  "title": "Examining the differential effects of environmental, social, and governance and controversies on metafrontier efficiencies for sustainable development goals",
  "abstract": "Environmental, social, and governance (ESG) investments have their rewards and risks. As the world focuses on ESG investments, the media shed light on ESG controversies or concerns, such as tax frauds and harmful products. These controversies place companies at risk and consequently harm their sustainable development. Using a unique supply chain dataset from McDonald's Corporation, this study (i) develops a two-stage efficiency evaluation framework with a metafrontier range directional model in data envelopment analysis (DEA) and (ii) examines the relationship between DEA efficiency scores and ESG and ESG controversy scores through regression analysis. Results show that research and development efficiency (0.910) contributes more to overall efficiency than to profitability efficiency (0.700). While ESG scores positively impact efficiency, ESG controversies exert a negative effect, except for companies with ISO14000 environmental management certification. This study not only reinforces stakeholder theory by highlighting the critical role of ESG practices in enhancing company efficiency and stakeholder engagement but also provides actionable insights for policymakers and management teams to foster sustainable development through strategic ESG investments and partnerships. Overall, this study underscores the importance of examining stakeholder engagement in achieving sustainable development goals by managing financial and R&D resources, investing in ESG, and addressing ESG controversies among supply chains.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4643dea6f5ff4a21c3a0e8a5c2149999",
  "timestamp": "2025-05-15T03:10:05.703909"
}