{
  "id": 5235,
  "title": "Influence of hazard-related and cognitive factors of households' flood risk perceptions in Kampala, Uganda",
  "abstract": "Understanding lay people's flood risk perceptions has become an essential component of flood risk management especially with respect to ascertaining possible responses both to risk situations and to government actions. However, different contextual factors determine how they respond, and little has been done in the African urban context to study flood risk perception trends. Using data from 612 household questionnaires, this paper documents the hazard-related and cognitive factors of flood risk perception (measured using perceived likelihood of flood-induced property damage, as the dependent variable) in 3 neighbourhoods of Kampala, Uganda. Correlation and ordinal regression analysis established a positive influence of flood experience on flood risk perception in 2 of the neighbourhoods. In contrast, it has a negative influence in the third neighbourhood, which also goes for existing mitigation measures. However, in the latter, flood-induced property damage and existing mitigation measures showed a positive influence. Additionally, flood-induced financial costs positively influence risk perception in two of the three neighborhoods. These differences are associated with case characteristics, including the widening of drainage channels and socio-economic characteristics, and partially confirm the findings from previous studies. The contextual trends provide insights to improve the application of the Protection Motivation Theory.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "464e6d0f238efd2657c56cc3bbdb693b",
  "timestamp": "2025-05-15T02:45:47.397308"
}