{
  "id": 4228,
  "title": "Delay in Seeing a Doctor Due to Cost: Disparity between Older Adults with and without Disabilities in the United States",
  "abstract": "Objective. To examine the disparity in delaying seeing a doctor due to cost between older adults with and without disabilities, and whether the disparity could be explained by health and financial variables. Data Sources. Nationally representative sample of community-dwelling adults aged >= 65 who have health insurance and a usual source of care from the 2006 Behavioral Risk Factor Surveillance System (n = 85,015). Study Design. This cross-sectional study used sequential logistic regression models to examine the associations of delaying seeing a doctor due to cost with disability status, including demographic, health, and financial variables. Principal Findings. Older adults with disabilities had significantly higher odds of delaying seeing a doctor due to cost compared to older adults without disabilities after controlling for demographic, health, and financial factors. Although health and financial variables collectively attenuated the disparity, they did not fully explain the disparity. Conclusions. Despite having health insurance and a usual source of care, older adults with disabilities encountered greater economic difficulties in seeing a doctor than their counterparts without disabilities. Policy makers should continue addressing the economic burden to improve timely visits to health care providers.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4670991880c1c0d47bc16d96ccc7bb9b",
  "timestamp": "2025-05-15T02:34:48.893171"
}