{
  "id": 7582,
  "title": "Complexity and competing interests: what factors bear on payment choices and financial decisions made for older people entering nursing homes?",
  "abstract": "Each year, many frail older people in Australia and their informal carers, are faced with the complex choice of how to pay for nursing home accommodation (through a refundable, one-off lump sum payment on entry, daily 'rent-style' interest payments or a combination), a choice interconnected with several other financial decisions. The payment choice often needs to be made suddenly after a health shock and within tight timeframes, and impacts an older person's income, consumption, and long-term wealth. To explore what factors potentially bear on this complex choice, we modelled payment choices in online survey data using multinomial and fractional logistic regression. We found payment choices to be associated with an older person's finances, family situation and health situation, supporting that individual budgets and access to liquidity constrains choice. Informal carer characteristics including educational attainment, English-speaking background, investment risk appetite and perceived stress were associated with choices, suggesting informal carers may directly or indirectly exert influence. Nursing home providers' payment preferences were also associated with choices, suggesting potential influence due to providers' capital financing requirements. We offer policy suggestions on reducing the complexity of payment choices, and better aligning the interests of consumers and providers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "468013518414410be0c610a896532940",
  "timestamp": "2025-05-15T03:10:05.541998"
}