{
  "id": 545,
  "title": "Modified fuzzy support vector machine for credit approval classification",
  "abstract": "In the recent past, credit approval is a significant problem in credit risk management. Making decision to approve a credit has been a source of major concern for financial institutions. As such the problem is formulated as classification problem where making correct decision yields maximum returns. The classification task is taken care of by modified fuzzy support vector machine (MFSVM). It is variant of fuzzy support vector machine (FSVM) developed by Chaudhuri et al. The inherent vagueness and uncertainty in training samples are handled by new fuzzy membership function with hyperbolic tangent kernel. The success of classification lies in considering fuzzy membership function as function of center and radius of each class in feature space and representing it with kernel. In nonlinear training samples, input space is mapped into high dimensional feature space to compute separating surface using linear separating method. The different input points make unique contributions to decision surface. MFSVM produces significant results for Australian Credit Approval dataset. The model is tested with both linear and nonlinear kernels. MFSVM performance is also assessed in light of number of support vectors required to model the data. The effect of variability in prediction and generalization of MFSVM is studied with respect to parameters C and delta (2). The area under curve helps to reduce imbalance issues in the dataset considered. The training samples are either linear or nonlinear separable. MFSVM effectively handles the issue of nonlinear classification problem. Experimental results on both artificial and real datasets support the fact that MFSVM achieves superior performance in reducing outliers' effects than FSVM.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4686e92577a00023f7bcfee5382cbca8",
  "timestamp": "2025-05-15T01:52:12.266063"
}