{
  "id": 9175,
  "title": "Enhanced primary care after hospitalization: General practitioner, pharmacist and patient feedback from the REMAIN HOME trial",
  "abstract": "Background: Pharmacist and general practitioner (GP) collaborative models of care are continuing to evolve in the Australian primary care setting. The REMAIN HOME study investigated whether a pharmacist integrated into 14 different primary care teams in general practice (the practice pharmacist model) reduces readmission to hospital for patients prescribed five or more long term medicines or high risk comorbidities. The aim of this paper is to describe the attitudes of GPs, patients, and practice pharmacists towards this model of pharmacist and GP collaboration.Methods: To explore the views and opinions about the model of care (pharmacist integration into general practice), participating GPs were invited to complete a survey that included the 13-item validated Attitudes Toward Collaboration Instrument for GPs (ATCI-GP) one month after the pharmacist had been integrated into the practice. Survey instruments were also created for patients and pharmacist participating in the intervention. These were deployed after the initial consultation and at the end of the intervention period respectively, to elicit each stakeholders' views and experiences of the service. Data were analysed using descriptive statistics.Results: In total, 48 GPs, 43/101 patients (43%) and 11/13 practice pharmacists (85%) completed the survey. The majority of GPs strongly agreed or agreed with all statements of the ATCI-GP, indicating support for the practice -integrated pharmacist model. Most patients agreed that there was a role for a pharmacist in their general practice (n = 28, 76%), and that they would like to see the pharmacist again (n = 34, 79%). Pharmacists indicated that they enjoyed the role (n = 11, 91%) and found the position professionally satisfying (n = 9, 82%). Most pharmacists agreed that co-location (inside the general practice itself, rather than in a co-located pharmacy) was beneficial (n = 8, 73%) and all pharmacists (100%) acknowledged the benefits of having access to patient medical records. Free text comments from GPs were enthusiastic overall, although some concerns about the financial viability of the model in the current setting were raised. The primary limitation of the study is the anonymous nature of the survey, meaning clustering of responses across the 14 sites could not be determined.Conclusions: A practice pharmacist model of care in the Australian primary care setting appears to be accepted by GPs, patients and practice pharmacists and provides promising evidence that this model of care is likely to be well accepted if implemented more broadly in the Australian healthcare setting, provided that it can be appropriately remunerated.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46a3e057e1f7b3565e739cebee98b306",
  "timestamp": "2025-05-15T03:26:25.930199"
}