{
  "id": 3122,
  "title": "Relationship between Community Collectivization and Financial Vulnerability of Female Sex Workers in Southern India",
  "abstract": "Introduction Studies exploring the linkages between financial vulnerabilities and community collectivization of female sex workers (FSWs) are scarce in India despite having potential policy implications. To fill this gap in the literature, this study attempts to understand the financial vulnerabilities among FSWs and assess the relationship between community collectivization and financial vulnerabilities in southern India. Data and Methods Data were drawn from a cross-sectional, behavioral tracking survey (BTS)-2014, conducted among FSWs (N = 2400) in Andhra Pradesh, a southern state of India under the Avahan-India AIDS initiative program. Adjusted odds ratios (AOR) and their 95% confidence intervals (CI) were estimated through multivariate logistic regression, to assess the independent relationships of the degree of community collectivization indicators with financial vulnerability indicators, adjusting for socio-demographic characteristics. Results Most FSWs (87%) reported having either one or more financial vulnerability and nearly one-fifth had a high financial vulnerability. The risk of facing financial vulnerability was significantly lower among FSWs with a high degree of perceived collective efficacy (15% vs 31%; AOR: 0.4; 95% CI: 0.3-0.5) and collective agency (4% vs 21%; AOR: 0.2; 95% CI: 0.1-0.3) as compared to their respective counterparts, after controlling for their individual socio-demographic characteristics. FSWs with a high degree of collective efficacy are also less likely to report different components of financial vulnerability (e.g. income, saving, expenditure, and debt). Conclusion This study finding suggests that community-led interventions such as improving collectivization are promising strategies to address financial vulnerabilities and a path to a sustainable reduction of HIV risk. This study calls for further evidence-based research and measurement of the effects of community-led approaches in addressing the financial vulnerabilities of the key population at risk for HIV.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46c691f008ea546453ca0c7b67514408",
  "timestamp": "2025-05-15T02:22:56.669291"
}