{
  "id": 3558,
  "title": "Cryptocurrencies as a new trigger for credit card misuse during economic downturns",
  "abstract": "PurposeIn this paper, we empirically investigate how crypto investments in times of economic downturn would affect credit card usage, a widely used payment method that has a significant impact on individual financial well-being.Design/methodology/approachWe carry out an ordinary least squares regression analysis and an instrumental variable design on data from the most recent National Financial Capability Study 2021 (NFCS2021). The NFCS2021 collects information about various demographic and financial backgrounds of US adults.FindingsWe find that crypto investments are associated with a significantly higher likelihood of credit card misuse, as indicated by making only the minim um payments, late payments and using credit cards for cash advances. Meanwhile, social media use is a strong predictor of crypto investments. Results from our analysis are robust after accounting for endogeneity concerns using an instrumental variable design.Originality/valueOur findings provide new insights into the influence of emerging financial instruments on delinquent credit card behaviors, which can further intensify individual and household financial instability during periods of market stress. Furthermore, our findings underscore the necessity of improving individual awareness of the high-risk characteristics of cryptocurrencies, despite their increasing popularity in the financial marketplace in the current financial marketplace.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46e3ac4e75ae862ef88133c4d2518c4d",
  "timestamp": "2025-05-15T02:27:19.140265"
}