{
  "id": 7646,
  "title": "Psychological Distress during Pregnancy in a Multi-Ethnic Community: Findings from the Born in Bradford Cohort Study",
  "abstract": "Purpose: Antenatal anxiety and depression are predictive of future mental distress, which has negative effects on children. Ethnic minority women are more likely to have a lower socio-economic status (SES) but it is unclear whether SES is an independent risk factor for mental health in pregnancy. We described the association between maternal mental distress and socio-demographic factors in a multi-ethnic cohort located in an economically deprived city in the UK. Methods: We defined eight distinct ethno-language groups (total N = 8,454) and classified a threshold of distress as the 75th centile of within-group GHQ-28 scores, which we used as the outcome for univariate and multivariate logistic regression for each ethnic group and for the sample overall. Results: Financial concerns were strongly and independently associated with worse mental health for six out of the eight ethnic groups, and for the cohort overall. In some groups, factors such as working status, education and family structure were associated with worse mental health, but for others these factors were of little importance. Conclusions: The diversity between and within ethnic groups in this sample underlines the need to take into consideration individual social, migration and economic circumstances and their potential effect on mental health in ethnically diverse areas.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46f194b8bc4ca3cdcc2ff38e2837e320",
  "timestamp": "2025-05-15T03:10:33.074377"
}