{
  "id": 5938,
  "title": "Housing Instability and Outcomes Among Patients With Access-Sensitive Surgical Conditions",
  "abstract": "Introduction: Housing instability is a significant contributor to poor health but remains understudied among surgical patients. We evaluated the association between housing instability and rates of unplanned surgical procedures, as well as resultant health and financial outcomes, for patients with access-sensitive conditions. Methods: Using the Healthcare Cost and Utilization Project National Inpatient Sample, we identified patients who underwent one of four selected procedures for access-sensitive surgical conditions (abdominal aortic aneurysm repair, colectomy, incisional hernia repair, and lower extremity bypass). Housing status was determined using International Classification of Disease, 10th Revision, Clinical Modification codes Z59.0 (homelessness) and Z59.1 (lack of adequate housing). Risk-adjusted multivariable logistic regression compared outcomes between patients with and without housing instability. Results: Of 1,761,965 individuals admitted for access-sensitive surgical conditions, 2280 were experiencing housing instability. Housing-unstable individuals had more than four times the odds of undergoing unplanned surgery than housing-stable individuals (odds ratio 4.41, P < 0.001). Across all procedures, individuals with housing instability experienced longer lengths of stay (planned: 5 d versus 4 d, P < 0.001; unplanned: 8 d versus 7 d, P < 0.001) and higher costs per admission following planned surgery ($20,379 versus $18,152, P < 0.001) than housing-stable individuals. Housing-unstable individuals had lower odds of complications and in-hospital mortality following planned surgeries. No differences in morbidity or mortality were identified following unplanned surgeries. Conclusions: Patients experiencing housing instability had higher odds of undergoing unplanned surgical procedures, had longer hospital stays and higher costs, and had similar or better outcomes following surgery. Efforts to expand affordable housing opportunities may improve access to timely surgical care. (c) 2024 Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46f1f5cb51ed0dd65aa3dd1edac415f2",
  "timestamp": "2025-05-15T02:53:03.089383"
}