{
  "id": 5676,
  "title": "Impact of the COVID-19 pandemic on the mental health of nursing students in Japan: a cross-sectional study",
  "abstract": "Background: The effect of the prolonged coronavirus disease (COVID-19) pandemic on the mental health of nursing students is unclear. This study assesses the prevalence of anxiety, depression, and insomnia among nursing students in Japan during the pandemic and determines the risk factors associated with such symptoms. Methods: An online survey-based cross-sectional study was conducted from August 16 to October 16, 2021. Participants were first-to fourth-year nursing students enrolled in undergraduate programs at the eight universities in Japan. Anxiety, depression, and insomnia were assessed using the Generalized Anxiety Disorder-7, Patient Health Questionnaire-9, and Insomnia Severity Index-7, respectively. We calculated descriptive statistics for each measurement item and performed univariate and logistic regression analyses to evaluate the potential risk factors.Results: We received responses from 1,222 of 3,056 nursing students (response rate: 40.0%). After 25 participants were excluded due to missing outcome values, 1,197 students (valid response rate: 98.0%) were included in the analysis. The prevalence of anxiety, depression, and insomnia was 4.8%, 12.4%, and 18.0%, respectively. The risk of anxiety was lower among participants who did not have any relatives or friends who had been infected with SARS-CoV-2 than among those who did (aOR 0.36, 95% CI 0.14-0.94). The risk of depression was higher among participants whose financial status had worsened during the pandemic than among those whose financial status had not changed (aOR 3.44; 95% CI 1.98-5.96). Common factors that increased the risk of anxiety, depression, and insomnia were life satisfaction and fear of COVID-19.Conclusion: Mental health-related symptoms among nursing students in Japan have not necessarily worsened with the spread of COVID-19 but were exacerbated by the intensity of changes in daily living and fear, which are psychosocial effects associated with the pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46f97ee5dcc32ac4a4cc24fb57754e99",
  "timestamp": "2025-05-15T02:50:21.201217"
}