{
  "id": 3173,
  "title": "Analyzing the impact of government R&D subsidy and digital transformation on supply chain risk dynamics management and firm performance in the China's chip industry",
  "abstract": "This study explores the interactions among digital transformation, government R&D subsidy, and supply chain risk dynamics management within the chips industry, spanning from 2013 to 2022. It scrutinizes data derived from annual reports and the China Stock Market & Accounting Research database of 364 listed Chinese chips companies. By integrating natural language processing and machine learning techniques, the paper analyzes textual changes in risk disclosures, providing insights into how firms adapt their risk management strategies in response to evolving market conditions and emerging risks. The study introduces a conceptual model that merges the resource-based view, resource dependence theory and dynamic capabilities with framework of the dynamics of innovation which consists of product innovation and process innovation. The proposed model suggests that strategic use of both R&D subsidies and digital transformation for product/process innovation, thereby enhancing Supply Chain Risk Dynamics Management (SCRDM). Empirical examination of this study reveals that while digital transformation positively influences SCRDM capabilities, enabling better management of supply chain risks, Government R&D subsidy may inadvertently dampen the dynamism essential for effective risk management. Interestingly, the results indicate a negative correlation between SCRDM and firms' return on assets, highlighting the complexities of aligning risk management with financial outcomes. Focusing on the Chinese chips market, the findings suggest a need for policy refinement to foster rather than hinder flexibility and innovation. This research contributes to scholarly discourse and offers practical guidance for industry leaders and policymakers aiming to strengthen supply chain resilience and boost organizational performance in the chips sector.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46fec7b287c41b2c5d1fb4a55bc66c2d",
  "timestamp": "2025-05-15T02:23:33.503372"
}