{
  "id": 7690,
  "title": "The economic burden of chronic diseases with co-occurring depression and alcohol use disorder for people in the Western Cape, South Africa",
  "abstract": "There is limited evidence on the economic burden of chronic diseases with co-occurring depression and alcohol use disorder (AUD) for people in low-and middle-income countries. We describe patient costs related to the utilisation of services and identify factors associated with the economic burden of co-occurring depression and AUD for people with HIV and/or diabetes using government health services in South Africa. We used baseline data from participants enrolled in a cluster randomised controlled trial (RCT). The sample (N = 1340) comprised participants classified as having risk of depression but not AUD (n = 689), risk of AUD but not of depression (n = 221); or risk of depression and AUD (n = 430). We measured total patient costs (direct patient costs (out-of-pocket payments (OOPP) plus indirect patient costs), and catastrophic costs. We applied a conceptual framework to guide multiple linear and logistic regression analyses examining factors associated with economic burden. Mean monthly total costs per patient and the percentage of these total costs attributable to OOPP were (US$9.78 [56.13%]; US$5.98 [24.58%]; US$7.16 [34.07%]) for the depression, AUD, and AUD and depression groups respectively. The depression group reported significantly more visits to private healthcare providers, higher OOPP and higher prevalence of catastrophe than other groups. OOPP were positively associated with urban location and higher educational attainment. Total patient costs were positively associated with urban location, HIV and diabetes comorbidity, and being employed. Higher utilisation was associated with greater odds of in-come loss. Results indicate a concerning economic burden in people with a chronic disease and co-occurring depression or AUD and suggest that cost and time may present barriers to accessing care. Given that psycho-logical treatments for mental health conditions are largely unavailable in government health services, improving access to care for the most vulnerable may require coordination of financial risk protection mechanisms alongside scale-up of effective first-line psychological treatments.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "46ff8340308b83ed39ee913529ef5875",
  "timestamp": "2025-05-15T03:11:04.569349"
}