{
  "id": 7138,
  "title": "A framework for chemical safety assessment incorporating new approach methodologies within REACH",
  "abstract": "The long-term investment in new approach methodologies (NAMs) within the EU and other parts of the world is beginning to result in an emerging consensus of how to use information from in silico, in vitro and targeted in vivo sources to assess the safety of chemicals. However, this methodology is being adopted very slowly for regulatory purposes. Here, we have developed a framework incorporating in silico, in vitro and in vivo methods designed to meet the requirements of REACH in which both hazard and exposure can be assessed using a tiered approach. The outputs from each tier are classification categories, safe doses, and risk assessments, and progress through the tiers depends on the output from previous tiers. We have exemplified the use of the framework with three examples. The outputs were the same or more conservative than parallel assessments based on conventional studies. The framework allows a transparent and phased introduction of NAMs in chemical safety assessment and enables science-based safety decisions which provide the same level of public health protection using fewer animals, taking less time, and using less financial and expert resource. Furthermore, it would also allow new methods to be incorporated as they develop through continuous selective evolution rather than periodic revolution.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "470746b99c282b9588b540646dfc1407",
  "timestamp": "2025-05-15T03:05:32.056808"
}