{
  "id": 1171,
  "title": "Forecasting solar stock prices using tree-based machine learning classification: How important are silver prices?",
  "abstract": "Solar energy is one of the fastest growing sources of electricity generation. Forecasting solar stock prices is important for investors and venture capitalists interested in the renewable energy sector. This paper uses tree-based machine learning methods to forecast the direction of solar stock prices. The feature set used in prediction includes a selection of well-known technical indicators, silver prices, silver price volatility, and oil price volatility. The solar stock price direction prediction accuracy of random forests, bagging, support vector machines, and extremely randomized trees is much higher than that of logit. For a forecast horizon of between 8 and 20 days, random forests, bagging, support vector machines, and extremely randomized trees achieve a prediction accuracy greater than 85%. Although not as prominent as technical indicators like MA200, WAD, and MA20, oil price volatility and silver price volatility are also important predictors. An investment portfolio trading strategy based on trading signals generated from the extremely randomized trees stock price direction prediction outperforms a simple buy and hold strategy. These results demonstrate the accuracy of using tree-based machine learning methods to forecast the direction of solar stock prices and adds to the broader literature on using machine learning techniques to forecast stock prices.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "470c2807a911ab01ccc400e4cb46073b",
  "timestamp": "2025-05-15T00:52:33.868615"
}