{
  "id": 2141,
  "title": "ANN and SSO Algorithms for a Newly Developed Flexible Grid Trading Model",
  "abstract": "In the modern era, the trading methods and strategies used in the financial market have gradually changed from traditional on-site trading to electronic remote trading, and even online automatic trading performed by pre-programmed computer programs. This is due to the conduct of trading automatically and self-adjustment in financial markets becoming a competitive development trend in the entire financial market, with the continuous development of network and computer computing technology. Quantitative trading aims to automatically form a fixed and quantifiable operational logic from people's investment decisions and apply it to the financial market, which has attracted the attention of the financial market. The development of self-adjustment programming algorithms for automatically trading in financial markets has transformed to being a top priority for academic research and financial practice. Thus, a new flexible grid trading model incorporating the Simplified Swarm Optimization (SSO) algorithm for optimizing parameters for various market situations as input values and the Fully Connected Neural Network (FNN) and Long Short-Term Memory (LSTM) model for training a quantitative trading model for automatically calculating and adjusting the optimal trading parameters for trading after inputting the existing market situation are developed and studied in this work. The proposed model provides a self-adjust model to reduce investors' effort in the trading market, obtains outperformed Return of Investment (ROI) and model robustness, and can properly control the balance between risk and return.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "471226dea449c83b7ea012a7a8a46abf",
  "timestamp": "2025-05-15T02:11:40.591358"
}