{
  "id": 3407,
  "title": "Cross-Validation of the Financial Exploitation Vulnerability Scale",
  "abstract": "ObjectivesThe present study is a cross-validation of the Financial Exploitation Vulnerability Scale (FEVS), a measure of contextual risk for financial exploitation.MethodsThe sample was drawn from both the community and the SAFE program, a service for older adults who have been financially scammed. FEVS was administered within a larger assessment battery. The total score ability to differentiate exploitation groups and its correlates were examined. ROC analysis and logistic regression evaluated the clinical utility of the FEVS to detect exploitation. Results were compared to the initial validation study.ResultsFEVS score was significantly higher for those who were exploited and correlated with age. ROC analysis revealed adequate detection of financial exploitation. FEVS total score remained a strong predictor of exploitation when compared to demographic factors and several measures of cognitive functioning.ConclusionsCross-validation demonstrates strong evidence that the FEVS detects financial exploitation in older adults, beyond the ability of many known risk factors.Clinical ImplicationsFEVS is an evidence-based tool for identifying exploitation and is accessible to many professionals working with older adults. Items query contextual factors that allow professionals to support clients with the appropriate standard of care.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "471b5223c3de85fa4ee68809094c6cf6",
  "timestamp": "2025-05-15T02:25:40.237291"
}