{
  "id": 8550,
  "title": "Incidence of Herpes Zoster Ophthalmicus: Results from the Pacific Ocular Inflammation Study",
  "abstract": "Purpose: To provide a population-based estimate of the incidence of herpes zoster ophthalmicus (HZO) with comparisons across racial, sex, and age groups, as well as to estimate the frequency of postherpetic neuralgia (PHN). Design: Retrospective, population-based cohort study. Participants: All patients enrolled in the Kaiser Permanente Hawaii health plan during the study period (N = 217 061). Methods: All patient encounters between January 1, 2006, and December 31, 2007, in the electronic medical record of Kaiser Permanente Hawaii were queried for International Classification of Diseases, 9th edition (ICD-9) codes corresponding to HZO. Charts were reviewed to confirm a diagnosis of HZO and to collect information about specific ocular manifestations. Demographic data and information on PHN were collected electronically. Incidence rates were calculated per 100 000 person-years for the entire population and for age-, sex-, and race-specific subgroups. Main Outcome Measures: Clinical diagnosis of HZO during the study period. Results: A total of 134 cases of HZO were identified in this population of 217 061 people. The overall incidence was 30.9 per 100 000 person-years (95% confidence interval [CI], 25.9-36.6). The incidence rate for the population aged >= 65 years was 104.6 per 100 000 person-years (95% CI, 79.0-135.9), approximately 5 times the remainder of the population (P < 0.001). The most common manifestation of HZO was dermatitis, followed by keratitis and conjunctivitis. The incidence of HZO for Pacific Islanders was 19.0 per 100 000 person-years (95% CI, 12.4-28.3), which was significantly lower than the rate for non-Pacific Islanders (P = 0.007). Twenty-one percent of patients with HZO developed PHN. Older age and HZO with keratitis, conjunctivitis, or uveitis were found to be risk factors for PHN. Conclusions: This study provides a population-based estimate of HZO and highlights differences across various age and racial groups. It also suggests that demographic characteristics may be useful in determining the risk of developing HZO. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2013;120:451-456 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "471b1d9483c72071b6bdf315a0586785",
  "timestamp": "2025-05-15T03:19:52.170699"
}