{
  "id": 8339,
  "title": "Financial Barriers to Care Among Low-Income Children With Asthma Health Care Reform Implications",
  "abstract": "IMPORTANCE The Patient Protection and Affordable Care Act (ACA) includes subsidies that reduce patient cost sharing for low-income families. Limited information on the effects of cost sharing among children is available to guide these efforts. OBJECTIVE To examine the associations between cost sharing, income, and care seeking and financial stress among children with asthma. DESIGN, SETTING, AND PARTICIPANTS A telephone survey in 2012 about experiences during the prior year within an integrated health care delivery system. Respondents included 769 parents of children aged 4 to 11 years with asthma. Of these, 25.9% of children received public subsidies; 21.7% were commercially insured with household incomes at or below 250% of the federal poverty level (FPL) and 18.2% had higher cost-sharing levels for all services (eg, >=$75 for emergency department visits). We classified children with asthma based on (1) current receipt of a subsidy (ie, Medicaid or Children's Health Insurance Program) or potential eligibility for ACA low-income cost sharing or premium subsidies in 2014 (ie, income <= 250%, 251%-400%, or >400% of the FPL) and (2) cost-sharing levels for prescription drugs, office visits, and emergency department visits. We examined the frequency of changes in care seeking and financial stress due to asthma care costs across these groups using logistic regression, adjusted for patient/family characteristics. MAIN OUTCOMES AND MEASURES Switching to cheaper asthma drugs, using less medication than prescribed, delaying/avoiding any office or emergency department visits, and financial stress (eg, cutting back on necessities) because of the costs of asthma care. RESULTS After adjustment, parents at or below 250% of the FPL with lower vs higher cost-sharing levels were less likely to delay or avoid taking their children to a physician's office visit (3.8% vs 31.6%; odds ratio, 0.07 [95% CI, 0.01-0.39]) and the emergency department (1.2% vs 19.4%; 0.05 [0.01-0.25]) because of cost; higher-income parents and those whose children were receiving public subsidies (eg, Medicaid) were also less likely to forego their children's care than parents at or below 250% of the FPL with higher cost-sharing levels. Overall, 15.6% of parents borrowed money or cut back on necessities to pay for their children's asthma care. CONCLUSIONS AND RELEVANCE Cost-related barriers to care among children with asthma were concentrated among low-income families with higher cost-sharing levels. The ACA's low-income subsidies could reduce these barriers for many families, but millions of dependents for whom employer-sponsored family coverage is unaffordable could remain at risk for cost-related problems because of ACA subsidy eligibility rules.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "472975aa6638c9f24da669122af970b6",
  "timestamp": "2025-05-15T03:17:49.149890"
}