{
  "id": 4696,
  "title": "Activity Internationalization and Innovation in SME: Searching Building Blocks for Rating Models",
  "abstract": "For many SME innovation-centered internationalization may be the only way into sustained growth which can attract sufficient mid- and long-term financial support. Hence, we expect that it should be worthwhile, to classify SME according to whether they will be capable of accomplishing the required innovation-internationalization link. Obviously, such a risk rating cannot be obtained by solely recurring to the more traditional, finance-oriented indicators as used e. g. in models for bankruptcy prediction. In this paper we propose first steps towards constructing such a extended classification model for SME recurring to certain group level effects which may occur when the firms are pursuing their innovation-internationalization activities within a cluster of technologically related firms. In order to obtain some empirical motivation for such an approach, we first discuss the case of a Romanian SME cluster from the furniture sector, heavily involved in international activities and which is also exposing some readiness to innovate. We then comment on the pervasiveness of the example and we evaluate a simple mechanism for deriving the named group level effects of innovation and internationalization activities which serve as additional indicators for determining the risk class of a single SME. Finally we discuss the role and usefulness of such derived indicators within more traditional classification models and we propose extended classification models which use this structural information about the SME cluster in a consistent way. Potential applications of such rating models range from banks issuing credit to SME to decision support for SME-related economic policy. The building blocks used in this paper stem from empirical economic models, from optimization and coalition formation as well as from structure representation in classification models.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47714a6df02ce3a5774873cc6e98f37c",
  "timestamp": "2025-05-15T02:39:57.588749"
}