{
  "id": 2589,
  "title": "Precision Reimbursement for Precision Medicine: Using Real-World Evidence to Evolve From Trial-and-Project to Track-and-Pay to Learn-and-Predict",
  "abstract": "Basic scientists and drug developers are accelerating innovations toward the goal of precision medicine. Regulators create pathways for timely patient access to precision medicines, including individualized therapies. Healthcare payors acknowledge the need for change but downstream innovation for coverage and reimbursement is only haltingly occurring. Performance uncertainty, high price-tags, payment timing, and actuarial risk issues associated with precision medicines present novel financial challenges for payors. With traditional drug reimbursement frameworks, payment is based on an assumed randomized controlled trial (RCT) projection of real-world effectiveness, a trial-and-project strategy; the clinical benefit realized for patients is not usually ascertained ex post by collection of real-world data (RWD). To mitigate financial risks resulting from clinical performance uncertainty, manufacturers and payors devised track-and-pay frameworks (i.e., the tracking of a pre-agreed treatment outcome which is linked to financial consequences). Whereas some track-and-pay arrangements have been successful, inherent weaknesses include the potential for misalignment of incentives, the risk of channeling of patients, and a failure to use the RWD generated to enable continuous learning about treatments. Precision reimbursement (PR) intends to overcome inherent weaknesses of simple track-and-pay schemes. In combining the collection of RWD with advanced analytics (e.g., artificial intelligence and machine learning) to generate actionable real-world evidence, with prospective alignment of incentives across all stakeholders (including providers and patients), and with pre-agreed use and dissemination of information generated, PR becomes a learn-and-predict model of payment for performance. We here describe in detail the concept of PR and lay out the next steps to make it a reality.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "477410156aaf6bbdfe3e0d070f0c6bba",
  "timestamp": "2025-05-15T02:17:01.710412"
}