{
  "id": 5139,
  "title": "Comparing outcomes in renal replacement therapy: How should we correct for case mix?",
  "abstract": "The need to evaluate the effectiveness of clinical practice to justify expensive therapy in the face of financial constraints in all areas of health care delivery makes it necessary to identify groups of patients who are likely to benefit most from treatment. Various risk stratification methods have been used for analyzing survival probabilities for patients receiving renal replacement therapy. Complicated risk stratification methods produce large numbers of risk groups of small sizes, which makes comparison between individual centers difficult. We compared three simple methods of risk stratification, that divided patients into low-, medium-, and high-risk groups, in a cohort of 1,407 patients who commenced renal replacement therapy in five European countries during a 7-year period. Method 1 considered age (>55 years) and diabetes alone; method 2 used a higher age limit (>70 years) and comorbid illnesses, including those other than diabetes; and method 3 used only the number of comorbidities (none, 1, or greater than or equal to 2) for stratification. Kaplan-Meier survival curves were constructed for comparison between risk groups and Cox's regression model used to assess strength of relationship with mortality. Although patient survival was significantly different between the low-, medium-, and high-risk groups using all three methods, Cox's regression analysis showed that method 2 provided the greatest discrimination between risk groups. In predicting mortality, method 2 (based on comorbidities and age) showed the highest sensitivity and specificity (84% and 80%, respectively) compared with method 1 (80% and 74%) and method 3 (64% and 82%). Validation of this approach in other populations in a prospective study is required before this method, which takes into account the influences of both age and comorbidity for risk stratification, can be used for comparing survival data and for presenting results of renal replacement therapy. (C) 1998 by the National Kidney Foundation, Inc.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "477e93192eb65d4a28ec8c7ee86ad546",
  "timestamp": "2025-05-15T02:44:43.905056"
}