{
  "id": 9136,
  "title": "No healthcare coverage, big problem: lack of insurance for older population associated with worse emergency general surgery outcomes",
  "abstract": "Introduction Older populations, being a unique subset of patients, have poor outcomes for emergency general surgery (EGS). In regions lacking specialized medical coverage for older patients, disparities in healthcare provision lead to poor clinical outcomes. We aimed to identify factors predicting index admission inpatient mortality from EGS among sexagenarians, septuagenarians, and octogenarians. Methods Data of patients aged >60 years with EGS conditions defined by the American Association for the Surgery of Trauma at primary index admission from 2010 to 2019 operated and non-operated at a large South Asian tertiary care hospital were analyzed. The primary outcome was primary index admission inpatient 30-day mortality. Parametric survival regression using Weibull distribution was performed. Factors such as patients' insurance status and surgical intervention were assessed using adjusted HR and 95% CI with a p-value of <0.05 considered statistically significant. Results We included 9551 primary index admissions of patients diagnosed with the nine most common primary EGS conditions. The mean patient age was 69.55 +/- 7.59 years. Overall mortality and complication rates were 3.94% and 42.29%, respectively. Primary index admission inpatient mortality was associated with complications including cardiac arrest and septic shock. Multivariable survival analysis showed that insurance status was not associated with mortality (HR 1.13; 95% CI 0.79, 1.61) after adjusting for other variables. The odds of developing complications among self-paid individuals were higher (adjusted OR 1.17; 95% CI 1.02, 1.35). Conclusion Lack of healthcare coverage for older adults can result in delayed presentation, leading to increased morbidity. Close attention should be paid to such patients for timely provision of treatment. There is a need to expand primary care access and proper management of comorbidities for overall patient well-being. Government initiatives for expanding insurance coverage for older population can further enhance their healthcare access, mitigating the risk of essential treatments being withheld due to financial limitations. Level of evidence III.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4781ba92c99d7498a1ee38235e0e27a4",
  "timestamp": "2025-05-15T03:25:54.609930"
}