{
  "id": 8963,
  "title": "Performance measurement of ESG-themed megatrend investments in global equity markets using pure factor portfolios methodology",
  "abstract": "ESG factors are becoming mainstream in portfolio investment strategies, attracting increasing fund inflows from investors who are aligning their investment values to Sustainable Development Goals (SDG) declared by the United Nations Principles for Responsible Investments. Do investors sacrifice return for pursuing ESG-aligned megatrend goals? The study analyses the risk-adjusted financial performance of ESG-themed megatrend investment strategies in global equity markets. The analysis covers nine themes for the period 2015-2019: environmental megatrends covering energy efficiency, food security, and water scarcity; social megatrends covering ageing, millennials, and urbanisation; governance megatrends covered by cybersecurity, disruptive technologies, and robotics. We construct megatrend factor portfolios based on signalling theory and formulate a novel measure for stock megatrend exposure (MTE), based on the relative fund flows into the corresponding thematic ETFs. We apply pure factor portfolios methodology based on constrained WLS cross-sectional regressions to calculate Fama-French factor returns. Time-series regression rests on the generalised method of moments estimator (GMM) that uses robust distance instruments. Our findings show that each environmental megatrend, as well as the disruptive technologies megatrend, yielded positive and significant alphas relative to the passive strategy, although this outperformance becomes statistically insignificant in the Fama-French 5-factor model context. The important result is that most of the megatrend factor portfolios yielded significant non-negative alphas; which supports our assumption that megatrend investing strategy promotes SDGs while not sacrificing returns, even when accounting for transaction costs up to 50bps/annum. Higher transaction costs, as is the case for some of these ETFs with expense ratios reaching 80-100bps, may be an indication of two things: ESG-themed megatrend investors were willing to sacrifice ca. 30-50bps of annual return to remain aligned with sustainability targets, or that expense ratio may well decline in the future.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4781a915d8f972aae3ad930ea1793d69",
  "timestamp": "2025-05-15T03:24:26.239455"
}