{
  "id": 3903,
  "title": "Does corporate governance moderate the relationship between internal control system effectiveness and SMEs financial performance in Ghana?",
  "abstract": "The study examined the effect of the major component of an internal control system according to the COSO framework on the financial performance of SMEs registered with the Association of Ghana Industries (AGI) in Ghana. The study further examined the moderating role of corporate governance practice on the relationship between the components of the internal control system and the financial performance of SMEs registered with AGI. The study surveyed 300 SMEs registered with AGI in Ghana using a questionnaire as the main instrument of data collection. The data were analysed using Pearson correlation analysis and hierarchical regression analysis to achieve the above-stated objectives. The results of the study showed that all the five major components of the internal control system (control environment, control activities, risk assessment, information, and communication and monitoring) have a positive and significant relationship with the financial performance of SMEs registered with AGI. The study further revealed that effective corporate governance practice moderates the relationship between all five components of the internal control system and the financial performance of SMEs registered with AGI in Ghana. The interaction between the independent variables and financial performance is stronger with the introduction of corporate governance practices.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47817e7437f26fd60f1a52ed549d302d",
  "timestamp": "2025-05-15T02:30:58.385334"
}