{
  "id": 3057,
  "title": "REVISITING THE INFLUENCE OF REFORMED PENSION REGIMES ON DOMESTIC CAPITAL MARKETS: 1990-2014",
  "abstract": "Personal funded systems have experienced significant growth in recent decades, following the trend of aging populations and crises in pension systems that have affected all countries globally. The aim of this study was to determine whether the implementation of these pension schemes has developed domestic capital markets, as established by structural reforms. For this purpose, regression data panels were constructed using indicators of depth and liquidity of stock and bond markets as well as variables representing pension systems and other indicators of development of financial markets in the period 1990-2014. The regressions also considered the detected linkages between pension systems, using a methodology based on clustering analysis and hierarchical tree statistical tools, following representative statistical information of their performance. The results showed that the seniority of the systems was relevant to explain the associations between them, but not the mandatory or voluntary nature of systems nor their geographical location. There were important sources of heterogeneity of the impact of pension funds on capital markets. The analysis revealed that individual capitalization pension schemes have meant a stimulus to stock market depth. Membership to a cluster determined significant impacts of pension systems on capital market development indicators. Stock markets depth and liquidity indicators received the positive impacts of greater magnitude from those systems included in the intermediate gradual maturation cluster. Pension schemes belonging to the low gradual and incipient maturation cluster exerted significant incentive on public bond markets depth. The high gradual maturation cluster was associated with substantial increases in stock depth as well as public bond depth. On the other hand, the advanced maturation cluster showed a positive impact on private bond depth, as well as systems with an incipient maturation. A negative causality with stock market liquidity was also evidenced for the incipient maturation cluster, which was linked to the long-term profile of pension portfolio management that privileges funding strategies to trading strategies.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "478603b989491ccb5b1f730d1583336b",
  "timestamp": "2025-05-15T01:13:09.843655"
}