{
  "id": 62,
  "title": "Application of Machine Learning in Credit Risk Assessment: A Prelude to Smart Banking",
  "abstract": "A precise credit risk assessment system is always vital to any financial institution for impeccable and gainful functioning. In such an ever-changing economy as the rate of loan defaults are gradually increasing, authorities of financial institutions are finding it more and more difficult to correctly assess loan requests and tackle the risks of loan defaulters. In light of these events this paper proposes a machine learning model which can precisely assess credit risk and predict possible loan defaulters for credit lending institutions. A comparative analysis has been made using tuned supervised learning algorithms such as Support Vector Machine, Random Forest, Extreme Gradient Boosting and Logistic Regression for identifying defaulters. Recursive Feature Elimination with Cross-Validation and Principal Component Analysis have been used for dimensionality reduction. Metrics such as F1 score, AUC score, prediction accuracy, precision and recall have been used to evaluate each model. Among all the models, the combination of a tuned Support Vector Machine and Recursive Feature Elimination with Cross-Validation have shown great promise in identifying loan defaulters. The proposed model, therefore, can assist financial institutions in accurately identifying loan defaulters and prevent them from incurring further loss.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "479a9ab321a9300566f8a6689d792c68",
  "timestamp": "2025-05-15T01:46:03.935790"
}