{
  "id": 7563,
  "title": "Electronic Medication Regimen Complexity Index at admission and complications during hospitalization in medical wards: a tool to improve quality of care?",
  "abstract": "Objective: Adverse events during hospitalization are a major worry considering their frequency and their burden. Many could be avoided by immediate identification of at-risk patients at admission and adapted prevention. The complexity of a patient's medication regimen immediately available at admission is a good indicator of the complexity of the patient's condition. This study aims to determine whether the electronic Medication Regimen Complexity Index (MRCI) at admission is associated with complications during hospitalization. Design: We performed a multilevel logistic regression model, adjusted for age and sex. Setting: Premier Perspective T database, a clinical and financial information system from 417 US hospitals. Participants: Adults hospitalized for more than 3 days in a medical ward and included in Premier's Perspective T database for 2006. Intervention(s): Multilevel logistic regression. Main Outcome Measure: Association of the MRCI and complications during hospitalization, defined as in-hospital death, hospital-acquired infection, pressure ulcers; and need for highly technical healthcare, identified as the secondary introduction of catecholamines. Results: In total, 1 592 383 admissions were included. The median MRCI at admission was 13 [interquartile range: 9-19]. The higher the MRCI, the higher the adjusted odds ratio of the following: in-hospital mortality, hospital-acquired infections, pressure ulcers and the secondary introduction of catecholamines. Conclusions: Our results suggested that the MRCI at admission was correlated with patient complexity, independent of age. Considering that patients with complex conditions pose a heavier workload for staff, measuring MRCI at admission could be used to allocate resources in medical wards at an institutional level. The MRCI might be a useful tool to assess the management of care.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47a54dfc7883fee3bd636f66ec41d50b",
  "timestamp": "2025-05-15T03:10:05.508470"
}