{
  "id": 1062,
  "title": "Optimizing fraud detection in financial transactions with machine learning and imbalance mitigation",
  "abstract": "The rapid advancement of the Internet and digital payments has transformed the landscape of financial transactions, leading to both technological progress and an alarming rise in cybercrime. This study addresses the critical issue of financial fraud detection in the era of digital payments, focusing on enhancing operational risk frameworks to mitigate the increasing threats. The objective is to improve the predictive performance of fraud detection systems using machine learning techniques. The methodology involves a comprehensive data preprocessing and model creation process, including one-hot encoding, feature selection, sampling, standardization, and tokenization. Six machine learning models are employed for fraud detection, and their hyperparameters are optimized. Evaluation metrics such as accuracy, precision, recall, and F1-score are used to assess model performance. Results reveal that XGBoost and Random Forest outperform other models, achieving a balance between false positives and false negatives. The study meets the requirements for fraud detection systems, ensuring accuracy, scalability, adaptability, and explainability. This paper provides valuable insights into the efficacy of machine learning models for financial fraud detection and emphasizes the importance of striking a balance between false positives and false negatives.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47b9fa49e0c0bc688debbe89d2d7013c",
  "timestamp": "2025-05-15T01:58:08.699184"
}