{
  "id": 7289,
  "title": "Older family caregivers' diet-related disparities: Cross-sectional evidence from Finland",
  "abstract": "Background: Some older family caregivers experience financial vulnerabilities due to their caregiving role, which may affect their ability to afford appropriate food. This study aimed to assess the extent to which there are diet-related disparities among older family caregivers in Eastern Finland. Methods: This study is based on the multidisciplinary LifEstyle, NutriTion and Oral health in caregivers (LENTO) study. In total, 125 family caregivers were included. Data were collected between June and December 2019. Participants were assessed on health, nutritional status and sociodemographic factors. The associations and predictors of diet-related disparities were assessed using the independent samples t-test, ANOVA-test, chi(2)-tests and binary logistic regression. Results: The mean age of family caregivers was 74 years (SD = 8). Most were female (72%), 20% had malnutrition risk and 30% reported having 'moderately enough money' or less, which was identified as 'subjective poverty'. Family caregivers experiencing subjective poverty were less likely to consume two or more portions of fruit and vegetables daily and were more likely overweight. Study participants' diet-related disparities were further associated with several health inequalities, including comorbidity, depression, diabetes (Type I or II) and osteoporosis. Conclusions: Older family caregivers have diet-related disparities, further associated with health inequalities. Family caregivers' diet-related disparities require increasing attention in healthcare. Addressing family caregivers' food insecurity risk would enhance their health equity. Lack of assessment of diet-related disparities will only deepen health inequalities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47c29317ace121a248c99dba1757a8e7",
  "timestamp": "2025-05-15T03:07:02.634790"
}