{
  "id": 7536,
  "title": "Factors determining access to surgery for children with congenital cardiac disease in Guatemala, Central America",
  "abstract": "Background: Surgical intervention for children with congenital cardiac disease in the developing world often occurs late. Our objective was to identify factors that placed Guatemalan children at risk for delayed care. Methods: We investigated the medical and socioeconomic background of 178 children under the age of 18 years who received their first corrective surgery for congenital cardiac disease at the Unidad de Cirugia Cardiovascular de Guatemala in 2002. A retrospective review of medical records was performed. Each case was stratified into one of three surgical classes based upon customary practice in the United States of America. The outcome we measured was age at surgery, adjusting for the surgical class. Logistic regression was performed and odds ratios calculated. Results: In univariate analyses, patients presented later for surgery if they were from rural areas (p equals 0.001), did not have social security membership (p equals 0.004), or paid any amount towards the cost of their surgery (p less than 0.001). Age at surgery was also positively correlated with the distance of the home of the patient from the surgical centre (p equals 0.002). For the subset of patients who applied for financial assistance, we found that children presented later for surgery if they required institutional support (p equals 0.001), or came from households of larger size (p less than 0.001). Conclusions: Guatemalan children with congenital cardiac disease may be at risk for delayed surgical care if they come from rural areas, areas distant from the surgical centre, or from families without membership of social security.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47c5211bd22f32f3c8aed2697b2fdcea",
  "timestamp": "2025-05-15T03:09:36.899602"
}