{
  "id": 7159,
  "title": "Cancer screening and its associated factors in hypertensive individuals: new insights from the 2021 STEPs national study in Iran",
  "abstract": "BackgroundCancer continues to be a major cause of death worldwide with almost 10 million deaths from cancer each year and a significant financial burden on healthcare systems. Hypertension can increase the risk of developing certain cancers and their complications, necessitating higher screening rates in the hypertensive population. Although screening for cancer can reduce mortality rates and help with early diagnosis, the screening rates in Iran are far below the optimal level. This study aimed to identify factors associated with cancer screening participation among hypertensive individuals.MethodsWe utilized data from the STEPs 2021 survey, a large-scale nation-wide cross-sectional study conducted in Iran to assess non-communicable disease (NCD) risk factors. The survey followed the WHO's STEPwise approach and included adults aged 18 and older from both urban and rural areas of 31 provinces of Iran. The effect of each covariate on different types of cancer screening was determined using odds ratios (ORs) which were estimated using univariate and multivariate logistic regression models.ResultsWe found that screening rates were significantly influenced by age, marital status, employment, wealth, and residential area. Middle-aged women were more likely to participate in breast and cervical cancer screenings, whereas prostate cancer screening was more common among men aged 70 and older. Furthermore, awareness and control of hypertension, a history of cancer, comorbid chronic diseases, and receiving lifestyle advice were all associated with increased screening participation. Lifestyle scores, BMI, education level, and insurance coverage were all linked to higher screening rates for most cancer types.ConclusionDespite these findings, cancer screening rates in Iran remain alarmingly low, particularly among high-risk groups such as hypertensive individuals. Urgent reforms and targeted strategies are required to increase screening uptake and enhance early detection efforts in populations at risk.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47f8f8203f636bad3d87227b3ef60071",
  "timestamp": "2025-05-15T03:05:32.122125"
}