{
  "id": 3865,
  "title": "Hedging uncertainty with cryptocurrencies: Is bitcoin your best bet?",
  "abstract": "Are cryptocurrencies useful minimum-variance hedging instruments? This paper develops a two-step analytical framework to explore this question across time. First, it estimates dynamic optimal weights, calibrated when investing between the aggregate market and a respective sampled cryptocurrency. This is performed separately for 11 major cryptocurrencies using the dynamic conditional correlation approach of Engle. Second, using a fractional regression approach, it uncovers linkages between optimal weights in cryptocurrencies and sources of economic uncertainty. Overall, this paper makes the following important findings. First, optimal weights in cryptocurrencies all rose rapidly during the COVID-19 pandemic. In all, bitcoin showed to be the leading cryptocurrency in terms of hedging effectiveness during this recent time period. Second, most cryptocurrencies exhibit zero or negative betas consistently across time, thus making them natural hedging instruments for investors seeking to reduce their portfolio's comovement with the market. Finally, cryptocurrencies serve as better hedges for economic uncertainties arising from equity and commodity markets. They are relatively less effective for uncertainties arising from risks in the banking industry and firm default risk. This paper contributes broadly to the asset pricing literature since our two-step approach herein can tractably be extended to other asset classes or other econometric measures of systematic risk.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "47fe7f7d3c23dfda7b8a744720074302",
  "timestamp": "2025-05-15T01:21:41.363315"
}