{
  "id": 2875,
  "title": "Railroad Near-Miss Occurrence Detection and Risk Estimation System with Data from Camera Using Deep Learning",
  "abstract": "An unsafe railway operation system has both direct and indirect societal consequences. Railway accidents are a major safety and financial issue for the railroad industry. Estimating the risk of railway accidents is critical for safety, as it will support in the development of secure railway operations and reduce the further risks associated with railway systems. For many years, researchers have explored various techniques for obstacles detection and early detection of railroad accidents to aid in railway incident management. With recent advancements in machine learning algorithms and data collection techniques, there are a growing number of research studies to provide suitable solutions for the railway safety system. In this paper, we present a novel approach for detecting near-miss occurrences and estimating the risk of event with data from camera using deep learning models. Our proposed approach detects and localizes foreign objects on the railroad. It also detects the position of rail tracks using a segmentation method to estimate the risk of near-miss occurrence by calculating the distance between the detected objects to the rail track. A proposed approach successfully analyzed input image into a rail track segmentation and detection of foreign objects on rail track. Experimental results demonstrate the effectiveness of the proposed approach and its suitability for a complex real-world railway systems.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "480054e6f0c1c545137d12728d847c44",
  "timestamp": "2025-05-15T02:20:16.829004"
}