{
  "id": 4541,
  "title": "To assess the multiperiod market risk with deep learning method taking the boosting additive quantile regression as an example",
  "abstract": "Compared with current risks, future risks are more important for investment decisions and risk management. This paper modifies the Square Root of Time Rule with the boosting additive quantile regression model to forecast multi-period horizon market risk. In J. P. Morgan's RiskMetrics Model, the k-period horizon value at risk (VaR) equals to k sigma(boolean AND)t(1). Since its assumptions are too strict, expected capacity of Risk Metrics is not so well. Taylor relaxed assumptions of this model, used the GARCH model to replace the IGARCH model, and obtained multi-period horizon VaR, which is a nonlinear function of the one-step-ahead volatility forecast sigma(boolean AND)t(1).The conditional mean mu(t) is zero in Taylor's model, but Tsay pointed out that this assumption (mu(t) = 0) does not always hold. Therefore, we relax this assumption about the conditional mean, and obtain the VaR which is mixed function consisting of two parts, one is a linear function of conditional mean, and the other is a nonlinear function of sigma(boolean AND)t(1), given the holding horizon k. For our mixed VaR function, we chose a more appropriate method, the boosting additive quantile regression model, to forecast multi-period horizon VaR. Taking log-returns of the Hang Seng Index from January 1, 2007 to November 1, 2016 as the sample, weforecast the 5-, 10-, 15-, and 20-day horizon VaRs, and compare the prediction accuracy of Morgan's model withour quantile regression model through likelihood ratio tests. Results show that VaR based on the quantile regression model is not only more accurate, but also sensitive to volatility, and is conducive to maintaining a reasonable risk reserve level for financial institutions, enabling them to pay less for regulation andachieve incentive compatibility.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4815b8850b14e8e9832d0f9706d7a767",
  "timestamp": "2025-05-15T02:38:20.407051"
}