{
  "id": 7511,
  "title": "Association of Safety-Net Hospital Status With Outcomes Following Head and Neck Cancer Operations",
  "abstract": "Objective. To assess perioperative and readmission outcomes of patients undergoing head and neck cancer (HNCA) surgery at safety-net hospitals (SNHs) in a modern cohort. Study Design. Retrospective cohort study. Setting. Nationwide Readmissions Database (NRD), 2010 to 2019. Methods. All elective adult (>= 18 years) admissions involving HNCA resection were identified from the NRD. To calculate safety-net burden, the proportion of Medicaid or uninsured patients admitted to each hospital for any indication was tabulated annually, with centers in the highest quartile defined as SNHs. To perform risk adjustment in assessing perioperative and readmission outcomes, multivariable regression models were developed. Results. Of an estimated 133,018 head and neck surgical patients, 26.5% (n = 35,268) received treatment at a SNH. Utilization of SNHs increased over the decade-long study period, with 29.8% of individuals treated at these sites in 2019. After multivariable adjustment, several patient factors were noted to be associated with SNHs, including younger age, lower comorbidity burden, and income within the lowest quartile. Although incidence of adverse events decreased at both SNHs and non-SNHs during the study period, treatment at SNHs remained associated with these events after risk adjustment (adjusted odds ratio: 1.17, 95% confidence interval: 1.08-1.28, P < .001). Conclusion. SNHs continue to provide valuable specialty care to underserved populations, often with limited financial resources. Despite promising results from prior decades demonstrating comparable perioperative outcomes, the present study noted increased adverse events following HNCA surgery at these sites. Such findings underscore the need for continued advocacy to secure necessary funding for these centers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4824dc5fae592109153cd6e9f509d5a3",
  "timestamp": "2025-05-15T03:09:07.391137"
}