{
  "id": 4987,
  "title": "Adverse life experiences and common mental health problems in pregnancy: a causal pathway analysis",
  "abstract": "Risk factors for antenatal common mental problems include a history of depression, lack of social support and a history of both childhood and adulthood sexual and physical abuse. However, it is less clear whether pregnancy is a time of particular susceptibility to mental disorders due to prior childhood experiences. The aim of the paper was to investigate the potential pathways to antenatal mental health problems. A total of 521 women attending prenatal care attended a clinical interview and answered psychological questionnaires. Univariate analysis, sequential binary logistic regression and structural equation modelling (SEM) were used to analyse the relationships between variables. Having experienced parental maladjustment, maltreatment and serious physical illness in childhood and domestic violence, financial difficulties and serious spousal substance abuse in adulthood significantly predicted antenatal common mental health symptoms. SEM showed that history of depression and adverse experiences in adulthood had mediating effects on the relationship between adverse childhood events and symptoms of antenatal common mental disorders. Adverse childhood experiences are distal risk factors for antenatal common mental health problems, being significant indicators of history of depression and adverse experiences in adulthood. We therefore conclude that pregnancy is not a time of particular susceptibility to common mental health problems as a result of childhood abuse, but rather, these childhood experiences have increased the risk of adulthood trauma and prior mental disorders. Women at risk for antenatal common mental disorders include those with a history of depression, domestic violence, financial difficulties, spousal substance abuse and lack of social support.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "482839d09a209ba8b07cc8c4de203fb9",
  "timestamp": "2025-05-15T02:43:06.777493"
}