{
  "id": 4140,
  "title": "Evaluating the efficacy of fuzzy Bayesian networks for financial risk assessment",
  "abstract": "The demand for advanced predictive tools has surged in the intricate landscape of global financial markets. Traditional predictive tools based on crisp models offer foundational insights, while the evolving complexities in global financial markets necessitate more nuanced analytical techniques. This research delves deep into Bayesian networks (FBN) as a potential tool for financial risk prediction (FRP). Integrating the probabilistic reasoning of Bayesian Networks with the uncertainty-handling capabilities of fuzzy logic, FBNs present a promising avenue for capturing the multifaceted dynamics of financial data. A comprehensive methodology was employed, encompassing data collection, data preprocessing, and transformation. The FBN model's construction was rooted in established methodologies, emphasizing feature selection, parameter estimation, and a systematic validation process. The model's empirical robustness was ensured through rigorous validation and testing mechanisms. The results found that the FBN accuracy achieved a mean absolute error (MAE) of 9.78 and a root mean square error (RMSE) of 11.64, when compared to traditional models such as linear regression, which had MAE and RMSE values of 15.70 and 18.39, respectively. The obtained results illuminate the FBN's standout performance in FRP. The FBN excels in capturing the underlying intricacies of financial data, offering unparalleled predictive accuracy. Its predictions are closer to actual average value but exhibit fewer large deviations, making it an invaluable tool in the financial analytics arsenal demonstrably outpacing traditional crisp models.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "482d9233498689b826d56fe1a50cf1fc",
  "timestamp": "2025-05-15T02:33:42.057303"
}