{
  "id": 8583,
  "title": "Association Between Household Income and Self-Perceived Health Status and Poor Mental and Physical Health Among Cancer Survivors",
  "abstract": "Background: Health-related quality of life (HRQoL) is multidimensional and is composed of, at a minimum, self-perceived health status, physical functioning, and psychological well-being. HRQoL measures reflect the extent of disability and dysfunction associated with a chronic disease such as cancer. The objective of this study is to examine factors associated with HRQoL among cancer survivors.Methods: Data from the 2009 Behavioral Risk Factor Surveillance System survey was used to examine factors associated with HRQoL among participants who reported having ever been diagnosed with cancer. Four questions associated with HRQoL included self-perceived health status, number of bad physical health days, and number of bad mental health days per month. Least square regression and logistic regression models, adjusted for confounding variables, were used for an ordinal and dichotomous [5 (bad) vs. 1-4 (excellent, very good, good, fair)] scale of HRQoL, respectively.Results: Fifty nine thousand one hundred seventy three participants reported having ever been diagnosed with cancer. Adjusted mean self-perceived health status (5-point scale) among survivors of thyroid, colon, lung, cervical, breast, prostate, and ovarian cancer was 3.83 (0.05), 4.02 (0.04), 4.36 (0.06), 3.77 (0.03), 3.88 (0.03), 3.78 (0.04), and 3.96 (0.05), respectively. After adjusting for confounders, a positive dose-response effect was observed between income range and all three HRQoL measures across all seven cancer sites. Income was consistently and inversely associated with a higher chance for reporting poorer HRQoL [OR: 0.64, 95% CI: 0.57-0.71], [OR: 0.63, 95% CI: 0.48-0.82], [OR: 0.67, 95% CI: 0.56-0.80], [OR: 0.69, 95% CI: 0.56-0.86], [OR: 0.55, 95% CI: 0.49-0.62], [OR:0.55, 95% CI: 0.44-0.69], [OR: 0.75, 95% CI: 0.62-0.91] among those with thyroid, colon, lung, cervical, breast, prostate, and ovarian cancer, respectively.Discussion: This study found that income range was associated with HRQoL among cancer survivors. It is plausible that financial resources may lessen the overall burden of cancer survivors, which could improve health-related quality of life among cancer survivors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "482e1e464cc98f25d0a9251fc44c7842",
  "timestamp": "2025-05-15T03:20:22.222461"
}