{
  "id": 8668,
  "title": "Determinants of Quality of Life among Adolescents in the Malopolska Region, Poland",
  "abstract": "Knowledge about predictors associated with quality of life (QoL) in adolescents is important for public health. The aim of the study was to indicate determinants of the different dimensions of QoL in the fields of demographic, socio-economic factors, general health and lifestyle in a sample of Polish adolescents. The cross-sectional study was carried out in a southern region of Poland among 804 schoolchildren from junior high schools and upper secondary schools. The quality of life was measured using the Polish version of the KIDSCREEN-52 questionnaire. The author's questionnaire concerning determinants of the adolescents' quality of life was also used. In the analysis of the quality of life, standardized results on the European population (T-score) and categorization on the low, average and high quality of life were taken into account. Defining the possible determinants of the adolescents' quality of life was made by the multivariate logistic regression models. The highest prevalence of low QoL was observed in the school environment (53.4%) and the psychological well-being (51.6%) dimensions of the KIDSCREEN-52. The factors that increased the risk of the low assessment of the quality of life were, inter alia, female sex for physical well-being, psychological well-being, self-perception, autonomy, parent relation and home life, and financial resources, higher school year for physical well-being, psychological well-being, moods and emotions (2nd grade of upper secondary school only), self-perception, social support and peers, and school environment, and dissatisfaction in appearance for physical well-being, psychological well-being, moods and emotions, self-perception, school environment, social acceptance and bullying.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4834da2dbf9d4094f515e39c024cf133",
  "timestamp": "2025-05-15T03:21:24.614474"
}