{
  "id": 424,
  "title": "Application of Instance-Based Entropy Fuzzy Support Vector Machine in Peer-To-Peer Lending Investment Decision",
  "abstract": "Loan status prediction is an effective tool for investment decisions in peer-to-peer (P2P) lending market. In P2P lending market, most borrowers fulfill the repayment plan; however, some of them fail to pay back their loans. Therefore, an imbalanced classification method can be utilized to discriminate such default borrowers. In this context, the aim of this paper is to propose an investment decision model in P2P lending market which consists of fully paid loans classified via the instance-based entropy fuzzy support vector machine (IEFSVM). IEFSVM is a modified version of the existing entropy fuzzy support vector machine (EFSVM) in terms of an instance-based scheme. IEFSVM can reflect the pattern of nearest neighbors entropy with respect to the change of its size instead of fixing it in unified neighborhood size. Therefore, IEFSVM allows the class change of nearest neighbors in the determination of fuzzy membership. Applying the model to the lending club dataset, we determine loans that are predicted to be fully paid. Then, we also provide a multiple regression model to generate an investment portfolio based on non-default loans that are predicted to yield high returns. Throughout the experiment, the empirical results reveal that IEFSVM outperforms not only EFSVM but also the six other state-of-the-art classifiers including the cost-sensitive adaptive boosting, cost-sensitive random forest, EasyEnsemble, random undersampling boosting, weighted extreme learning machine, and cost-sensitive extreme gradient boosting in terms of loan status classification. Also, the investment performance of the multiple regression model using IEFSVM is higher and more robust than that of two other benchmarks. In this regard, we conclude that the proposed investment model is a decent and practical approach to support decisions in the P2P lending market.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4838f1f55001a4c002c1e25d1d0e426d",
  "timestamp": "2025-05-15T00:43:10.575253"
}