{
  "id": 225,
  "title": "Integrating Macroeconomic and Technical Indicators into Forecasting the Stock Market: A Data-Driven Approach",
  "abstract": "Forecasting stock markets is challenging due to the influence of various internal and external factors compounded by the effects of globalization. This study introduces a data-driven approach to forecast S&P 500 returns by incorporating macroeconomic indicators including gold and oil prices, the volatility index, economic policy uncertainty, the financial stress index, geopolitical risk, and shadow short rate, with ten technical indicators. We propose three hybrid deep learning models that sequentially combine convolutional and recurrent neural networks for improved feature extraction and predictive accuracy. These models include the deep belief network with gated recurrent units, the LeNet architecture with gated recurrent units, and the LeNet architecture combined with highway networks. The results demonstrate that the proposed hybrid models achieve higher forecasting accuracy than the single deep learning models. This outcome is attributed to the complementary strengths of convolutional networks in feature extraction and recurrent networks in pattern recognition. Additionally, an analysis using the Shapley method identifies the volatility index, financial stress index, and economic policy uncertainty as the most significant predictors, underscoring the effectiveness of our data-driven approach. These findings highlight the substantial impact of contemporary uncertainty factors on stock markets, emphasizing their importance in studies analyzing market behaviour.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48390fc06b641309631fa00a24f0bec7",
  "timestamp": "2025-05-15T01:35:45.478997"
}