{
  "id": 5899,
  "title": "The Impact of Market Discipline on Charter Value of Commercial Banks: Empirical Evidence from Pakistan Stock Exchange",
  "abstract": "To tranquilize the devastating impact of unnecessary risk-taking behavior of banks towards the economy for maximizing their profits that usually arises due to widely known 'moral-hazard' problem originating from market competition and intensified by bank's limited liability, the banking system is strongly monitored across all countries of the world. The goal of controlling would become more feasible if there exist some self-discipline and motivations which could safeguard the banks' charter value through the mechanism of market discipline. Therefore, our study is aimed to scrutinize the relation between market discipline and charter value of local commercial banks that are registered on the Pakistan Stock Exchange by analyzing a balanced panel data from the year 2007 to 2019. Deposit growth, interbank deposits, and subordinate debt are taken as proxies to measure market discipline whereas Tobin's Q theory is applied for calculating the charter value. Generalized Least Square Regression with Fixed Effect Model is used for evaluation. The outcomes reveal that in the existence of control variables, all proxies of market discipline have a significant positive impact on bank charter value. Our research has important policy implications for monitoring and supervising financial intermediaries for their stability and soundness by offsetting the complications of moral-hazard in the financial systems.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4854a07498d7cbe6087059fb0df0352d",
  "timestamp": "2025-05-15T02:52:31.494947"
}