{
  "id": 3360,
  "title": "Beyond borders: investigating the impact of the 2023 Israeli-Palestinian conflict on global equity markets",
  "abstract": "PurposeThe present research study aims to explore the impact of the most recent Israeli-Palestinian conflict, which unfolded in October 2023, on global equity markets, including a wide range of both emerging and developed markets (as per the Morgan Stanley Capital Investment country classification).Design/methodology/approachThe market model of event study methodology, with an estimation window of 200 days and 28-day event window (including event day, i.e. October 7, 2023), has been employed to investigate the event's impact on the stock markets of different countries, with 24 emerging countries and 23 developed countries. The daily closing prices of the prominent indices of all 47 countries have been analyzed to examine the impact of the conflict on emerging markets, developed markets and overall global equity markets. Additionally, cross-sectional regression analysis has been performed to investigate the possible explanations for abnormal returns.FindingsThe findings of the study suggest the heterogeneous impact of the selected event on different markets. Notably, emerging markets and the overall global equity landscape exhibited substantial negative responses on the event day, as reflected in average abnormal returns of -0.47% and -0.397%, respectively. In contrast, developed markets displayed resilience, with no significant negative impact observed on the day of the event. A closer examination of individual countries revealed diverse reactions, with Poland, Egypt, Greece, Denmark and Portugal standing out for their positive or resilient market responses. Poland, in particular, demonstrated significantly positive cumulative abnormal returns (CARs) of 7.16% in the short-term and 8.59% in the long-term event windows (-7, +7 and -7, +20, respectively), emphasizing its robust performance amid the geopolitical turmoil. The study also found that, during various event windows, specific variables had a significant impact on the CARs.Practical implicationsThe study suggests diversification and monitoring of geopolitical risks are key strategies for investors to enhance portfolio resilience during the Israeli-Palestinian conflict. This study identifies countries such as Poland, Egypt, Greece, Denmark and Portugal with positive or resilient market reactions, providing practical insights for strategic investment decisions. Key takeaways include identifying resilient markets, leveraging opportunistic strategies and navigating market dynamics during geopolitical uncertainties.Originality/valueAs per the authors' thorough investigation and review of the literature, the present study is the earliest attempt to explore the short-term and long-term impact of the 2023 Israeli-Palestinian conflict on equity markets worldwide using the event study approach and cross-sectional regression analysis.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4873f9930bc12d33ecec96ccb7a3184e",
  "timestamp": "2025-05-15T01:16:22.151403"
}