{
  "id": 1073,
  "title": "Unmet Financial Needs of People with Psychotic Disorders-A Cross-Sectional Study in People with Psychotic Disorders, Parents, Siblings, and Controls",
  "abstract": "Background. Psychotic disorders have a strong negative impact on people's lives, including their financial situation. This study aimed to examine differences in unmet financial needs between people with psychotic disorders, parents, siblings, and controls. Secondly, we aimed to examine whether family clustering contributes to unmet financial needs. Lastly, we aimed to examine to what extent demographic, economic, psychiatric, functional, and cognitive characteristics and substance use predict unmet financial needs in people with psychosis. Methods. Data from the first assessment of people with psychosis (n = 956), siblings (n = 889), parents (n = 858), and controls (n = 496) included in the Genetic Risk and Outcome of Psychosis study were used. Group differences were assessed with Kruskal-Wallis tests (aim 1), while a mixed-effects logistic regression analysis and explorative and confirmative ordinal logistic regression analyses were conducted for aims 2 and 3, respectively. Results. Twenty-four percent of people with psychotic disorders reported unmet financial needs. These levels of unmet financial needs were significantly higher than levels for siblings, parents, and controls. We found a negligible influence of (direct) familial clustering on unmet financial needs. Lastly, cannabis and tobacco use significantly and consistently predicted higher levels of unmet financial needs of people with psychosis. Conclusions. Relatively high levels of unmet financial needs occurred in a heterogeneous group of people with psychosis, especially when people used cannabis or tobacco. Unmet financial needs can have detrimental consequences for mental health, stigmatization, leisure time activities, and social engagement. Thus, it is pivotal to recognize unmet financial needs, especially combined with substance use, as a crucial stressor for people with psychosis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48792682e5d40db0ee456c8b62883760",
  "timestamp": "2025-05-15T01:58:43.352353"
}