{
  "id": 7860,
  "title": "Health Disparities in Young Adults: A Direct Comparison of Distress and Unmet Needs Across Cancer Centers",
  "abstract": "PURPOSE Information on concerns that young adults (YAs) with cancer face when receiving care outside of specialized treatment centers is needed to increase equitable care to YAs at greater risk of marginalization by the health care system. The current study compared distress and unmet needs at the time of clinic visit between YAs receiving care from three different cancer clinics: (1) a National Cancer Institute-designated center, (2) a community-based clinic, and (3) a county hospital outpatient clinic. METHODS The Adolescent and Young Adult Psycho-Oncology Screening Tool (AYA-POST) was administered to measure distress and cancer-related concerns of YAs in active treatment. A one-way analysis of variance (ANOVA) compared distress scores by treatment site. A Fisher's exact test compared the number of participants endorsing each item on the Needs Assessment Checklist from each site. A simple linear regression determined the association between distress and number of items endorsed on the Needs Assessment Checklist. RESULTS Ninety-seven participants completed the AYA-POST, endorsing, on average, 11 concerns. Fisher's exact test showed significant differences between sites in the proportion of participants endorsing eight items: boredom (P < .001), eating/appetite (P < .001), nausea/vomiting (P < .001), financial concern (P = .002), hopelessness/helplessness (P = .03), confidentiality (P = .04), sibling concern (P = .04), and insurance (P = .05). The simple linear regression model was significant (F(1, 94) = 39.772, P < .001, R-2 = 0.297), indicating the number of unmet needs accounted for almost 30% of the variance in distress. The one-way ANOVA was not significant (F(2, 93) = 1.34, P = .267). CONCLUSION Social determinants of health can influence the number and type of unmet needs experienced, affecting distress and other outcomes and underscoring the importance of timely, effective, age-appropriate screening and intervention for distress and unmet needs in YAs with cancer.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "487a6390512542bffb60405ee5a911b0",
  "timestamp": "2025-05-15T03:12:36.559262"
}