{
  "id": 7112,
  "title": "Approach to the diagnosis and treatment of high-grade B-cell lymphomas with MYC and BCL2 and/or BCL6 rearrangements",
  "abstract": "High-grade B-cell lymphomas (HGBLs) with MYC and BCL2 and/or BCL6 rearrangements, so-called double-hit lymphomas (HGBL-DH), are aggressive lymphomas that form a separate provisional entity in the 2016 revised World Health Organization Classification of Lymphoid Tumors. Fluorescence in situ hybridization (FISH) will be required to identify HGBL-DH and will reclassify a subset of diffuse large B-cell lymphomas (DLBCLs) and HGBLs with features intermediate between DLBCL and Burkitt lymphoma into this new category. Identifying patients with HGBL-DH is important because it may change clinical management. Thisposesa challengefor centers that may not be ready to handle the additional workload and financial burden associated with the increase in requests for FISH testing. Herein, we review the mechanisms of deregulation of these oncogenes. We identify the factors associated with a poor prognosis and those that can guide diagnostic testing. Restricting FISH analysis to the 10% of DLBCL patients who have a germinal center B-cell phenotype and coexpress MYC and BCL2 proteins would be cost-effective and would identify the subset of patients who are at highest risk of experiencing a relapse following conventional therapy. These patientsmay benefit from intensified chemotherapy regimens or, ideally, should enroll in clinical trials investigating novel regimens.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4886692e63b5a349ed42d3eb70b95625",
  "timestamp": "2025-05-15T03:05:03.602776"
}