{
  "id": 201,
  "title": "Prediction of the volume of shallow landslides due to rainfall using data-driven models",
  "abstract": "Landslides due to rainfall are among the most destructive natural disasters and cause property damage, huge financial losses, and human deaths in different parts of the world. To plan for mitigation and resilience and to understand the relationship between the volume of soil materials debris and their associated predictors, prediction of the volume of rainfall-induced landslides is essential. The objectives of this research are to construct a model using advanced data-driven algorithms (i.e., ordinary least squares or linear regression (OLS), random forest (RF), support vector machine (SVM), extreme gradient boosting (EGB), generalized linear model (GLM), decision tree (DT), deep neural network (DNN), k-nearest-neighbor (KNN), and ridge regression (RR) algorithms) for the prediction of the volume of landslides due to rainfall, considering geological, geomorphological, and environmental conditions. Models were trained and tested on a South Korean landslide dataset, with the EGB predictions yielding the highest coefficient of determination (R-2 = 0.8841) and the lowest mean absolute error (MAE = 146.6120 m(3)), followed by RF predictions (R-2 = 0.8435, MAE = 330.4876 m(3)), on the holdout set. The DNN, EGB, and RF models exhibited R-2 > 0.8 on both the training and the test sets. The differences in the coefficient of determination R-2 on the training and holdout set were 1.75 %, 7.72 %, and 12.17 % for RF, EGB, and DNN, respectively, signifying that these models could yield reliable volume estimates in adjacent areas with similar geomorphological and environmental settings. The volume of landslides was strongly influenced by slope length, maximum hourly rainfall, slope angle, aspect, and altitude. The anticipated volume of landslides can be important for land use allocation and efficient landslide risk management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "488fa700232d21937f42b4aabdd1e319",
  "timestamp": "2025-05-15T01:47:53.062744"
}