{
  "id": 7197,
  "title": "Does regulatory under-compliance with governance standards lead to bank instability? An exploration using Indian dataJEL Codes",
  "abstract": "The paper looks at whether under-compliance with governance standards leads to bank instability. The empirical analysis is executed using a novel and unique panel dataset on the governance of Indian banks from 2009 to 2018. The study gauges the governance compliance on 48 norms, covering six key dimensions of corporate governance: board effectiveness, audit function, risk management, remuneration, shareholder rights and information, and disclosure and transparency. A measure of bank stability is obtained using 14 important financial ratio indicators, encompassing five critical dimensions of stability: soundness, asset quality, profitability, management efficiency and liquidity. The composite indices for both governance compliance and bank stability are constructed using the innovative non-parametric constrained Benefit-of-the-Doubt (BoD) approach. The governance compliance-stability nexus is tested econometrically using the panel ordered probit regression. Empirical results are found to be robust and suggest that governance compliance emphatically explains bank stability in India. The most significant policy implication, which emerges from the empirical findings, is that any sort of regulatory under-compliance with selected governance norms by banks would be costly and may have a destabilising effect on the banking system.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4890e22e349f3f6b9e94e26b23b6bd43",
  "timestamp": "2025-05-15T03:06:01.276408"
}