{
  "id": 1883,
  "title": "Risk Control Management of New Rural Cooperative Financial Organizations Based on Mobile Edge Computing",
  "abstract": "Rural cooperative financial organization is a new type of cooperative financial organization in recent years. It is a community financial institution created by farmers and small rural enterprises to voluntarily invest in shares in order to meet the growing demand for rural financing. However, this financial organization has many flaws in the design of the system; it has not promoted the better development of rural mutual fund assistance. In addition, mobile edge computing (MEC) can be used as an effective supplement to mobile cloud computing and has been proposed. However, most of the current literature studies on cloud computing provide computing offload just to propose a network architecture, without modeling and solving to achieve. In this context, this paper focuses on the practical application of MEC in the risk control of new rural cooperative financial organizations. This paper proposes a collaborative LECC mechanism based on machine learning under the MEC architecture. The experimental simulation shows that the HR under the LECC mechanism is about 17%-23%, 46%-69%, and 93%-177% higher than that of LENC, LRU, and RR, respectively. It is unrealistic to want to rely on meager loan interest for long-term development. The most practical way is to increase the income level of the organization itself.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "489551ae214d9440f1c8c0552231dce0",
  "timestamp": "2025-05-15T02:08:39.030472"
}