{
  "id": 524,
  "title": "Minimizing Portfolio Risk with Fuzzy Neural Networks and Pelican Optimization with Levy Flight",
  "abstract": "Portfolio selection aims to construct a portfolio that increases expected returns with satisfactory risk levels. The risk measurement is considered the most important part of making an investment decision. However, delays and interruptions may occur during the portfolio selection process, and several transaction costs make the problem critical. In the conventional approaches, the management of risk and returns was found as difficult before the portfolio optimization process. The existing studies that use a single prediction model or utility-based solution are insufficient to provide an efficient solution regarding the accurate possibilistic distribution of the return rates. To overcome these drawbacks, a novel Fuzzy Neural Network-based Pelican Optimization with the Levy Flight method is proposed that optimizes the risk associated with the portfolio selection process. The main objective is to diminish various uncertainties and computational problems associated with portfolio selection. The historical stock data from the Bombay Stock Exchange is utilized for analysis and the uncertain asset returns are modeled as trapezoidal fuzzy numbers. A Fuzzy Neural Network model is utilized for the prediction of optimal portfolios by studying the relationship between the output metrics and input features. The hyperparameters of the Fuzzy Neural Network are tuned by the Pelican optimization with levy flight (POLF) algorithm for effective uncertainty modeling and portfolio optimization. The Pelican optimization with levy flight (POLF) algorithm helps the Fuzzy Neural Network model to improve the expected return and reduce the risk of the portfolio. The integration of the Levy Flight concept into the Pelican optimization algorithm balances between exploitation and exploration effectively and significantly improves the convergence rate with the diverse set of solutions obtained globally. Finally, the proposed Fuzzy Neural Network-based Pelican Optimization with Levy Flight (FNN-POLF) approach's efficiency in solving portfolio issues is demonstrated using real-time traded stock details of the Bombay Stock Exchange and analyzed in terms of different performance evaluation criteria such as portfolio return, portfolio risk rate, fitness value, portfolio curvature, and risk distance. The outcomes illustrate that the proposed Fuzzy Neural Network-based Pelican Optimization with Levy Flight (FNN-POLF) model offers improved performance with a lower portfolio risk ratio, higher portfolio return, exercise value, portfolio skewness, and risk distance.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48bb92c9c52a5a80c3b1edccad89d449",
  "timestamp": "2025-05-15T00:44:21.063073"
}