{
  "id": 6029,
  "title": "Total cost of care associated with opioid use disorder treatment",
  "abstract": "The opioid epidemic in the United States disproportionately affects Medicaid beneficiaries than other groups. This results in a significant financial burden on state Medicaid programs. In this analysis, we investigate the association of medication for opioid use disorder (MOUD) treatment initiation and linkage to ongoing care on overall healthcare costs of Medicaid Fee-for-Service patients. We conducted a retrospective study among adult patients diagnosed with opioid use disorder (OUD) and who had a clinical encounter at a safety-net institution in Denver Colorado in 2020. Three categories of MOUD status of patients were defined: 1) identified with OUD but did not receive MOUD; 2) initiated MOUD but not linked to ongoing treatment and 3) received MOUD and linked to ongoing treatment. Our outcome variable was per-member per-month total healthcare cost. We estimated a multivariable model to test the association between healthcare cost and MOUD status, while controlling for demographic and risk classification variables. We found that in individuals with OUD who initiated MOUD treatment but were not linked to ongoing care had the highest healthcare cost, while those who were linked to ongoing MOUD treatment had the lowest healthcare cost. MOUD treatment is not only effective at addressing the significant morbidity and mortality burden of OUD but also associated with decreased financial cost, which is disproportionately incurred by Medicaid. Additional policy and care delivery changes are needed to focus efforts to improve linkage to ongoing treatment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48c5e6dd36007e5f8b62a4ff8697dd96",
  "timestamp": "2025-05-15T02:54:03.374946"
}