{
  "id": 5703,
  "title": "Embedding risk in total productive maintenance model",
  "abstract": "The importance of this study comes from the vital contribution Total Productive Maintenance (TPM) makes in improving the maintenance and reliability of machine perfor-mance. Although TPM is widely recognized for its effectiveness in addressing various issues such as failures, setup times, and production defects, current approaches lack a theoretical foun-dation that incorporates risk into overall equipment effectiveness (OEE), a key performance indicator in TPM. Existing TPM methodologies focus on maximizing asset performance through employee participation and process improvement. However, there is a notable research gap in the theoretical embedding of risk within TPM. This study pioneers the introduction of a theoretical concept to embed risk into OEE, specifically addressing the economic risks associated with breakdown failures in assets. To bridge this gap, the research utilizes real machine failure data, with 50 historical data points used to estimate reliability growth parameters and coefficients for loss value estimation through polynomial regression. The introduced risk-based OEE is then compared against a traditional approach that does not consider risk. Although the validation is based on failure data from the meat industry, the proposed risk-based TPM framework is versa-tile and applicable to any manufacturing industry. Incorporating economic risk into TPM provides decision makers with critical technical information, allowing them to comprehend the financial implications of failures. This approach enables more informed decision making in asset management, prioritizing maintenance activities, and enhancing overall risk management within the TPM framework.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48c6186b65531324b42cd2a636eae27d",
  "timestamp": "2025-05-15T02:50:21.339289"
}