{
  "id": 1817,
  "title": "Minimalistic Logit Model as an Effective Tool for Predicting the Risk of Financial Distress in the Visegrad Group",
  "abstract": "Predicting financial distress is one of the most well-known issues in corporate finance. Investors and other stakeholders often use prediction models as relevant tools for identifying weaknesses to eliminate potential threats to business partners. This paper aims to present an effective logistic regression model for a one-year-ahead prediction of financial distress with the minimum set of predictors as a part of risk management. The paper is motivated by various works dealing with the curse of dimensionality phenomenon and the observation that the increasing number of logit-model predictors does not improve the prediction-on the contrary. Monitoring the significance of improvement in the stepwise growth of the predictor set is used to identify the minimal set. Logistic regression with cross-validation is involved in the modelling process. The proposed model is compared with other logit-based models used regionally or globally on the same large dataset, which underlines the model validity and robustness. The proposed logit model contains only two significant predictors and achieves excellent performance metrics compared to other models. The added value of the article lies in a simple application for managers, investors, creditors, financial institutions, and others with a reliable classification of companies into healthy and unhealthy company groups.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48c91cfe784fd27050120d68c669a2d1",
  "timestamp": "2025-05-15T02:08:03.856958"
}