{
  "id": 2865,
  "title": "Association between fund attributes and fund's performance: a panel data approach",
  "abstract": "Purpose The present study tries to explore the various fund attributes that influence the mutual fund performance. Further, study examined the effect of mutual fund attributes namely, Net Asset Value (NAV), Portfolio turnover ratio (PTR), fund size (AUM), expense ratio (ExpR) and fund age (Age) on mutual fund's performance using gross return and risk-adjusted performance measures. Design/methodology/approach The study evaluated balanced panel data (short panel) comprising 81 Indian equity mutual fund schemes for the period of 2013-2019. The study estimated relationship between fund attributes (Net asset value, Portfolio turnover ratio, Fund age, fund size and Expense ratio) and fund performance (using gross return and risk-adjusted performance measures), through panel data regression using fixed-effects model as suggested by Hausman specification test on transformed data (due to high multicollinearity), with cluster-robust estimators due to the presence of heteroskedasticity in the model. Findings The findings of the study suggested that using gross return as fund performance measure, PTR, NAV, AUM, Age exhibit significant relationship with the fund performance whereas using risk-adjusted performance measures (Treynor ratio and Jensen alpha) NAV and ExpR significantly influences the fund performance. Identification of the significant relationship between fund characteristics and fund performance offers valuable insights to the investors and fund managers for rationally managing their portfolio with the ultimate objective of the wealth maximization. Research limitations/implications The study considered only 81 equity mutual fund schemes. Some of the data were not available at the time of the study due to the policy of the company. The present study contributes significantly in examining the expected association between fund attributes and fund performance in the context of Indian mutual fund industry where this relationship were explored less. Practical implications The findings of the present study will help the investors to take the rational investment decision with the ultimate objective of maximum return with minimal risk. The findings also offer significant germane to the stakeholders in making rational decision-making process. Originality/value There is dearth of study concerning the relationship between mutual fund characteristics and fund performance with respect to Indian mutual fund industry. Therefore, study provides valuable insights to the area of the portfolio selection and management with respect to Indian mutual funds.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48ca140ba2d40eabf23505fd2ce75054",
  "timestamp": "2025-05-15T01:11:17.420555"
}