{
  "id": 4946,
  "title": "Supply Chain Finance, Performance and Risk: How Do SMEs Adjust Their Buyer-Supplier Relationship for Competitiveness?",
  "abstract": "Supply chain finance (SCF) has attracted considerable attention being an innovative business model that allows firms, especially small- and medium-sized enterprises (SMEs), to convert illiquid assets into cash without incurring additional liabilities. However, its effects on SME performance and risk have been insufficiently studied. The competitiveness of SMEs depends on performance enhancement and risk mitigation. Thus, this study constructs a scaled-decile rank transformation of account receivable turnover to gauge the degree to which a supplier implements SCF, thereby examining the relationship between SCF, performance, and risk. We collect data on 4,679 SMEs from the Chinese manufacturing sector. Thereafter, hierarchical linear regression, a complex form of multiple linear regression analysis, is employed to test the hypotheses. The results indicate that an SME's SCF adoption positively impacts its performance but negatively impacts its risk. 'lb further explore cross-sectional variability, we investigated the buyer-supplier relationship's moderating role. Results show that an increase in customer concentration strengthens both the positive effects of SCF on performance and the negative effects of SCF on risk. Overall, our study contributes to the literature on the interface of operations and finance in supply chains by exploring the multiple facets of SCF adoption and highlighting the moderating role of buyer-supplier relationship in SCF and SME competitiveness. Finally, we provide managerial implications for SMEs and financial service providers by validating the value of SCF implementation and the buyer-supplier relationship management in forging competitive advantages.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48cb24a63b9dd634125ec3f4338e3f51",
  "timestamp": "2025-05-15T02:42:36.199195"
}