{
  "id": 3925,
  "title": "Mission-oriented innovation for sustainable polymers in liquid formulation",
  "abstract": "Industrial chemical producers and formulators are increasingly conscious of their responsibility in stewarding planetary resources and minimizing harm to the environment. In 2019, the Royal Society of Chemistry (RSC) engaged an industry task force from across the value chain to drive technical research to classify a new class of polymer-polymers in liquid formulation (PLFs). Building on this, the task force called for step change in sustainability practices for PLFs and instigated a design and development process to identify research themes and priorities that could accelerate innovation in this area. However, a key challenge was that as a novel classification, PLFs were largely unknown outside the chemistry community and entirely absent from the mainstream research agenda. To establish the demand-pull requirements of the value chain for sustainable PLFs, the RSC used a 'mission-oriented' innovation framework to enable the taskforce to co-design an ideal-type portfolio of research and innovation projects, and to set out a realistic roadmap for transition. This perspective article presents a summary of the activities carried out by the task force in its pursuit of mission-oriented innovation for PLFs and describes the strategic design method used to enable cross-value chain consensus on action for PLF sustainability, build system-wide innovation ecosystems and explore common-good scenarios. This article is part of the discussion meeting issue 'Green carbon for the chemical industry of the future'.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48d3ca843cde31ff394831974806e326",
  "timestamp": "2025-05-15T01:22:11.924702"
}