{
  "id": 3217,
  "title": "Towards Achieving Sustainability in the BRICS Economies: The Role of Renewable Energy Consumption and Economic Risk",
  "abstract": "In this study, the focus is on examining the influence of renewable energy consumption, economic risk, and financial risk on the load capacity factor (LF) within the BRICS countries. The analysis covers the time span from 1990 to 2019. The empirical strategy uses the Method of Moments Quantile Regression (MMQR) and long-run estimators (Fixed Effects Ordinary Least Squares, FE-OLS; Dynamic Ordinary Least Squares, DOLS; and Fully Modified Ordinary Least Squares, FMOLS). The findings highlight the presence of a cointegrating relationship. Moreover, fossil fuels and economic growth cause LF to decrease, while economic risk and the use of renewable energy sources increase the deepening of the LF. Furthermore, the results of the MMQR method are confirmed by DOLS, FMOLS, and FE-OLS estimates. Causality results also demonstrate that these factors may forecast ecological quality, indicating that policies for renewable energy consumption, financial risk, renewable energy, and economic growth can all have an impact on the degree of LF. In light of this research, policymakers should strongly encourage expenditures on environmentally friendly technologies and economic and financial stability to increase energy efficiency as well as sustain the widespread adoption and use of energy-saving products.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48dc34cd56efac0175bdcc1d292a1403",
  "timestamp": "2025-05-15T02:24:05.011405"
}