{
  "id": 1779,
  "title": "Analysis of default risk in microfinance institutions under the Basel III framework",
  "abstract": "International organizations such as OECD, WBG, IMF, UN and EU, as well as research studies, have highlighted the increasing contribution being made by microcredit finance institutions (MFIs) to financial inclusion, sustainable economic development and the fight against poverty. However, access to MFI credit is still far from the desired level for small and micro-enterprises, especially in developing countries. The countries of Latin America and the Caribbean, where approximately half of the small formal companies do not have access to credit, have the world's highest financial gap ratio compared to potential demand (87%). In this context, effective instruments are needed to assess default risk, through credit ratings. Based on the Basel III regulations, an empirical study was conducted of two microcredit portfolios corresponding to two MFIs in two Latin American countries (Bolivia and Colombia) during the period 2012-2015, to identify the explanatory variables of the probability of default on loans granted by MFIs, using a logistic regression model and a neural network. The results obtained show that the main variables in this respect are the amount of the loan, the number of payments in arrears, the guarantees provided, the assessment of the credit analyst, male gender of the borrower and the level and trend of the general stock exchange index. The conclusions presented advance previous research findings and may be useful for MFI managers, regulatory institutions, financial analysts, scholars, policy-makers and applicants for microcredits to undertake a business project, especially in times of emerging crisis, such as that caused by the Covid-19 pandemic.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "48f1ce69c2687a5d046f357dfdec1afc",
  "timestamp": "2025-05-15T02:07:25.694311"
}