{
  "id": 4179,
  "title": "Ghanaian women's experience of intimate partner violence (IPV) during group antenatal care: a brief report from a cluster randomised controlled trial",
  "abstract": "Intimate partner violence (IPV) impacts women of reproductive age globally and can lead to significant negative consequences during pregnancy. This study describes an exploratory aim of a cluster randomised controlled trial designed to assess the outcomes of Group Antenatal Care (ANC) in Ghana. The purpose was to understand the effect of a healthy relationship Group ANC module on experiences of IPV and safety planning as well as to explore the relationship between self-efficacy on the experiences of IPV and safety planning. Data were collected at baseline and at 11-14 months postpartum (post). Survey measures captured reported experiences of violence, self-efficacy, and safety. The chi-square test was used to compare baseline and post scores, and a logistic regression was performed to ascertain the effects of self-efficacy on the experiences of IPV in both groups. The sample included 1,751 participants, of whom 27.9% reported IPV at baseline. Between baseline and postpartum, there was a small increase in reported emotional (6.2% vs. 4.6%) and sexual (5.4% vs. 3.2%) violence in the intervention group compared to the control group. Logistic regression demonstrated that an increasing self-efficacy score was associated with an increased likelihood of experiencing IPV. There were no changes in safety knowledge. This study found higher rates of reported sexual and emotional violence post-intervention among the intervention group. Group ANC may be just one part of a portfolio of interventions needed to address IPV at all socio-ecological levels.Paper ContextMain findings: There was no reduction in experiences of intimate partner violence or increases in safety planning among Ghanaian pregnant women participating in a Group Antenatal Care session focused on healthy relationships and safety planning.Added knowledge: Group Antenatal Care has been identified as an effective modality for providing antenatal care and facilitating conversations about sensitive topics such as intimate partner violence and safety. However, this study highlights the importance of developing multifaceted approaches to decrease the risk of intimate partner violence among women, especially during the critical times of pregnancy and postpartum.Global health impact for policy and action: Effective global health action and policy must extend beyond educational efforts, incorporating multifaceted strategies that include healthcare provider training, robust community engagement, and legislation aimed at preventing intimate partner violence, with a special focus on safeguarding the well-being of women during pregnancy and the postpartum period.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4906235c09efaddc24dc8373c14abd67",
  "timestamp": "2025-05-15T01:24:25.453724"
}