{
  "id": 8303,
  "title": "Health-related quality of life and the predictive role of sense of coherence, spirituality and religious coping in a sample of Iranian women with breast cancer: a prospective study with comparative design",
  "abstract": "Background: There is disagreement among studies of health-related quality of life (HRQoL) changes in breast cancer patients over time. Reportedly, assessment of HRQoL prior to diagnosis may be crucial to provide a clear point of comparison for later measurements. The aims of this study were (1) to investigate changes in HRQoL, sense of coherence (SOC), spirituality and religious coping in a group of women with breast cancer from the pre-diagnosis phase to 6 months later in comparison with a control group, and (2) to explore the predictor role of SOC, spirituality, and religious coping within the breast cancer group at the 6-month follow-up. Methods: A sample of women with breast cancer (n = 162) and a matched control group (n = 210) responded to the following instruments on both occasions: the European Organization for Research and Treatment of Cancer QLQ-C30, the SOC Scale, the Spiritual Perspective Scale and the Brief Religious Coping Scale. A series of General Linear Model (GLM) Repeated Measures was used to determine changes between the groups over time. Also, Multiple Linear Regression analyses were applied to each of the HRQoL dimensions, as dependent variable at the 6 months follow-up. Results: Physical and role function, fatigue, and financial difficulties were rated worse by the women with breast cancer during the first 6 months in comparison to the controls, which was both a statistically (p < 0.001) and clinically significant difference. Women had better scores for global quality of life (p < 0.001), and emotional functioning (p < 0.01) during the same period of time. The degree of SOC (p < 0.01) and baseline ratings of several dimensions of HRQoL (p < 0.05) were the most important predictors of HRQoL changes. Conclusions: Collecting HRQoL data before a final diagnosis of breast cancer is important to identify women at risk of deterioration in HRQoL during and after treatment. Special attention should be paid to physical and role functioning impairment, fatigue, and financial difficulties experienced by these women. These results underscore that the degree of SOC may be more important as a predictor for HRQoL changes in this sample than spirituality and religious coping.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4923f680f716b261bb350a7bedf9247c",
  "timestamp": "2025-05-15T03:17:21.582566"
}