{
  "id": 6048,
  "title": "Downside Beta and Downside Gamma: In Search for a Better Capital Asset Pricing Model",
  "abstract": "In the financial world, the importance of downside risk and higher moments has been emphasized, predominantly in developing countries such as Pakistan, for a substantial period. Consequently, this study tests four models for a suitable capital asset pricing model. These models are CAPM's beta, beta replaced by skewness (gamma), CAPM's beta with gamma, downside beta CAPM (DCAPM), downside beta replaced by downside gamma, and CAPM with downside gamma. The problems of the high correlation between the beta and downside beta models from a regressand point of view is resolved by constructing a double-sorted portfolio of each factor loading. The problem of the high correlation between the beta and gamma, and, similarly, between the downside beta and downside gamma, is resolved by orthogonalizing each risk measure in a two-factor setting. Standard two-pass regression is applied, and the results are reported and analyzed in terms of R-2, the significance of the factor loadings, and the risk-return relationship in each model. The risk proxies of the downside beta/gamma are based on Hogan and Warren, Harlow and Rao, and Estrada. The results indicate that the single factor models based on the beta/downside beta or even gamma/downside gamma are not a better choice among all the risk proxies. However, the beta and gamma factors are rejected at a 5% and 1% significance level for different risk proxies. The obvious choice based on the results is an asset pricing model with two risk measures.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49497d156d40d420ccefc0df0e9be7c0",
  "timestamp": "2025-05-15T02:54:03.488165"
}