{
  "id": 1032,
  "title": "A Big Data Technique for Internet Financial Risk Control",
  "abstract": "The danger of losing funds on an investment or business enterprise is referred to as financial risk. Credit risk, liquidity risk, and operational risk are some of the most prevalent and different financial hazards. Financial risk control is an organizational activity that seeks to detect, monitor, and manage exposure to different risks associated with the usage of financial services. Conventional accounting risk control has relatively great timeliness and unpredictability; therefore, traditional accounting risk identification has numerous difficulties, such as high error rate, low precision, lengthy time, and risk. As a result, this research provides a unique financial risk control strategy in the Internet environment based on big data. First, the decision tree algorithm is used to classify the users who can face financial risks. Simultaneously, the user's personal credit information is established and represented mathematically, and the 5C mathematical model is obtained. In this way, the user's credit degree can be judged more accurately, and the user's credit rating can be obtained, allowing quantitative analysis of users to be realized. Second, construct and weight the financial risk system index of the Internet in accordance with the existing financial system. Finally, the Internet financial risk control model based on big data is built, and the financial risk early warning threshold range is determined to achieve Internet financial risk control. The experimental findings reveal that the method's risk identification error rate is minimal, accuracy is high, and control time is quick. It can match the actual risk level, which shows that the control effect of this method is good.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "494f5a56dd3a63ad2b465e4dffd0ec5f",
  "timestamp": "2025-05-15T01:58:08.482604"
}