{
  "id": 3973,
  "title": "Deep learning based bi-level approach for proactive loan prospecting",
  "abstract": "A fundamental component to managing a marketing campaign is identifying prospects and selection of leads. Current lead generation models focus on predicting the intention of a customer to purchase a product, however with financial products, particularly loans, this can be insufficient as there are many factors to consider, such as risk, utility, and financial maturity. Developing a marketing campaign for loan prospecting should consider not only customers who need a loan, but rather clients who need a loan and will also be approved. Otherwise, the marketing effort is deemed ineffective, if the lead cannot be converted into a sale. Although, a low response rate is expected for a marketing campaign for loans, we highlight a better approach in managing resources while maintaining a shortlist of high-quality leads. This manuscript introduces a bi-level approach to handle the complex nature of loan products. Two classifiers are built, one modelling loan intention and the other one modelling loan eligibility. We adopt convex combination to control weights of both problems, which in most cases results in an improved performance for identifying future successful loan applicants when compared to baseline models. Rank-based evaluation measures are also adopted to explore the performance of customer rankings. We find that soft classifiers, such as deep learning techniques, are ideal for ranking customers, achieving a superior performance when compared to other machine learning techniques. In addition, we conclude that an ideal cut-off for K customers is estimated to be between 20 to 25 customers, however our best model can maintain an Average Precision of greater than 0.85 when K approaches 50.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4971422ec0f59ceba795eaa788f54903",
  "timestamp": "2025-05-15T02:31:58.602279"
}