{
  "id": 6102,
  "title": "An exploration of structural determinants driving racial disparities in COVID-19 deaths in Michigan",
  "abstract": "Aim Racial disparities in COVID-19 death rates have largely been driven by structural racism in health, housing, and labor systems that place Black, Brown, and Indigenous populations at greater risk for COVID-19 exposure, transmission, and severe illness, compared to non-Hispanic White populations. Here we examine the association between taxable property values per capita, an indicator influenced by historical and contemporary housing policies that have disproportionately impacted people of color, and COVID-19 deaths.Methods Taxable values serve as a proxy for fiscal health providing insight on the county's ability to address imminent needs, including COVID-19 responses. Therefore, higher taxable values indicate local governments that are better equipped to deliver these public services. We used county-level data from the American Community Survey, the Michigan Community Financial Dashboard, The Atlantic's COVID Tracking Project, and the Community Health Rankings and Roadmap for this cross-sectional study. Maps were created to examine the geographic distribution of cumulative death rates and taxable values per capita, and regression models were used to examine the association between the two while controlling for population density, age, education, race, income, obesity, diabetes, and smoking rates.Results Seventy-five counties were included. The mean taxable value per capita was $43,764.50 and the mean cumulative death rate was 171.86. Findings from the regression analysis showed that counties with higher taxable values were associated with lower COVID-19 death rates (B = -2.45, P < 0.001)Conclusion Our findings reveal a need to reevaluate current policies surrounding taxable property values in the state of Michigan, not solely for their inequitable impact on local governments' financial solvency and service quality, but also for their negative consequences for population health and racial health equity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4978ab129070c2455b7b56a72f8d8b9a",
  "timestamp": "2025-05-15T02:54:39.111415"
}