{
  "id": 5035,
  "title": "Achieving cost efficiency through increased inventory leanness: Evidences from oriented strand board (OSB) industry",
  "abstract": "Impact of inventory leanness on financial performance has been well-documented by scientific community for various industries. However, its application in value-added wood products industry is relatively scarce when compared to other industry segments. The objective of the study was to investigate impact of increased inventory leanness on financial performance of a value-added wood products manufacturer. Outcomes of the study was also expected to contribute to the intersection zone of three research streams, namely Lean Inventory Management, Procurement Lot-Sizing and Demand Forecasting. To achieve stated objectives, research question and hypotheses were constructed around an un-capacitated single item raw material lot-sizing problem in the context of an SME. A six-step systematic optimization approach (SOA) was developed and followed to improve cost efficiency throughout the study. Time series and Regression based demand forecasting coupled with Dynamic and Statistical lot-sizing models to derive the optimal solution to the problem. At the end of exhaustive simulations, an optimized procurement strategy that could achieve 32.87%-60.90% raw material inventory management cost savings depending on desired buffer level was proposed. Consequently, increased inventory leanness led to less costly procurement activities within target supply chain, which indicated enhanced overall financial performance of the firm through proper risk management and mitigation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "498f1b60083747ffca44872c756f7486",
  "timestamp": "2025-05-15T02:43:40.151443"
}