{
  "id": 4968,
  "title": "Association of social relationships with incident cardiovascular events and all-cause mortality",
  "abstract": "Objective To examine how different aspects of social relationships are associated with incident cardiovascular events and all-cause mortality. Methods In 4139 participants from the population-based Heinz Nixdorf Recall study without previous cardiovascular disease (mean (SD) age 59.1 (7.7) years, 46.7% men), the association of self-reported instrumental, emotional and financial support and social integration at baseline with incident fatal and non-fatal cardiovascular events and all-cause mortality during 13.4-year follow-up was assessed in five different multivariable Cox proportional hazards regression models: minimally adjusted model (adjusting for age, sex, social integration or social support, respectively); biological model (minimally adjusted+systolic blood pressure, low-density and high-density lipoprotein cholesterol, glycated haemoglobin, body mass index, antihypertensive medication, lipid-lowering medication and antidiabetic medication); health behaviour model (minimally adjusted+alcohol consumption, smoking and physical activity); socioeconomic model (minimally adjusted+income, education and employment); and depression model (minimally adjusted+depression, antidepressants and anxiolytics). Results 339 cardiovascular events and 530 deaths occurred during follow-up. Lack of financial support was associated with an increased cardiovascular event risk (minimally adjusted HR=1.30(95% CI 1.01 to 1.67)). Lack of social integration (social isolation) was associated with increased mortality (minimally adjusted HR=1.47 (95% CI 1.09 to 1.97)). Effect estimates did not decrease to a relevant extent in any regression model. Conclusions Perceiving a lack of financial support is associated with a higher cardiovascular event incidence, and being socially isolated is associated with increased all-cause mortality. Future studies should investigate how persons with deficient social relationships could benefit from targeted interventions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49a89776bd62445171e158045cd35b13",
  "timestamp": "2025-05-15T02:43:06.685963"
}