{
  "id": 5791,
  "title": "An Integrated Risk Management System for Road Infrastructures: Focus on Seismic Risk and Network Performance",
  "abstract": "As part of an integrated risk management process of road infrastructures, the Asset Management Systems of existing bridges play an increasingly significant role, in order to define the programmatic strategies of road owners and managers. In this perspective, the introduction of the new Italian Guidelines for risk classification and management, the safety assessment and the monitoring of existing bridges represents a strong innovation. These Guidelines, based on a modern risk-based approach, call road managers to activate their procedures for the knowledge and the classification of the state of their structural assets, identifying, at the same time, the needs in terms of maintenance, works and interventions. The results of the application of these Guidelines also represent the basis for defining, through the tools of the Integrated Management Systems, an optimal operational and financial planification of interventions, to be carried out to maximize the safety of the existing bridges. In this paper, after focusing on the importance of the application of the Guidelines procedures to the Safety Management Systems of Road network managers, the importance of the completeness of the cognitive process, provided by the Guidelines - in terms of correct definition of the priorities and of the most suitable intervention aimed to mitigate the seismic risk - is illustrated. In particular, the activities for the detection of the aspects related to the seismic vulnerability are identified as the key process in the context of the Safety Management Systems of Road managers. In the second part of the paper, the aspects related to the adoption, by all the road managers operating in a certain territorial area, of the approach defined by the Guidelines have been analyzed. This aspect plays a key role in order to improve the network safety performance for the areas characterized by a greater seismic hazard and for the most strategic and/or heavily trafficked road infrastructures. (c) 2023 The Authors. Published by Elsevier B.V.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49b3fcd4cdc946c280970ea4a5fb8346",
  "timestamp": "2025-05-15T02:51:30.052592"
}