{
  "id": 7951,
  "title": "Study on Survival and Sustainable Development of Small- and Medium-Sized Tourism and Hospitality Enterprises in Macao Based on Regional Soft Environment and Competitive Advantage",
  "abstract": "The small- and medium-sized tourism and hospitality enterprises are the main forms of enterprises in Macao. This study put forward a new framework of survival and sustainable development from the perspective of competitive advantage and regional soft environment, which significantly holds theoretical and practical research value. The study obtained cross-sectional data of 317 small- and medium-sized tourism and hospitality enterprises in Macao through a large-scale questionnaire survey. This article used exploratory factor analysis and confirmatory factor analysis to test the reliability and validity of each factor system and its measurement scale. The variance analysis is used to judge the differences between the elements. The regression analysis is used to verify the hypothesis of a causal relationship between factors. The structural equation analysis is used to fit the model and make necessary amendments. The results reveal that the government service environment has a significant positive impact on the ability of an entrepreneur. In addition, the regional soft environment significantly impacts the competitive advantage of small- and medium-sized tourism and hospitality enterprises in Macao. Contrary, the impact of laws of Macao on the acquisition of financial resources and the promotion of entrepreneur ability and innovation ability is found insignificant. In conclusion, the results showed that market of Macao lacks venture investors where enterprises cannot obtain funds through angel financing or risk financing.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49b72750642c945afdc226d7635bf90d",
  "timestamp": "2025-05-15T03:13:30.710656"
}