{
  "id": 6344,
  "title": "Geopolitical risk and cash holdings: evidence from an emerging economy",
  "abstract": "PurposeThis study aims to examine the influence of geopolitical risk (GPR) on corporate cash holdings in an emerging market, India. It also investigates whether the effect of GPR on cash holdings varies across financially constrained and unconstrained firms, and across the different sectors.Design/methodology/approachThis study uses the fixed-effect regression model to examine the effect of GPR on the corporate cash holdings of 2090 Indian firms from 2003 to 2021. To correct the potential endogeneity issue and ensure the robustness of the results, this study uses two-stage least squares regression, alternative cash holdings proxies, GPR measures and across the different periods (Global financial crisis and COVID-19).FindingsThe paper finds that GPR has a positive impact on the cash holdings of Indian firms. The authors also find that the positive relationship between GPR and cash holdings is consistent for financially constrained and unconstrained firms. Furthermore, the results also show that firms in the construction sector maintain higher cash reserves than other sectors.Originality/valueTo the best of the authors' knowledge, this study is one of the first-ever studies which examines the effect of GPR on corporate cash holding for an emerging economy like India. The use of alternative measures of cash holding, GPR, and estimation methods make this study more robust.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49cd30dbe4b926184abc29c17e4776a2",
  "timestamp": "2025-05-15T02:57:07.722425"
}