{
  "id": 2739,
  "title": "Regional effect of monetary policy based on GVAR model and machine learning",
  "abstract": "Monetary policy is an important means for a country to regulate macroeconomic operations and achieve established economic goals. Moreover, a reasonable monetary policy improves the efficiency of financial operations on a global scale and effectively resolves the financial crisis. At present, scholars from various countries have begun to pay attention to the issue of differentiated formulation of monetary policy among regions. This paper combines machine learning to construct a monetary policy differentiation effect analysis model based on the GVAR model. Moreover, this paper uses the gray correlation analysis method to obtain the gray correlation matrix between industries, and then introduces the industry's own characteristics, industry relevance and macroeconomic factors into the macro stress test of credit risk. In addition, this paper constructs a conduction model based on the industry GVAR model, and uses the first-order difference sequence of GDP growth rate, CPI growth rate and M2 growth rate of each economic region to construct a GVAR model to test the impulse response function. The results of the test show that the monetary policy shocks of various economic regions are significantly different. All in all, the research results show that the performance of the model constructed in this paper is good.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49d643d2dfd43f7106be51cfe2de7320",
  "timestamp": "2025-05-15T02:18:37.169632"
}