{
  "id": 3788,
  "title": "Corporate climate risk disclosure: assessing materiality and stakeholder expectations for sustainable value creation",
  "abstract": "PurposeThis study aims to evaluate the adequacy of climate risk disclosure by providing empirical evidence on whether corporate disclosure meets rising stakeholders' demand for risk disclosure concerning climate change.Design/methodology/approachDrawing on a triangulated approach for collecting data from multiple sources in a longitudinal study, we perform a panel regression analysis on a sample of multinational firms between 2007 and 2021. Inspired by the Global Reporting Initiative (GRI) principles, our innovative and inclusive model of measuring firm-level climate risks underscores the urgent need to redefine materiality from a broader value creation (rather than only financial) perspective, including the impact on sustainable development.FindingsThe findings of this study provide evidence of limited corporate climate risk disclosure, indicating that organisations have yet to accept the reality of climate-related risks. An additional finding supports the existence of a nexus between higher corporate environmental disclosure and higher corporate resilience to material financial and environmental risks, rather than pervasive sustainability risk disclosure.Practical implicationsWe argue that a mechanical process for climate-related risk disclosure can limit related disclosure variability, risk reporting priority selection, thereby broadening the short-term perspective on financial materiality assessment for disclosure.Social implicationsThis study extends recent literature on the adequacy of corporate risk disclosure, highlighting the importance of disclosing material sustainability risks from the perspectives of different stakeholder groups for long-term success. Corporate management should place climate-related risks at the centre of their disclosure strategies. We argue that reducing the systematic underestimation of climate-related risks and variations in their disclosure practices may require regulations that enhance corporate perceptions and responses to these risks.Originality/valueThis study emphasises the importance of reconceptualising materiality from a multidimensional value creation standpoint, encapsulating financial and sustainable development considerations. This novel model of assessing firm-level climate risk, based on the GRI principles, underscores the necessity of developing a more comprehensive approach to evaluating materiality.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49e39a49923c505a5ce92f241e3688c1",
  "timestamp": "2025-05-15T02:29:59.179002"
}