{
  "id": 473,
  "title": "Assessment of the influence of food attributes on meal choice selection by socioeconomic status and race/ethnicity among women living in Chicago, USA: A discrete choice experiment",
  "abstract": "Large and persistent obesity disparities exist in the US by socioeconomic status (SES) and race/ethnicity, and weight loss interventions have traditionally been less effective in these populations. Thus, a better understanding is needed of the behavioral, economic, and geographic factors that influence obesity risk factors such as eating behaviors. We used a discrete choice experiment to evaluate the impact of different meal attributes on meal choice and to test whether the relative importance of these attributes varied by SES and race/ethnicity. Study participants (n = 228) were given a series of 10 choice tasks and asked to choose among 4 meals, each rated based on the following attributes: taste; healthfulness; preparation time; travel time to food outlet for meal/ingredients; and price. SES was measured using education and self-reported difficulty paying for basics. Race/ethnicity was categorized as Hispanic/Latina, non-Hispanic black, non-Hispanic white, and non-Hispanic other. Data were analyzed using mixed logit regression models with interaction terms to determine whether meal attributes influenced meal choices differentially by SES and race/ethnicity. Healthfulness and taste were the most important attributes for all participants. Price was a more important attribute among those in the lowest SES group compared with those in the higher SES groups. Travel was the least important attribute for low SES participants, and it was not significantly related to meal choice in these groups. Discrete choice experiments as illustrated here may help pinpoint the most salient targets for interventions to improve eating behaviors and reduce obesity disparities. Specifically, our findings suggest interventions should incorporate strategies to target the pricing of healthy and unhealthy food options.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49ed1e6400e15de5cc3746757948edbc",
  "timestamp": "2025-05-15T01:32:30.170969"
}