{
  "id": 76,
  "title": "Stable Multilevel Deep Neural Networks for Option Pricing and xVAs Using Forward-Backward Stochastic Differential Equations",
  "abstract": "Deep learning techniques have significantly impacted fields such as image processing, computer vision, and natural language processing. However, their influence on quantitative finance, particularly in option pricing, hedging, and portfolio management, has been limited. Traditional financial applications rely on rigorous mathematical models and established numerical methods like Monte Carlo and finite difference methods. However, these methods struggle with high-dimensional problems. Recent works propose using Deep Neural Networks (DNNs) to solve high-dimensional Partial Differential Equations (PDEs) in finance, potentially overcoming the limitations of conventional techniques. Despite the recent progress, DNN methods face high computational costs, stability issues, and generally fail to meet the high accuracy requirements of the financial industry. This paper addresses these challenges. To address the high computational cost of training deep neural networks for financial applications, we propose a multilevel architecture inspired by multilevel Monte Carlo methods. To enhance stability, we adopt a dynamical systems perspective and utilize the NAIS-Net architecture, which ensures global asymptotic stability. For improving accuracy, we leverage the forward and backward systems of stochastic differential equations (FBSDEs) for option pricing problems. We also provide a theoretical argument that suggests that the proposed approach is superior to Physics Informed Neural Networks. Finally, the proposed methodology is implemented on several option pricing and xVA problems and is shown to achieve higher efficiency and accuracy, notably improving the pricing of options and xVAs by an order of magnitude over state-of-the-art methods.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49f36d3e1ec4efca7b2d181e0aab01b9",
  "timestamp": "2025-05-15T01:26:55.049862"
}