{
  "id": 283,
  "title": "Asset Pricing and Portfolio Investment Management Using Machine Learning: Research Trend Analysis Using Scientometrics",
  "abstract": "Asset pricing in the context of financial economics pertains to the investigation and formulation of two fundamental pricing ideas and the models that go along with them. Various models exist for different scenarios, but they can be traced back to either general equilibrium asset pricing or rational asset pricing. Asset pricing models, as the name suggests, serve as valuable tools to assess the value of assets. The general equilibrium theory states that supply and demand interact to determine market prices. In this context, asset prices collectively satisfy the market clearing condition, which dictates that the supply and demand for each asset are equal at the prevailing price. Another crucial aspect of financial planning is portfolio management (PM), which aims to maximise investment profits while minimising losses. PM involves implementing effective asset allocation strategies to enhance returns and mitigate risks. Numerous studies have been conducted worldwide on various types of asset pricing models and investment portfolios, with some incorporating machine learning and deep learning techniques. In several models, the predictive accuracy has exceeded 90%. To shed light on the current research landscape in the realm of asset pricing and portfolio investment, we conducted a scientometric analysis.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "49fcfaabe220159020981f19ef440456",
  "timestamp": "2025-05-15T00:41:04.875982"
}