{
  "id": 4211,
  "title": "Historical Redlining, Social Determinants of Health, and Stroke Prevalence in Communities in New York City",
  "abstract": "IMPORTANCE Historical redlining was a discriminatory housing policy that placed financial services beyond the reach of residents in inner-city communities. The extent of the impact of this discriminatory policy on contemporary health outcomes remains to be elucidated. OBJECTIVE To evaluate the associations among historical redlining, social determinants of health (SDOH), and contemporary community-level stroke prevalence in New York City. DESIGN, SETTING, AND PARTICIPANTS An ecological, retrospective, cross-sectional study was conducted using New York City data from January 1, 2014, to December 31, 2018. Data from the population-based sample were aggregated on the census tract level. Quantile regression analysis and a quantile regression forests machine learning model were used to determine the significance and overall weight of redlining in relation to other SDOH on stroke prevalence. Data were analyzed from November 5, 2021, to January 31, 2022. EXPOSURES Social determinants of health included race and ethnicity, median household income, poverty, low educational attainment, language barrier, uninsurance rate, social cohesion, and residence in an area with a shortage of health care professionals. Other covariates included median age and prevalence of diabetes, hypertension, smoking, and hyperlipidemia. Weighted scores for historical redlining (ie, the discriminatory housing policy in effect from 1934 to 1968) were computed using the mean proportion of original redlined territories overlapped on 2010 census tract boundaries in New York City. MAIN OUTCOMES AND MEASURES Stroke prevalence was collected from the Centers for Disease Control and Prevention 500 Cities Project for adults 18 years and older from 2014 to 2018. RESULTS A total of 2117 census tracts were included in the analysis. After adjusting for SDOH and other relevant covariates, the historical redlining score was independently associated with a higher community-level stroke prevalence (odds ratio [OR], 1.02 [95% CI, 1.02-1.05]; P < .001). Social determinants of health that were positively associated with stroke prevalence included educational attainment (OR, 1.01 [95% CI, 1.01-1.01]; P < .001), poverty (OR, 1.01 [95% CI, 1.01-1.01]; P < .001), language barrier (OR, 1.00 [95% CI, 1.00-1.00]; P < .001), and health care professionals shortage (OR, 1.02 [95% CI, 1.00-1.04]; P = .03). CONCLUSIONS AND RELEVANCE This cross-sectional study found that historical redlining was associated with modern-day stroke prevalence in New York City independently of contemporary SDOH and community prevalence of some relevant cardiovascular risk factors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a05e696d08f16902e85b2f034760611",
  "timestamp": "2025-05-15T02:34:13.512263"
}