{
  "id": 8125,
  "title": "Characteristics and spending patterns of high-cost child patients: findings from Fujian in China",
  "abstract": "Background The health condition during childhood has been shown to influence an individual's health and socioeconomic status in adulthood. Understanding the concentration and persistence patterns in children's healthcare expenditures is crucial for providing risk protection and promoting the well-being of children. Studies regarding the concentration and persistence of health expenditures have focused mainly on elderly individuals in developed regions. To gain insights into factors that contribute to childhood health expenditures, this article examined children with high costs (that is, in the top 10% of the expenditure distribution) and explored the characteristics and spending patterns that distinguished them from other patients in the context of the largest developing economy-China.Methods By using a unique individual-level administrative claims dataset over a 5-year observation period, this study identified spending concentrations and the proportion of children whose costs remained high over five years using a linear probability model and logit regression analysis.Results Teenagers from 12 to 17 years old were more likely to persist in the high-cost group than any other age groups in the study. Pediatric complex chronic conditions and other severe health ailments were predictive factors for entry into and persistence in the high-cost category. More than half of the total health expenditures were attributed to children in the top 10% expenditure group. In addition, risk protection and healthcare insurance support for high-cost children was found to be inadequate, particularly for children from low-income families.Conclusions Healthcare support for children impacts individual development and family financial status. This study described the characteristics and spending patterns of children patients in the largest developing country. The fact that over half of total expenditures are concentrated toward 10% of patients makes it valuable to consider relevant support for this group, especially for families whose medical costs are higher than income.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a1302b4e87af7d1d41a8d0365ba4549",
  "timestamp": "2025-05-15T03:15:38.362250"
}