{
  "id": 9324,
  "title": "Coopetition and sales performance: evidence from non-mainstream sporting clubs",
  "abstract": "Purpose Small sports clubs are the life-blood of particular communities, even though many are under-resourced and have difficulties in operating under an individualistic business model. Although coopetition (simultaneous cooperation and competition) has been recognised as a positive driver of performance, the complexities of this association remain under-researched. Consequently, grounded in resource-based theory and the relational view, the purpose of this current study is to examine the moderating roles of inter-firm conflict and competitive intensity in the coopetition-sales performance relationship. Design/methodology/approach After undertaking 25 field interviews, survey data were collected from 151 non-mainstream sporting clubs in New Zealand. This setting was ideal, since it hosts high-degrees of cooperativeness and competitiveness. After assessing the statistical data for all major robustness checks (including common method variance and endogeneity bias), the hypothesised and control paths were tested through a hierarchical regression analysis. Findings Coopetition had a positive relationship with sales performance, but inter-firm conflict yielded a negative interaction effect. Surprisingly, this link was positively moderated by competitive intensity. Practical implications Under-resourced entrepreneurs (like those in many small sports clubs) should consider cooperating with their competitors, as these strategies can assist them to improve their sales performance. However, they should be careful when engaging in such activities due to the considerable risk that rival firms could behave opportunistically, which might harm their performance. That being said, owner-managers are advantaged if they operate in sectors where there are lots of competitors because there is increased scope to collaborate with complementary and trustworthy rivals that can help them to achieve mutually-beneficial outcomes. Indeed, sporting governing bodies (including those that operate on a non-profit basis) should encourage their members to engage in coopetition due to these positive financial consequences. Originality/value This investigation contributes to the extant literature by evaluating the competitive forces affecting the link between coopetition and sales performance. Specifically, new evidence emerges on the circumstances where coopetition is (and is not) a performance-enhancing entrepreneurial strategy. Further, this investigation provides unique insights regarding coopetition among non-mainstream sporting clubs, adding new knowledge to the sports entrepreneurship literature. Moreover, by infusing resource-based theory with the relational view, stronger arguments feature how owner-managers can navigate the paradoxical forces that drive coopetition activities. This study ends with several practitioner implications, alongside a series of limitations and avenues for future research.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a2006ae0385f1596fa7cdecaefa1999",
  "timestamp": "2025-05-15T03:27:53.320671"
}