{
  "id": 8047,
  "title": "Do large-scale agricultural entities achieve higher livelihood levels and better environmental outcomes than small households? Evidence from rural China",
  "abstract": "There is an ongoing debate about the type or scale of agriculture that should be most encouraged. This study explores the differences in livelihood levels and outcomes between new agricultural business entities (NABEs) and traditional small households. We applied the analytical tools of a sustainable livelihood framework and a multiple linear regression model to describe the determinants of livelihood outcomes of 105 NABEs and 119 traditional small households in two typical areas around the Sichuan Basin in China. The results show that the overall livelihood level of NABEs is 1.40 times higher than traditional small households. NABEs with a mixed livelihood strategy of both planting and breeding have the highest livelihood level, followed by planting NABEs and breeding NABEs. About 3.13% of all agricultural entities are at risk of falling into poverty; the greater risk levels are associated with the subsidized households (30.00%), pure farmers (12.50%), and part-time farming households (1.69%). NABEs in the study area are verified to use 2.06 times more pesticide and herbicide inputs compared to traditional small households. Education level, technical training, financial accessibility, and the connection with professional cooperatives are common factors influencing the livelihood levels of the two groups of agricultural entities. Livelihood levels of NABEs are also significantly influenced by the age of NABE leaders, planting area per capita, and agricultural insurance. Based on these results, the study proposes policy interventions that are most appropriate for achieving higher livelihood levels among both NABEs and small households. Although the mixed type of NABEs and non-farming households are recognized as being better agricultural entity types for poverty alleviation, we recommend a balance between fostering NABEs and maintaining traditional small households; guidance related to green agriculture production for NABEs is also urgently needed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a213bbce11166478bc7a24612c41c39",
  "timestamp": "2025-05-15T03:14:37.385401"
}