{
  "id": 2022,
  "title": "Factors associated with presenteeism among employed Australian adults reporting lifetime major depression with 12-month symptoms",
  "abstract": "Background: Employees experiencing depression can take a sickness absence or continue working ('presenteeism'). However, little is known about the factors associated with these behaviors within this population. This study aimed to determine the relative importance of socio-demographic, financial, work and health-related factors associated with presenteeism. Methods: The 2007 Australian National Survey of Mental Health and Wellbeing provided data from employed individuals reporting lifetime major depression with 12-month symptoms (N = 320). Survey adjusted multivariable logistic regression assessed classification of 12-month, depression-related presenteeism on the basis of socio-demographic, financial, work and health factors. Results: Acceptable classification of cases was 70% or greater. Classification of cases based on socio-demographic factors, age, sex and marital status, was reasonable (62%). Adding work factors (work hours and occupation type) produced a 1% increase in successfully classified cases (63%). Health factors further increased correctly classified cases (67%). Marital status, housing tenure and co-morbid mental disorders were important indicators of presenteeism behavior. Limitations: Work-related variables were restricted to available measures. Potentially important psychosocial work environment factors were unavailable. Cross-sectional data precluded causal inference. Conclusions: Using available factors, model discrimination did not reach an acceptable level i.e. 70% of presenteeism cases successfully classified. This highlighted the contribution of unmeasured factors to presenteeism behavior. Future research should explore the relative importance of psychosocial work environment and personality factors such as work demands, effort/reward imbalance and conscientiousness. The identified associations between socio-demographic, financial and health factors on work attendance behaviors could inform disease management guidelines for employers via recognition of employees at risk of presenteeism. (C) 2011 Elsevier B.V. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a24f00792eea002d89aff6d3bdf90c6",
  "timestamp": "2025-05-15T02:10:25.664443"
}