{
  "id": 7634,
  "title": "The profiles of public and private patients in maternal healthcare: a longitudinal study to examine adverse selection",
  "abstract": "In this article, we investigate differences in the profiles of patients within the Australian mixed public-private maternal health system to examine the extent of adverse selection. There are conflicting influences on adverse selection within the private health sector in Australia due to government regulations that incentivise lower risk segments of the population to purchase community-rated private health insurance. We use a two-phase modelling methodology that incorporates statistical learning and logistic regression on a dataset that links administrative and longitudinal survey data for a large cohort of women. We find that the key predictor of private patient status is having private health insurance, which itself is largely driven by sociodemographic factors rather than health-or pregnancy-related factors. Additionally, transitioning between the public-private systems for a subsequent pregnancy is uncommon; however, it is primarily driven by changes in private health insurance when it occurs. Other significant factors when transitioning to the private system for a second pregnancy are hypertension, increased access to specialists and stress related to previous motherhood experiences. Consequently, there is limited evidence of adverse selection in this market, with targeted financial incentives likely outweighing the impact of community rating even during childbearing years where private health service use increases.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a26a86844e5af1ebc0ba640ee96d6dd",
  "timestamp": "2025-05-15T03:10:33.016724"
}