{
  "id": 3369,
  "title": "Quality of Entrepreneurship and Micro-, Small- and Medium-sized Enterprises' (MSMEs) Financial Performance in Indonesia",
  "abstract": "The purpose of this study is to investigate the quality of entrepreneurship - motivation, entrepreneurial orientation, and risk behavior - in relation to the odds of micro-, small- and medium-sized enterprises' (MSMEs) financial performance in Indonesia. Additionally, this paper investigates how these qualities apply for the current challenges perceived by MSMEs' entrepreneurs in Indonesia due to Covid-19 crisis; specifically, this paper examines the odds of MSMEs' financial performance during the pandemic in respect to when these qualities are implemented by the entrepreneurs. The empirical data was obtained from an online survey by means of a structured questionnaire. MSMEs surveyed were randomly selected on a national scale. To test the hypotheses, a quantitative approach is employed, using multinomial regression. The main result shows that, under normal economic environment, the more intrinsically-motivated and continuity-driven entrepreneur is, the more likely the MSME will achieve financial growth compared to remaining stagnant. To our surprise, innovativeness leads to less likelihood of MSME's financial growth, suggesting the significance of innovation does not apply to MSMEs in Indonesia. Lastly, MSMEs' risk behavior to operate in a stable business environment is found more likely to result in a better performance and is true for operational and financial risks, but not marketing risks.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a29bd1e566f96c134bbb20904c35736",
  "timestamp": "2025-05-15T02:25:40.081069"
}