{
  "id": 8805,
  "title": "Different tenure phases of executives and audit fees",
  "abstract": "Purpose The authors investigate whether the different tenure phases of executives have a differential effect on audit pricing. Two alternate views - career concern and power - can explain the effect of executives' tenure on audit pricing. This paper aims to determine, which viewpoint dominates in explaining the relationship between audit pricing and executive tenure phases. Design/methodology/approach Using a sample of 11,198 firm-year observations from 2007 to 2016, the authors adopt an ordinary least squares regression model to assess the impact of the middle and long phases of executives' tenure on audit fees. Findings Audit fees are significantly lower when executives enter the middle and long phases of tenure. The reduction in audit fees is greatest as both chief executive officers and chief financial officers enter the long tenure phase. Although audit fees gradually decrease as executive tenure is extended, they start increasing two years before the end of executive tenure. Furthermore, the negative association between the executive tenure phase and audit fees is greater when the executive is appointed externally. Finally, the long phase of executive tenure also mitigates the positive relationship between audit fees and internal control weaknesses. Research limitations/implications This study is based on US data. Future research may extend this study to other countries. Practical implications The findings are important to firms, practitioners and academicians, particularly, as the length of tenure of top executives has increased in recent years. By documenting that executives' middle and long tenure phases reduce audit fees, the findings highlight the importance of maintaining executives in the firm. Finally, the findings have implications for investors, policymakers and auditors to identify companies with high audit risk. Originality/value This study is the first to document the impact of executives' middle and long tenure phases on audit fees.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a344542897708353ef1d6156fcc53f7",
  "timestamp": "2025-05-15T03:22:26.118595"
}