{
  "id": 7871,
  "title": "Money laundering, media and European banks",
  "abstract": "PurposeThis paper aims to assess, from an empirical perspective, the research question if public media reports which relate concrete banks to concrete allegations of money laundering have an adverse impact on banks stock prices and what are the drivers of such impact? Design/methodology/approachThe paper makes use of event study methodology and uses the constant mean and the market model. The event window is calibrated towards a five-day window, and the estimation window has a length of 90 days, in line with best academic practices. Drivers are identified by correlation analysis. and the market model uses ordinary least squares regression. FindingsThe application of event study methodologies yields the results that stock prices of affected banks generate, at the date of the news appearance, statistically significant negative abnormal returns under both the market model and the constant mean model. As negative abnormal returns have been mainly found at the date of the event itself, the findings confirm that the impacts of money laundering may be severe but short natured. In addition, the paper finds that the identified negative abnormal returns may be driven by the banks' size in terms of total assets, by the bank's profitability in terms of return on assets and by the bank's sustainability risk. Practical implicationsThe findings have implications in terms of banking and supervisory practices. In specific, the findings help to argue that banking consolidation is needed to lower the impacts of AML cases, as stock prices of larger banks show less sensitivity. In addition, the findings could be used to determine financial sanctions against banks violating AML regulation. Finally, the findings imply that AML news can have severe and fast-moving financial stability considerations and are, therefore, important in crisis situations. Originality/valueAs there appears to be no substantial research that applies event study methodology to the money laundering context, the combination of research question and methodology has an innovative character. In addition, there is no clear literature on media and money laundering.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a34c5ee178d0f238a78e02ef02465ef",
  "timestamp": "2025-05-15T03:13:04.878908"
}