{
  "id": 7050,
  "title": "Financial Market Determinants of Dynamic Herding in North American Energy Equity Market",
  "abstract": "This study employs state-space models and the quantile-on-quantile regression technique to examine the dynamics of intentional and fundamental herding in North American energy stocks, together with its non-linear determinants. Our findings reveal persistent herding in North American energy stocks, with no exceptions during the global financial crisis, COVID-19, lockdown and post-lockdown period, which is primarily driven by intentions. In all of these cases, herding is primarily motivated by intentional drivers rather than fundamental factors. Our results also show a herding asymmetry during bullish and bearish market conditions, but herding during bullish (bearish) market condition is mainly driven by the intentions (fundamentals). The findings of our quantile-on-quantile regression show that the effects of macroeconomic variables on time-varying herding are, in fact, regime-specific. We generally find evidence of herding (anti-herding) at the lower (upper) quartiles of energy stocks liquidity, oil price shocks, economic policy uncertainty and oil market implied volatility. The investment community engaged in North American energy stocks can benefit from our study, as awareness about regime-specific effects of various market variables on intentional (fundamental) herding can be a useful input in designing asset allocation and hedging strategies. The outcome of our study may provide interesting input to regulators to develop the dynamic legislative framework focusing on policies to encourage investment diversification during regime-specific systemic risk escalation resulting from the dynamic behaviour of herding and macroeconomic variables.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a371b9ad2cd12750b21244883a471de",
  "timestamp": "2025-05-15T03:04:23.036901"
}