{
  "id": 423,
  "title": "A New Procedure for Discriminating Between Long Memory and Shifting Means Alternatives",
  "abstract": "It is now recognized that long memory and structural change can easily be confused because the statistical properties of times series of lengths typical of financial and econometric series are similar for both models. The implications of long memory models or short memory with breaks for the pricing of financial assets (e.g. options) have been studied by other authorities who have concluded the pricing is significantly different between the two classes of models. Option pricing is also of interest to regulatory authorities. Thus it is of interest both from a finance theory and regulatory point of view whether the data are generated by a true long memory process or by something else. We propose a new approach aimed at distinguishing between long memory and structural change. The approach, which utilizes the computational efficient methods based upon Atheoretical Regression Trees (ART), uses a null hypothesis of the data being a fractionally integrated series. It establishes through simulation the bivariate distribution of the fractional integration parameter, d, with regime length for simulated fractionally integrated series of given nominal d value and series length. Confidence intervals can be established empirically as contours on the simulated data. This bivariate distribution is then compared with the data for the time series under test. We apply these methods to the realized volatility series of 16 stocks in the Dow Jones Industrial Average in the 10 year period from the beginning of 1994 to the end 2003. We show that in these series the value of the fractional integration d parameter is not constant with time. Given that a constant d value is fundamental to the definition of a fractionally integrated process",
  "year": 2009,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a3ffb08745b254848831b66e3575c31",
  "timestamp": "2025-05-15T01:31:50.730630"
}