{
  "id": 8563,
  "title": "Determinants of Islamic bank stability in Asia",
  "abstract": "PurposeThis study aims to analyze the factors that influenced the stability of Islamic banks in Asia.Design/methodology/approachThe panel data consisted of 16 Asian countries operating Islamic banks from 2010 to 2019. The data were analyzed through dynamic panel regression using Arellano-Bond generalized method of moments (GMM).FindingsThis study provides novel insights into the factors influencing the stability of Islamic banks in Asia. The findings suggest that past financial stability, liquidity risk, loan risk, inflation, gross domestic product, government effectiveness, rule of law and control of corruption are all significant contributors to Islamic bank stability. Notably, political stability, voice and accountability and regulatory quality did not show a significant association.Research limitations/implicationsThe current study's focus was solely on Islamic bank stability in Asian countries, which leaves room for further exploration. Future research could benefit from expanding the scope to encompass all nations with active Islamic banking institutions. In addition, incorporating a broader range of macroeconomic variables, such as exchange rates, interest rates, profit-sharing equivalents and investment rates, could provide deeper insights into the factors influencing Islamic bank stability across diverse contexts.Practical implicationsThis study has significant practical implications for policymakers, bank managers and regulatory authorities seeking to enhance the stability of Islamic banks in Asia. By implementing robust risk management frameworks, adopting prudent regulatory policies, and actively fostering economic growth, policymakers can create an environment conducive to the sustained development and prosperity of Islamic banking institutions. Notably, promoting good governance practices and instituting effective crisis prevention measures can further bolster the resilience of the Islamic banking sector, enabling it to play a more dynamic role in contributing to the overall development and welfare of Asian societies.Social implicationsThe findings of this study carry significant social implications, highlighting the need for governments in Asian countries to prioritize public policies that promote good governance and ethical practices within the banking industry. Such policies, coupled with efforts to attract foreign investments and foster a stable and transparent banking sector, have the potential to generate far-reaching positive effects on society. Through economic growth stimulated by a robust Islamic banking sector, Asian countries can create new employment opportunities, improve living standards and ultimately enhance the overall well-being of their citizens.Originality/valueThis study contributes to the ongoing discourse on Islamic banking stability by offering novel insights and expanding the empirical knowledge base in this field. The dual application of robust regression methodologies - namely, GMM dynamic panel data models - presents a unique analytical framework for investigating the complex interplay between diverse variables and Islamic bank stability. This methodological choice fosters deeper understanding of the dynamic relationships at play, advancing our understanding of how specific factors influence the sector's resilience and performance. In addition, the study uses rigorous empirical techniques and engages with the extant literature to provide fresh perspectives and nuanced interpretations of the findings, further solidifying its contribution to the field's originality and richness.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a404b4acf25fe9ea3cd0f5410f17a24",
  "timestamp": "2025-05-15T03:20:22.135740"
}