{
  "id": 6270,
  "title": "Does Working Capital Management Influence Operating and Market Risk of Firms?",
  "abstract": "Extant empirical studies have predominantly focused on the nexus between working capital management (WCM) and corporate profitability. While there is a dearth of literature on the nexus between WCM and a firm's risk, the present study examines Pakistani-listed firms coming from 12 diverse industrial segments to observe this association for a time span of ten years (2005-2014). To ensure robustness, we employed a System Generalized Method of Moments (SGMM) regression estimation to investigate the influence of WCM on the operational and market risk for firms. Empirical testing revealed that higher working capital levels were associated with lower volatility in firms' stock price, which shows that shareholders prefer a conservative working capital policy. Moreover, firms with better cash positions were subject to lesser stock market volatility. In contrast, excess working capital and a larger net trade cycle were associated with increased volatility in the operating income. Besides, firms with lower working capital levels relative to their respective industry experienced fewer fluctuations in their operating profits. Our findings assert that short-term financial management has important ramifications for firms' operating and market fundamentals. Practical implications are discussed for corporate managers and relevant stakeholders.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a5751daa2992d8076273e6e32c453c2",
  "timestamp": "2025-05-15T02:56:37.267199"
}