{
  "id": 2439,
  "title": "Teacher-led versus student-led seminar blended with portfolio for assessment of learning: An interventional study",
  "abstract": "BACKGROUND: Increase in competitive demands has led to the promotion of seminar presentation by the students to increase active learning and for the assessment of learning. Portfolios are an important tool for assessment for learning. The objectives of the study were to compare the gain in knowledge among the conventional and the blended seminar groups (intervention group), analyze the working portfolios to assess for learning, and to gather the perception of students. MATERIALS AND METHODS: This was an interventional study (2016) with convenience sampling that included 27 students each in the conventional and interventional groups. It was conducted in a medical college in central India. The conventional group was teacher led and the blended seminar group was student led with interaction with the students regarding the contents of the portfolio. Student's unpaired and paired t tests were used for statistical analysis. P < 0.05 was considered as the level of significance. Class average normalized gain (g) was used as a measure of effectiveness of the intervention. Quantitative questions were analyzed using percentages and qualitative data using categorization. RESULTS: Significant difference was found between the conventional and intervention groups (P < 0.05) with gain g  being 0.52 for the intervention group. On evaluation of the feedback, students commented regarding its interactive nature and progress during the learning process. The reflections were coded as text as the unit of coding and student as the unit of coding. It was also found that the students who were critical reflectors were the ones who scored > 50% in the posttest scores. CONCLUSION: The present study showed that seminar when blended with portfolio yielded positive results in the process of learning, and hence was effective in assessment for learning.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a6094e07b62f81859f63a255655b138",
  "timestamp": "2025-05-15T01:06:38.190715"
}