{
  "id": 1841,
  "title": "Novel hybrid ensemble credit scoring model with stacking-based noise detection and weight assignment",
  "abstract": "Credit scoring is used to help financial institutions control default risks and reduce economic losses, and a variety of mainstream machine learning and data mining algorithms have been applied for this purpose. However, realworld datasets are generally noisy, which seriously affects the performance of credit scoring models. Among the mainstream strategies for handling noise, instance filtering may result in information loss, especially for hard-toaccess credit datasets, and label noise correction may produce erroneous information in the dataset. In this study, to reduce the adverse impact of noisy data on the performance of classification algorithms, a novel hybrid ensemble credit scoring model with stacking-based noise detection and weight assignment is developed to remove or adapt noisy data in raw datasets and to form noise-detected training data to obtain excellent default risk prediction competence. Furthermore, a new weight assignment approach based on a cloud model is proposed, which is applied to calculate the weight values of the classifiers in the weighted voting ensemble model to improve the prediction accuracy of the proposed model. In this study, five public datasets are adopted using five performance metrics to evaluate the performance of the proposed model. The experimental results demonstrate good model prediction power and robustness.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a68d0487541af1822279db63ab2a9a8",
  "timestamp": "2025-05-15T02:08:03.960583"
}