{
  "id": 2266,
  "title": "Investment with a Conscience: Examining the Impact of Pro-Social Attitudes and Perceived Financial Performance on Socially Responsible Investment Behavior",
  "abstract": "This article addresses the growing industry of retail socially responsible investment (SRI) profiled mutual funds. Very few previous studies have examined the final consumer of SRI profiled mutual funds. Therefore, the purpose of this study was to, in an exploratory manner, examine the impact of a number of pro-social, financial performance, and socio-demographic variables on SRI behavior in order to explain why investors choose to invest different proportions of their investment portfolio in SRI profiled funds. An ordinal logistic regression analysis on 528 private investors revealed that two of the three pro-social variables had a positive impact on how much the consumer invested in SRI profiled funds. Moreover, there was proof of a non-altruistic motive for investing in SRI as consumers who perceive that financial return of SRI is equal or better than regular mutual funds, invested a greater proportion of their portfolio in SRI profiled mutual funds. Furthermore, the results showed that women and better-educated investors were more likely to invest a greater proportion of their investment portfolio in SRI. Overall, the findings indicate that both financial perceptions and pro-social attitudes are connected to consumer investment in SRI.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a6ea84ed14d7bfa947c427c0638397e",
  "timestamp": "2025-05-15T01:05:04.489882"
}