{
  "id": 6668,
  "title": "The prediction of thoughts of death or self-harm in a population-based sample of female twins",
  "abstract": "Background. Although suicide is a leading cause of death, few Studies have attempted to predict suicidal ideation prospectively using epidemiological samples or multivariate methods. Method. Discrete-time event history analysis Was used to model the onset of thoughts of death or self-harm (TD/SH) in a population-based sample of female twins (N=2164) using variables from the demographic, psychopathological, childhood adversity, personality and life event domains. Univariate, multivariate-within domain and multivariate-across domain regression analyses were performed. Results. Most variables predicted TD/SH in the univariate analyses. However, the only variables to predict TD/SH independently were obsessive symptoms, childhood sexual abuse, rural residence, unemployment, older age, lifetime history of cocaine Misuse and low levels of education, personal religious devotion and altruism, as well as divorce/separation, loss of confidant, assault, job loss and financial problems in the previous month. This final model explained 16% of the variance in TD/SH. Lifetime histories of major depression, panic disorder and alcohol Misuse had no significant independent effect. Conclusions. Many variables, from all five domains of risk factors, are associated with the risk of TD/SH, but many of these effects may be mediated by other risk factors. Proximal life events and psychopathology may have more independent effects than other domains. The overall ability of these risk factors to predict TD/SH is modest. We cannot rule out that differences between these analyses and previous reports were due to our use of TD/SH as the dependent variable instead of thoughts of committing Suicide per se.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a8c5297dd621a8b8d621c27ab5c86f9",
  "timestamp": "2025-05-15T03:00:35.323943"
}