{
  "id": 7631,
  "title": "Relationship between the Prevalence of Metabolic Disease and Impaired Mobility, Diet, Physical Activity, and Socio-Demographic Characteristics in the Polish Elderly-A Cross-Sectional Study",
  "abstract": "Maintaining good health for as long as possible presents a great challenge for the elderly. As the elderly population is growing, there is an ongoing need to identify health risk factors affecting older individuals. The study aimed to explore relationships between sociodemographic characteristics, diet, physical activity, and prevalence of metabolic diseases and impaired mobility in the Polish elderly. A cross-sectional study was carried out on 417 elderlies in May-July 2021. Cluster analysis was applied to separate four homogeneous clusters based on the prevalence of metabolic disease and impaired mobility. Logistic regression analysis was used to verify associations between variables. Being overweight or having obesity, as well as following a diet, increased the probability of being affected by metabolic disease. Being well educated, having a better financial situation, positive perception of own health, and having at least moderate physical activity decreased the probability of suffering from mobility impairments. Eating behaviors were not found to be predictors of the disease. However, they differentiated the selected clusters. The results confirmed the heterogeneity of factors that may impact healthy aging. Thus, they should be taken into account by public health authorities to develop health promotion actions adjusted to the needs of specific subgroups.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a90e1e0ad8b763b06f05d7acc31b23f",
  "timestamp": "2025-05-15T03:10:33.011745"
}