{
  "id": 3356,
  "title": "Crypto goes East: analyzing Bitcoin, technological and regulatory contagions in Asia-Pacific financial markets using asset pricing",
  "abstract": "PurposeThis study provides a comprehensive analysis of the potential contagion of Bitcoin on financial markets and sheds light on the complex interplay between technological advancements, accounting regulatory and financial market stability.Design/methodology/approachThe study employs a multi-faceted approach to analyze the impact of BTC systemic risk, technological factors and regulatory variables on Asia-Pacific financial markets. Initially, a single-index model is used to estimate the systematic risk of BTC to financial markets. The study then uses ordinary least squares (OLS) to assess the potential impact of systemic risk, technological factors and regulatory variables on financial markets. To further control for time-varying factors common to all countries, a fixed effect (FE) panel data analysis is implemented. Additionally, a multinomial logistic regression model is utilized to evaluate the presence of contagion.FindingsResults indicate that Bitcoin's systemic risk to the Asia-Pacific financial markets is relatively weak. Furthermore, technological advancements and international accounting standard adoption appear to indirectly stabilize these markets. The degree of contagion is also found to be stronger in foreign currencies (FX) than in stock index (INDEX) markets.Research limitations/implicationsThis study has several limitations that should be considered when interpreting the study findings. First, the definition of financial contagion is not universally accepted, and the study results are based on the specific definition and methodology. Second, the matching of daily financial market and BTC data with annual technological and regulatory variable data may have limited the strength of the study findings. However, the authors' use of both parametric and nonparametric methods provides insights that may inspire further research into cryptocurrency markets and financial contagions.Practical implicationsBased on the authors analysis, they suggest that financial market regulators prioritize the development and adoption of new technologies and international accounting standard practices, rather than focusing solely on the potential risks associated with cryptocurrencies. While a cryptocurrency crash could harm individual investors, it is unlikely to pose a significant threat to the overall financial system.Originality/valueTo the best of the authors knowledge, they have not found an asset pricing approach to assess a possible contagion. The authors have developed a new method to evaluate whether there is a contagion from BTC to financial markets. A simple but intuitive asset pricing method to evaluate a systematic risk from a factor is a single index model. The single index model has been extensively used in stock markets but has not been used to evaluate the systemic risk potentials of cryptocurrencies. The authors followed Morck et al. (2000) and Durnev et al. (2004) to assess whether there is a systemic risk from BTC to financial markets. If the BTC possesses a systematic risk, the explanatory power of the BTC index model should be high. Therefore, the first implied contribution is to re-evaluate the findings from Aslanidis et al. (2019), Dahir et al. (2019) and Handika et al. (2019), using a different method.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a92646fccea1be1991f21e72c4a107c",
  "timestamp": "2025-05-15T02:25:13.783651"
}