{
  "id": 4901,
  "title": "The Association between Psychosocial Stressors and Gestational Weight Gain: Analysis of the National Pregnancy Risk Assessment Monitoring System (PRAMS) Results from 2012 to 2015",
  "abstract": "ObjectiveBoth psychosocial stress and gestational weight gain are independently associated with adverse maternal and fetal outcomes. Studies of the association between psychosocial stress and gestational weight gain (GWG) have yielded mixed results. The objective of this study was to evaluate the association between psychosocial stress and GWG in a large population-based cohort.MethodsData from the nationally representative Pregnancy Risk Assessment Monitoring System (PRAMS) Phase 7 questionnaire 2012-2015 was utilized. Maternal psychosocial stress was assessed through response to questions designed to examine four domains of psychosocial stress (i.e., traumatic, financial, emotional, partner-related) three months prior to or during pregnancy. GWG was categorized using pre-pregnancy BMI and total GWG into inadequate, adequate, or excessive according to the Institute of Medicine's GWG guidelines. Multinomial logistic regression was used to evaluate the association between psychosocial stressors and adequacy of GWG. Analyses took into account complex survey design.ResultsAll respondents who delivered >= 37 weeks gestation with GWG information available were included in the analysis (n = 119,183). After adjusting for confounders, patients who reported financial stress were more likely to experience excessive versus adequate GWG (RRR 1.09 [95%CI: 1.02-1.17]). Exposure to any of the stressor groups did not significantly increase the risk of inadequate GWG.ConclusionsThis large, population-based study revealed that among pregnant people in the US, exposure to financial stress is associated with higher risk of excessive GWG. Understanding the role stress plays in GWG will help to inform initiatives targeting this important aspect of prenatal care. What is already known on this subject?Excessive gestational weight gain (GWG) has been linked to postpartum weight retention and long-term adverse maternal and child health outcomes. Multiple studies have shown an association between psychosocial stress and adverse fetal outcomes. Risks of inadequate weight gain include low birthweight and failure to initiate breast-feeding whereas the risks of excessive weight gain include cesarean deliveries and postpartum weight retention for the mother and large-for-gestational-age infants, macrosomia, and childhood overweight or obesity for the offspring.What this study adds?The 2012-2015 Pregnancy Risk Assessment Monitoring System (PRAMS) provides unique nationally representative data in which birth outcomes and maternal weight are linked to psychosocial stressors. Our study is the largest of its kind examining the link between stress and GWG and reveals that exposure to financial stress is associated with higher risk of excessive GWG in the US.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4a9485eea422a20027c78bc8888c3d6f",
  "timestamp": "2025-05-15T02:42:04.919890"
}