{
  "id": 7496,
  "title": "The moderating effects of coping strategies on major depression in the general population",
  "abstract": "Objectives: To evaluate the moderating effects of various coping strategies on the association between stressors and the prevalence of major depression in the general population. Methods: Subjects from the Alberta buy-in component of the 1994 -1995 National Population Health Survey (NPHS) were included in the analysis (n = 1039). Each subject was asked 8 questions about coping strategies that dealt with unexpected stress from family problems and personal crises. Major depression was measured using the World Health Organization's (WHO) Composite International Diagnostic Interview-Short Form (CIDI-SF) for major depression. The impacts of coping strategies in relation to psychological stressors on the prevalence of major depression were determined by examining interactions between coping and life stress on major depression using logistic regression modelling. Results: No robust impact of coping strategies in relation to various categories of stress evaluated in the NPHS was observed. There was evidence that the use of pray and seek religious help and talks to others about the situations as coping strategies by women moderated the risk of major depression in the presence of financial stress and relationship stress (with a partner). Using emotional expression as a coping strategy by women might decrease the risk of major depression in the presence of I or more recent life events, personal stress, relationship stress (with a partner), and environmental stress. Conclusion: Different coping strategies may have a differential impact on the prevalence of major depression in specific circumstances. These findings may be important both to prevent and to treat depressive disorders.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4aa5c4ceb6fda52299b148749ff3fccd",
  "timestamp": "2025-05-15T03:09:07.326625"
}