{
  "id": 3133,
  "title": "MULTIDIMENSIONAL CREDIBILITY MODEL AND ITS APPLICATION",
  "abstract": "Solvency II project places emphasis on the modelling and management of risks of the insurance companies. This requires further improvement in actuarial methods and their application in insurance practice. Improving the quality of premium calculation methods is an effective factor in reducing the insurance technical risk of an insurer. Presentation the methods of premium calculation and its permanent updating is the aim of this article. Credibility theory is an experience rating technique to determine premiums, claim frequencies or claim sizes. Credibility models are based on the realistic concept of a heterogeneous insurance portfolio. Therefore, two sources of information are used in the calculation of the credibility estimators for the individual risk: typically little knowledge about the individual risk and quite extensive statistical information about entire portfolio. The most important model in the credibility theory is Buhlmann-Straub model. This model has a wide range of possibilities to be used in praxis mainly in general insurance. Besides that this model is a basis for other more specific models such as hierarchical, multidimensional or regression credibility models. In this article we deal with generalisation of one-dimensional Buhlmann-Straub credibility model to the multidimensional credibility model. We mainly focus on estimation of so-called structural parameters and usage of SAS Enterprise Guide application when estimating. The multidimensional Buhlmann-Straub credibility model is applied based the real data in motor vehicle third party liability insurance.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4aaa7943aa145467a1dbf99a54dc120d",
  "timestamp": "2025-05-15T01:13:45.296195"
}