{
  "id": 7281,
  "title": "An inquest into predictors of losses and constraints in Uttar Pradesh's potato (Solanum tuberosum) value chain",
  "abstract": "A significant portion of total horticultural production is lost each year due to post-harvest losses. These losses vary significantly in different segments of the supply chain and these variations are primarily due to various farm-level factors. Present study was carried out during 2019-20 to isolate the predictors of post-harvest losses in potatoes (Solanum tuberosum L.) in the purposively selected Khandoli block of Agra district, Uttar Pradesh. The total sample size was 160 included 120 farmers; 10 wholesalers; 15 retailers and 15 institutional stakeholders. The study used ordered logistic regression analysis and found that the knowledge level of the producers, training received, variety, timely labour availability, quantity harvested, and storage duration influenced the amount of loss e s in potatoes. The major constraints identified in the potato value chain were small operational size, absence of storage facilities, inadequate insurance coverage and poor market intelligence. The study suggested focusing more on capacity building, breeding & disseminating improved varieties: creating local-level storage infrastructure; ensuring financial risk coverage and price policy support; creating strong marketing intelligence network and farmer mobilization into farmers groups for effective post-harvest management.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ab129e6f98ac6cc12cb247d2ab1bbb3",
  "timestamp": "2025-05-15T03:07:02.602207"
}