{
  "id": 2578,
  "title": "A jack-of-all-trades or a master of none: the performance effects of balancing exploration and exploitation within vs across alliance portfolio domains",
  "abstract": "Purpose Theory predicts that balancing exploratory and exploitative learning (i.e., ambidexterity) across alliance portfolio domains (e.g. value chain function, governance modes) increases firm performance, whereas balance within domains decreases performance. Prior empirical work, however, only assessed balance/imbalance within and across two domains. The purpose of this study is to determine if theory generalizes beyond specific domain combinations. The authors investigated across multiple domains to determine whether alliance portfolios should be imbalanced toward exploration or exploitation within domains or balanced across domains. The authors also extended prior research by exploring whether the direction of imbalance matters. Current theory only advises managers to accept imbalance without helping with the choice between exploration and exploitation. Design/methodology/approach Hypotheses are tested using fixed-effects generalized least squares (GLS) regression analysis of a large 13-year panel sample of Fortune 500 firms from 1996 to 2008. Findings With respect to the balance between exploration and exploitation within each of the five domains investigated, imbalanced alliance portfolios had higher firm performance. No evidence was found that balance across domains relates to performance. Instead, for four of the five domains, imbalance toward exploration related positively to firm performance. Originality/value An alliance portfolio that allows for exploration in some domains and exploitation in other domains appears more difficult to implement than prior theory suggests. Firms benefit mostly from using the alliance portfolio for exploratory learning.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ab2e16c16acfe41b5cd2f70cfbf32cb",
  "timestamp": "2025-05-15T01:08:10.928212"
}