{
  "id": 4114,
  "title": "A dropout weight-constrained recurrent neural network model for forecasting the price of major cryptocurrencies and CCi30 index",
  "abstract": "Cryptocurrency is widely recognized as an alternative method for paying and exchanging currency instead of using classic coins or gold; thus, it has infiltrated almost in all financial transactions worldwide. Nowadays, cryptocurrency trade constitutes one of the most popular and promising type of profitable investments. Nevertheless, this new and constantly increasing financial market is characterized by high volatility and strong fluctuations of prices over time. As a result, it is considered essential for portfolio optimization and management, the development of a forecasting model. In this work, we propose a new time-series model based on dropout weight-constrained recurrent neural networks for forecasting cryptocurrency prices and the value of Crypto-Currency index 30 (CCi30). The proposed forecasting model exploits advanced regularization techniques for reducing the fundamental problem of overfitting. More specifically, it is characterized by the imposition of box-constraints on the weights of the network for reducing the likelihood of them blowing up to unrealistic values. Additionally, the adoption of dropout technique aims to explore hard-reaching regions of the weight space and forces the weights to away from zero. The proposed forecasting model was evaluated against state-of-the-art types of neural networks and regression models for forecasting the price of the four most widely traded digital currencies and for the prediction of CCi30 index. Our conducted experimental and detailed statistical analysis demonstrate that although weight-constrained networks give significant improvements the adoption of dropout technique in weight-constrained networks provides a boost in increasing the forecasting performance.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ab47781adff647d84759c62e8107af7",
  "timestamp": "2025-05-15T01:23:58.069902"
}