{
  "id": 3092,
  "title": "Relational justice, economic fluctuations, and long-term sickness absence: a multi-cohort study",
  "abstract": "Objectives Previous studies mainly based on the public sector show that organizational justice is associated with a lower risk of sickness absence (SA). The purpose of this study is to analyze this association with multi-cohort data from different employment sectors and to discover whether the association varies according to the general economic context or financial situation of the workplace. Methods Cross-sectional Finnish Quality of Work Life surveys from 1997, 2003, and 2008 were combined with data on long-term SA obtained from the Finnish Social Security Institution. The associations between SA periods in the three years following each survey and perceived relational justice, general economic context, and the perceived financial situation of the workplace were analyzed with negative binomial regression. Results Higher level of relational justice was statistically significantly associated with lower rate of SA after controlling for baseline health, but not after controlling for job control and job demands. An interaction was found with relational justice and the financial situation of the workplace. Higher level of relational justice was related to a lower risk of SA when the financial situation of the workplace was stable, but there was a higher risk of SA when the financial situation was insecure. Conclusions The association between relational justice and a lower risk of SA is in line with previous studies when the financial situation of the workplace is stable. In unstable economic conditions, employees may have the courage to take sick leave when they are ill if they are fairly treated by their supervisor.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ab77e36b1dd51ac526a2a2d53b96a18",
  "timestamp": "2025-05-15T02:22:25.152743"
}