{
  "id": 8651,
  "title": "Contraceptive Use and Abortion Among Women Of Reproductive Age in St. Petersburg, Russia",
  "abstract": "CONTEXT: Although the characteristics associated with contraceptive use among Russian women have been studied, no large-scale research has been conducted on women's use of different contraceptive methods and abortion. METHODS: A random sample of 1,147 women aged 18-44 completed questionnaires at local women's clinics in St. Petersburg in 2003-2004. Chi-square tests were used to examine differences in selected characteristics among age-groups, and logistic regression was used to assess associations between these characteristics and the use of contraceptive methods at last intercourse and abortion history. RESULTS: Among women at risk of unintended pregnancy, six in 10 had used reliable contraceptives (the pill, the IUD or condoms) at last intercourse; 42% had used condoms. Women in the middle income level were more likely than women with lower income to have used the pill (odds ratio, 2.1); cohabiting women and those who had had children had lowered odds of using condoms (0.6 and 0.3-0.5, respectively). More than half of those surveyed reported having had an abortion. Characteristics associated with increased odds of having had an abortion included being 25 or older (2.2-3.5), cohabiting (2.9), having high income (1.7), having experienced first intercourse before turning 18 (2.2) and having used no contraceptive method at first sex (1.5). The factor that was most strongly associated with abortion was a woman's number of births (4.9-5.7). CONCLUSIONS: Educational programs that promote the consistent use of condoms, especially among young women, and family planning programs that reduce financial barriers to contraceptive use, are critically needed in Russia.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4abf7e5b98a2b7d8e9d39a171cda9d54",
  "timestamp": "2025-05-15T03:20:55.986915"
}