{
  "id": 5109,
  "title": "Spillover Effect of the Interaction between Fintech and the Real Economy Based on Tail Risk Dependent Structure Analysis",
  "abstract": "Fintech innovation has greatly improved the operation efficiency of the financial industry and promoted the sustainable development of the real economy. On the other hand, fintech also brings the problem of risk spillover. Through a time series analysis, vector auto-regression with the Granger causality test is conducted to analyze the interaction between fintech and the real economy. To deal with the nonlinear relationship and overcome the high-dimensional-dependent structure faced by Copula, this paper establishes a GARCH-Vine-Copula model to study the tail risk and dynamic dependency between fintech and industries of the real economy in China, and then analyzes the risk spillover by calculating the CoVaR. The results show that there is a positive dynamic correlation between fintech and the real economy, and this increases when facing risk impact; fintech is located in the leading position of R-vine-dependent structure, and has a high correlation coefficient with the upper and lower tail of various industries. The results of CoVaR show that the extreme risk events in fintech and various industries have different degrees of negative impact on each other; the risk events in fintech have an extreme impact on industry in a short time.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ac10ce08f11b1d3b648cc45dc88d53b",
  "timestamp": "2025-05-15T02:44:11.110338"
}