{
  "id": 6943,
  "title": "Cost of poor adherence to anti-hypertensive therapy in five European countries",
  "abstract": "The financial burden for EU health systems associated with cardiovascular disease (CV) has been estimated to be nearly a,not sign110 billion in 2006, corresponding to 10 % of total healthcare expenditure across EU or a mean a,not sign223 annual cost per capita. The main purpose of this study is to estimate the costs related to hypertension and the economic impact of increasing adherence to anti-hypertensive therapy in five European countries (Italy, Germany, France, Spain and England). A probabilistic prevalence-based decision tree model was developed to estimate the direct costs of CV related to hypertension (CV defined as: stroke, heart attack, heart failure) in five European countries. Our model considered adherence to hypertension treatment as a main driver of blood pressure (BP) control (BP < 140/90 mmHg). Relative risk of CV, based on controlled or uncontrolled BP group, was estimated from the Framingham Heart Study and national review data. Prevalence and cost data were estimated from national literature reviews. A national payer (NP) perspective for 10 years was considered. Probabilistic sensitivity analysis was performed in order to evaluate uncertainty around the results (given as 95 % confidence intervals). The model estimated a total of 8.6 million (1.4 in Italy, 3.3 in Germany, 1.2 in Spain, 1.8 in France and 0.9 in England) CV events related to hypertension over the 10-year time horizon. Increasing the adherence rate to anti-hypertensive therapy to 70 % (baseline value is different for each country) would lead to 82,235 fewer CV events (24,058 in Italy, 7,870 in Germany, 18,870 in Spain, 24,855 in France and 6,553 in England). From the NP perspective, the direct cost associated with hypertension was estimated to be a,not sign51.3 billion (8.1 in Italy, 17.1 in Germany, 12.2 in Spain, 8.8 in France and 5.0 in England). Increasing adherence to anti-hypertensive therapy to 70 % would save a total of a,not sign332 million (CI 95 %: a,not sign319-346 million) from the NPs perspective. This study is the first attempt to estimate the economic impact of non-adherence amongst patients with diagnosed hypertension in Europe, using data from five European countries (Italy, France, Germany, Spain and England).",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ac9c3695b36deb571ecda8535e2fd5d",
  "timestamp": "2025-05-15T03:03:13.502639"
}