{
  "id": 3560,
  "title": "Risk-taking behavior, earnings quality, and bank performance: A profit frontier approach",
  "abstract": "After the financial crisis of 2007-2008, some bank performance dimensions have been the subject of debate, two of which are bank efficiency and bank risk-taking behavior. The literature on bank efficiency and productivity has grown considerably over the past three decades, and has gained momentum in the aftermath of the financial crisis. Interest in bank risk-taking behavior, usually focusing on its links to monetary policy, has been relatively low, but has also increased exponentially in more recent years. This article combines these two streams of research. Specifically, we test whether more inefficient banks take greater risks when selecting borrowers, charging interests, and requiring collateral, and whether these links between inefficiency and risk change according to the type of bank. Our analysis centers on the Spanish banking system, which has been severely affected by the burst of the housing bubble and has undergone substantial restructuring. To test our hypotheses, we created a database with information on banks and savings banks, their borrowers (non-financial firms), and the links between them. The study also contributes to the literature by considering a novel profit frontier approach. Our results suggest that more inefficient banks take greater risks in selecting their borrowers, and that this high-taking behavior is not offset by higher interest rates. JEL CLASSIFICATION C14; C61; G21; L50",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4acb196cb94493b09eee0d6deae41bed",
  "timestamp": "2025-05-15T02:27:19.142358"
}