{
  "id": 8017,
  "title": "Risk Factors for 90-day Readmissions With Fluid and Electrolyte Disorders Following Posterior Lumbar Fusion",
  "abstract": "Study Design. Retrospective cohort study of the 2012 to 2014 Healthcare Cost and Utilization Project Nationwide Readmissions Database. Objective. To identify risk factors for 30- and 90-day readmission due to fluid and electrolyte disorders following posterior lumbar fusion. Summary of Background Data. Thirty- and 90-day readmission rates are important quality and outcome measures for hospitals and physicians. These measures have been tied to financial penalties for abnormally high rates of readmission. Furthermore, complex and high cost surgeries have been increasingly reimbursed in the form of bundled disease resource group payments, where any treatment within 90-day postdischarge is covered within the original bundled payment scheme. Methods. A total of 65,121 patients in the Healthcare Cost and Utilization Project Nationwide Readmissions Database met our inclusion criteria, of which 1128 patients (1.7%) were readmitted within 30 days, and 1669 patients (2.6%) were readmitted within 90 days due to fluid and electrolyte abnormalities. A bivariate analysis was performed to compare baseline characteristics between patients readmitted with fluid and electrolyte disorders and the remainder of the cohort. A multivariate regression analysis was then performed to identify independent risk factors for readmission due to fluid and electrolyte disorders at 30 and 90 days. Results. The strongest independent predictors of 30-day readmissions were age >= 80 years, age 65 to 79 years, age 55 to 64 years, liver disease, and drug use disorder. The five strongest predictors of 90-day readmissions were age >= 80 years, age 65 to 79 years, age 55 to 64 years, liver disease, and fluid and electrolyte disorders. Conclusion. Patients with baseline liver disease, previously diagnosed fluid and electrolyte disorders, age older than 55 years, or drug use disorders are at higher risk for readmissions with fluid and electrolyte disorders following posterior lumbar fusion. Close monitoring of fluid and electrolyte balance in the perioperative period is essential to decrease complications and reduce unplanned readmissions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ad0c08eaa371f3b4fb0367e30799eaf",
  "timestamp": "2025-05-15T03:14:37.263253"
}