{
  "id": 1669,
  "title": "Across-time risk-aware strategies for outperforming a benchmark",
  "abstract": "We propose a novel objective function for constructing dynamic investment strategies with the goal of outperforming an investment benchmark at multiple points of evaluation during the investment time horizon. The proposed objective is intuitive, easy to parameterize, and directly targets a favorable tracking difference of the actively managed portfolio relative to the benchmark. Under stylized assumptions, we derive closed-form optimal investment strategies to guide the intuition in more realistic settings. In the case of discrete rebalancing with investment constraints, optimal strategies are obtained using a neural network-based numerical approach that does not rely on dynamic programming techniques. Compared to the targeting of a favorable tracking difference relative to the benchmark only at some fixed time horizon, our results show that the proposed objective offers a number of advantages: (i) The associated optimal strategies exhibit potentially more attractive asset allocation profiles, in that less extreme positions in individual assets are taken early in the investment time horizon, while achieving a similar terminal terminal wealth distribution. (ii) Across-time risk awareness leads to more robust performance and a higher probability of benchmark outperformance during the investment horizon in out-of-sample testing. The resulting strategies therefore exhibit desirable characteristics for active portfolio managers with periodic reporting requirements. (c) 2023 Elsevier B.V. All rights reserved.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ad563f8ec3f5eb6e6b6cea605f5063d",
  "timestamp": "2025-05-15T00:58:18.368112"
}