{
  "id": 353,
  "title": "Research on Enterprise Financial Customer Classification Method and Preference Based on Intelligent Algorithm",
  "abstract": "Compared with the past questionnaire survey, this paper applies the intelligent algorithm developed rapidly in recent years to identify the tendency of customers to buy financial products in the market. In addition, for the single state customer classification indicators based on the previous demographic information and action information, it is proposed to combine the action of market activities with demographic information; that is, the static integrated customer classification index is further combined with the improved neural network model to study the classification and preference of enterprise financial customers. Firstly, the enterprise financial customer classification model based on neural network algorithm is studied. Aiming at the shortcomings of easy falling into the local optimal solution of neural network algorithm, slow convergence speed of algorithm, and difficult setting of network structure, combined with the characteristics of genetic algorithm, the concept of adaptive genetic neural network algorithm is proposed. Then, the design of adaptive genetic neural network model is studied. Secondly, combined with the customer data of a financial enterprise and the characteristics of enterprise finance, this paper analyzes the risk influencing factors of enterprise financial customers, analyzes the customer data, evaluates the enterprise financial customers through the adaptive genetic neural network model, and realizes the classification of enterprise financial customers. Through an example, it is proved that the enterprise financial customer classification and preference model based on the adaptive genetic neural network algorithm discussed in this paper has better customer classification accuracy and can provide better method support for enterprise financial customer management.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ada9caecd563f588ba822bdb7eba5b0",
  "timestamp": "2025-05-15T01:49:41.095418"
}