{
  "id": 2751,
  "title": "Artificial Intelligence and Sustainable Development: Reducing Food Waste, Building Resilient Organisations, and Enhancing Public Financial Administration",
  "abstract": "This paper explores the transformative impact of Artificial Intelligence (Al) across three critical areas: food waste reduction, organisational resilience, and public financial administration. By utilising Al technologies like machine learning, predictive analytics, and real-tinte monitoring, the study highlights how Al can address inefficiencies, enhance systemic resilience, and support global sustainability goals, inchiding the United Nations SDGs. In food waste reduction, Al improves demand forecasting, inventory management, and supply chain optimisation, reducing surplus and spoilage. Examples like bakery demand forecasting and blockchain transparency demonstrate economic and environmental benefits. For organisational resilience. Al enables risk assessment and adaptive strategies, strengthening supply chains and helping organisations transition from reactive to proactive approaches during crises such as COVID-19. In public financial administration, Al streopilines process & iecy;& khcy;, detects frand, and enhances public trust through innovative platforms and predictive fiscal modelling, tax shown in case studies from Finland, Australia, and China. Despite its potential, Al adoption faces challenges, including costs, data integration, ethical concerns, and unequal access. Overcoming these requires robust policies, collaboration, and capacity building. This research emphasises Alx rola ax a catalyst for systemic change, advocating for ethical and inclusive adoption to advance sustainability, resilience, and equity in a complex world.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4adebe61d7fcc29f259465fd399e547f",
  "timestamp": "2025-05-15T02:18:37.210876"
}