{
  "id": 8680,
  "title": "Socioeconomic Vulnerability to Disaster Risk: A Case Study of Flood and Drought Impact in a Rural Sri Lankan Community",
  "abstract": "While climate change is a global phenomenon, its negative impacts are more severely felt in poor countries because of their high dependence on natural resources and limited coping capacity to climate variability and extremes. However, investigation of the relationship between poverty, climate variability and water-related disasters is complex. This article investigates the relationship between disaster risk, poverty, and the associated vulnerability of households and communities. The case study on which the article is based was carried out in Sri Lanka, a developing country prone to disasters. Data collected from household surveys conducted in North Central province, Sri Lanka, was examined with the use of cross tabulation and regression analysis techniques. Our study is novel because it considers floods and droughts together and compares their economic impact on socioeconomic groups at a local level. Our findings show that households depend heavily on natural resources for their livelihood, and that those with low income suffer greater losses from floods and droughts than households with high income. On the other hand flood impact is higher on households depend heavily on natural resources for their livelihood, and having lower income. The study uses survey data to examine the relationship between disaster frequency and localized poverty, an issue rarely considered in past literature. We show that low income households that depend fully on natural resources for their livelihood are exposed to more frequent disasters and most vulnerable to financial losses incurred through floods and droughts. To combat the effects of disasters, the Sri Lankan government might encourage members of poor households to seek at least some income from non-agricultural endeavors.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b181289e866e6b1b2a7e525de14342d",
  "timestamp": "2025-05-15T03:21:24.650925"
}