{
  "id": 1904,
  "title": "Knowledge graph driven credit risk assessment for micro, small and medium-sized enterprises",
  "abstract": "Micro, Small, and Medium-sized Enterprises (MSMEs) are essential for the growth and development of the country's economy, as they create jobs, generate income, and foster production and innovation. In recent years, credit risk assessment (CRA) has been an essential process used by financial institutions to evaluate the creditworthiness of MSMEs and determine the likelihood of default. Traditionally, CRA has relied on credit scores and financial statements, but with the advent of machine learning (ML) algorithms, lenders have a new tool at their disposal. By and large, ML algorithms are designed to classify borrowers based on their credit history and transactional data while leveraging the entity relationship involved in credit transactions. This study introduces an innovative knowledge graph-driven credit risk assessment model (RGCN-RF) based on the Relational Graph Convolutional Network (RGCN) and Random Forest (RF) algorithm. RGCN is employed to identify topological structures and relationships, which is currently nascent in traditional credit risk assessment methods. RF categorises MSMEs based on the enterprise embedding vector generated from RGCN. Extensive experimentation is conducted to assess model performance utilising the Indian MSMEs database. The balanced accuracy of 92% obtained using the RGCN-RF model demonstrates a considerable advancement over prior techniques in identifying risk-free enterprises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b1f4440b1ce307e2c8c1c479a37bd68",
  "timestamp": "2025-05-15T02:08:39.083244"
}