{
  "id": 6294,
  "title": "Executive compensation, risk and performance: evidence from the USA",
  "abstract": "PurposeGiven the serious question raised by the subprime of the 2008 global financial crisis over the rising practices of excessive rewarding of executives in the USA and European firms, the executive pay-performance nexus has emerged as a popular topic of debate in the contemporary corporate finance research. Conducted mostly on the Anglo-Saxon contexts, research outcomes have been inconclusive and dichotomous. Considering this backdrop, this study aims to investigate the endogenous relationship between executive compensation and risk taking in the context of the USA.Design/methodology/approachUsing a large sample of non-financial firms from 2010 to 2020 based on panel data and two-stage least square regression. In this study, the riskier corporate decision is measured as book leverage and ratio of R&D expense to total assets. Chief executive officers' (CEO) experience and age are used as instrumental variables, and these are expected to influence compensation incentives and, hence, affect firm riskiness indirectly. Firm size, return on assets and CEO turnover are reported to affect compensation and corporate decisions, therefore, included as control variables. Given that higher executive compensation is related to riskier corporate decision in firms, this study incorporates total wealth (i.e. accumulated equity related compensation) as an additional proxy of compensation, and this selection is justifiable by the perfect contracting notion of the agency theory.FindingsThe results of this study show a significant positive and increasing nexus among compensation and riskier corporate decisions. Besides, the compensation level proxied through the percentage of each form of compensation in total compensation is very important as greater equity and greater salary diminishes risk taking.Practical implicationsThe outcomes of this study have useful implications for firm stakeholders and policymakers.Originality/valueThe level of pay measured by the percentage of each type of compensation in total compensation is of utmost importance as it can increase or decrease risk taking in corporate decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b20eedceef1b8d131d2e564c8960fc4",
  "timestamp": "2025-05-15T02:56:37.502444"
}