{
  "id": 8972,
  "title": "The effect of technological overlap on acquisition premiums: moderating roles of target firm's technology clockspeed and industry munificence",
  "abstract": "PurposeDrawing on the literature on technological acquisition and the knowledge-based view , this study examines how technological overlap between acquiring and target firms influences acquisition premiums. We further explore how the resulting synergies are contingent on the dynamic characteristics of the target firm, specifically its technology clockspeed and industry munificence. Technology clockspeed indicates the pace of technological evolution, reflecting internal dynamic resources, while industry munificence represents the abundance of external resources. These boundary conditions illustrate the dynamics of synergies, explaining their moderation effects on acquisition premiums.Design/methodology/approachWe analyze a sample of 369 technological acquisitions by publicly traded U.S. firms between 1990 and 2011. To test our hypotheses, we used the ordinary least squares regression model with robust standard errors clustered by acquiring firms. In the robustness checks, we applied the generalized estimating equations to account for non-independent observations in our sample and verified that the results were robust to an alternative two-way clustering approach.FindingsWe suggest that a low level of technological overlap between an acquiring firm and its target firm leads the acquiring firm to offer a high acquisition premium because of the expected synergistic potential that evolves from combining two distant technological bases. We further find that this effect is contingent on the target firm's technology clockspeed and industry munificence. Specifically, the negative effect is amplified when target firms exhibit a rapid pace of technological evolution, whereas it is weakened when target firms operate in highly munificent industries characterized by robust growth and abundant resource flows.Research limitations/implicationsThis study has several limitations, but it offers opportunities for future research. First, our sample is limited to domestic acquisitions between U.S. publicly traded firms, which may restrict generalizability. Cross-border acquisitions could reveal different dynamics, as technology leakage and national security concerns might make technological overlap a more sensitive factor. Additionally, private firms were not included, and their distinct strategic considerations could provide further insights. Future research could explore post-acquisition data to validate these synergies and expand the scope to include international contexts and private firms for a comprehensive analysis.Practical implicationsOur findings highlight important implications for managers in technology sector acquisitions. This study underscores the need for a thorough evaluation of target firms to avoid misjudging synergies. Low technological overlap can heighten expectations for value creation, making it crucial for executives to accurately assess potential synergies to prevent overestimation. Managers should consider both internal resources and external industry conditions when evaluating synergies. Ultimately, these insights help managers offer informed prices that reflect true strategic synergies, adopting effective valuation practices to mitigate risks of financial overpayments and poor post-merger performance.Social implicationsThe social implications of our findings emphasize the broader impact of acquisition decisions on innovation and competition within the technology sector. By ensuring accurate valuation and avoiding overpayment, companies can allocate resources more efficiently, fostering sustainable growth and innovation. This diligent approach can reduce the risk of corporate failures.Originality/valueThis study makes two key theoretical contributions. First, it identifies technological overlap as a critical determinant of acquisition premiums in technological acquisitions, addressing gaps in the literature that focused on CEO characteristics and managerial attention. Second, it expands the theoretical framework by highlighting the dynamic nature of synergies, influenced by the target firm's technology clockspeed and industry munificence. By integrating both acquiring and target firm characteristics, this study provides a relational perspective on value creation, explaining why firms pay high premiums and offering a more comprehensive understanding of the strategic motivations in technological acquisitions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b29546613898d4bbdce9fea336ca381",
  "timestamp": "2025-05-15T03:24:26.265821"
}