{
  "id": 7866,
  "title": "Determinants of Health Insurance Coverage among People Aged 45 and over in China: Who Buys Public, Private and Multiple Insurance",
  "abstract": "Background China is reforming and restructuring its health insurance system to achieve the goal of universal coverage. This study aims to understand the determinants of public, private and multiple insurance coverage among people of retirement-age in China. Methods We used data from the China Health and Retirement Longitudinal Survey 2011 and 2013, a nationally representative survey of Chinese people aged 45 and over. Multinomial logit regression was performed to identify the determinants of public, private and multiple health insurance coverage. We also conducted logit regression to examine the association between public insurance coverage and demand for private insurance. Results In 2013, 94.5% of this population had at least one type of public insurance, and 12.2% purchased private insurance. In general, we found that rural residents were less likely to be uninsured (Relative Risk Ratio (RRR) = 0.40, 95% Confidence Interval (CI): 0.34-0.47) and were less likely to buy private insurance (RRR = 0.22, 95% CI: 0.16-0.31). But rural-tourban migrants were more likely to be uninsured (RRR = 1.39, 95% CI: 1.24-1.57). Public health insurance coverage may crowd out private insurance market (Odds Ratio = 0.55, 95% CI: 0.48-0.63), particularly among enrollees of Urban Resident Basic Medical Insurance. There exists a huge socioeconomic disparity in both public and private insurance coverage. Conclusion The migrants, the poor and the vulnerable remained in the edge of the system. The growing private insurance market did not provide sufficient financial protection and did not cover the people with the greatest need. To achieve universal coverage and reduce socioeconomic disparity, China should integrate the urban and rural public insurance schemes across regions and remove the barriers for the middle-income and low-income to access private insurance.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b2d490880244cff7fb37475850162bd",
  "timestamp": "2025-05-15T03:13:04.862360"
}