{
  "id": 2368,
  "title": "Does FinTech drive asymmetric risk spillover in the traditional finance?",
  "abstract": "The rapid development of fintech has caused a great impact on traditional financial industries. It improves the quality of financial services but also buries potential risks at the same time. This paper takes China's FinTech and traditional financial industry as the research objects based on the daily yield data from 2019 to 2022. First, we measure the systemic risk index.CoVaR (Conditional Value at Risk) of the FinTech industry and traditional financial industries after effectively fitting the marginal distribution of industry return data. Second, we decompose the systemic risk sequences of FinTech and traditional financial industries to obtain the data at different frequencies with the combination of the frequency decomposition method. Finally, we use the quantile-on-quantile regression model to analyze the risk spillover effect of the FinTech industry driving traditional financial industries in different frequencies under different risk states. The article draws the following conclusion: first, in general, the peak of the positive risk spillover impact of FinTech on the traditional industries is mainly concentrated in the high quantile of FinTech, while the peak of the negative impact is mainly concentrated in the low quantile of FinTech. Second, the risk spillover impact direction of FinTech on the five traditional financial industries mainly changes from negative to positive under high trading frequency and low trading frequency, and takes a U-shape in medium trading frequency.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b31683f1bb4acf98f1eaa145296e4d2",
  "timestamp": "2025-05-15T02:14:50.266704"
}