{
  "id": 7850,
  "title": "Determinants of Sustainable Profitability of the Serbian Insurance Industry: Panel Data Investigation",
  "abstract": "This paper aims to investigate the main drivers of sustainable profitability trends in the Serbian insurance industry over the years 2008-2019 (inclusive). Our study is motivated by the fact that insurance companies contribute to economic growth, and thus it is essential to understand the factors that contribute to their financial strength and stability. We use a set of standard panel regression models, including the mixed-effects model, followed by a more robust GMM estimation to uncover the linkage between selected micro-specific, macroeconomic, and institutional factors, and return of assets (ROA) and return on total premiums (ROTP). The present paper constitutes a significant contribution to the existing literature on the account of its comprehensiveness both in terms of the institutional datasets that we use, and in terms of the methodologies we apply (in particular, mixed effects and the generalized method of moments (GMM)). The estimated parameters are model-specific, and we find that firm size, GDP, the population growth rates, political stability, and the degree of specialization (in some empirical models) all lead to higher profitability. On the other hand, we observe that excessive risk-taking and inflation (in some specifications) are inversely related to profitability. Finally, we note that regulatory quality, average wage, and life expectancies are found to be not statistically significant. Accordingly, we argue that a profitability-centric managerial strategy should be based on expanded market share and stringent risk management protocols. At the macro level, we conclude that pro-growth and pro-population policies, combined with a well-oiled institutional setting that ensures political stability, constitute the best possible prescription for strong operational performance and profit sustainability in the Serbian insurance industry.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b331edf309e258a65c3d5aecde8677b",
  "timestamp": "2025-05-15T03:12:36.537545"
}