{
  "id": 3265,
  "title": "Capital Structure, Financial Performance, and Sustainability of Micro-Finance Institutions (MFIs) in Bangladesh",
  "abstract": "Capital structure plays an important role in organizational performance. Sources of funds for micro-finance institutions (MFIs) and their performance and financial sustainability become an important topic for the MFIs and poverty alleviation initiatives to achieve sustainable development goals of the UN. We explored the following question: Does the financial structure in terms of financial leverage affect the financial performance: Financial sustainability, depth, and breadth of outreach of MFIs? Our research focuses on studying the relationship between capital structure and financial performance of micro-finance institutions as well as achieving the objectives of this program by reaching out to the deserving clients without collaterals. A dataset of 187 MFIs is used to establish the relationship between the capital structure and performance of MFIs. Panel data regression analysis has been used for this study using the Random effect and Fixed effect models. Return on Asset (ROA), and Net Income to Expenditure (NIER) have been used as measures of financial performance. The findings indicate that Equity to Asset Ratio (EAR), Debt to Loan Ratio (DTL), Risk, and Size are the factors that influence NIER. Furthermore, EAR, and DTL have a positive effect on ROA, and Risk has a negative effect. The findings of this study will enable MFIs to configure their capital structure by creating a portfolio of sources of their capital from market-based sources of funds that can maximize their financial performance and reach out to poor clients without collaterals.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b3b2c85978150e68e47e39ca6c223e0",
  "timestamp": "2025-05-15T02:24:39.563679"
}