{
  "id": 2867,
  "title": "Moving Toward Sustainable Finance: Leveraging Environment, Social and Governance (ESG) Performance and Risk Management to Drive Corporate Financing Efficiency",
  "abstract": "The growing demand for companies to adopt environmentally sustainable and ethical practices has led to a greater focus on the organization's environmental, social, and governance accomsplishments. This study aims to investigate the relationship between environmental social and governance (ESG) and corporate financial risk (CFR) on corporate finance efficiency (CFE) in China, using a dataset of 400 Chinese firms registered on the Shanghai and Shenzhen A-share exchanges between 2013 and 2022, the analysis uses a data envelopment analysis (DEA) model with entity-fixed effects regression and a robustness test. The findings show a positive relationship between ESG and corporate finance efficiency, implying that promoting ESG practices can boost corporate financing efficiency. However, the study also found the negative effect of high financial risk on corporate financing efficiency. These findings have significant implications for businesses, investors, and policymakers. Businesses can enhance their long-term financial performance by giving ESG practices top priority and controlling financial risks. Policymakers can utilize these findings to encourage businesses to enhance their ESG practices and risk management to increase overall financing efficiency.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b3b66b2250473f4dc829bde5c353349",
  "timestamp": "2025-05-15T02:20:16.801719"
}