{
  "id": 4242,
  "title": "The nexus of economic growth, priority sector lending and non-performing assets: case of Indian banking sector",
  "abstract": "PurposeIn recent years, the Indian banking sector is facing a major cause of concern in the form of Nonperforming Assets (NPA), and the priority sector lending (PSL) is generally recognized as the major factor contributing to it. Thus, the present study has been carried out with the objective of examining the relationship between priority sector lending and GDP growth. Thereafter, the role of PSL and certain other bank-specific, industry-specific and macroeconomic variables in determining NPA has been studied.Design/methodology/approachTaking a sample of 45 scheduled commercial banks, the study has been carried out for 14 years (2004-2018). Granger causality between PSL and GDP has been examined by applying the Dumitrescu-Hurlin test. For the purpose of investigating the impact of PSL and other determinants on NPA, both static and dynamic panel regression have been performed. Under the dynamic panel, system generalized methods of moments (S-GMM) approach has been followed.FindingsThe findings show that there exists a positive correlation and bidirectional causal relationship between PSL and GDP, which implies that PSL brings additional growth for the whole economy. In addition to it, PSL is found to be insignificant for the NPA ratio, and thus, it can be inferred that credit extended to government-specified sectors does not bring any major increase in the bad loan portfolio of banks.Practical implicationsThe policymakers and bank management can take a cue from the findings of this study to decrease the exposure to loan nonrepayment issue. The priority sectors are in need of formal credit for their growth, and since the rising population of the country can find employment in these sectors, banks should meet their credit needs while securing their position with regard to the NPA problem.Originality/valueThe issue of NPA determinants, and in particular, the contribution of priority sector lending in it has not been much explored for Indian banking sector. Also, the present study adds to the literature by using the causality approach for examining the importance of directed credit schemes for economic growth.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b44800da56adfc84779a42400a49b32",
  "timestamp": "2025-05-15T01:25:23.216476"
}