{
  "id": 8881,
  "title": "Characteristics of non-drinking and drinking adults in Taiwan and their implications in alcohol epidemiological studies",
  "abstract": "Background Confounding is a major threat to causal inferences regarding alcohol and health. One proposed causal inference approach was to compare the associations obtained from cohorts in different countries, where we know the confounding structures are different. To explore the confounding structure related to alcohol and health in Taiwan, we compared differences in the characteristics of drinkers and non-drinkers, using data from the Nutrition and Health Survey in Taiwan (2013-2016).Methods The cross-sectional survey data were collected nationwide and were representative of residents in Taiwan, which included 2,846 men and 2,833 women ages 19 years and older. We used information regarding alcohol drinking and covariates of sociodemographic and health behavior variables. We performed sex-stratified multinomial logistic regression to assess the associations between each independent variable and alcohol drinking (non-drinkers, occasional drinkers, and moderate drinkers).Results Among men, 31% were non-drinkers, 7% former drinkers, 43% occasional drinkers, 13% moderate drinkers, and 5% heavy drinkers. Among women, 62% were non-drinkers, 1% former drinkers, 32% occasional drinkers, 4% moderate drinkers, and 1% heavy drinkers. In both men and women, occasional drinkers had higher educational levels and fewer family financial problems, but had more smoking and betel nut chewing behaviors than non-drinkers, after we adjusted for age. Moderate drinkers had even more smoking and betel nut chewing behaviors. Male moderate drinkers also reported more comorbidities than non-drinkers.Conclusions We observed that occasional drinkers had a better socioeconomic position than non-drinkers; moderate drinkers seemed to have a worse risk profile than non-drinkers. These confounding patterns were different from that in Western countries and may thereby help us make causal inferences regarding alcohol and health.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b53ccfb9d44c1d22db39ecccc9041d7",
  "timestamp": "2025-05-15T03:23:27.800417"
}