{
  "id": 7027,
  "title": "Additional medical costs of chronic conditions among adolescent and young adult cancer survivors",
  "abstract": "Purpose Adolescent and young adult (AYA) cancer survivors are more likely to have multiple chronic conditions compared to AYAs without history of cancer. The financial hardship of chronic conditions associated with cancer can substantially impact cancer survivors. We aim to assess health risk behaviors and health care access factors associated with increased medical expenses in AYA cancer survivors. Methods We utilized 2011-2016 Medical Expenditure Panel Survey (MEPS) data to identify the prevalence of chronic conditions, health risk behaviors, and health care access in 2326 AYA cancer survivors. The association between health risk behaviors, health care access factors, and chronic conditions with medical expenditures was assessed using multivariable regression with gamma distribution and log link. Analyses were adjusted for age, sex, race/ethnicity, education, and marital status. Expenses were adjusted for inflation to 2016 dollars. Results Most AYA cancer survivors had >= 1 chronic condition (74%) and were diagnosed with cancer >= 10 years prior to the survey (76%). AYA cancer survivors with chronic conditions spent an additional $2777 (95% CI, $480 to $5958) annually compared to survivors with no chronic conditions. Additional annual expenses also were associated with physical inactivity ($3558; 95% CI, $2200 to $4606) and being unable to get care when needed ($1291; 95% CI, $198 to 3335). Conclusions Chronic conditions are associated with a substantial increase in medical expenses well after cancer diagnosis in AYA cancer survivors. Implication for Cancer Survivors Getting care when needed and adopting healthy behaviors, particularly exercise, may reduce medical expenses associated with chronic conditions in AYAs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b596a6b2534af10421c4ab6679c1a12",
  "timestamp": "2025-05-15T03:04:22.996465"
}