{
  "id": 3947,
  "title": "Corporate Engagement with the Science Based Targets Initiative: Financial Implications and Key Motivators",
  "abstract": "Objective: This study focuses on the Science Based Targets Initiative (SBTi), a voluntary framework that enables companies to set emission reduction targets based on science and aligned with the Paris Agreement to combat climate change in a credible and effective way. The research aims to examine the impact of companies' participation in the SBTi on their stock performance, volatility, and financial risk. It also seeks to identify the key factors that motivate firms to participate in the SBTi. Methodology: The study collects and processes extensive data from SBTi and Refinitiv, utilizing statistical methods such as Difference-in-Differences (DiD) regression analysis and Probit models. It analyses financial variables, carbon emissions, as well as sector and geographic information of more than 4,000 companies, using panel data from 2015 to 2022. Results: The study finds a negative impact of SBTi on stock returns, while volatility and financial risk show no significant changes. Factors such as lower returns, reduced stock price fluctuation, and higher financial risk increase the likelihood of companies joining SBTi. Limitations: The study acknowledges certain limitations, including the focus on investor reactions to short-term targets and commitments. As more data become available, future research could explore a broader time horizon. Additionally, the study did not assess whether companies are meeting their targets. Lastly, a comparative analysis between companies from different regions and industries was not conducted, but is recommended for future research. Practical implications: The SBTi provides companies with flexibility in achieving their targets, which does not guarantee ambitious measures against climate change. Potential greenwashing practices may undermine investor confidence in the initiative's standards. Firms must set realistic and challenging goals. Therefore, transparency and the integration of environmental commitments into business management are crucial for improving corporate perception and attracting capital, even though the financial benefits of these actions may not be immediate.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b5f04ca58715e8738e047953492c7a4",
  "timestamp": "2025-05-15T02:31:28.449017"
}