{
  "id": 3582,
  "title": "Health Disparities Grants Funded by National Institute on Aging: Trends Between 2000 and 2010",
  "abstract": "Purpose of the Study: The present study examined the characteristics of health disparities grants funded by National Institute on Aging (NIA) from 2000 to 2010. Objectives were (a) to examine longitudinal trends in health disparities-related grants funded by NIA and (b) to identify moderators of these trends. Design and Methods: Our primary data source was the National Institutes of Health Research Portfolio Online Reporting Tools Expenditures and Results (RePORTER) system. The RePORTER data were merged with data from the Carnegie Classification of Institutions of Higher Education. General linear models were used to examine the longitudinal trends and how these trends were associated with type of grant and institutional characteristics. Results: NIA funded 825 grants on health disparities between 2000 and 2010, expending approximately 330 million dollars. There was an overall linear increase over time in both the total number of grants and amount of funding, with an outlying spike during 2009. These trends were significantly influenced by several moderators including funding mechanism and type of institution. Implications: The findings highlight NIA's current efforts to fund health disparities grants to reduce disparities among older adults. Gerontology researchers may find this information very useful for their future grant submissions.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b6e4ce90da9c104fdc4952fa7a2e17e",
  "timestamp": "2025-05-15T01:18:20.613647"
}