{
  "id": 3601,
  "title": "A procurement-based classification of pharmaceutical supplies for diabetes disease management",
  "abstract": "Background and Aims Diabetes is among the most prevalent noncommunicable chronic diseases globally and carries a substantial expense in worldwide health care. Pharmaceutical supplies related to diabetes management account for 20%-40% of the disease's management cos, and this percentage continues to increase. This study examines the pharmaceutical expenses associated with one of the most common chronic diseases: diabetes. Specifically, we measure the extent to which patient health and demographic factors drive the annual cost of pharmaceutical supplies for diabetes management. Second, the study applied a procurement-centric classification scheme to pharmaceutical items involved in diabetes treatment. Methods Data on 98,648 pharmaceutical-dispensing transactions (related to 2828 patients) over 1 year were collected from a specialized diabetes health center. Pharmaceutical prices from the sample were compared internationally to ensure that the findings apply to other countries. The association between the item cost and the number of unique patients prescribed pharmaceutical products was estimated at the category and subcategory levels. Results Approximately 80% of total pharmaceutical expenditures were attributed to 20% of patients. Two of 20 pharmaceutical categories-anti-diabetes drugs and insulin-accounted for 34% of products dispensed and 57% of total pharmaceutical expenditures. Age, body mass index, and diabetes type were essential factors in predicting supply cost per patient. Conclusion Applying the portfolio purchasing model also suggested that some clinically similar items, like insulin types, are best procured through divergent procurement strategies or vendors for optimal cost efficiency. A better understanding of the diverse array of diabetes supplies can reveal opportunities for better strategic supply management. This supply classification approach can also be applied in other supply-intensive specialties, such as orthopedics.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b884da78c83a30f4ea4bc66da36fe9b",
  "timestamp": "2025-05-15T01:19:00.637342"
}