{
  "id": 3797,
  "title": "Financial toxicity in lung cancer: an assessment of magnitude, perception, and impact on quality of life",
  "abstract": "Background: Advances in lung cancer therapy have resulted in improved clinical outcomes. Unfortunately, advances can come at a financial cost to patients and their families that poses a significant risk to overall quality of life (QoL). Financial distress has been shown to be associated with increased symptom burden and decreased treatment compliance but the magnitude of financial distress is not well characterized in lung cancer populations. Patients and methods: Patients with stage II-IV newly diagnosed lung cancer and starting first-line therapy were recruited at a tertiary academic institution between July 2018 and April 2019. The comprehensive score for financial toxicity (COST) was used to assess financial toxicity and the Functional Assessment of Cancer Therapy-Lung (FACT-L) was used to assess QoL. Associations between financial toxicity and baseline variables were assessed using multivariable linear regression and correlations were assessed using the Pearson correlation. Results: In this study, 143 consecutive patients were approached and 91.6% agreed to participate (N = 131). The median age was 65 years (35-90); 52.7% were male (n = 69), and 75.6% were white (n = 99). The inability to afford basic necessities and having <1 month of savings was associated with increased financial toxicity (P < 0.001) after adjusting for other factors such as age, race, insurance, and income. There was also a trend toward increased financial toxicity among those who were employed but on sick leave (P = 0.06). Increased financial toxicity was correlated with a decrease in QoL (correlation coefficient 0.41, P < 0.001). Patients' anticipated out-of-pocket (OOP) expenses for the upcoming 6 months ranged from $0 to $50 000 (median $2150). However, there was no correlation between anticipated OOP expenses and either financial toxicity or QoL. Conclusions: These data identify key factors for identifying at-risk patients and builds a framework for exploring the benefit of financial counseling interventions, which may improve QoL and oncologic outcomes.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b88e7ad02b089e77074b8db800312b6",
  "timestamp": "2025-05-15T02:29:59.214603"
}