{
  "id": 8163,
  "title": "Quantifying Total and Out-of-Pocket Costs Associated With Head and Neck Cancer Survivorship",
  "abstract": "IMPORTANCE Oncologic treatment is costly to the health care system and to individuals, but patients with head and neck cancer (HNC) also have long-term care needs after treatment. Survivors of HNC require specific consideration given their rapidly growing numbers. This subpopulation of cancer survivors often experiences long-term treatment-associated morbidity. OBJECTIVE To describe the total and out-of-pocket (OOP) costs associated with HNC survivorship and the risk factors for financial toxicity among this population. DESIGN, SETTING, AND PARTICIPANTS This was a retrospective review and economic evaluation of a cohort of US adults with a diagnosis of HNC from 2006 to 2018. The study used data the from IBM MarketScan Commercial Claims Database. Data were analyzed from November 2020 to June 2022. EXPOSURES Treatment for HNC. MAIN OUTCOMES AND MEASURES Total and OOP medical costs were assessed monthly and reported relative to the date of HNC diagnosis. The primary outcome was the difference between a patient's mean monthly survivorship costs (13-60 months after diagnosis) and mean monthly baseline costs (7-12 months before diagnosis). Univariate and multivariable linear regression models were created for total and OOP costs to generate coefficient estimates with 95% CIs. RESULTS The study cohort of this economic evaluation included 19 098 patients with HNC (median [range] age, 56 [18-64] years; 14 144 [74.1%] men and 4954 [25.9%] women; race and ethnicity were not considered). Throughout the survivorship period, median total and OOP costs were $372 per month and $31 per month higher than baseline costs, respectively, with variation in expenses by demographic information, health plan type, and oncologic variables. In the multivariable model, greater total and OOP excess survivorship costs were associated with female sex ($343/mo; 95% CI, $126 to $560 and $9/mo; 95% CI, $4 to $14). Highest and lowest total excess survivorship costs associated with cancer site were seen for hypopharyngeal ($1908/mo; 95% CI, $1102 to $2714) and oropharyngeal cancers (-$703/mo; 95% CI, -$967 to -$439) vs oral cavity cancers. Compared with surgery or radiation therapy alone, multimodal treatment was generally associated with excess OOP survivorship costs. CONCLUSIONS AND RELEVANCE The findings of this retrospective economic evaluation review suggest that the costs of HNC survivorship remain persistently elevated above baseline costs for at least 5 years after diagnosis. High survivorship costs were associated with female sex, hypopharyngeal tumors, and treatment with multimodal therapy. Practitioners should seek to minimize costs for these patients at higher-risk of financial toxicity after treatment and work to provide directed supportive services.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4b9b955bb3893ba1f47dc3dccd74fd37",
  "timestamp": "2025-05-15T03:16:17.248799"
}