{
  "id": 950,
  "title": "Efficacy in Galleria mellonella Larvae and Application Potential Assessment of a New Bacteriophage BUCT700 Extensively Lyse Stenotrophomonas maltophilia",
  "abstract": "In recent years, Stenotrophomonas maltophilia (S. maltophilia) has become an important pathogen of clinically acquired infections accompanied by high pathogenicity and high mortality. Moreover, infections caused by multidrug-resistant S. maltophilia have emerged as a serious challenge in clinical practice. Bacteriophages are considered a promising alternative for the treatment of S. maltophilia infections due to their unique antibacterial mechanism and superior bactericidal ability compared with traditional antibiotic agents. Here, we reported a new phage BUCT700 that has a double-stranded DNA genome of 43,214 bp with 70% GC content. A total of 55 ORFs and no virulence or antimicrobial resistance genes were annotated in the genome of phage BUCT700. Phage BUCT700 has a broad host range (28/43) and can lyse multiple ST types of clinical S. maltophilia (21/33). Furthermore, bacteriophage BUCT700 used the Type IV fimbrial biogenesis protein PilX as an adsorption receptor. In the stability test, phage BUCT700 showed excellent thermal stability (4 to 60 degrees C) and pH tolerance (pH = 4 to 12). Moreover, phage BUCT700 was able to maintain a high titer during long-term storage. The adsorption curve and one-step growth curve showed that phage BUCT700 could rapidly adsorb to the surface of S. maltophilia and produce a significant number of phage virions. In vivo, BUCT700 significantly increased the survival rate of S. maltophilia-infected Galleria mellonella (G. mellonella) larvae from 0% to 100% within 72 h, especially in the prophylactic model. In conclusion, these findings indicate that phage BUCT700 has promising potential for clinical application either as a prophylactic or therapeutic agent.IMPORTANCE The risk of Stenotrophomonas maltophilia infections mediated by the medical devices is exacerbated with an increase in the number of ICU patients during the Corona Virus Disease 2019 (COVID-19) epidemic. Complications caused by S. maltophilia infections could complicate the state of an illness, greatly extending the length of hospitalization and increasing the financial burden. Phage therapy might be a potential and promising alternative for clinical treatment of multidrug-resistant bacterial infections. Here, we investigated the protective effects of phage BUCT700 as prophylactic and therapeutic agents in Galleria mellonella models of infection, respectively. This study demonstrates that phage therapy can provide protection in targeting S. maltophilia-related infection, especially as prophylaxis. The risk of Stenotrophomonas maltophilia infections mediated by the medical devices is exacerbated with an increase in the number of ICU patients during the Corona Virus Disease 2019 (COVID-19) epidemic. Complications caused by S. maltophilia infections could complicate the state of an illness, greatly extending the length of hospitalization and increasing the financial burden.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ba31291af045bbb391aab6b79ac6153",
  "timestamp": "2025-05-15T01:44:35.518466"
}