{
  "id": 2961,
  "title": "Health shock, medical insurance and financial asset allocation: evidence from CHFS in China",
  "abstract": "Background As health care cost is taking an increasingly substantial proportion of national wealth, health shocks and the subsequent medical expenditures have become increasingly vital contributions to financial risks. However, the individual or combined effects of social and financial medical insurance on household financial behaviors are poorly understood. This research aims to examine the effect of health shocks on financial asset mobility and portfolio allocation of the household. Also, whether medical insurance positively affects the financial market will be analyzed. Methods Linear-regression models are used to determine the relationship between health shock, medical insurance, and household financial behaviors, including liquidity measures and financial portfolio (risk and risk-free assets). Two types of variables (transition probability and upward mobility) are constructed to measure the aggregate-level financial asset mobility. The portfolio of financial assets is categorized according to the risk it bears. Results Households which experience health shocks are found to exhibit lower transition probability and upward mobility of financial assets than households that do not, and health shocks pose a more serious threat to low-income households. From the inter-temporal perspective, households that have medical insurance exhibit a higher probability of raising their position within the national financial asset distribution, and are more inclined to invest in the risky financial assets. Commercial insurance displays a larger marginal effect on financial asset allocation than social insurance. Our study results highlight an essential link between health shocks, medical insurance, and household financial behavior. Conclusion This work identified and described the relationship between health-related factors (health shock and two types of medical insurance) and household financial behaviors (risky investment involvement and class mobility in financial asset). A strong link exists between the health and financial market, with heterogenous effects between urban and rural groups, households with distinct income levels, etc. A multilayered insurance system would be helpful to facilitate household income, financial consumption, and economic growth.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ba33d16a69b5608a427dc43a58ab405",
  "timestamp": "2025-05-15T02:20:48.300098"
}