{
  "id": 6721,
  "title": "Clostridium difficile Colitis Following Revision Total Knee Arthroplasty: Incidence and Risk Factors",
  "abstract": "Background: Clostridium difficile-associated diarrhea (CDAD) is associated with adverse events and financial liability. As institutions continue to adopt CDAD rates as a quality control metric, it is important to identify patients at risk before surgery, including revision total knee arthroplasty (rTKA). This study was conducted to (1) determine the incidence of CDAD within 30 days of rTKA and (2) identify perioperative risk factors for CDAD following rTKA. Methods: The American College of Surgeons National Surgical Quality Improvement Program was queried to identify 6023 rTKA procedures from 2015-2016. Preoperative and perioperative variables, including patient demographics, lab values, comorbidities, operative time, procedure type, presence of postoperative infections, and rates of CDAD were collected. Chi-square and Fisher's exact tests were used to detect differences between categorical variables, and t-tests were used to compare continuous variables. A stepwise logistic regression model was used to identify the risk factors for CDAD. Results: The rate of CDAD within 30 days of rTKA was found to be 0.4% (24/6024). The CDAD rate following aseptic revision was 0.2% (12/4893), while the incidence of CDAD after septic revision was 1.1% (12/1130). Preoperative functional dependence (odds ratio [OR] = 5.14; P = .002), septic revision (OR = 2.77; P = .026), and cancer (OR = 14.26; P = .016) were statistically significant independent risk factors for CDAD after rTKA. Conclusion: The incidence of CDAD after rTKA is approximately 0.4% in the United States. Independent risk factors for CDAD include septic revision, preoperative functional dependence, and cancer. Prevention of CDAD in these higher risk patients must be considered before surgery and antibiotic selection for other infections should be managed judiciously. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bb8f1845dcd002fbcfc1a9e48bf1d8d",
  "timestamp": "2025-05-15T03:01:03.531652"
}