{
  "id": 4712,
  "title": "How do foreign direct investors group by their investments in Turkey and Germany?",
  "abstract": "Purpose - The purpose of this paper is to classify the source countries of inward foreign direct investments (FDIs) to Turkey and to Germany as individual samples of developing and developed economies, to produce practical information to target company managers and owners that they can use for having much more investments or getting more bargaining power with the existing or potential investors. Design/methodology/approach - Cluster analysis methodology with Ward's (1963) technique is used to create significant groups out of FDI source countries. Findings - The results show that foreign direct investors - labeled by their country of origin investing in Turkey are grouped into two main clusters. First main cluster of Turkey has three sub-clusters. Investors investing in Germany are also grouped into two main clusters. First main cluster of Germany has two sub-clusters. Of all seven clustering criteria, four of them were prominent in grouping, which are: having a high equity ownership in the investment, investing in companies with high market capitalization, investing in companies with high/low financial risk and high/low financial performance, and investing in young companies. Furthermore, investors from same origin behave differently in Turkey and Germany. They adjust their attitude toward risk when the host country changes. Lastly, source countries in the sample that have a minimum distance in between, are the ones sharing similar cultural values. Research limitations/implications - The limitations of the study are the small number of observation with complete and standard company data needed, especially in Turkey, and the compelled shortness of time period for the empirical analysis. Some suggestions were offered for future researches to contribute to the topic by using bigger samples; by making variations in country, time, or industry; by relating country factors to social/entrepreneurial factors; and by supporting the research with qualitative techniques. Originality/value - This paper constitutes a contribution to the empirical field research in Turkey, an emerging country with very limited firm-level financial and ownership data, compared to Germany, a developed country with relatively more data availability.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bc0d5594a5da466f5fc69e79a30a504",
  "timestamp": "2025-05-15T02:39:57.632419"
}