{
  "id": 3024,
  "title": "Boardroom diversity (task- and relation-oriented diversity) and financial stability: evidence from Chinese financial listed firms",
  "abstract": "PurposeThis study aims to examine the impact of boardroom diversity on the financial stability of Chinese financial listed firms. Boardroom diversity is quantified in the following aspects: relation-oriented diversity and task-oriented diversity.Design/methodology/approachPanel data on Chinese financial listed firms between 1998 and 2017 are used in this study. Panel regression is used to analyze the firm data for fixed effects and robust standard errors.FindingsTask-oriented diversity of the board increases financial stability. Regarding the impact of boardroom diversity on firm risk, the results reveal that task-oriented diversity of the board reduces firm risk, which supports the predictions of this research. Regarding the moderating effect of state ownership on the relationship between boardroom diversity (task- and relation-oriented diversity) and financial stability, the results show that state ownership enhances the positive impact of the board's task-oriented diversity on financial stability.Practical implicationsTask-oriented diversity of the board enhances the financial stability of Chinese financial listed firms. As existing studies on bank boards in China are limited, the findings of this research can be used when crafting policy initiatives to enhance financial stability.Originality/valueTo the best of the authors' knowledge, this study is the first to examine the effect of boardroom diversity, particularly task- and relation-oriented diversity, on financial stability. It provides empirical support that boardroom diversity positively affects the financial stability of Chinese financial listed firms. This research also offers empirical evidence that state ownership enhances the positive impact of the board's task-oriented diversity on financial stability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bc4e35cc472c8647699caa3783b8a95",
  "timestamp": "2025-05-15T02:21:52.168921"
}