{
  "id": 8584,
  "title": "Global logistics management curriculum: perspective from practitioners in Taiwan",
  "abstract": "Purpose - This study attempts to list and rank the necessary skills required of a global logistics professional based on objective evaluations from industry. Design/methodology/approach - This paper adopts a novel mixed-methods approach using elements of concept mapping (brainstorming, multidimensional scaling, cluster analysis), and link analysis. Concept mapping through repeated brainstorming by industry practitioners helps to summarize the key skill required of an effective global logistician. The multidimensional scaling method and cluster analysis support the classification and weighting of the capabilities into nine clusters. Link analysis helps to evaluate the significance of the results and addresses the gap between industry and academic perceptions of the existing global logistics curriculum in Taiwan. Findings - In dealing with globalization, a logistician needs to be able to integrate, communicate, and analyze from an international perspective, perform financial analysis, maintain good industry and customer relations, exhibit strong people skills, stay healthy, and understand laws and regulations. Significant differences exist between industry practitioners and educators. The former believe that cross-functional marketing skills are critical and emphasize the importance of risk and financial management. In contrast, logistics educators consider the traditional logistics management skills, such as demand forecasting, sourcing, planning, and system integration, as key priorities. Research limitations/implications - There is room for research and theory on how to narrow the mismatch between the current logistics curricula in academia and practical requirements. Different pedagogical strategies and techniques can be further investigated to orchestrate an effective and balanced global logistics management course. One research limitation arises from the sample which is confined to Taiwan. Thus, the authors' findings may be constrained by local and cultural influences. Future research could extend to a large-scale multi-country data collection and analysis to reduce the possibility of cultural and context bias. Practical implications - Arming students with such important but diverse global logistics skills presents a challenge for logistics educators who need to find the right balance between breadth and depth of the modules. Educators and practitioners need to work closely together to co-design and adapt the logistics curricula for a rapidly changing global environment. This will help to shorten the last stage from the classroom to the workplace by keeping abreast of the changes in industry and produce relevant logisticians without compromising on rigour. Originality/value - The results provide a reference for educators keen on blending logistics education course design with practitioner inputs, to better develop global logistics capabilities. It also provides a reference to help prioritize what skills are important to be taught jointly in a module.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bc9a90c886ae5c18a7b7c65124d293e",
  "timestamp": "2025-05-15T03:20:22.225431"
}