{
  "id": 7067,
  "title": "Prevalence of work related musculoskeletal disorders in Italian workers: is there an underestimation of the related occupational risk factors?",
  "abstract": "BackgroundWork-related musculoskeletal disorders (WMSDs) represent an important socio-economic burden. The current risk assessment and management involved in the ethiopathogenesis of WMSDs is based on observational tools and checklists, which have some limitations in terms of accuracy and reliability. The aim of this study was to assess WMSD prevalence and identify possible correlations with several socio-demographic and work-related variables in a large cohort representative of Italian workers in order to improve our understanding of the WMSD phenomenon.MethodsThis study includes data from INSuLa, a cross-sectional nationally representative survey of health and safety at work, developed by the Italian Workers' Compensation Authority. A total of 8000 Italian workers were included. Multivariate logistic regression analyses were performed to evaluate the association of independent variables, such as workers' perceptions of exposure to biomechanical/ergonomic and video display unit (VDU) risks (Risk Perceived) and the actual risk exposure (Risk Detected) on Back, Lower and Upper limb pain. Socio-demographic, occupational and other health-related variables were included to investigate possible association with musculoskeletal disorders.ResultsWorkers perceiving a significant exposure to biomechanical/ergonomic and VDU risks but not included in a health surveillance program for them (Risk Perceived/No Risk Detected) have had significantly higher odds of reporting musculoskeletal disorders. Regarding the biomechanical/ergonomic risk these workers are in the 19-24 age range (39.9%), transportation, warehousing/information and communication sectors (38.9%) and are employed in companies with more than 250 workers (35.8%). Regarding VDU risk, workers are in the 45-54 age range (24.5%), professional, financial and business services (38.0%) and come from companies with more than 250 employees (25.6%).ConclusionsWithin the occupational safety and health management systems an appropriate assessment of occupational risk factors correlated to musculoskeletal disorders (mainly biomechanical/ergonomic and VDU) and the correct definition of their exposure levels is essential to adequately prevent the onset of WMSDs. In this regard, our findings provide useful information to design novel approaches, aimed at improving our understanding of emerging risks, identifying gaps in current risk assessment strategies and enhancing workplace interventions are mandatory to improve the occupational risk assessment and management process and therefore implement the subsequent health surveillance systems.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bcb17ca1a4527ed0b486e74e087cc64",
  "timestamp": "2025-05-15T03:05:03.367629"
}