{
  "id": 5947,
  "title": "CEO power and risk taking: evidence from European banks mergers and acquisitions",
  "abstract": "PurposeThis study investigates the relationship between CEO power and the risk profile (RP) of acquiring banks through mergers and acquisitions (M&A) transactions.Design/methodology/approachThe analysis is based on 214 transactions between 2010 and 2022 involving European Union-based acquirers. To assess the impact of M&A on the acquiring bank's RP, we compare changes in the acquirer's RP to control banks. We use linear regression with two-stage least squares instrumental variables (2SLS-IV) to examine the effect of CEO power on changes in merger-related risk.FindingsThe findings suggest that CEO power reduces the RP of the acquiring bank. Specifically, CEOs who hold both the CEO and board chair positions tend to take fewer risks. Additionally, CEOs with high ownership, CEO pay and extensive experience (measured by tenure and acquisition experience) decrease the RP. However, prestige power is positively correlated with an increase in RPs.Practical implicationsThis research examines CEO influence on bank risk post-mergers, providing insights into governance, risk and strategic choices. The findings can guide banks in CEO selection and governance to mitigate M&A risks, improving risk management and decision-making in the financial sector.Originality/valueThis study is the first empirical investigation introducing diverse executive power metrics to analyze the link between executive power and risk-taking in the European banking sector, with a specific emphasis on the impact on M&A as critical investment choices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bd19c7a84f8df4372a17a7beb621975",
  "timestamp": "2025-05-15T02:53:03.128876"
}