{
  "id": 3789,
  "title": "The Effectiveness of Financial Incentives for Health Behaviour Change: Systematic Review and Meta-Analysis",
  "abstract": "Background: Financial incentive interventions have been suggested as one method of promoting healthy behaviour change. Objectives: To conduct a systematic review of the effectiveness of financial incentive interventions for encouraging healthy behaviour change; to explore whether effects vary according to the type of behaviour incentivised, post-intervention follow-up time, or incentive value. Data Sources: Searches were of relevant electronic databases, research registers, www.google.com, and the reference lists of previous reviews; and requests for information sent to relevant mailing lists. Eligibility Criteria: Controlled evaluations of the effectiveness of financial incentive interventions, compared to no intervention or usual care, to encourage healthy behaviour change, in non-clinical adult populations, living in high-income countries, were included. Study Appraisal and Synthesis: The Cochrane Risk of Bias tool was used to assess all included studies. Meta-analysis was used to explore the effect of financial incentive interventions within groups of similar behaviours and overall. Meta-regression was used to determine if effect varied according to post-intervention follow up time, or incentive value. Results: Seventeen papers reporting on 16 studies on smoking cessation (n = 10), attendance for vaccination or screening (n = 5), and physical activity (n = 1) were included. In meta-analyses, the average effect of incentive interventions was greater than control for short-term (<= six months) smoking cessation (relative risk (95% confidence intervals): 2.48 (1.77 to 3.46); long-term (>six months) smoking cessation (1.50 (1.05 to 2.14)); attendance for vaccination or screening (1.92 (1.46 to 2.53)); and for all behaviours combined (1.62 (1.38 to 1.91)). There was not convincing evidence that effects were different between different groups of behaviours. Meta-regression found some, limited, evidence that effect sizes decreased as post-intervention follow-up period and incentive value increased. However, the latter effect may be confounded by the former. Conclusions: The available evidence suggests that financial incentive interventions are more effective than usual care or no intervention for encouraging healthy behaviour change.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4bdfa525acf6fe5cef8038d985a690a2",
  "timestamp": "2025-05-15T02:29:59.186027"
}