{
  "id": 1690,
  "title": "An integrated generalized TODIM model for portfolio selection based on financial performance of firms",
  "abstract": "Multi-criteria decision-making (MCDM) models are well-suited for solving portfolio selection problems. Diversified financial indices and complex subjective preferences are important factors affecting investment decisions within the MCDM framework. Therefore, this study adopts a well-known behavioral MCDM model called generalized TODIM (TOmada de Decisao Iterativa Multicriterio) for portfolio selection based on the financial performance of firms. First, a multidimensional financial evaluation index system is proposed for financial performance evaluation, which is the most appropriate approach for stock investment within a long-term horizon. Second, features are selected from the financial ratios using affinity propagation clustering (APC). Through the APC algorithm, financial ratios with a strong influence on stock evaluation can be obtained. Third, a generalized TODIM method with entropy weight is used to calculate the dominance relation between stocks and reflect investors' bounded rational behaviors. Fourth, an extended mean-variance multi-objective portfolio selection model that considers financial and stock market performance is constructed. The compromise solution is used when solving the multi-objective optimization programming. Finally, a case study on medical stock investment in the Chinese stock market is examined to recommend the optimal portfolio allocation for investors. Sensitivity and comparative analyses are performed to demonstrate the robustness, effectiveness, and superiority of the proposed methodology. (C) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4be8b9ec7a78aeabceec0c0e691ef41c",
  "timestamp": "2025-05-15T00:58:50.567232"
}