{
  "id": 9294,
  "title": "Regional Differences in the Payments Sustainability of the Pension Insurance-Quantitative Analysis Based on Panel Data",
  "abstract": "The pension insurance is the first level of the multi-level pension insurance system in China, and it is also one of the most important types of social security. In recent years, the growing population aging increases the risk of pension payment in China. The Chinese government needs to use financial resources to subsidize it every year. But the problem of insufficient pension insurance has not been properly resolved. Then, more and more provinces'pension insurance appear to be unbalance, and the gap between the pension payment capacity of each province is expanding. This kind of regional disparity has hindered the improvement of the overall level of pension in China. Based on this, the paper makes a quantitative analysis to comprehensively show the difference of pension payment ability at the provincial level, and explores the factors that affect the unbalanced development of the pension in each region, which is of great significance for the sustainable development of the national pension. This paper selects urban workers' pension insurance fund as the research object, which include 31 provinces, autonomous regions, and municipalities except for Hong Kong, Macao and Taiwan, and analyses the differences of pension insurance affordability in different province through empirical research. The paper combine the quantitative analysis with the actual situation in China to put forward the policy recommendations of sustainable development of the basic pension insurance. First of all, using the provincial panel data of 2011-2015 in China, then establish threshold regression model of pension gap in China. It proved that the population structure have double threshold effects on the payment capacity of China's pension insurance. In areas with poor and good economic development, population aging has a negative impact on the sustainable development of basic pensions. On the contrary, in the middle economic development area, population aging is positively related to the balance of basic pensions, but this effect is not significant. Next, Through the estimation of the coefficient of control variables in the model, it is found that the wages of the workers in the town are raised, the replacement rate of the old - age insurance is increased, and the system support rate is not conducive to the sustainable development of the basic pension. The increase in the capital ratio of state-owned enterprises compared to foreign and Hong Kong, Macao and Taiwan enterprises and private enterprises, and the increase in wages of state-owned enterprises will help the basic pension to achieve sustainable development. Finally, the paper puts forward some policy suggestions about how to slove the shortage of China's pension and the unblanced pension payment capacity between provinces. The innovation of this paper: Threshold regression model is established based on Provincial Panel Data, the paper divide the provinces of China into different levels, it analyses the impact of different factors on the ability of sustainable payment of pension insurance in different regions by specific way. and it also give clear direction for the province's reasonable management of pension income and expenditure.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c00268420ceb400cf7bf680661bb579",
  "timestamp": "2025-05-15T03:27:25.008044"
}