{
  "id": 3859,
  "title": "THE RELATIONSHIP BETWEEN BANK CAPITAL, RISK- TAKING AND PROFITABILITY: FRESH EVIDENCE FROM PANEL QUANTILE APPROACH",
  "abstract": "This study aims to reveal the relationship between bank capital (BC), risk- taking, and profitability for commercial banks in Turkey using panel quantile regression models (QRPD) with non-additive fixed effects (NAFE). Accordingly, we consider the data of 18 commercial banks for 2012-2022. Firstly, we concluded a positive relationship between banks' risk-based capital (RBC) and traditional capital ratios (CR) and return on assets (ROA); in contrast, there is a negative relationship between RBC and risk-weighted assets (RWATA). Secondly, we found a positive relationship between RBC and the loan loss provision ratio (LLPTA) in other periods except the contraction period and between CR and LLPTA in other periods except the expansion period. The findings also showed an inverted U-shaped relationship between RBC and the LLPTA and return on equity (ROE) and an N-shaped relationship between CR and ROE. ALastly, we discovered a positive relationship between RWATA and ROA and ROE, whereas a negative relationship exists between LLPTA and ROA. AThe findings provide valuable insights into the validity of the moral hazard, cost-skimping, regulatory assumptions, agency, portfolio and risk- bearing profit theories in the commercial banking sector and that risk, capital and profitability indicators are leading factors in banks' stability.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c067c006b7830c6612ba4fa9bc5c7d8",
  "timestamp": "2025-05-15T01:21:41.325638"
}