{
  "id": 6274,
  "title": "Methodology of Business Risk Analysis and its Practical Application in the Enterprises Working in the Global Market",
  "abstract": "One of the most important aspects which guarantees successful work of a company, i.e. risk analysis is considered. The exploration of risk analysis is essential both theoretically and practically as it reduces the risk of loss, venturesome dealings and harm for a company's good will. The shortage of both theoretical and practical knowledge about risk, processes of risk analysis and its stages prevent companies from business development both locally and internationally. The exploration of this field is even more relevant because there is no clear and unanimous concept of risk analysis which would be accepted both by scientists and business environment. At present, the conception of risk analysis of authorities, various institutions and foreign and Lithuanian scientist differs greatly. Risk analysis is distinguished by the variety of methods, their complexity and lengthening time of their implementation. The classification of methods may also vary greatly whereas reasons (advantages and disadvantages) for such classification are explained differently by scientists. Meanwhile, companies face real practical problem how to choose a method which could be the most appropriate and conforming to company's financial possibilities. The perception that risk analysis is a very complex and responsible process during which risk should be identified, assessed, analyzed and estimated, i.e. to manage, encourage companies to assign this process for professionals, i.e. specialized companies of risk analysis, the launching of which increased as there was the gap in the market in this field. The aim of the article is to work out the methodology of risk analysis and to compare the stages of risk analysis process used by Lithuanian risk management analysis companies. Having performed the analysis of scientific literature and summarized various approaches, risk analysis as a constituent part of risk management concept is presented, method groups and types of risk analysis, stages of individual method processes are discerned as well as advantages and disadvantages of qualitative and quantitative risk analysis methods are explored. Having systemized different viewpoints of authors, four main stages of risk analysis process were distinguished: organizational investigation, identification, estimation and evaluation. Business companies are recommended to use a resumptive model of risk analysis process in the context of risk management process. The investigation is conducted using the data of three Lithuanian companies: SC Compservis, PriceWaterHouseCoopers/Lietuva and SC Synergy Consulting. The aim of the investigation was twofold: 1) to find out what risk analysis methods and stages are applied by risk analysis companies; 2) to compare the essential stages of risk analysis process which are described theoretically and applied practically and to identify their similarities and differences. The results of investigation were: 1) Lithuanian risk analysis companies more often apply qualitative risk analysis methods than quantitative ones; 2) the stages of SC Synergy Consulting and SC Compservis risk analysis process (asset identification and valuation, threats assessment, vulnerabilities assessment and risk identification and its evaluation) are the same and identical to the stages of risk analysis discerned by R. K. Rainer, J.R. Charles A. Snyder, Houston H. Carr (1991); Sharon Halliday, Karin Badenhorst, Rossouw von Solms (1996).",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c07020a60ab49ea4d5b71f9e9c71af2",
  "timestamp": "2025-05-15T02:56:37.285480"
}