{
  "id": 6786,
  "title": "Burden and management of type 2 diabetes in rural United States",
  "abstract": "In the United States, rural areas have a higher burden of type 2 diabetes (T2DM) compared to urban areas. However, there is limited information on risk factors and interventions that improve the primary prevention and management of T2DM in rural areas. To synthesize current knowledge on T2DM in rural areas and to guide healthcare providers and policy makers, we reviewed five scientific databases and the grey literature over the last decade (2010-2020). We described classification systems for rurality and the T2DM burden based on rurality and region (West, South, Midwest, and Northeast). We highlighted risk factors for T2DM in rural compared to urban areas, and summarized interventions to screen and manage T2DM based on opportunistic screening, T2DM self-management, community-based initiatives, as well as interventions targeting comorbidities and T2DM. Several studies identified the co-existence of T2DM and depression/psychological symptoms, which could reduce adherence to non-pharmacologic and pharmacologic management of T2DM. We highlighted the role of technology in education and counselling of patients with geographic and financial barriers to accessing care, which is exacerbated by the SARS-CoV-2 coronavirus disease-19 pandemic. We identified knowledge gaps and next steps in improving T2DM care in rural areas. There is an urgent need for interventions tailored to rural areas given that rural Americans currently experience a disproportionate burden of T2DM and are encumbered by its associated morbidity, mortality, and loss in economic productivity.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c1dbbaa7a3e304a26bb92e01a50cd35",
  "timestamp": "2025-05-15T03:01:31.440123"
}