{
  "id": 8363,
  "title": "Do-Not-Resuscitate Status and Risk-Standardized Mortality and Readmission Rates Following Acute Myocardial Infarction Implications for Public Reporting",
  "abstract": "BACKGROUND: Important administrative-based measures of hospital quality, including those used by Centers for Medicare and Medicaid Services, may not adequately account for patient illness and social factors that vary between hospitals and can strongly affect outcomes. Do-not-resuscitate (DNR) order on admission (within the first 24 hours) is one such factor that may reflect higher preadmission illness burden as well as patients' desire for less-intense therapeutic interventions and has been shown to vary widely between hospitals. We sought to evaluate how accounting for early DNR affected hospital quality measures for acute myocardial infarction. METHODS AND RESULTS: We identified all patients admitted with acute myocardial infarction using the California State Inpatient Database, which captures early DNR use within 24 hours of admission. We generated hospital risk-standardized mortality and readmissions using random-effects logistic regression, before and after including early DNR status, to examine changes in overall model fit and hospital outlier designations. We included 109 521 patients from 289 hospitals and found that 8.5% (9356) patients had early DNR. Early DNR use varied widely, with median (interquartile range) hospital rates of 7.9% (4.1%-14.0%). Including early DNR in models used to assess hospital quality resulted in improvement in the mortality model (C statistics from 0.754 [0.748-0.759] to 0.784 [0.779-0.789]) but not the readmissions model. Of the hospitals designated high outliers for mortality and readmissions by the Centers for Medicare/Medicaid Services model, and therefore destined for a financial penalty, 6/25 (24%) were reclassified as nonoutliers for mortality and 2/14 (14.3%) for readmissions after including DNR status. Agreement in outlier status between the models before and after inclusion of early DNR status was moderate for mortality (kappa, 0.603 [0.482-0.724]; P<0.001) and high for readmissions (kappa, 0.888 [0.800-0.977]; P<0.001). CONCLUSIONS: Including early DNR status in risk-adjustment models significantly improved model fit and resulted in substantial reclassification of hospital performance rankings for mortality and moderate reclassification for readmissions. DNR status at hospital admission should be considered when reporting risk-standardized hospital mortality.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c446a1bd9d94082662c9a1db1180329",
  "timestamp": "2025-05-15T03:18:19.482565"
}