{
  "id": 6620,
  "title": "Direct and indirect influence of natural resources and regional integration on green growth: Exploring the role of political risk in South Asia",
  "abstract": "Within the context of sustainability, an integral focus of ongoing research is centred on cultivating economic expansion that prioritizes environmental friendliness and reduces resource dependence. This approach is commonly referred to as green economic growth. Hence, the present study strives to explore the heterogeneous effects of regional trade and economic integration, natural resource reliance, and political risk while also examining how regional integration index combined with natural resource factors influences the green growth trajectory of selected south Asian countries. The cross-sectional dependence and slope heterogeneity of the countries have been examined. Stationarity properties are checked before proceeding to the long-run relationship and empirical estimation procedure. Method of Moments Quantile Regression is employed to understand the variables ' asymmetric association. The outcomes revealed the positive influence of regional integration on green growth, while political risk and natural resources pose a negative impact. It can be observed that the negative consequences of natural resources are neutralized with higher trade and financial integration. Lastly, the causality test is used to investigate the causal association between the variables. The outcomes imply that Asian countries emphasize shaping natural resource extraction policies and stabilizing their political situation to get the maximum benefit from green growth.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c5253a9cc6da79228c00c7146b75644",
  "timestamp": "2025-05-15T03:00:04.937614"
}