{
  "id": 8385,
  "title": "Current Smoking: An Independent Predictor of Elevated A1C in Persons With Type 2 Diabetes",
  "abstract": "Purpose The purpose of this study is to examine the association of current smoking as one of several potential predictors of elevated A1C in adults with type 2 diabetes (T2D). Methods Using a cross-sectional design, baseline data (N = 282) were analyzed from a randomized clinical trial examining treatment of obstructive sleep apnea in persons with T2D. Sociodemographic, clinical, and behavioral data were collected using questionnaires and physical examinations. Physical activity (mean daily steps walked) was measured with the BodyMedia Armband. Participants were asked if they never smoked, had previously smoked, or currently smoke. The sample distributions of demographic and clinical characteristics were examined using descriptive statistics. Continuous variables were described using means and standard deviations; categorical variables were described as numbers and percentages. Multiple linear regression analysis with backward selection was conducted to develop a parsimonious predictive model for the dependent variable A1C. Results Participants were generally middle-aged and, on average, obese with suboptimal blood glucose control; almost 1 of every 5 participants currently smoked. After controlling for age, race, education, financial difficulty, diabetes education, physical activity, and diabetes knowledge, 4 variables were found in the final model to be independently associated with higher A1C: (1) current smoking status, (2) younger age, (3) longer diabetes duration, and (4) higher diabetes-related distress. Conclusions The study found that not only is smoking prevalent among persons with T2D with self-reported sleep problems but smoking is also an independent predictor of elevated A1C. The results highlight the vital role diabetes educators have in promoting risk reduction through education and support for smoking cessation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c62d7a016035ac82bbf714eeaaeb671",
  "timestamp": "2025-05-15T03:18:19.570630"
}