{
  "id": 3885,
  "title": "Examining the Link between CSRD and FP in Korean Companies: The Moderating Effect of Company Reputation",
  "abstract": "This study investigates two key aspects of Korean companies. First, we examine the significance of the relationship between corporate social responsibility disclosure and a company's financial performance. Second, we explore the moderating role of company reputation in the link between corporate social responsibility disclosure and financial performance. We use data from Korean companies included in the Forbes Global 2000 list, employing a quantitative methodology and analyzing data from 66 Korean companies between 2017 and 2021. To estimate the relationship between the independent variable (corporate social responsibility disclosure) and the dependent variable (financial performance), we applied multiple regression models, using market value, sales, and net profit as control variables. Our study provides robust evidence of a positive and significant relationship between corporate social responsibility disclosure and the financial performance of Korean companies. We find that their influence is partially mediated by the company's reputation, which serves as a signal of the firm's ethical and social responsibility practices to stakeholders. Our results suggest that firms with a positive reputation for corporate social responsibility activities are more likely to experience enhanced financial performance, possibly due to increased stakeholder trust and loyalty, improved risk management, and enhanced access to capital.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c6c3d59fa1c7cb3d6f81573c821f29c",
  "timestamp": "2025-05-15T02:30:58.307591"
}