{
  "id": 4168,
  "title": "Evaluating College Students' Displayed Alcohol References on Facebook and Twitter",
  "abstract": "Purpose: Current trends suggest that adolescents and young adults typically maintain a social media portfolio of several sites including Facebook and Twitter, but little is known regarding how an individual chooses to display risk behaviors across these different sites. The purpose of this study was to investigate college students' displayed alcohol references on both Facebook and Twitter. Methods: Among a larger sample of college students from two universities, we identified participants who maintained both Facebook and Twitter profiles. Data collection included evaluation of 5 months of participants' Facebook and Twitter posts for alcohol references, number of social connections (i.e., friends or followers), and number of posts. Phone interviews assessed participants' frequency of Facebook and Twitter use and self-reported alcohol use. Analyses included Fisher's exact test, Wilcoxon matched pair sign test, Friedman rank-sum tests, and logistic regression. Results: Of 112 eligible participants, 94 completed the study. Participants were more likely to display alcohol references on Facebook compared with those on Twitter (76% vs. 34%, p = .02). Participants reported more social connections on Facebook versus Twitter (average 801.2 friends vs. 189.4 followers, p <.001) and were more likely to report daily use of Facebook versus Twitter (94.6% vs. 50%, p <.001). Current alcohol use was predictive of both Facebook and Twitter displayed alcohol references, but mediators differed in each model. Conclusions: College students were more likely to display alcohol references on Facebook compared with those on Twitter. Understanding these patterns and predictors may inform prevention and intervention efforts directed at particular social media sites. (C) 2016 Society for Adolescent Health and Medicine. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c730ec7bc46d3e6914013637c76bfb4",
  "timestamp": "2025-05-15T01:24:25.396449"
}