{
  "id": 7505,
  "title": "Child Maltreatment during the COVID-19 Pandemic: Consequences of Parental Job Loss on Psychological and Physical Abuse Towards Children",
  "abstract": "Background: Job loss resulting from the COVID-19 pandemic presents significant risk for child abuse. Protective factors, such as reframing coping, may mitigate the risk of job loss on child maltreatment. Objective: The current study investigated factors associated with child maltreatment during the COVID-19 pandemic, including parental job loss, and whether cognitive reframing moderated associations between job loss and child maltreatment. Method: A community sample of 342 parents (62% mothers) of 4- to 10-year-olds (M = 7.38, SD = 2.01; 57.3% male) living in the United States completed online questionnaires regarding experiences with COVID-19, the Parent-Child Conflict Tactics Scale, and the Family Crisis Oriented Personal Evaluation Scales. Results: Two logistic regression analyses evaluated predictors of whether parents psychologically maltreated or physically abused their children during the pandemic controlling for maltreating history, parental depressive symptoms, financial stability, parent age, parent gender, child age, and child gender. Parents who lost their jobs (OR = 4.86, 95% CI [1.19, 19.91], p = .03), were more depressed (OR = 1.05, 95% CI [1.02, 1.08], p < .01), and previously psychologically maltreated their children (OR = 111.94, 95% CI [28.54, 439.01], p < .001) were more likely to psychologically maltreat during the pandemic. Regarding physical abuse, a significant interaction between job loss and reframing coping emerged (OR = 0.76, 95% CI [0.59, 0.99], p = .04). Among parents who lost their jobs, the probability of physical abuse decreased as reframing coping increased. Conclusions: Job loss during the COVID-19 pandemic is a significant risk factor for child maltreatment. Reframing coping may be an important buffer of this association on physical abuse and presents implications for maltreatment prevention.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c89b8b0421128a5f3b8eded897a867f",
  "timestamp": "2025-05-15T03:09:07.357706"
}