{
  "id": 9137,
  "title": "Associations among maternal childhood socioeconomic status, cord blood IgE levels, and repeated wheeze in urban children",
  "abstract": "Background: Independent of current socioeconomic status (SES), past maternal SES might influence asthma outcomes in children. Objective: We examined associations among the mother's SES in the first 10 years of her life (maternal childhood SES), increased cord blood IgE levels (upper 20% [1.37 IU/mL]), and repeated wheeze (>= 2 episodes by age 2 years) in an urban pregnancy cohort (n = 510). Methods: Data on sociodemographics, discrimination, financial strain, community violence, interpersonal trauma, and other negative events were obtained prenatally. Prenatal household dust was assayed for cockroach and murine allergens, and traffic-related air pollution was estimated by using spatiotemporal land-use regression. Maternal childhood SES was defined by parental home ownership (birth to 10 years). Maternally reported child wheeze was ascertained at 3-month intervals from birth. Using structural equation models, we examined whether outcomes were dependent on maternal childhood SES directly versus indirect relationships operating through (1) cumulative SES-related adversities, (2) the mother's socioeconomic trajectory (adult SES), and (3) current prenatal environmental exposures. Results: Mothers were largely Hispanic (60%) or black (28%), 37% had not completed high school, and 56% reported parental home ownership. When associations between low maternal childhood SES and repeated wheeze were examined, there were significant indirect effects operating through adult SES and prenatal cumulative stress (beta = 0.28, P = .003) and pollution (beta = 0.24, P = .004; P value for total indirect effects <= .04 for both pathways). Low maternal childhood SES was directly related to increased cord blood IgE levels (beta = 0.21, P = .003). Maternal cumulative adversity (interpersonal trauma) was also associated with increased cord blood IgE levels (beta = 0.19, P = .01), although this did not explain maternal childhood SES effects. Conclusion: Lower maternal childhood SES was associated with increased cord blood IgE levels and repeated wheeze through both direct and indirect effects, providing new insights into the role of social inequalities as determinants of childhood respiratory risk. (J Allergy Clin Immunol 2011;128:337-45.)",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c8b4a4e72175a373e35bb56345e76d4",
  "timestamp": "2025-05-15T03:25:54.610973"
}