{
  "id": 2745,
  "title": "An empirical investigation of capital flight and economic growth nexus in Africa",
  "abstract": "This paper investigates the impact of capital flight on economic growth in Africa using 54 African countries from 2000 to 2021. The study employed the GMM and the dynamic panel threshold regression estimation techniques. GMM results revealed that capital flight negatively and significantly affects economic growth in Africa. The study also revealed that external debt repayment and outward foreign direct investment, proxies of capital flight, have a negative and significant effect on economic growth in Africa, except foreign portfolio investment outflow, which positively and insignificantly influences economic growth. Again, the dynamic panel threshold estimation results also revealed that capital flight negatively affects economic growth at all levels of capital flight in Africa. The study also revealed that all the proxies of capital flight, external debt repayments, foreign portfolio investment outflows, and outward foreign direct investment negatively and significantly affect economic growth above a certain threshold. However, external debt repayment has an insignificant negative effect on economic growth below the threshold in Africa. Based on the findings, African countries should implement stringent policies to curb capital flight and regulate external debt repayments and outward foreign direct investment to enhance economic growth.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c8dab97a4cbb84a7dd1353321ad0283",
  "timestamp": "2025-05-15T01:10:16.430182"
}