{
  "id": 4325,
  "title": "Association of job loss, income loss, and financial burden with adverse mental health outcomes during coronavirus disease 2019 pandemic in Thailand: A nationwide cross-sectional study",
  "abstract": "Background Economic crises during the coronavirus disease (COVID-19) pandemic severely impacted mental health outcomes. However, there is limited evidence on this issue in Thailand. We aimed to evaluate the association of economic burden during the first phase of the pandemic and the risk of adverse mental health outcomes in the Thai population. Methods We recruited 2,303 participants aged 18 years or above with employment/full-time jobs before the national lockdown in April-May 2020. The measures of economic burden were job loss, income loss, and financial problems related to the outbreak. The outcomes included depressive symptoms, anxiety, and perceived stress. The association between economic burden and adverse mental health outcomes was evaluated using multivariable logistic regression models. Results Individuals who lost their jobs during the COVID-19 pandemic had a higher risk of perceived stress compared to those who maintained their job (adjusted odds ratio [OR], 2.40; 95% confidence interval [CI], 1.28-4.51; p = .006). A higher risk of anxiety was observed in individuals with a monthly income loss of 50% (adjusted OR, 1.42; 95% CI, 1.03-1.99; p = .035; individuals without income loss, reference group) or over. Self-reported financial problems were significantly associated with adverse mental health outcomes (nonexperienced financial problems, reference group): Adjusted ORs of 1.84 (95% CI, 1.34-2.51; p < .001) for depressive symptoms, 2.00 (95% CI, 1.48-2.71; p < .001) for anxiety, and 2.12 (95% CI, 1.51-2.95; p < .001) for perceived stress. Conclusions Economic burden, especially self-reported financial problems, was associated with adverse mental health outcomes. However, long-term studies are needed to address the mental health consequences of COVID-19 and economic downturns.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c9577ee0b42e851036a32bb3bd788a1",
  "timestamp": "2025-05-15T02:36:05.162301"
}