{
  "id": 8190,
  "title": "Factors affecting catastrophic health expenditure and impoverishment from medical expenses in China: policy implications of universal health insurance",
  "abstract": "Objective To assess the degree to which the Chinese people are protected from catastrophic household expenditure and impoverishment from medical expenses and to explore the health system and structural factors influencing the first of these outcomes. Methods Data were derived from the Fourth National Health Service Survey. An analysis of catastrophic health expenditure and impoverishment from medical expenses was undertaken with a sample of 55 556 households of different characteristics and located in rural and urban settings in different parts of the country. Logistic regression was used to identify the determinants of catastrophic health expenditure. Findings The rate of catastrophic health expenditure was 13.0%; that of impoverishment was 7.5%. Rates of catastrophic health expenditure were higher among households having members who were hospitalized, elderly, or chronically ill, as well as in households in rural or poorer regions. A combination of adverse factors increased the risk of catastrophic health expenditure. Families enrolled in the urban employee or resident insurance schemes had lower rates of catastrophic health expenditure than those enrolled in the new rural corporative scheme. The need for and use of health care, demographics, type of benefit package and type of provider payment method were the determinants of catastrophic health expenditure. Conclusion Although China has greatly expanded health insurance coverage, financial protection remains insufficient. Policy-makers should focus on designing improved insurance plans by expanding the benefit package, redesigning cost sharing arrangements and provider payment methods and developing more effective expenditure control strategies.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c9d3bff124c24c545dea3c132e4920f",
  "timestamp": "2025-05-15T03:16:17.400180"
}