{
  "id": 2965,
  "title": "FINANCIAL SECURITY OF THE ENTERPRISE: AN ALTERNATIVE APPROACH TO EVALUATION AND MANAGEMENT",
  "abstract": "Purpose - The main purpose of the article is to justify an alternative approach to assessing the level of financial security of the enterprises based on use the model of modified and adjusted financial statements. Research methodology - The following methods of general theoretical and empirical research were used in the writing of the article: abstract-logical (when systematizing scientific publications on the problems of financial security management of enterprises), comparisons and grouping (when developing and validating a model of modified financial statements), coefficient (when considering and using models for adjusting modified financial statements), grouping (when clustering enterprises depending on the results of the analysis), formalization (when developing a matrix for diagnosing the level of financial security of enterprises), generalization (when formulating research findings). Findings - Based on an established sample from nine of sunflower oil production enterprises of Ukraine their modified financial statements have been developed, it was adjusted to the consumer price index, key financial indicators of the model have been identified and the level of their financial security over the past 7 years have been assessed. The research identified a direct relationship between the level of financial security of enterprises and key financial indicators: financial stability, solvency and financial risk. Also, the proposed methodological approach can be not only an important tool for diagnosing the level of financial security of enterprises, but also its forecasting. Research limitations - The research limitation is associated with sampling size and geographical scope. Also, the diagnostic results may differ depending on the chosen adjustment base, determination of adjustment method and selection of inflation measurement method for the modification financial statements. Practical implications - Practical use of the proposed model proves that it is a convenient, simple, understandable and effective tool for diagnosing the financial security level of enterprises in terms of the main components: financial stability, solvency, and risk. The use of the proposed approach to the assessment of the financial security of the enterprise can serve as an indicator of the overall efficiency of its management at sunflower oil production enterprises and as an informative tool for factor analysis. Originality/Value - Consideration of a significantly different, alternative approach that allows enterprises to quickly and easily diagnose the level of their financial security; to manage it effectively during the current period, and can also become the basis for the formation of strategic directions of financial development and forecasting of the level of financial security for prospective period.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4c9f2ef14af09acb2a6a26d01fbaab80",
  "timestamp": "2025-05-15T02:21:19.180795"
}