{
  "id": 3688,
  "title": "Life-course Social Mobility and Reduced Risk of Adverse Birth Outcomes",
  "abstract": "Introduction: Higher adult socioeconomic position (SEP) is associated with better birth outcomes. However, few studies incorporate life-course or intergenerational SEP, which may inform etiology and targeted prevention efforts. This study tested whether life-course social mobility from childhood was associated with lower risk of adverse birth outcomes. Methods: Data were from the Life-course Influences of Fetal Environments (LIFE) retrospective cohort study among black women, 2009-2011, in metropolitan Detroit, MI. This study (analyzed in 2014-2016) examined whether social mobility was associated with two primary birth outcomes: small for gestational age (SGA) and preterm birth (PTB). Childhood and adulthood SEP were measured by survey in adulthood, for two constructs, measured ordinally: educational attainment and perceived financial sufficiency (subjective income/wealth). Social mobility was calculated as the difference of adulthood minus childhood SEP. Results: In covariate-adjusted Poisson regression models, 1-SD improved educational social mobility from childhood to adulthood was protective for SGA (adjusted risk ratio = 0.76; 95% CI = 0.64, 0.91); this association remained after adjusting for financial mobility. Upward financial social mobility from early childhood was marginally protective for SGA (adjusted risk ratio = 0.85; 95% CI = 0.72, 1.02), but became nonsignificant after controlling educational mobility. There were no overall associations of social mobility with PTB or low birth weight, although sensitivity analyses identified that improved financial mobility was associated with 16% marginally lower risk of spontaneous PTB and 28% marginally lower risk of low birth weight among upwardly mobile/stable women only. Conclusions: Improved life-course social mobility is associated with reduced risk for SGA and spontaneous PTB among black women. (C) 2016 American Journal of Preventive Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cb3cbbc6a8e177000fefbbf9452eca0",
  "timestamp": "2025-05-15T02:29:00.148467"
}