{
  "id": 5113,
  "title": "Impact of the introduction and withdrawal of financial incentives on the delivery of alcohol screening and brief advice in English primary health care: an interrupted time-series analysis",
  "abstract": "Aim To evaluate the impact of the introduction and withdrawal of financial incentives on alcohol screening and brief advice delivery in English primary care. Design Interrupted time-series using data from The Health Improvement Network (THIN) database. Data were split into three periods: (1) before the introduction of financial incentives (1 January 2006-31 March 2008); (2) during the implementation of financial incentives (1 April 2008-31 March 2015); and (3) after the withdrawal of financial incentives (1 April 2015-31 December 2016). Segmented regression models were fitted, with slope and step change coefficients at both intervention points. Setting England. Participants Newly registered patients (16+) in 500 primary care practices for 2006-16 (n = 4 278 723). Measurements The outcome measures were percentage of patients each month who: (1) were screened for alcohol use; (2) screened positive for higher-risk drinking; and (3) were reported as having received brief advice on alcohol consumption. Findings There was no significant change in the percentage of newly registered patients who were screened for alcohol use when financial incentives were introduced. However, the percentage fell (P < 0.001) immediately when incentives were withdrawn, and fell by a further 2.96 [95% confidence interval (CI) = 2.21-3.70] patients per 1000 each month thereafter. After the introduction of incentives, there was an immediate increase of 9.05 (95% CI = 3.87-14.23) per 1000 patients screening positive for higher-risk drinking, but no significant further change over time. Withdrawal of financial incentives was associated with an immediate fall in screen-positive rates of 29.96 (95% CI = 19.56-40.35) per 1000 patients, followed by a rise each month thereafter of 2.14 (95% CI = 1.51-2.77) per 1000. Screen-positive patients recorded as receiving alcohol brief advice increased by 20.15 (95% CI = 12.30-28.00) per 1000 following the introduction of financial incentives, and continued to increase by 0.39 (95% CI = 0.26-0.53) per 1000 monthly until withdrawal. At this point, delivery of brief advice fell by 18.33 (95% CI = 11.97-24.69) per 1000 patients and continued to fall by a further 0.70 (95% CI = 0.28-1.12) per 1000 per month. Conclusions Removing a financial incentive for alcohol prevention in English primary care was associated with an immediate and sustained reduction in the rate of screening for alcohol use and brief advice provision. This contrasts with no, or limited, increase in screening and brief advice delivery rates following the introduction of the scheme.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cc19ba9d3c6f1a91a8704bfe82de4b8",
  "timestamp": "2025-05-15T02:44:43.794040"
}