{
  "id": 7432,
  "title": "High Polygenic Risk Is Associated with Earlier Initiation and Escalation of Treatment in Early Primary Open-Angle Glaucoma",
  "abstract": "Purpose: To assess the association between a glaucoma polygenic risk score (PRS) and treatment out-comes in primary open-angle glaucoma.Design: Prospective, observational cohort study.Participants: Participants from the Progression Risk of Glaucoma: Relevant SNPs with Significant Associ-ation Study were divided into a cohort with suspect glaucoma who were treatment naive at enrollment and one with early manifest and suspect glaucoma receiving treatment at enrollment.Methods: A per-allele weighted glaucoma PRS was calculated for 1107 participants. Multivariable mixed-effects Cox proportional regression analysis assessed the association between PRS and time to commence-ment of intraocular pressure (IOP)-lowering therapy in 416 patients with suspect glaucoma who were treatment naive at study enrollment. Secondary analysis evaluated the association between PRS and escalation of IOP-lowering therapy among 691 patients with suspect and early manifest glaucoma who were receiving IOP-lowering therapy at enrollment.Main Outcome Measures: Commencement or escalation of IOP-lowering therapy.Results: A higher PRS was associated with a greater risk of commencing IOP-lowering therapy within 5 years (hazard ratio [HR], 1.45 per 1 standard deviation [/SD]; 95% confidence interval [CI], 1.27-1.62; P < 0.001). Participants in the upper population-based quintile showed a 3.3 times greater risk of commencing therapy by 5 years than those in the lowest quintile (HR, 3.30; 95% CI, 1.63-6,70; P < 0.001) and a 5.4 times greater risk of commencing IOP-lowering therapy by 2 years than the those in the lowest quintile (HR, 5.45; 95% CI, 2.08-14.25; P < 0.001). A higher PRS was associated with a greater risk of treatment escalation among patients receiving treatment at enrollment (HR, 1.19/SD; 95% CI, 1.09-1.31; P < 0.001). In combined analysis of all participants, participants in the top population-based quintile were at 2.3 times greater risk of requiring initiation or escalation of IOP-lowering therapy than those in the lowest quintile (HR, 2.33; 95% CI, 1.75-3.01; P < 0.001).Conclusions: This study demonstrated novel associations between glaucoma polygenic risk and risk of commencement or escalation of IOP-lowering therapy, building on previous work highlighting the potential clinical usefulness of genetic risk stratification in glaucoma. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references.& COPY; 2023 by the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ccb17721d440e063355543c458887ab",
  "timestamp": "2025-05-15T03:08:37.814141"
}