{
  "id": 3104,
  "title": "CORRUPTION RISKS IN LEGAL PROVISION OF PUBLIC PROCUREMENT FINANCING",
  "abstract": "Introduction: in the Russian Federation, a significant part of the budget is spent on ensuring public interest by procuring goods, works, and services. The disposition of budgetary funds in all countries of the world is characterized as a corruption risk. This study examines the problems of legal provision for public procurement in the Russian Federation taking the national anti-corruption measures into account. The practice of anti-corruption measures implemented in public procurement in foreign countries is also considered. Purpose: to identify the signs of corruption in public procurement from the perspective of the risk-based approach in order to prepare proposals for optimization of legal regulation and improving the financial efficiency of national public procurement. Methods: the research uses general scientific methods (analysis, synthesis, analogy) as well as formal legal and comparative legal methods. Results: the analysis of law enforcement practice in public procurement in Russia and foreign countries revealed some corruption risks that were further classified. The presented author's classification can become a basis for creating a set of coordinated legal, financial, and personnel measures to prevent corruption in public procurement. Conclusions: to focus the attention of legislative and executive authorities on minimizing the negative consequences of corruption in public procurement, the author's classification of corruption risks is proposed. There should necessarily be a system of monitoring over the results obtained in the procurement process. The paper proposes removing corruption offenses in procurement from under criminal prosecution and placing them under the scope of financial responsibility, which would ensure commensurable personal financial responsibility of an official whose actions (inaction) caused damage to the budget.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ccc8c37775ce9fe6703b73cfa92e3d2",
  "timestamp": "2025-05-15T02:22:25.186081"
}