{
  "id": 5818,
  "title": "Emergency obstetric care in Mali: catastrophic spending and its impoverishing effects on households",
  "abstract": "Objective To investigate the frequency of catastrophic expenditures for emergency obstetric care, explore its risk factors, and assess the effect of these expenditures on households in the Kayes region, Mali. Methods Data on 484 obstetric emergencies (242 deaths and 242 near-misses) were collected in 2008-2011. Catastrophic expenditure for emergency obstetric care was assessed at different thresholds and its associated factors were explored through logistic regression. A survey was subsequently administered in a nested sample of 56 households to determine how the catastrophic expenditure had affected them. Findings Despite the fee exemption policy for Caesareans and the maternity referral-system, designed to reduce the financial burden of emergency obstetric care, average expenses were 152 United States dollars (equivalent to 71 535 Communaute Financiere Africaine francs) and 20.7 to 53.5% of households incurred catastrophic expenditures. High expenditure for emergency obstetric care forced 44.6% of the households to reduce their food consumption and 23.2% were still indebted 10 months to two and a half years later. Living in remote rural areas was associated with the risk of catastrophic spending, which shows the referral system's inability to eliminate financial obstacles for remote households. Women who underwent Caesareans continued to incur catastrophic expenses, especially when prescribed drugs not included in the government-provided Caesarean kits. Conclusion The poor accessibility and affordability of emergency obstetric care has consequences beyond maternal deaths. Providing drugs free of charge and moving to a more sustainable, nationally-funded referral system would reduce catastrophic expenses for households during obstetric emergencies.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cd2e3f663289f8580421e0f9d5d4393",
  "timestamp": "2025-05-15T02:51:58.514875"
}