{
  "id": 2633,
  "title": "Deep neural network for investment decision planning on low-carbon transition in power grid",
  "abstract": "With the urgency of mitigating global warming, the low-carbon transformation of power grid systems has emerged as a pivotal industry upgrade for sustainable development. We proposed a novel deep neural network-based approach for investment decision planning in the low-carbon transformation of power grids, which aimed to address multidimensional key indicators related to power grid transformation and provided reliable electricity industry layouts and investment plans for power system investment decisions. To achieve this, three targeted investment branch models were established, encompassing investment behavior, electricity production and consumption, and predictions of new capacity investment. These models effectively tackled challenges associated with power distribution, electricity price scheduling, power carbon quotas, and the feasibility of low-carbon power generation technologies. Subsequently, a global investment decision planning model was constructed, employing spatiotemporal neural networks and recurrent neural networks, which integrated the aforementioned branch models and incorporated existing low-carbon transformation data. A comparative analysis was conducted, examining the predicted results against actual values from three perspectives: power generation portfolio, grid economy, and overall investment decision plans. The results demonstrated the effectiveness of our method in accurately predicting future installed capacity of diverse low-carbon power generation technologies, sustainability indices, and investment returns. Notably, our method achieves an impressive forecasting accuracy of over 90% compared to actual values of investment decision planning over the past 4 years.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cd842f88220002dbcf6c7abd6c30832",
  "timestamp": "2025-05-15T01:08:42.032632"
}