{
  "id": 6787,
  "title": "MANAGEMENT OF INVESTMENT PROJECTS AS AN IMPORTANT COMPONENT OF ENTERPRISE MANAGEMENT IN THE GLOBAL SPACE",
  "abstract": "The article analyzes the concepts to determine the essence of the investment project. The theoretical and methodical approach to the definition of an investment project, which will provide the possibility for a clear identification of the essential features, ensure an effective interaction with internal and external dynamic environment is offered. The most common classification features of investment projects are singled out. The main features of the definition of the functions of investment management as a management system and a special area of enterprise management are determined. It was emphasized that for the steady positive development of industrial enterprises in a competitive and rapidly changing environment, effective management of investment activity of enterprises is a necessary condition for functioning. In addition, it is proved that in the context of the limited financial and other types of resources, the use of an integrated approach to investing is one more major area for improving the efficiency of management of investment processes at the macro level, and an integrated investment design is a system-integrated process of management of a set of investment projects that are subordinated to a single strategic plan focused on the successful implementation of the enterprise investment program. The necessity of further, more profound research of investment management in conditions of uncertainty and risk is substantiated. The next stage of the research should be the construction of a system for making investment decisions in conditions of uncertainty and risk.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ce58bb471f5db7991b3fefb680bf831",
  "timestamp": "2025-05-15T03:01:31.444619"
}