{
  "id": 4024,
  "title": "Unravelling the Relations between and Predictive Powers of Different Testing Variables in High Performance Concrete Experiments: The Data-Driven Analytical Methods",
  "abstract": "This study proposes and applies a systematic data analysis methodology to analyse experimental data for high-performance concrete (HPC) samples with different admixtures for offshore fan foundation grouting materials uses. In contrast with other relevant research, including experimental studies, the materials physics and chemistry studies, or cementitious material portfolio determination studies, this data-driven analysis provides a deep exploration of the experimental variables associated with the test data. To offer complete and in-depth perspectives, several methods are employed for the data analyses, including correlation analysis, cosine similarity analysis, simple linear regression (SLR) modelling, and heat map and heat-based tabularised visualisations; the outcome is a proposed methodology that is easily implementable. The results from these methods are validated using a pairwise comparison approach (PCA) to avoid unnecessary interference between data variables. There are several potential contributions from this work, including insights for cohered groups of variables, techniques for double check and 'third check', an established 'knowledge base' consisting of 504 SLR predictive models with their effectiveness (significance) and prediction accuracy (data-model fitness) used in practical applications, an alternative visualisations of the results, three data transforms which can be omitted in a future analysis, and three valuable theory-linking perspectives (e.g., for the relationships between destructive and non-destructive tests with respect to the variable categories). The implication that some variables are interchangeable will make future experiments less labour intensive and time consuming for pre-project HPC material testing.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ce8f558c6b3c896ddb94cf1290c8bf5",
  "timestamp": "2025-05-15T01:23:07.371048"
}