{
  "id": 8829,
  "title": "Perceptions and Correlates of Distress Due to the COVID-19 Pandemic and Stress Management Strategies Among Adults With Diabetes: A Mixed-Methods Study",
  "abstract": "Background: Greater risk of adverse health outcomes and public health measures have increased distress among people with diabetes during the coronavirus-2019 (COVID-19) pandemic. The objectives of this study were to explore how the experiences of people with diabetes during the COVID-19 pandemic differ according to sociodemographic characteristics and identify diabetes-related psychosocial correlates of COVID distress. Methods: Patients with type 1 or 2 diabetes were recruited from clinics and community health centres in Toronto, Ontario, as well as patient networks. Participants were interviewed to explore the experiences of people with diabetes with varied sociodemographic and clinical identities, with respect to wellness (physical, emotional, social, financial, occupational), level of stress and management strategies. Multiple linear regression was used to assess the relationships between diabetes distress, diabetes self-efficacy and resilient coping with COVID distress. Results: Interviews revealed that specific aspects of psychosocial wellness affected by the pandemic, and stress and illness management strategies utilized by people with diabetes differed based on socioeconomic status, gender, type of diabetes and race. Resilient coping (beta=-0.0517; 95% confidence interval [CI], -0.0918 to -0.0116; p=0.012), diabetes distress (beta=0.0260; 95% CI, 0.0149 to 0.0371; p<0.0001) and diabetes self-efficacy (beta=-0.0184; 95% CI, -0.0316 to -0.0052; p=0.007) were significantly associated with COVID distress. Conclusions: Certain subgroups of people with diabetes have experienced a disproportionate amount of COVID distress. Assessing correlates of COVID distress among people with diabetes will help inform interventions such as diabetes self-management education to address the psychosocial distress caused by the pandemic. (C) 2021 The Author(s). Published by Elsevier Inc. on behalf of Canadian Diabetes Association. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cefd65ffae7fee4ea3db0fa366f78a0",
  "timestamp": "2025-05-15T03:22:57.893880"
}