{
  "id": 7061,
  "title": "Political sensitivity and government oversight in the US corporate bond market: evidence from federal contractors",
  "abstract": "Purpose This paper aims to investigate the political cost hypothesis and the effects of political sensitivity-induced governance in the US bond market by using yield spreads from bonds issued by a diverse sample of US government contractors. Design/methodology/approach Fixed effects regression analysis is used to test the relation between the political sensitivity of government contractor firms and their cost of debt. Findings Results illustrated that government contractors with greater political sensitivity are associated with larger yield spreads, indicating that bondholders require a premium when firms endure the costs of increased political oversight and the threat of outside intervention, reducing the certainty of future income. However, despite the overall positive impact of political sensitivity on bond yield spreads on average, the authors found that the additional government oversight is associated with lower spreads when the firm is facing greater repayment risk. Practical implications Despite the benefits of winning a government contract, this paper identifies a direct financial cost of increased political sensitivity because of additional firm oversight and potential intervention. Importantly, it also finds that this governance is valued by bondholders when faced with increased risk. Firms must balance their desire for government receipts with the costs and benefits of dependence on those expenditures. Originality/value This paper contributes to the literature in its exploration of political sensitivity as an important determinant of the cost of debt for corporate government contractors. Specifically, the authors document a significant risk premium in bond pricing because of the joint effects of the visibility and importance of government contracts to the firm.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cf8764d5243e95145c3ef36e456d051",
  "timestamp": "2025-05-15T03:04:23.064914"
}