{
  "id": 8397,
  "title": "Food Security: An Unmet Need in Outpatient Burn Care",
  "abstract": "Nutrition is paramount for wound healing after burn injury. With rising food prices and time off work due to burn injuries, access to adequate nutrition may be a significant financial stressor. We asked patients at an outpatient burn clinic to complete the Household Food Security Module, which queries about food security over the preceding 12 months. Demographics and burn characteristics were abstracted from the medical record. We assessed the overall prevalence of food insecurity, risk factors for food insecurity, and potential effects of food insecurity on nutritional status and wound healing time. Wound healing time was assessed via Cox regression while adjusting for burn depth, total body surface area burned, and diabetes. Over 40% of participants reported experiencing food insecurity; it was more common in patients who preferred Spanish language (P = 0014) or were unemployed (P = .049). Just over half of participants experiencing food insecurity were using any food assistance resources. Among patients more than 30 days from burn injury, patients who were food insecure had larger burns (P = .01). Experience of food insecurity was not associated presence of malnutrition on nutrition-focused physical exam (P = .47). Wound healing time for burns managed in the outpatient setting was associated with burn depth (P < .001), but not food insecurity (P = .95), burn size (P = .17), or diabetes (P = .14). Although food insecurity did not result in malnutrition or negatively impact wound healing time, it is important for providers to routinely screen for food insecurity due to increased nutritional requirements and loss of wages after burn injury.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4cfaebf088aeaf57ca0a1223679db431",
  "timestamp": "2025-05-15T03:18:19.648373"
}