{
  "id": 8503,
  "title": "Emergency department visits and hospital readmissions after a deprescribing intervention among hospitalized older adults",
  "abstract": "BackgroundDeprescribing is the planned/supervised method of dose reduction or cessation of medications that might be harmful, or no longer be beneficial. Though benefits of deprescribing are debatable in improving clinical outcomes, it has been associated with decreased number of potentially inappropriate medications, which may potentially reduce the risk of adverse events among hospitalized older adults. With unclear evidence for deprescribing in this population, this study aimed to examine time-to-first unplanned healthcare utilization, which included 90-day emergency department (ED) visits or hospital readmission and associated predictors, during a deprescribing intervention.MethodsA secondary data analysis of a clinical trial (Shed-MEDS NCT02979353) was performed. Cox regression was used to compare the time-to-first 90-day ED visit/readmission/death from hospital discharge for the intervention and control groups. Additionally, we performed exploratory analysis of predictors (comorbidities, functional health status, drug burden index (DBI), hospital length of stay, health literacy, food insecurity, and financial burden) associated with the time-to-first 90-day ED visit/readmission/death.ResultsThe hazard of first 90-day ED visits/readmissions/death was 15% lower in the intervention versus the control group (95% CI: 0.61-1.19, p = 0.352, respectively); however, this difference was not statistically significant. For every additional number of comorbidities (Hazard ratio (HR): 1.12, 95% CI: 1.04-1.21) and each additional day of hospital length of stay (HR: 1.04, 95% CI: 1.01-1.07) were significantly associated with a higher hazard of 90-day ED visit/readmission/death in the intervention group; whereas for each unit of increase in pre-hospital DBI score (HR: 1.08 and HR 1.16, respectively) was significantly associated with a higher hazard of 90-day ED visit/readmission/death in the control group.ConclusionsThe intervention and control groups had comparable time-to-first 90-day ED visit/readmission/death during a deprescribing intervention. This finding suggests that deprescribing did not result in a higher risk of ED visit/readmission/death during the 90-day period following hospital discharge.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d0f3da9a30a79eea86bec7b09003bcf",
  "timestamp": "2025-05-15T03:19:21.368856"
}