{
  "id": 4189,
  "title": "The double-edged sword: how cryptocurrency investments could undermine the anxiety-reducing benefits of rainy-day savings in times of economic turbulence",
  "abstract": "PurposeRainy-day savings have been an effective measure for maintaining financial stability in times of emergency. Motivated by the rapid expansion of cryptocurrencies, the present study examines how crypto investments could moderate the beneficial outcomes of rainy-day savings for alleviating financial anxiety during the most recent economic turbulence caused by the COVID-19 pandemic.Design/methodology/approachThe present study carries out multivariate logistic regression with interaction effects on the most recent 2021 cohort data from the National Financial Capability Study (NFCS).FindingsWhile rainy-day savings relate to less financial anxiety, the effect varies depending on whether an individual has invested in cryptocurrencies. Specifically, this paper finds that crypto investors experience less relief in financial anxiety from rainy-day savings than non-crypto investors. Additionally, crypto investors are more susceptible to financial stressors like job loss and financial fragility, likely due to the financial loss from investing in cryptocurrencies.Practical implicationsThe findings highlight the necessity of implementing policies and regulations, such as the newly approved Markets in Crypto-Assets (MiCA) regulation, that could raise people's awareness of the high-risk nature of cryptocurrencies as well as offering targeted financial education for crypto investors, especially during times of market downturn.Originality/valueThis is the first attempt to study how crypto investments may weaken the benefits of rainy-day savings in reducing financial anxiety. The findings offer new insights into the beneficial outcomes of rainy-day savings for emergencies in light of individual crypto investment backgrounds. Additionally, findings from the present study also contain important implications given the rapid expansion of the cryptocurrency market as well as future economic turbulence.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d1ca815ec67dcbcfc91a4f634148a8f",
  "timestamp": "2025-05-15T02:34:13.435446"
}