{
  "id": 6182,
  "title": "Spatio-temporal exposure risk estimation for COVID-19 using social network analysis and mobile phone data",
  "abstract": "The COVID-19 pandemic highlighted the critical role of human mobility in disease transmission. Understanding and anticipating spatio-temporal exposure risk is crucial for effective public health interventions. Although various mobility datasets have been explored, the potential of anonymized Call Detail Records (CDRs), combined with social network analysis, remains largely untapped for exposure risk estimation. This study investigates the use of social network analysis for estimating spatio-temporal exposure risk, using anonymized Call Detail Records (CDRs) from Mozambique to model human mobility patterns. The study focuses on three centrality measures: weighted in-degree centrality, improved in-degree centrality, and weighted PageRank. Daily origin-destination matrices constructed from CDRs are used to build directed-weighted networks representing human flow between provinces and districts. The exposure risk scores derived from these measures are compared against a risk score calculated from daily COVID-19 case data and the time-varying reproduction number. Results at the province level show that while all three centrality measures reveal similar trends in spatio-temporal exposure risk, weighted PageRank demonstrates the highest correlation with the COVID-19-based risk score. Poisson regression models, built to predict COVID-19 cases using the three centrality measures, further support the strong influence of exposure risk on the number of cases, with the weighted PageRank model showing the best predictive performance. The district-level analysis, focusing on the Greater Maputo area, used the distribution of Points of Interest (POIs) for validation. The results indicate that education, financial, and transport POIs correlate with exposure risk across all three centrality measures. In general, weighted PageRank consistently outperforms the other two measures in capturing exposure risk across most POI categories. The study concludes that CDRs, in conjunction with weighted PageRank, can effectively estimate spatio-temporal exposure risk, aiding decision-makers in implementing informed interventions to mitigate disease spread.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d20fef123de8bdebd08d933649e1b3e",
  "timestamp": "2025-05-15T02:55:44.520682"
}