{
  "id": 7848,
  "title": "Risk Factors of PTSD and Substance Use Disorders in Clinical and Counseling Psychology Doctoral Students",
  "abstract": "Objective: This study investigated the prevalence of probable alcohol use disorder (AUD), drug use disorders (DUDs), and posttraumatic stress disorder (PTSD) among psychology doctoral students. Additionally, it explored the unique relationships between risk factors (lifetime trauma, recent stressful experiences, COVID-19-related stress, general stress, financial stress) and AUD, DUD, and PTSD while accounting for demographic factors. Method: The sample included 889 clinical and counseling psychology doctoral students, and the Alcohol Use Disorders Identification Test, Screen of Drug Use, and Primary Care PTSD Screen for Diagnostic and Statistical Manual of Mental Disorders (5th ed.) were used to measure current probable AUD, DUD, and PTSD, respectively. Results: Approximately 43.8% had probable AUD, 23.2% had probable DUD, and 14.7% had probable PTSD. The univariate analysis results indicated a pattern of elevated risk among Black, Indigenous, and people of color, lesbian, gay, bisexual, queer, and other (LGBQ+) individuals, and women students. The results of the multivariate logistic regression analyses revealed that increased lifetime trauma and COVID-19-related stress were associated with higher adjusted odds of probable PTSD. Higher adjusted odds of probable AUD were observed among individuals experiencing elevated levels of COVID-19-related stress and among younger, women, and non-Hispanic White individuals. LGBQ+ individuals and those with no religious affiliation were found to have higher adjusted odds of probable DUD. Conclusions: These findings underscore the alarming prevalence of AUD, DUD, and PTSD in this population, raising concerns that warrant attention. Women; Black, Indigenous, and people of color; and LGBQ+ individuals face heightened risks of PTSD, AUD, and DUD, emphasizing the urgent need for mental health care for psychology doctoral students and marginalized groups.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d2c7f87255710fee63031267ab98c35",
  "timestamp": "2025-05-15T03:12:36.535530"
}