{
  "id": 358,
  "title": "Alliance portfolio internationalization and firm performance",
  "abstract": "Alliance research has traditionally focused on structural and relational aspects of the networks in which firms are situated, paying less attention to the inherent characteristics of their partners. This study introduces the notion of alliance portfolio internationalization (API), which refers to the degree of foreignness of partners in a firm's collection of immediate alliance relationships. We develop a framework to explain how API impacts firm performance. We suggest that as a firm's API increases, financial performance is expected to initially decline, then improve, and finally decline again. This sigmoid relationship between API and financial performance is ascribed to evolving learning effects that shape the net benefits of API. When the firm's alliance portfolio, on average, consists of proximate foreign partners, the firm may fail to recognize latent national differences, but at moderate levels of API, its absorptive capacity and specialized collaborative routines support the exchange of valuable network resources. Nevertheless, high levels of API undermine firm performance because of the failure of collaborative routines and mounting liabilities of cross-national differences. We test the framework using data on the alliance portfolios of U. S.-based software firms from 1990 to 2001. The results provide support for the sigmoid relationship as well as for our predictions that firms, which have gained experience with foreign partners and maintained wholly owned subsidiaries in their partners' countries of origin, can overcome some of the liabilities of API and better leverage its benefits.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d2f97e3eb41262dc464b41ad7702ef2",
  "timestamp": "2025-05-15T00:35:17.439725"
}