{
  "id": 9204,
  "title": "Factors associated with inadequate receipt of components and non-use of antenatal care services in India: a regional analysis",
  "abstract": "Background:Failure to use antenatal care (ANC) and inadequate receipt of components of ANC pose a significant risk for the pregnant woman and the baby. This study aimed to examine a regional analysis of factors associated with receiving no ANC and inadequate receipt of components of ANC services among Indian women. MethodIn:formation from 173,970 women of reproductive age 15-49 years from the 2019-21 India National Family Health Survey (NFSH-5) was analysed. Logistic regression analyses that adjusted for cluster and survey weights were conducted to assess the socio-demographic and other factors associated with receiving non-use of ANC and inadequate receipt of components of ANC, respectively, in the six regions and 28 states, and 8 union territories in India. Results:Across regions in India, 7% of women reported no ANC, and the prevalence of inadequate and adequate receipt of components of ANC in all six regions ranged from 67 to 89% and 8% to 24%, respectively. Of all the 36 federated entities, the prevalence of inadequate receipt of ANC components was less than two-thirds in Tamil Nadu, Puducherry, Andaman and the Nicobar Islands, Odisha, and Gujarat. Our analyses revealed that associated factors vary by region, state, and union territories. Women from poor households reported increased odds of receiving no ANC in North, East and North-eastern regions. Women who reported no schooling in South, East and Central regions were associated with increased odds of receiving no ANC. Women from poor households in Himachal Pradesh, Bihar, Uttar Pradesh, Nagaland, Manipur, Uttar Pradesh, and Madhya Pradesh states reported significantly higher odds of inadequate components ANC than women from rich households. The receipt of inadequate components of ANC was significantly higher among women who never read magazines in Delhi, Ladakh, Karnataka, Telangana, Jharkhand, Maharashtra, Uttar Pradesh, Chhattisgarh, Arunachal Pradesh, Manipur, and Mizoram states in India. Conclusion:A better understanding of the factors associated with and incorporating them into the short- and long-term intervention strategies, including free financial support from the Indian government to encourage pregnant women from lower socioeconomic groups to use health services across all regions, states and union territories.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d42624abff3fb58303c464b208255b1",
  "timestamp": "2025-05-15T03:26:26.039540"
}