{
  "id": 3101,
  "title": "Pleiotropic β-agonist-promoted receptor conformations and signals independent of intrinsic activity",
  "abstract": "beta-Agonists used for treatment of obstructive lung disease have a variety of different structures but are typically classified by their intrinsic activities for stimulation of CAMP, and predictions are made concerning other downstream signals based on such a classification. We generated modified beta(2)-adrenergic receptors with insertions of energy donor and acceptor moieties to monitor agonist-promoted conformational changes of the receptor using intramolecular bioluminescence resonance energy transfer in live cells. These studies suggested unique conformations stabilized by various agonists that were not based on their classic intrinsic activities. To address the cellular consequences of these differences, G(s)-coupling, G(i)-coupling (p44/p42 activation), G protein-coupled receptor kinase-mediated receptor phosphorylation, internalization, and down-regulation were assessed in response to isoproterenol, albuterol, terbutaline, metaproterenol, salmeterol, formoterol, and fenoterol. In virtually every case, agonists did not maintain the classic rank order, indicating that distinct signaling is evoked by beta-agonists of different structures, which is unrelated to intrinsic activity. The extensive pleiotropy of agonist responses shown here suggests that classification of agonists by cAMP-based intrinsic activity is inadequate as it pertains to other intracellular events and that it may be possible to engineer a beta-agonist that stabilizes conformations that evoke an ideal portfolio of signals for therapeutic purposes.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d47b5c2d3aed1123999ba9c1a5d9e3e",
  "timestamp": "2025-05-15T01:13:45.131475"
}