{
  "id": 863,
  "title": "OPTIMAL MANAGEMENT OF OFFSHORE WIND ASSETS AT DIFFERENT STAGES OF LIFE EXTENSION ACCOUNTING FOR UNCERTAINTY PROPAGATION",
  "abstract": "The objective of the present study is to develop an optimal life extension management strategy for ageing offshore wind farms. The optimal management strategy is attained by minimising the overall risk of a group of different assets based on the principles of the modern portfolio theory. The statistical measures regarding the risk and expected return are obtained through a probabilistic techno-economic assessment, which considers the mean wind speed, capacity factor, degradation severity, initial crack size and feed-in tariff as stochastic variables. The expected return accounts for the time-weighted incremental free cash flows. The risk and return of the offshore wind farm are investigated under optimistic, moderate, and pessimistic scenarios. Finally, the optimal allocation (portfolio) of offshore wind assets attained based on the mean-variance optimisation is presented for the different stages of the life extension of the offshore wind farms accounting for the uncertainty propagation during the life extension. The uncertainty propagation is reflected in the correlation and variability between the offshore wind turbines and their operation. The results indicate that a significant risk reduction can be achieved by employing an offshore wind asset allocation according to the risk-adjusted portfolio. Also, the benefit of using a risk-adjusted allocation increases as the life extension moves on. The outcome of the present study can be useful for the feature engineering part of the deep neural network training for the classification of ageing offshore wind turbines.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d4b367fe80fac6d8fd53d1a0620c59e",
  "timestamp": "2025-05-15T00:49:03.150932"
}