{
  "id": 5627,
  "title": "Development of a dynamic risk system for predicting the risk of recurrence and progression in patients with non-muscle-invasive bladder cancer after thulium laser resection of bladder tumor or transurethral resection of bladder tumor followed by intravesical BCG instillation",
  "abstract": "BackgroundThe high recurrence rate of non-muscle-invasive bladder cancer (NMIBC) after tumor resection brings huge physical and financial burdens for patients. Several predictive models that predict the recurrence of patients with NMIBC have drawbacks in clinical practice. With the rapid development of therapeutic methods, more factors should be taken into consideration when constructing predictive model. MethodsWe retrospectively enrolled 90 patients who were diagnosed as intermediate- or high-risk NMIBC and received a Thulium laser resection of bladder tumor (TmLRBT) or transurethral resection of bladder tumor (TURBT) followed by BCG instillation. Univariate Cox regression analysis and multivariate Cox regression analysis were performed to screen out the independent prognostic factors of recurrence free survival (RFS). A nomogram and risk index were constructed using these prognostic factors. ResultsIn this study, 22 patients suffered recurrence; 37 patients (41%) received TmLRBT, and over 90% patients completed intravesical BCG instillation for one year. The univariate Cox regression showed that surgery (TURBT vs TmLRBT), previous bladder tumor, tumor number, pathological stage, post-operative catheterization and number of BCG therapy were associated with RFS. The multivariate Cox regression revealed that surgery (TURBT vs TmLRBT) (HR = 3.16, 95%CI [1.02 - 9.83]); previous bladder tumor (HR = 4.03, 95%CI [1.41 - 11.54]); number of BCG therapy (HR = 0.89, 95%CI [0.84 - 0.95]) were independent prognostic factors. A nomogram was constructed and exhibited excellent capability in predicting the RFS with an AUC of 0.789, 0.848, 0.806 at 6-, 12- and 24-months respectively and a c-index of 0.822. Also, the calibration curve and decision curve analysis were performed to verify the predictive efficacy. The risk index was derived from the nomogram and also exhibited favorable capability in predicting the progression free survival (PFS) of patients. ConclusionsPatients who received TmLRBT, without previous bladder tumor history and had more intravesical BCG instillations are likely to have better RFS. The nomogram and the risk index which were constructed to predict the RFS and PFS of patients may help urologists to make clinical decisions and aid in precision medicine.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d4f120b17eeb58b36c4082d411457d5",
  "timestamp": "2025-05-15T02:49:50.250668"
}