{
  "id": 5521,
  "title": "An Empirical Study on the Economic Impact of Cybersecurity Breaches and Computer Fraud on SMEs",
  "abstract": "Small and Medium Enterprises (SMEs) are indispensable for economic development; however, they are highly susceptible to cyber attacks and computer fraud. This research empirically investigates the financial implications of cyber risks to SMEs in terms of monetary losses, reputational backlash, business continuity break and remediation costs. This research adopts a mixed-methods approach, with primary data collected via structured surveys and interviews with SME owners, IT managers, and cybersecurity experts, and secondary data obtained from industry reports and case studies. Regression analysis was utilized to determine the relationship between cybersecurity incidences and business performance through descriptive and inferential statistical techniques. The results show that cyber-risk incidents bring about considerable financial losses, reduced customer confidence, regulatory penalty payments (fines) that have long-term implications for SMEs. The study concludes that there is a strong need for robust cybersecurity frameworks, better awareness programs, and regulatory interventions to mitigate risks associated with the Internet of Things (IoT). These insights can help policymakers better support the small business sector to improve protections against cyberattackers, and as this research shows, small businesses can take certain actions to minimize their own economic vulnerability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d7de0ef378fa42a22bba35bcbb50174",
  "timestamp": "2025-05-15T02:48:51.280783"
}