{
  "id": 6517,
  "title": "Economic management of health crises affecting production animals in Europe",
  "abstract": "The importance of animal health crises has considerably increased over the last few years. When a crisis occurs, farmers can receive financial support through various public, private and mixed compensation schemes. Economic losses resulting from diseases may be direct and indirect. If a disease is covered by European Union regulations then countries have a legal obligation to partly compensate farmers for direct losses, either directly through the national budget, or through a specific fund. The European Veterinary Fund also co-finances these losses. Only a few countries provide compensation for indirect losses. The private insurance sector also provides protection against some direct and indirect losses but the risks covered are variable. To encourage farmers to subscribe to this kind of insurance, some public authorities provide subsidies to help pay the premium. Insurance companies do not generally cover the risks linked to contagious diseases, but some companies do extend cover to include this type of risk. Several alternatives, such as mutual funds, are available to improve risk coverage. There is a lack of harmonisation among the various compensation schemes of different countries. Public authorities cannot provide full compensation, but mutual funds and private insurance companies are alternatives that should be further investigated and their use should be extended to other countries. A classification of diseases would harmonise the situation at the European level.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4d94976ac9ebe18dfa9c886215cafaf5",
  "timestamp": "2025-05-15T02:59:07.401644"
}