{
  "id": 5140,
  "title": "Prediction of the trajectories of depressive symptoms among children in the adolescent brain cognitive development (ABCD) study using machine learning approach",
  "abstract": "Background: Depression often first emerges during adolescence and evidence shows that the long-term patterns of depressive symptoms over time are heterogeneous. It is meaningful to predict the trajectory of depressive symptoms in adolescents to find early intervention targets.Methods: Based on the Adolescent Brain Cognitive Development Study, we included 4962 participants aged 9-10 who were followed-up for 2 years. Trajectories of depressive symptoms were identified by Latent Class Growth Analyses (LCGA). Four types of machine learning models were built to predict the identified trajectories and to obtain variables with predictive value based on the best performance model.Results: Of all participants, 536 (10.80%) were classified as increasing, 269 (5.42%) as persistently high, 433 (8.73%) as decreasing, and 3724 (75.05%) as persistently low by LCGA. Gradient Boosting Machine (GBM) model got the highest discriminant performance. Sleep quality, parental emotional state and family financial adversities were the most important predictors and three resting state functional magnetic resonance imaging functional connectivity data were also helpful to distinguish trajectories. Limitation: We only have depressive symptom scores at three time points. Some valuable predictors are not specific to depression. External validation is an important next step. These predictors should not be interpreted as etiology and some variables were reported by parents/caregivers. Conclusion: Using GBM combined with baseline characteristics, the trajectories of depressive symptoms with two years among adolescents aged 9-10 years can be well predicted, which might further facilitate the identification of adolescents at high risk of depressive symptoms and development of effective early interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4da05fb04f12a991b95946a8e4a2d7bc",
  "timestamp": "2025-05-15T02:44:43.913554"
}