{
  "id": 1344,
  "title": "Manifold feature index: A novel index based on high-dimensional data simplification",
  "abstract": "The current stock index design models typically consider financial factors, such as market capitalization and free-float, regardless of stock price changes. Their constituent selection strategies are based on the ranking and determined by experts in exchanges or financial services. In this paper, we develop a novel stock index model, namely, the manifold feature (MF) index, to reflect the overall price activity of the entire stock market. The MF index is designed using the manifold learning theory and a harmonic analysis method. To our knowledge, it is the first time to do so in expert/intelligent systems to design stock index. Specifically, according to the manifold learning theory, the studied stock dataset is assumed to be a low-dimensional manifold embedded in a higher-dimensional Euclidean space. After data preprocessing, a harmonic analysis method is performed. That is, the discrete Laplace-Beltrami operator (LBO) matrix defined on the stock dataset, which forms a low-dimensional manifold, is firstly constructed. Then, the eigenvectors of LBO are calculated, and the feature points on the eigenvectors are detected. The stocks corresponding to these feature points are considered as the constituent stocks of the MF index. Finally, the MF index is generated by a weighted formula using the price and market capitalization of these constituents. Moreover, we propose four metrics to compare the MF index series and the Shanghai Stock Exchange (SSE) index series (SSE 50, SSE 100, SSE 150, SSE 180 and SSE 380), and the MF indexes are better than the SSE indexes in two aspects: On one hand, from the perspective of data approximation, MF indexes are closer to the stock market than the SSE index series. On the other hand, from the perspective of risk premium, MF indexes have higher stability and lower risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4db8fe3e00634938864dc3165918c68f",
  "timestamp": "2025-05-15T02:01:44.827569"
}