{
  "id": 6388,
  "title": "Medicare's Hospital-Acquired Conditions Policy: A Problem of Nonpayment After Total Joint Arthroplasty",
  "abstract": "Background: Total joint arthroplasty (TJA) utilization continues to increase, and optimizing efficiency while reducing complications is critical to provide a sustainable product. Recent policy has defined several hospital-acquired conditions (HACs) that are the target of reducing complications with significant financial implications. The present study defines the incidence of HACs after TJA as well as patient and hospital factors associated with HACs. Methods: The National Inpatient Sample (NIS) was used to identify all patients from 2009 to 2011 undergoing elective total hip or knee arthroplasty. Patient demographics, comorbidities, and hospital characteristics were obtained from the database, and HACs defined according to established International Classification of Diseases, Ninth Revision, Clinical Modification criteria. The incidence of HACs after TJA was calculated, as were demographic factors and preadmission comorbidities associated with HACs using bivariate and multivariable analysis. Results: The overall incidence of HACs after TJA was 1.3%. Several patient and hospital factors, including increased age, female gender, black race, medium hospital bed size, year of surgery, and Charlson Comorbidity Index >= 1, independently predicted development of a HAC. When evaluating the financial impact of the development of a HAC after TJA, more than 200 million dollars in hospital costs would be lost during the inclusive years of this study, equating to nearly 70 million dollars annually. Conclusion: The incidence of HACs after TJA is 1.3%. Many of the patient factors associated with HACs are nonmodifiable, and risk adjustment should be considered to provide a sustainable product to a diverse patient population. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4dbb9d377d890ca17f5579fa40bfbb7d",
  "timestamp": "2025-05-15T02:57:38.757410"
}