{
  "id": 3983,
  "title": "Optimism, Lifetime Financial Stressors, and Mental Health Among Racially, Sexually, and Gender Minoritized Emerging Adults",
  "abstract": "BackgroundAlthough racially, sexually, and gender minoritized (RSGM) persons experience chronic and sometimes severe financial life stressors that increase their risk of mental health problems across the life course, no studies in this population have examined psychological resilience factors, such as optimism, that may mitigate these negative effects.PurposeTo investigate how exposure to financial stressors is associated with symptoms of anxiety, depression, and somatization, and whether optimism moderates these associations.MethodTwo hundred and eighty-five RSGM emerging adults (Mage = 25.18, SD = 1.94) completed the Stress and Adversity Inventory and Brief Symptom Inventory online. Participants were Black (22.1%), Latinx (57.9%), and biracial Black-Latinx (20%), and they primarily identified as male (94.7%) and gay (74.2%).ResultsAs hypothesized, multiple regression analyses with interaction terms indicated that more frequent and severe acute and chronic lifetime financial stressors were related to greater anxious, depressive, and somatic symptoms. Moreover, greater optimism was associated with fewer mental health symptoms. Additionally, greater optimism was associated with fewer somatic symptoms than lower optimism when exposed to more financial stressors. Similarly, greater optimism attenuated the negative effects of greater financial stressors' severity on depressive symptoms.ConclusionsFinancial stressors are related to worse mental health among RSGM emerging adults, and optimism may mitigate these effects. Screening for lifetime financial stressors and bolstering optimism may help reduce mental health disparities related to financial stressors in this population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4dc340abffe3e505f3ba8518f41f4e03",
  "timestamp": "2025-05-15T02:31:58.634816"
}