{
  "id": 8352,
  "title": "The impact of social unrest and pandemic on mental health of young people in Hong Kong: The transdiagnostic role of event-based rumination",
  "abstract": "Objective: Co-occurring population-level events, such as social unrest and coronavirus disease 2019, are observed in many societies today. Few studies have explored their combined mental health effects on young people. While self-focused rumination has been suggested to be a key mechanism underlying depression, the role of event-based rumination in mediating the impact of population stressors has yet to be elucidated. Methods: Data were collected from 6988 young people in a large-scale community online survey in Hong Kong. The survey assessed symptoms of post-traumatic stress disorder and depression, direct exposure to social unrest-related traumatic events, coronavirus disease 2019 pandemic-related events, personal stressful life events, event-based rumination and other individual risk factors. Results: High levels of comorbid post-traumatic stress disorder and depressive symptoms were observed. Logistic regression analysis revealed that probable post-traumatic stress disorder was associated with traumatic events (odds ratio = 1.73, 95% confidence interval = [1.64, 1.82]), pandemic-related events (odds ratio = 1.08, confidence interval = [1.01, 1.16]), stressful life events (odds ratio = 1.20, confidence interval = [1.21, 1.37]), high event-based rumination (odds ratio = 3.00, confidence interval = [2.58, 3.48]), lower resilience (odds ratio = 1.18, confidence interval = [1.15, 1.21]), higher smartphone reliance (odds ratio = 1.09, confidence interval = [1.05, 1.13]) and financial concerns (odds ratio = 1.25, confidence interval = [1.18, 1.33]). The odds for probable post-traumatic stress disorder was also significantly higher when two or more traumatic events were experienced (odds ratio = 4.03, confidence interval = [3.52, 4.62]). Factors associated with moderate-to-severe level depressive symptoms were similar. Event-based rumination significantly mediated between different types of external events (traumatic events, pandemic-related events, stressful life events) and both post-traumatic stress disorder and depressive symptoms. Conclusion: These findings suggest that diverse types of stressful events during population-level crises could add to personal stressors to affect mental health outcomes in young people. Among other protective and risk factors, event-based rumination presented as a prominent transdiagnostic mediator for different symptom dimensions which may be a potentially important target for early risk detection and intervention.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4dccf588e60a30c15e8f9336d01a6e83",
  "timestamp": "2025-05-15T03:17:49.193519"
}