{
  "id": 7212,
  "title": "Not All Homes Are Safe: Family Violence Following the Onset of the Covid-19 Pandemic",
  "abstract": "Evidence from victim service providers suggests the COVID-19 pandemic led to an increase in family violence. However, empirical evidence has been limited. This study uses novel survey data to investigate the occurrence of family violence during the early months of the COVID-19 pandemic in the United States. Data come from the second wave of the Assessing the Social Consequences of COVID-19 study, an online non-probability sample collected in April and May 2020. Family violence is measured using four variables: any violence, physical violence, verbal abuse, and restricted access. The authors use logistic regression and KHB decomposition to examine the prevalence of family violence during the COVID-19 pandemic. We find that sexual minorities, in particular bisexual people, experienced higher rates of family violence than heterosexual respondents. Women were the only group to report an increase in the frequency of family violence. Household income loss is associated with the incidence of verbal violence. Our findings demonstrate the importance of expanding victim services to address the additional barriers victims face within the pandemic context and beyond, including broad contexts of social isolation and financial precarity experienced by individuals at risk of family violence.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4dce26b7e2ea46b66bc0b28e7ea60350",
  "timestamp": "2025-05-15T03:06:01.344581"
}