{
  "id": 403,
  "title": "Comparing the Hedging Effectiveness of Weather Derivatives Based on Remotely Sensed Vegetation Health Indices and Meteorological Indices",
  "abstract": "Weather derivatives are considered a promising agricultural risk management tool. Station-based meteorological indices typically provide the data underlying these instruments. However, the main shortcoming of these weather derivatives is an imperfect correlation between the weather index and the yield of the insured crop, called basis risk. This paper considers three available remotely sensed vegetation health (VH) indices, namely, the vegetation condition index (VCI), the temperature condition index (TCI), and the vegetation health index (VHI), as indices for weather derivatives in a German case study. We investigated the correlation and period of highest correlation with winter wheat yield. Moreover, we analyzed whether the use of remotely sensed VH indices for weather derivatives can reduce basis risk and thus improve the performance of weather derivatives. The two commonly used meteorological indices, precipitation and temperature sums, were employed as benchmarks. Quantile regression and index value simulation were used for the design and pricing of the weather derivatives. The analysis for the selected farms and corresponding counties in northeastern Germany revealed that, on average, the VHI resulted in the highest correlation with winter wheat yield, and VHI-based weather derivatives were also superior in terms of the hedging effectiveness. The total periods of the highest correlations ranged from the beginning of April to the end of July. VHI- and VCI-based weather derivatives led to statistically significant reductions of basis risk, compared to the benchmarks. Our results indicate that the VHI-based weather derivatives can be useful alternatives to meteorological indices, especially in regions with sparser weather station networks.",
  "year": 2018,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4de188a9b931f034259d3533455658ec",
  "timestamp": "2025-05-15T01:31:50.634274"
}