{
  "id": 8206,
  "title": "Cardiovascular prevention at the general practitioner? First results of a study on attitudes, services, success and barriers in practice",
  "abstract": "Cardiovascular prevention at the general practitioner? First results of a study on attitudes, services, success and barriers in practice. Background: There is a lack of detailed data about lifestyle counseling and other cardiovascular preventive services in primary care settings in Germany. The objectives of this study were to analyze the provision of these services and to identify associated factors. Methods: 260 (13%) out of 2,000 randomly selected general practitioners from Southern Germany, took part in this study and were asked about lifestyle counseling and other preventive services as well as barriers and attitudes. Factors associated with lifestyle counseling were analyzed using chi-square tests and logistic regression. Results: Participating physicians had positive attitudes towards health promotion and prevention. Four out of ten physicians counseled the majority of their patients about diet, physical activity, tobacco and alcohol consumption. Female physicians (odds ratio, OR: 1,98), physicians who were confident about their preventive services (OR: 3,55) and those having risk factor questionnaires in the waiting room (OR: 2,26; all p < 0,05) were more likely to counsel their patients. The most important barriers towards preventive services were patients' lack of adherence (91 %), inadequate reimbursement (80 %) and lack of time (70 %). Conclusion: There is a discrepancy between the potential and the implementation of cardiovascular-preventive services in primary care settings. Special trainings of physicians as well as better financial and organizational conditions might help to improve the provision of preventive care.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4de3e935a39d6ec580fd03120a35e27b",
  "timestamp": "2025-05-15T03:16:17.453608"
}