{
  "id": 3838,
  "title": "A data-driven framework for predicting weather impact on high-volume low-margin retail products",
  "abstract": "Accurate demand forecasting is of critical importance to retail companies operating in high-volume low-margin industries. Inaccuracies in the forecasts lead either to stock-outs or to excess inventories, resulting in either lost sales or higher working capital, and for both cases in extra unnecessary costs. Prediction accuracy is essential to retail companies having a part of their product portfolio manufactured in low-cost countries and requiring long delivery times. It is rather vital when the demand for these goods is strongly weather dependent. The combination of long delivery times and weather dependence creates a business challenge, as the availability period of accurate weather information is much shorter than the lead time. In this paper we propose a methodology that handles the impact of both the short-term (with available weather data) and the long-term weather uncertainty on the forecast. For the former, the proposed framework is capable of automatically selecting the best prediction model. For latter, the framework fits a distribution on simulated and aggregated sales using the short-term regression model with historical weather data. This framework has been tested on a company's sales data and is proven to satisfactorily address the challenges that the company is facing.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4de744ba2abbc3a97f6221eb7a40d408",
  "timestamp": "2025-05-15T01:21:08.350329"
}