{
  "id": 6580,
  "title": "Unlocking portfolio resilient and persistent risk: A holistic approach to unveiling potential grounds",
  "abstract": "Purpose: This study identifies residual, persistent, or resilient risks that remain even after controls for systematic and sentiment risk and extensive portfolio diversification are applied. Method: This methodology employs the Newey-West regression analysis in conjunction with the Lagrange multiplier method to construct a global minimum variance portfolio. This analysis focuses explicitly on the diversifiable risk component. It uses two benchmarks, the Wilshire 5000 and S&P500, in collaboration with investor sentiment metrics. Its primary objective is to mitigate systematic and idiosyncratic risk by examining three different portfolios (Tourism, Utilities/Energy, and Industrials) comprising 132 individual stocks observed over a span of 17 years. Findings: This study identifies a persistent and resilient residual risk that may be connected to undisclosed uncertainties and emerging risks that are known to exist but are not yet fully materialized. These include potential ramifications from emerging widespread climate disasters, the duration of the recession periods, the effect of uncertainty on merger and acquisition outcomes, and even unknown threats such as the proliferation of new computer viruses and system vulnerabilities, the repercussions of unregulated artificial intelligence, and shifts in individual preferences, beliefs, and behaviours that may influence both investors and society's economic dynamics. All these risks and uncertainties will greatly contribute to a fear of the unknown and subsequently affect financial markets. Novelty: In this study, we extract the systematic and investor sentiment risks for individual socks and construct annual minimum variance portfolios. Our next step was to justify the presence of unknown, persistent, resilient, or residual risk factors. Practical implications: This particular approach provides multiple advantages to investors and regulators. It enables them to construct portfolios with lower levels of risk and proactively mitigate potential sources of risk that are presently little more than possibilities but may evolve into real threats.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4dec5a9b2fc9df7ac092207d9d7e37f0",
  "timestamp": "2025-05-15T02:59:36.958968"
}