{
  "id": 8946,
  "title": "Institutional delivery in rural India: the relative importance of accessibility and economic status",
  "abstract": "Background: Skilled attendance at delivery is an important indicator in monitoring progress towards Millennium Development Goal 5 to reduce the maternal mortality ratio by three quarters between 1990 and 2015. In addition to professional attention, it is important that mothers deliver their babies in an appropriate setting, where life saving equipment and hygienic conditions can also help reduce the risk of complications that may cause death or illness to mother and child. Over the past decade interest has grown in examining influences on care-seeking behavior and this study investigates the determinants of place of delivery in rural India, with a particular focus on assessing the relative importance of community access and economic status. Methods: A descriptive analysis of trends in place of delivery using data from two national representative sample surveys in 1992 and 1998 is followed by a two-level (child/mother and community) random-effects logistical regression model using the second survey to investigate the determinants. Results: In this investigation of institutional care seeking for child birth in rural India, economic status emerges as a more crucial determinant than access. Economic status is also the strongest influence on the choice between a private-for-profit or public facility amongst institutional births. Conclusion: Greater availability of obstetric services will not alone solve the problem of low institutional delivery rates. This is particularly true for the use of private-for-profit institutions, in which the distance to services does not have a significant adjusted effect. In the light of these findings a focus on increasing demand for existing services seems the most rational action. In particular, financial constraints need to be addressed, and results support current trials of demand side financing in India.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4df63045744d54320af6effe9546a32d",
  "timestamp": "2025-05-15T03:23:56.125666"
}