{
  "id": 4930,
  "title": "Risk factors associated with postoperative complications after liver cancer resection surgery in western China",
  "abstract": "Objectives Postoperative complications increase the workload of nursing staff as well as the financial and mental distress suffered by patients. The objective of this study is to identify clinical factors associated with postoperative complications after liver cancer resection surgery. Methods Data from liver cancer resections occurring between January 1st, 2019 to December 31st, 2019 was collected from the Department of Liver Surgery in West China Hospital of Sichuan University. The Kruskal-Wallis test and logistic regression were used to perform single-factor analysis. Stepwise logistic regression was used for multivariate analysis. Models were established using R 4.0.2 software. Results Based on data collected from 593 cases, the single-factor analysis determined that there were statistically significant differences in BMI, incision type, incision length, duration, incision range, and bleeding between cases that experienced complications within 30 days after surgery and those did not. Stepwise logistic regression models based on Kruskal-Wallis test and single-factor logistic regression determined that BMI, incision length, and duration were the primary factors causing complications after liver resection. The adjust OR of overweight patients and patients with obesity (stage 1) compared to low weight patients were 0.12 (95% CI:0.02-0.72) with p = 0.043 and 0.18 (95% CI:0.03-1.00) with p = 0.04, respectively. An increase of 1 cm in incision length increased the relative risk by 13%, while an increase of 10 min in surgical duration increased the relative risk by 15%. Conclusions The risk of postoperative complications after liver resection can be significantly reduced by controlling factors such as bleeding, incision length, and duration of the surgery.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e0732002b52dda5f771ac31cc7a498f",
  "timestamp": "2025-05-15T02:42:36.136329"
}