{
  "id": 4900,
  "title": "Locked up at home: a cross-sectional study into the effects of COVID-19 lockdowns on domestic violence in households with children in Belgium",
  "abstract": "Background Policymakers worldwide took measures to limit the spread of the COVID-19-virus. While these sanitary measures were necessary to fight the spread of the virus, several experts warned for a significant impact on mental health and a potential increase in domestic violence. To study the impact of the COVID-19 measures in Belgium, and the factors influencing the occurrence of domestic violence, we set up the study on relationships, stress, and aggression. In this study, we evaluate the prevalence of domestic violence victimization during the COVID-19 lockdown in Belgian children aged zero to seventeen years and the associations of the parents' financial status, relationships, mental health, and previous victimization to the child's victimization. Methods A stepwise forward binary logistic regression was used to analyse the association between multiple risk factors of domestic violence and victimization of the respondent's child. The respondent being an assailant, the respondent's age, and the age of the children in the household were added as moderators. Results In this model an association with domestic child abuse was found for the age of the respondent, the household's size, the presence of children between zero and five years in the household, the perceived stress level of the respondent, and victimization of the respondent during the first wave of the sanitary measures, as well as victimization before the COVID-19 pandemic. None of the interacting effects were found to be significant. Conclusion It is advisable to make extra efforts to improve well-being when maintaining sanitary measures by providing appropriate assistance and helping households struggling with increased or acute stress to install positive coping strategies - especially in larger households with children between six and 17 years. Besides, our findings draw attention to the clustering of risk of child and adult violence exposure in lockdown situations as well as to the potential cumulative impact of exposure to violence across the lifespan and across generations. It is key to invest in training healthcare workers and staff at schools to screen for and assess risks of domestic violence development and ongoing or past occurrence in order to detect, refer and follow-up on families at risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e073655d2b421b52d88f237ccf95f8f",
  "timestamp": "2025-05-15T02:42:04.916394"
}