{
  "id": 645,
  "title": "Alternative Scoring Factors using Non-Financial Data for Credit Decisions in Agricultural Microfinance",
  "abstract": "Financial exclusion has a major socio-economic impact on the poor and unbanked. Financially excluded smallholder farmers face challenges accessing credit facilities to fund their farming activities because they lack the financial history data required to create credit scores for credit risk evaluations. Non-financial data sources such as mobile applications have been proposed for the development of credit scoring models. However, context-specific alternative scoring factors which are independent of financial history information, must be developed for credit decision systems that use non-financial data. This research proposes an approach to developing alternative scoring factors based on stakeholder's requirements. An example of implementation of the proposed method is given using data collected from farmers in rural Cambodia through surveys and a mobile application. Alternative scoring factors are developed based on stakeholder's requirements and collected data. Multiple logistic regression and support vector machine models are trained and tested on this data to evaluate the selected factors. Models are compared by area under the receiver operating characteristics curve values and accuracy. Additional considerations are made to determine the most suitable model in this context. This stakeholder requirements-based approach can be used to design credit decision systems using non-financial data for financially excluded persons and facilitates greater financial inclusion.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e1207c601a843826583d5f39a1f9dd7",
  "timestamp": "2025-05-15T01:53:24.881762"
}