{
  "id": 2799,
  "title": "Dynamic Co-Movements among Oil Prices and Financial Assets: A Scientometric Analysis",
  "abstract": "In this study, we examined the extant literature on the dynamic association between oil prices and financial assets with special emphasis on the methodologies for measuring the dependence among oil prices, exchange rates, stock prices, energy markets, and assets related to sustainable finance. We performed a scientometric review of the structure and global trends of the dynamic association among oil prices and financial assets, based on research from 1982 to 2022 (September) using techniques such as the analysis of (i) sources, (ii) authors, (iii) documents, and (iv) cluster analysis. A total of 746 bibliographic records from Scopus and Web of Science databases were analyzed to generate the study's research data through scientometric networks. The findings indicate that the most promising areas for further research in this field are represented by co-movement, copula, wavelet, dynamic correlation, and volatility analysis. Furthermore, energy markets and assets related to sustainable finance emerge as crucial trends in investigating dynamic co-movements with oil prices. They also suggest a research gap in analyzing by means of machine learning, deep learning, big data, and artificial intelligence for measuring dynamic co-movements among oil prices and assets in financial and energy markets, especially in emerging countries. Thus, these methodologies can be implemented in further research because these methods could more robustly quantify the association among such variables. The analysis provides researchers and practitioners with a comprehensive understanding of the existing literature and research trends on the dynamic association among oil prices and financial assets. It also promotes further studies in this domain. The identification of these relations presents benefits in risk diversification, hedges, speculation, and inflation targeting.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e1fa62ee2c74e89aad5406aadcd812f",
  "timestamp": "2025-05-15T02:19:08.480230"
}