{
  "id": 6916,
  "title": "Resource utilization among neonatologists in a university children's hospital",
  "abstract": "Objective. We studied factors affecting length of hospital stay and resulting hospital charges among patients managed by two separate groups of neonatologists in the same academic health science center. Design. Retrospective analysis of clinical and financial data base information. Methods. Neonatal intensive care was provided in the same acute care nursery in a large university children's hospital by: (1) neonatologists in a full-time academic division (group A) and (2) a group associated with a private managed care organization (group B). Clinical and financial parameters of all neonates admitted in fiscal year 1994 were compared for the two provider groups. Stepwise regression analysis was used to evaluate factors influencing hospital charges and length of hospital stay (LOS) and to adjust for differences in clinical variables between the two groups. Results. Group A physicians provided care for 340 infants, while 137 were treated by those of group B. Group A included older patients, more outborns, more level III patients, more sepsis, more intermittent positive pressure ventilation, and more patent ductus arteriosus. The incidence of transient tachypnea of the newborn was higher among group B patients. Hospital charges were primarily determined by LOS, which was similar for the two groups. When the data were corrected for differences in risk and patient acuity, however, a significant relationship between physician group and LOS was demonstrated, with LOS being an average of 7.8 days shorter for group A. A net reduction of $3 114 969 in hospital charges might have been realized had group A physicians provided care for all study patients. Conclusions. Hospital charges were determined by LOS. In this setting, academic neonatologists produced shorter LOS and comparable clinical outcomes, despite caring for a population at greater risk. The reduction in LOS could have resulted in more than $3.1 million in annualized savings had the academic group provided care for all of the study patients.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e3a2a8b53e7e893ef51b51d1d4ec59e",
  "timestamp": "2025-05-15T03:03:13.391660"
}