{
  "id": 5512,
  "title": "Prevalence and associated risk factors of Brucella abortus and Brucella melitensis in humans and cattle populations: A comprehensive study",
  "abstract": "A zoonotic disease unique to South Asia, brucellosis causes major public health and financial problems, notably in Pakistan. This research aimed to ascertain the molecular frequency of Brucella abortus and Brucella melitensis in humans and cattle and to pinpoint related risk factors in the Southern Khyber Pakhtunkhwa, Pakistan, districts. A total of 800 blood samples, 600 from cattle and 200 from humans, were gathered and examined using traditional PCR targeting the IS711 locus. In humans, the molecular frequency of Brucella melitensis and Brucella abortus was 16.5 %; in cattle, it was 9.1 %. Risk factor analysis in cattle revealed that seasonality, geographic location, sex, and insemination method significantly impacted brucellosis prevalence & sdot; Higher risk was observed in female cattle, those naturally inseminated, and during the summer months, particularly in regions such as Bannu & sdot; In humans, univariate logistic regression identified potential risk factors, including age (25-50 years), rural residency, lower socioeconomic status, female gender, direct contact with animals, and consumption of raw animal products. However, none of these factors reached statistical significance. The findings underscore the importance of continuous surveillance and targeted preventive measures to control brucellosis transmission between cattle and humans. Understanding the molecular prevalence and risk factors can guide public health strategies and improve livestock management practices to mitigate this zoonotic disease.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e4359ee1f3ae6e732a314a5c39a2b0b",
  "timestamp": "2025-05-15T02:48:23.844116"
}