{
  "id": 5921,
  "title": "Association Between Choroidal Thickness and Myopic Maculopathy in a Japanese Population: The Hisayama Study",
  "abstract": "Purpose: To examine the association between choroidal thickness and myopic maculopathy in a general Participants: A total of 2841 residents of a Japanese community aged > 40 years, who consented to participate and had available data of choroidal thickness and fundus photographs, were enrolled in this study. Methods: The choroidal thickness was measured by swept-source OCT. Participants were divided into quartiles of choroidal thickness. Myopic maculopathy was defined according to the classification system of the Meta-analysis of Pathologic Myopia Study Group. Main outcome measures were odds ratios (ORs) of choroidal thickness for prevalent myopic maculopathy. The ORs and 95% confidence intervals (CIs) were estimated using a logistic regression model. Results: Eighty-one participants had myopic maculopathy (45 diffuse chorioretinal atrophy, 31 patchy chorioretinal atrophy, and 5 macular atrophy). Individuals in the lowest quartile of choroidal thickness had a significantly greater OR for the presence of myopic maculopathy than those in the highest quartile of choroidal thickness (OR: 4.78 [95% CI: 1.78-16.72]) after adjusting for confounders, including axial length. The sensitivity analysis among the 1176 myopic individuals with axial length of > 24.0 mm also showed that thinner choroidal thickness was significantly associated with prevalent myopic maculopathy. Conclusions: The present study demonstrated the significant inverse association between choroidal thickness and the likelihood of myopic maculopathy, suggesting that the measurement of choroidal thickness in addition to axial length would be useful for assessing the risk of myopic maculopathy and elucidating its pathogenesis. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology Science 2023;3:100350 2023 Published by Elsevier Inc. on behalf of the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e508f75626eae2ec259deddd5793606",
  "timestamp": "2025-05-15T02:53:03.028213"
}