{
  "id": 5052,
  "title": "The Effects of Intellectual Capital and Financial Leverage on Evaluating Market Performance",
  "abstract": "This study aimed to identify the key factors that affect the financial market performance (Price-Earnings Model) through a sample of 35 public shareholding industrial companies on the Amman Stock Exchange for the period 2010-2019, using statistical models and methods, such as the Simple Linear Regression Model, Correlation Coefficient, and dispersion board. The study results showed the nonexistence of a statistically significant effect between the intellectual capital and market value added (MVA) and market performance. Results also showed a statistically significant positive effect between financial leverage (FL) and the market performance, where the interpreted variation reached 64%. It showed from the analysis results that the relationship between (MVA) and market performance (P/E) agrees with the study hypotheses, while the result related to (FL) disagrees with the study hypotheses. The study recommends that public shareholding industrial companies should focus more on intellectual capital and show its value in the annual financial statements and reports, and those companies that have high profitability and the chance to hold gains and profits should rely less on debt and more on retained earnings, due to the high risk of debt and in line with the present unstable circumstances in Jordan, especially in light of the global Covid-19 crisis.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e664df7460909c16460df1daf05fb1f",
  "timestamp": "2025-05-15T02:43:40.252982"
}