{
  "id": 3492,
  "title": "Continuing Professional Development of physiotherapists based in community primary care trusts: a qualitative study investigating perceptions, experiences and outcomes",
  "abstract": "Objective To provide an insight into individual physiotherapists' experiences of Continuing Professional Development (CPD), and to gain an understanding of the challenges of undertaking CPD in a geographically dispersed primary healthcare setting. Design A qualitative phenomenological methodology using a one-to-one semi-structured interview technique to achieve an in-depth exploration of this complex area of study. Data analysis was conducted by data transcription, immersion, coding and generation of themes using a pragmatic five-step process. Participants Eleven participants were identified from a study population of physiotherapists working in two local primary care trusts following the principle of maximum variation sampling. Results Four main themes emerged: CPD processes motivation for undertaking CPD; enabling CPD; and Outcomes of CPD. Participants felt that CPD should include a range of activities and learning behaviours. However, there was a preference for active learning styles and formal course-based learning. Engagement in reflective practice and portfolio keeping was generally poor, with participants identifying lack of skills in these areas. Factors motivating CPD engagement included a strong sense of professional obligation and wishing to provide the best possible service to patients. There was frustration over the impact of external issues including political and organisational change on CPD, and anxiety over forthcoming regulatory changes affecting physiotherapy. The study also identified issues around CPD planning and needs identification. There was evidence of change in individuals' practice and internal perceptions as outcomes of CPD, although issues around the application and maintenance of change were identified. Conclusions There is evidence that CPD has an effect on clinical practice in this small group of physiotherapists working in community National Health Service settings. Significantly, undertaking CPD improves confidence as well as competence, enabling individuals to form effective therapeutic relationships with patients and other members of their teams. (C) 2007 Chartered Society of Physiotherapy. Published by Elsevier Ltd. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e6e54ca9e4d5f49242260d00408d0e4",
  "timestamp": "2025-05-15T01:17:54.040281"
}