{
  "id": 3307,
  "title": "RISK MARGIN QUANTILE FUNCTION VIA PARAMETRIC AND NON-PARAMETRIC BAYESIAN APPROACHES",
  "abstract": "We develop quantile functions from regression models in order to derive risk margin and to evaluate capital in non-life insurance applications. By utilizing the entire range of conditional quantile functions, especially higher quantile levels, we detail how quantile regression is capable of providing an accurate estimation of risk margin and an overview of implied capital based on the historical volatility of a general insurers loss portfolio. Two modeling frameworks are considered based around parametric and non-parametric regression models which we develop specifically in this insurance setting. In the parametric framework, quantile functions are derived using several distributions including the flexible generalized beta (GB2) distribution family, asymmetric Laplace (AL) distribution and power-Pareto (PP) distribution. In these parametric model based quantile regressions, we detail two basic formulations. The first involves embedding the quantile regression loss function from the nonparameteric setting into the argument of the kernel of a parametric data likelihood model, this is well known to naturally lead to the AL parametric model case. The second formulation we utilize in the parametric setting adopts an alternative quantile regression formulation in which we assume a structural expression for the regression trend and volatility functions which act to modify a base quantile function in order to produce the conditional data quantile function. This second approach allows a range of flexible parametric models to be considered with different tail behaviors. We demonstrate how to perform estimation of the resulting parametric models under a Bayesian regression framework. To achieve this, we design Markov chain Monte Carlo (MCMC) sampling strategies for the resulting Bayesian posterior quantile regression models. In the non-parametric framework, we construct quantile functions by minimizing an asymmetrically weighted loss function and estimate the parameters under the AL proxy distribution to resemble the minimization process. This quantile regression model is contrasted to the parametric AL mean regression model and both are expressed as a scale mixture of uniform distributions to facilitate efficient implementation. The models are extended to adopt dynamic mean, variance and skewness and applied to analyze two real loss reserve data sets to perform inference and discuss interesting features of quantile regression for risk margin calculations.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e7233cf492e4afbad1656797ff71cc3",
  "timestamp": "2025-05-15T01:15:54.727456"
}