{
  "id": 3586,
  "title": "Machine Learning-Based Decision-Making for Stock Trading: Case Study for Automated Trading in Saudi Stock Exchange",
  "abstract": "Stock markets are becoming the center of attention for many investors and hedge funds, providing them with a wide range of tools and investment opportunities to grow their wealth and participate in the economy. However, investing in the stock market is not trivial. Stock traders and financial advisors are required to frequently monitor market actions, search for profitable companies, and analyze stock price movements to generate various trading ideas (e.g., selecting a stock symbol and making the decision when to enter or exit a trade), potentially leading to investment returns. Therefore, this study aims to address this challenge through exploring the adaptation of machine learning methods combined with risk management techniques to develop a framework for automating the task of stock trading. We evaluated our framework by creating a diverse portfolio containing several companies listed on the Saudi Stock Exchange (Tadawul) and using the simulated trading actions (executed by the framework) to estimate the portfolio's returns for 3.7 years. The findings show that in terms of investment returns, the proposed framework is very promising; it has generated over 86% returns and outperformed almost all hedge funds by the top investment banks in Saudi Arabia.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e73da97606440c8010a2240a0f4dad0",
  "timestamp": "2025-05-15T02:27:54.051729"
}