{
  "id": 8226,
  "title": "Determinants of Enterprises' Capital Structure in Energy Industry: Evidence from European Union",
  "abstract": "The aim of the study is to identify the main determinants of the capital structure of energy industry companies in the European Union. The study was based on a panel of 6122 companies from 25 EU countries, operating between 2011 and 2018. The study used multiple regression analysis. We have obtained strong evidence for a positive relationship between corporate debt and tangibility and size, and a negative relationship for profitability and liquidity. The factors that also affect the share of debt in capital have turned out to be growth (positive relationship) and non-debt tax shield (negative relationship), but the statistical significance of these relationships is ambiguous. We have shown that growth of industry business risk is accompanied by an increase in corporate debt and this is a distinguishing feature of the energy industry. For country-specific capital structure determinants, we have obtained strong evidence for the negative relationship between GDP growth, the level of stakeholder rights protection, the degree of capital markets development, and indebtedness of the companies studied. There has been moderate support for the hypotheses of a positive effect of inflation, taxation, and the degree of financial institutions development. Our study has also shown a negative impact of the volume of energy consumption and the share of renewable sources in its production and a positive impact of market monopolization on the indebtedness of companies from the energy industry in the EU.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e7b2476e07e55377552ad6b45ac625a",
  "timestamp": "2025-05-15T03:16:48.880067"
}