{
  "id": 2474,
  "title": "Influence of financial productivity incentives on the use of preventive care",
  "abstract": "PURPOSE: We examined whether physician factors, particularly financial productivity incentives, affect the provision of preventive care. SUBJECTS AND METHODS: We surveyed and reviewed the charts of 4,473 patients who saw 1 of 169 internists from 11 academically affiliated primary care practices in Boston. We abstracted cancer risk factors, comorbid conditions, and the dates of the last Papanicolaou (Pap) smear, mammogram, cholesterol screening, and influenza vaccination. We obtained physician information including the method of financial compensation through a mailed physician survey. We used multivariable logistic regression to examine the association between physician factors and four outcomes based on Health Plan Employer Data and Information Set (HEDIS) measures: (1) Pap smear within the prior 3 years among women 20 to 75 years old; (2) mammogram in the prior 2 years among women 52 to 69 years old; (3) cholesterol screening within the prior 5 years among patients 40 to 64 years old; and (4) influenza vaccination among patients 65 years old and older. All analyses accounted for clustering by provider and site and were converted into adjusted rates. RESULTS: After adjustment for practice site, clinical, and physician factors, patients cared for by physicians with financial productivity incentives were significantly less likely than those cared for by physicians without this incentive to receive Pap smears (rate difference, 12%; 95% confidence interval [CI]: 5% to 18%) and cholesterol screening (rate difference, 4%; 95% CI: 0% to 8%). Financial incentives were not significantly associated with rates of mammography (rate difference, -3%; 95% CI: -15% to 10%) or influenza vaccination (rate difference, -13%; 95% CI: -28% to 2%). CONCLUSIONS: Our findings suggest that some financial productivity incentives may discourage the performance of certain forms of preventive care, Specifically Pap smears and cholesterol screening. More studies are needed to examine the effects of financial incentives on the quality of care, and to examine whether quality improvement interventions or incentives based on quality improve the performance of preventive care. (C)2001 by Excerpta Medica, Inc.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e7f038565e0269352800db016754b57",
  "timestamp": "2025-05-15T02:15:59.793095"
}