{
  "id": 654,
  "title": "A study on the financial approach of risk assessment using chemical accident records in chemical process industries",
  "abstract": "Usually, risk assessment is a combination of risk analysis and risk appraisal to evaluate the consequences and frequencies of hazardous events. The acceptability of the exposed risk is also judged in the process. In this regard, the financial risk matrix could be a useful tool based on the frequency and expected loss of damage. Thus, it is adopted in this study where a financial approach has been taken in risk assessment; the proposed methodology uses frequencies from chemical accident records and value at risk (VaR). The methodology consists of mainly five steps. It starts with hazard identification, and is followed by adjustment of history-based accident frequencies by using severity ratios. Then, accident probability and expected damage loss are estimated. The results obtained in the previous two steps are combined to compute VaR for the target process; this value is mapped with financial risk matrix to re-evaluate accident frequency. As an illustrative case, Texas BP refinery accident in 2005 is studied according to the proposed methodology. The results indicate that the financial risk increased from a low level to a medium high level after the occurrence of the tragic accident. As similar accidents frequently occurred for the same process, the risk of the process should have been increased. This proposed method can reflect this dynamic change in risks with the help of accident records and their impacts. (C) 2011 Curtin University of Technology and John Wiley & Sons, Ltd.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e85ce85a53504e56b84b4e96884bd08",
  "timestamp": "2025-05-15T01:40:51.194832"
}