{
  "id": 9127,
  "title": "Factors associated with unsafe abortion practices in Nepal: Pooled analysis of the 2011 and 2016 Nepal Demographic and Health Surveys",
  "abstract": "Background Unsafe abortion contributes to maternal morbidities, mortalities as well as social and financial costs to women, families, and the health system. This study aimed to examine the factors associated with unsafe abortion practices in Nepal. Methods Data were derived from the 2011 and 2016 Nepal Demographic and Health Surveys (NDHS). A total of 911 women aged 15-49 years who aborted five years prior to surveys were included in the analysis. The multivariate logistic regression analysis was employed to determine factors associated with unsafe abortion. Results Unsafe abortion rate was seven per 1000 women aged 15-49 years. This research found that women living in the Mountains (adjusted Odds Ratio (aOR) 2.36; 95% CI 1.21, 4.60), or those who were urban residents (aOR 2.11; 95% CI 1.37, 3.24) were more likely to have unsafe abortion. The odds of unsafe abortion were higher amongst women of poor households (aOR 2.16; 95% CI 1.18, 3.94); Dalit women (aOR 1.89; 95% CI 1.02, 3.52), husband with no education background (aOR 2.12; 95%CI 1.06, 4.22), or women who reported agriculture occupation (aOR 1.82; 95% CI 1.16, 2.86) compared to their reference's group. Regardless of knowledge on legal conditions of abortion, the probability of having unsafe abortion was significantly higher (aOR 5.13; 95% CI 2.64, 9.98) amongst women who did not know the location of safe abortion sites. Finally, women who wanted to delay or space childbirth (aOR 2.71; 95% CI 1.39, 5.28) or those who reported unwanted birth (aOR = 2.33; 95% CI 1.19, 4.56) were at higher risk of unsafe abortion. Conclusion Going forward, increasing the availability of safe abortion facilities and strengthening family planning services can help reduce unsafe abortion in Nepal. These programmatic efforts should be targeted to women of poor households, disadvantaged ethnicities, and those who reside in mountainous region.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e868343983ecae2b9fbeaf5c7dbbcf7",
  "timestamp": "2025-05-15T03:25:54.561185"
}