{
  "id": 8770,
  "title": "Arthroplasty vs proximal femoral nails for unstable intertrochanteric femoral fractures in elderly patients: A systematic review and meta-analysis",
  "abstract": "BACKGROUND Proximal femoral nails (PFNs) are the most common method for the treatment of unstable intertrochanteric femoral fractures (IFFs), but postoperative bed rest is required. There is a large amount of blood loss during the operation. Osteoporosis in elderly patients may cause nonunion of fractures and other complications. Arthroplasty can give patients early weight bearing and reduce financial burden, but whether it can replace PFNs remains controversial. AIM To compare the clinical outcomes of arthroplasty and PFNs in the treatment of unstable IFFs in elderly patients. METHODS A search was conducted in the PubMed, Embase, and Cochrane Library databases and included relevant articles comparing arthroplasty and PFN. The search time was limited from January 1, 2005 to November 1, 2020. Two investigators independently screened studies, extracted data and evaluated the quality according to the inclusion and exclusion criteria. According to the research results, the fixed effect model or random effect model were selected for analysis. The following outcomes were analyzed: Harris Hip score, mortality, complications, operation time, blood loos, hospital stay, weight-bearing time, fracture classification and type of anesthesia. RESULTS We analyzed four randomized controlled trials that met the requirements. A total of 298 patients were included in these studies. According to the AO/OTA classification, there are 20 A1 types, 136 A2 types, 42 A3 types and 100 unrecorded types. Primary outcome: The Harris Hip Score at the final follow-up of the PFN group was higher [mean difference (MD): 9.01, 95% confidence interval (CI): 16.57 to 1.45), P = 0.02]. There was no significant difference between the two groups in the rate of overall mortality [risk ratio (RR): 1.44, P = 0.44] or the number of complications (RR: 0.77, P = 0.05). Secondary outcomes: blood loss of the arthroplasty group was higher (MD: 241.01, 95% CI: 43.06-438.96, P = 0.02); the operation time of the PFN group was shorter (MD: 23.12, 95%CI: 10.46-35.77, P = 0.0003); and the length of hospital stay of the arthroplasty group was shorter [MD: 0.97, 95% CI: 1.29 to 0.66), P < 0.00001]. There was no difference between the two groups in the type of anesthesia (RR: 0.99). There were only two studies recording the weight-bearing time, and the time of full weight bearing in the arthroplasty group was significantly earlier. CONCLUSION Compared with PFN, arthroplasty can achieve weight bearing earlier and shorten hospital stay, but it cannot achieve a better clinical outcome. Arthroplasty cannot replace PFNs in the treatment of unstable IFFs in elderly individuals.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e87263ef833e9e8e85e88ac062ad5da",
  "timestamp": "2025-05-15T03:22:25.982331"
}