{
  "id": 9132,
  "title": "Effect of cardiac rehabilitation on 24-month all-cause hospital readmissions: A prospective cohort study",
  "abstract": "Background: Ageing populations and increasing survival following acute coronary syndrome has resulted in large numbers of people living with cardiovascular disease and at high risk of hospitalizations. Rising hospital admissions have a significant financial cost to the healthcare system. Aim: The purpose of this study was to determine whether cardiac rehabilitation is protective against long-term hospital readmission (frequency and length) following acute coronary syndrome. Methods: Data from 416 Australian patients with acute coronary syndrome enrolled in the Anxiety Depression and heart rate Variability in cardiac patients: Evaluating the impact of Negative emotions on functioning after Twenty four months (ADVENT) prospective cohort study between January 2013-June 2014 was analyzed secondarily. Participants self-reported cardiac rehabilitation attendance over the 12 months post-discharge. All-cause readmission data were extracted from hospital records 24 months post-index event. The association between cardiac rehabilitation and all-cause readmission, frequency of readmissions, and length of stay was assessed using three methods (a) regression analysis, (b) propensity score matching, and (c) inverse probability treatment weighting. Results: Overall, 416 patients consented (53% of eligible patients), of which 414 (99.5%) survived the first 30 days post-discharge and were included in the analysis. Medical records were located for 409 participants after 24 months (98% follow-up rate). In total, 267 (65%) reported attending cardiac rehabilitation; there were 392 readmissions by 239 patients. Cardiac rehabilitation attendance was not associated with all-cause hospital readmission; however, it was associated with lower frequency of hospital admissions (odds ratio 0.53, 95% confidence interval: 0.31-0.91 p-value:0.022) and length of stay (coefficient -1.21 days, 95% confidence interval: -2.46-0.26; marginally significant p-value: 0.055) in adjusted models. Conclusion: This study substantiates the long-term benefits of cardiac rehabilitation on readmissions, including length of stay, which would result in lower costs to the healthcare system.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4e8cbec661598f156840a289da9540b5",
  "timestamp": "2025-05-15T03:25:54.593728"
}