{
  "id": 1803,
  "title": "Z-Score: Does it work?",
  "abstract": "Agriculture is an important part of economy aimed at cultivating the soil, producing food resources and breeding animals. However, such aims are performed by companies which focus mainly on profitability. Several papers discuss issue of profitability of agricultural companies. Furthermore there is number of models that are developed to assess the profitability or bankruptcy risk of the agricultural company. The first and until this day used is Z-Score developed by Edward Altman. However, regarding this model there are several facts that need to be taken into consideration when applying the actual Z-Score. Namely method and variables used for Z-Score development, economic environment in the time of Z-Score creation, economic sector the Z-Score was designed for, etc. However, the most important question that needs to be answered is: Does the Z-Score work for Slovak agricultural cooperatives? This paper is aimed at testing the Altman's Z-Score applicability to Slovak agriculture cooperatives as well as its variables suitability. Furthermore, there is new financial health model suggested as a final component of the paper. Data on enterprises is drawn from Information Sheets of Ministry of Agriculture and Rural Development of the Slovak Republic. The suggested model is based on the year 2011 data with an intention to determine the financial success or failure as accurately as possible. There are mainly two methods considered for creation of model. These are discriminant analysis and logistic regression. Discriminant analysis tends to classify better than logistic regression. However, there are several conditions that have to be met for the correct use of discriminant analysis. Logistic regression does not assume any specific shapes in densities of predictor variables. Furthermore, logistic regression estimates conditional probability, which makes the understanding easier in the conditions of dynamic economic system. Return on equity is chosen as an indicator of financial health and profitability of cooperatives as it gives the information about the net income returned as a percentage of shareholders equity. Z-Score is not appropriate to apply to Slovak agricultural cooperatives in its original form. Explanatory variables used for Z-Score do not satisfy the normality criterion. Furthermore. Z-Score shows weak discriminant ability. Approximately 66% of cooperatives are correctly classified and 22% are classified as indifferent. On the other hand, variables used in Z-Score are suitable to use for classification with addition of new variables which are statistically significant for Slovak agricultural cooperatives. Model is designed using logistic regression due to the nature of the data. Classification ability reaches over 90%. Financial indicators have statistically greater impact on the financial success in agriculture as non-financial indicators. However, percentage of irrigated area has statistically significant impact on financial health.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eaa677188987b76553a20d68ff22313",
  "timestamp": "2025-05-15T02:07:25.769728"
}