{
  "id": 3709,
  "title": "A review of asset management literature on multi-asset systems",
  "abstract": "This article gives an overview of the literature on asset management for multi-unit systems with an emphasis on two multi-asset categories: fleet (a system of homogeneous assets) and portfolio (a system of heterogeneous assets). As asset systems become more complicated, researchers have employed different terms to refer to their specific problems. With an objective to facilitate readers in searching conducive studies to their interests, this paper establishes a novel classification scheme for multi-unit systems in accordance with essential features such as diversity of assets and intervention options. Moreover, discerning differences in characteristics between cross component and cross-asset interactions, we select three types of potential multi-component dependencies (performance, stochastic, and resource) and extend their notions to be applicable to multi-asset systems. The investigation into these dependencies enables the identification of problems that could exist in real industrial settings but are yet to be determined in academia. Ultimately, we delve into modelling approaches adopted by previous researchers. This comprehensive information allows us to offer the insights into the current trends in multi-asset maintenance. We expect that the output of this review paper will not only stress research gaps in multi-asset systems, but more importantly help systematise future studies on this aspect.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eae5aaae9316d8327f2934e1f27dcad",
  "timestamp": "2025-05-15T01:20:03.438744"
}