{
  "id": 6942,
  "title": "Quality of Pancreatic Transplant Program Assessment Using a Risk-adjusted Cumulative Sum Chart: Experience From a Single, Small Center",
  "abstract": "Background. The high rate of complication after pancreas transplantation not only had an impact on recipient quality of life and survival but also had significant financial implications. Thus, monitoring transplant center performance was crucial to indentifying changes in clinical practice that result in quality deterioration. Objective. To evaluate retrospectively the quality of the single, small pancreatic transplant program and to establish prospective monitoring of the center using risk-adjusted cumulative sum (CUSUM). Methodology. From 1988 to 2014, 119 simultaneous pancreas and the kidney transplantations (SPKTx) were performed. The program was divided into 3 eras, based on surgical technique and immunosuppression. Analyses of the 15 fatal outcomes due to complication from pancreatic graft were performed. The risk model was developed using multivariable logistic regression analysis based on retrospective data of 112 SPKTx recipients. The risk adjusted 1-sided CUSUM chart was plotted for retrospective and prospective events. The upper control limit was set to 2. Results. There were 2 main causes of death: multiorgan failure (73.3%; 11/15) and septic hemorrhage (26.7%; 4/15). Quality analysis using the CUSUM chart revealed that the process was not homogeneous; however, no significant signal of program deterioration was obtained and the performance of the whole program was within the settled control limit. Conclusion. For a single pancreatic transplant center. The risk-adjusted CUSUM chart was a useful tool for quality program assessment. It could support decision making during traditional surgical morbidity and mortality conferences. For small transplant centers, increasing the sensitivity of the CUSUM method by lowering the upper control limit should be considered. However, an individual assessment approach of the for particular centers is recommended.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eb6625084614b1ad8a5cdad005b7149",
  "timestamp": "2025-05-15T03:03:13.497139"
}