{
  "id": 8845,
  "title": "Causal nexus between agricultural credit rationing and repayment performance: A two-stage Tobit regression",
  "abstract": "The probability that the beneficiary would default on future payments poses a great risk to extending agricultural credit. Also, previous research on farmers' repayment of agricultural credit emphasized that a high default rate is a growing concern, thereby becoming a tall order for financial institutions to lend to farmers. Similarly, past studies accentuate an increasing focus on socio-economic characteristics as factors that explain the repayment rate. The nexus between repayment rates and credit rationing has not been well analyzed. The effect of credit rationing on repayment rate was therefore investigated. The study, therefore, investigates the causal effects of credit rationing on loan repayment performance using a structured questionnaire to elicit information from selected 240 respondents via a three-stage method of sampling technique, and the instrumental variable Tobit technique to analyze the effect of credit rationing on repayment performance. The result showed that the majority (70.83%) of the respondents are males, the mean age was 51 years with an average education year of 12.65. The result of instrumental variable Tobit regression confirmed the endogeneity of rationing rate (Wald test of exogeneity = Wald Chi2 (1) = 67.26; Prob > chi2 = 0.000) at a 1% level of statistical significance. The result with a Log-likelihood function (265.62459) revealed that the ration rate, among others, with coefficients of 0.4335, was a crucial factor in ascertaining the rate of repayment at various significant levels of the arable crop farmers in the research area. The key finding is that credit rationing did have a significantly positive influence on agricultural credit repayment. The research concluded that the significance of credit rationing in influencing the likelihood of repayment rate, points to the vital significance of adequacy in rationing borrowers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eb991996e7b268aeb3a97e5fcf269cb",
  "timestamp": "2025-05-15T03:22:57.923010"
}