{
  "id": 3950,
  "title": "Non-Conscious Affective Processing in Asset Managers during Financial Decisions: A Neurobiological Perspective",
  "abstract": "Featured Application The outcome of this study has the potential to open a new direction to optimise the success of asset management and of financial markets in general. The new focus is not algorithms, but the non-conscious mind in humans.Abstract In the world of finance, considerable attention is given to improving machine learning techniques to predict the future of stock markets. However, for obvious reasons, this turns out to be an unsolvable mission, most likely because the real world is not driven by algorithms but by human beings. In response to this, the present study has its focus on raw affective responses in actual asset managers during their decision making regarding controlled financial scenarios. Nineteen asset managers were invited and asked to make sell/buy decisions related to visual presentations of three different price developments of different assets. The three scenarios were crash, stable and gain. Parallel to their decision making, startle reflex modulation (SRM) was used to measure non-conscious affective responses without demanding any respective explicit responses (no conscious language processing involved). Interestingly, two further factors were introduced. First, all participants had to make their decisions once while being informed that 0% prior investments (low exposure) have been made into the presented assets, and once being informed that a large investment consisting of 25% of ones' overall portfolio has been made prior to making the decision (high exposure). Second, the factor experience was included dividing all participants into two groups, one with low experience and the other with high experience. First, across both these extra factors, it was found that crash scenarios resulted in the most negative affective responses. The most positive affective responses were found for gain scenarios, while the stable condition was in between. Interestingly, the factor of prior investment (i.e., exposure) had an effect. Non-conscious affective responses during decision making related to the stable condition varied as a function of exposure. In the low exposure condition, affective responses to decision making during the stable scenario were most negative, even more negative than in crash scenarios. The factor experience also had an effect, but due to the small sample size, no significant interaction occurred. However, t-tests revealed the same significant effects in the experienced group as found in the 0% prior investment condition. To our knowledge, this is the first empirical investigation measuring non-conscious affective responses during decision making in the context of asset management. Thus, this study might form an interesting basis for new strategies to explore non-conscious human brain functions instead of inventing new algorithms to make asset management more successful.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ecfcbfdd4ee1eee739343c9d4f2914a",
  "timestamp": "2025-05-15T01:22:39.311453"
}