{
  "id": 7225,
  "title": "Adverse childhood experiences, parenting, and socioeconomic status: Associations with internalizing and externalizing symptoms in adolescence*",
  "abstract": "Background: Adverse childhood experiences (ACEs), low socioeconomic status (SES), and harsh parenting practices each represent well-established risk factors for mental health problems. However, research supporting these links has often focused on only one of these predictors and psychopathology, and interactions among these variables in association with symptoms are not well understood.Objective: The current study utilized a cross-sectional, multi-informant, and multi-method design to investigate the associations of ACEs, SES, parenting, and concurrent internalizing and externalizing problems in adolescents. Participants and setting: Data are from a volunteer sample of 97 adolescents and their caregivers recruited from 2018 to 2021 in a southern U.S. metropolitan area to sample a range of exposure to ACEs.Methods: Multiple linear regression models were used to assess associations among adolescents' ACEs exposure, SES, observed parenting practices, and symptoms of internalizing and externalizing psychopathology.Results: Lower SES was associated with higher levels of internalizing and externalizing symptoms, while higher ACEs exposure and observed parenting were related to externalizing but not internalizing symptoms. Associations of adolescents' exposure to physical abuse and perceived financial insecurity with externalizing symptoms were moderated by warm and supportive parenting behaviors. Conversely, harsh parenting was linked to increased levels of externalizing symptoms, particularly in the context of low income. Conclusions: Findings suggest that the presence of multiple risk factors may incur greater vulnerability to externalizing problems, while warm and supportive parenting practices may provide a buffer against externalizing problems for adolescents exposed to physical abuse. Links",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ed7f49836c6bbff316cd9d9bce125a9",
  "timestamp": "2025-05-15T03:06:35.325595"
}