{
  "id": 3838,
  "title": "How Does Internal Control Affect Bank Credit Risk in Vietnam? A Bayesian Analysis",
  "abstract": "The purpose of this study is to investigate the impact of internal control on credit risk of joint stock commercial banks in Vietnam from 2007 to 2018. Furthermore, we specify bank-specific characteristics and macroeconomic conditions, and analyze how these factors affect credit risk of banks: the number of board members, the number of board members with banking or finance background as ratio of total board members, loans to total assets ratio, loans to deposit ratio, the number of days between the year-end and the publication of the financial statements, and the use of top four auditing firms proxy for five elements of internal control. By using the dataset of 30 Vietnamese joint stock commercial banks and Bayesian linear regression via Random-walk Metropolis Hastings algorithm, the results of this study show that five elements of internal control have a impact on bank credit risk, namely, control environment, risk assessment, control activities, information and communication, and monitoring activities. For factors of banks' characteristics, bank size and financial leverage have a negative impact on banks' credit risk, and bank age has a positive effect. For macroeconomic factors, inflation has a positive impact and economic growth has a negative impact on banks' credit risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4edcb13af5a7842032b5d0f9c0360dab",
  "timestamp": "2025-05-15T02:30:28.732882"
}