{
  "id": 3463,
  "title": "How Does Effectuation Affect Risk-Taking of Angel Investors?",
  "abstract": "Business angels emerged as key participants in the market for informal capital for entrepreneurial ventures particularly for enterprises who are in the early stages of their business lives (Mason and Harrison 2000; Maula et al. 2005; Reynolds et al. 2002). While the importance of business angels has been well-established, we still do not clearly know what drives risk-taking among angel investors. In other words, it is not known what antecedents influence the proportion of wealth invested in angel projects. We contend that effectuation theory (Sarasvathy 2001; Simon1981), household portfolio theory (Guiso et al, 2002) and social psychology theory of planned behavior (Ajzen 1991) are appropriates vehicle to understand business angels' risk taking propensity. To investigate the antecedents of risk-taking we employ archival data from the Angel Investor Performance Project (AIPP) which collected information from 539 angel investors. our final sample consists of 257 angel investors. We identify five antecedent variables as determinants of risk-taking (proportion of wealth invested in angel projects): Investment experience, entrepreneurial experience, founding experience, diversification and age. Business angels invested on average approximately 15% of their personal wealth in angel projects and had an average investment experience of 9.7 years. Our model accounts for more than 26% of variation in level of risk-taking. At a variable level, all variables except entrepreneurship experience and diversification were significant at the .05 level. Further, we divided our sample into low-degree (LD) of risk taking (up to 10% of wealth invested) and high-degree (HD) of risk taking (10% or higher). The logistic regression model achieves a classification ratio of 77.6%. We offer some important practical implications by showing that individuals who are younger and have a longer investment and founding experience are likely to invest a higher proportion of their wealth in angel projects. Future studies should include measures such as due diligence, relationship with project leaders, start up involvement, and seed stage to better uncover the relationship between effectuation, planned behavior and risk taking.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ee90e8b1a75ec2fc57eddfb100975a5",
  "timestamp": "2025-05-15T01:17:25.491431"
}