{
  "id": 9039,
  "title": "Vaccine intention and hesitancy among Australian women who are currently pregnant or have recently given birth: the Birth in the Time of COVID-19 (BITTOC) national online survey",
  "abstract": "Objective To examine the prevalence of COVID-19 vaccination, and factors associated with vaccination intention and hesitancy in pregnant and postnatal women in Australia. Design and setting A national online survey was conducted over 6 months between 31 August 2021 and 1 March 2022 and responses to vaccination status were categorised as: 'vaccinated', 'vaccine intended' and 'vaccine hesitant'. The data were weighted to reflect the proportion of women of reproductive age. Potential confounding variables were examined using multinomial logistic regression analyses, and all comparisons were made against vaccinated pregnant and postnatal women. Participants 2140 women responded to the survey (838 pregnant; 1302 recently post partum). Results Amongst pregnant women, 586 (69.9%) were vaccinated, 166 (19.8%) indicated intention and 86 (10.3%) were hesitant. In postnatal women, this was 1060 (81.4%), 143 (11.0%) and 99 (7.6%), respectively. Only 52 (6.2%) of pregnant women stated never wanting a COVID-19 vaccine. Vaccine hesitancy increased over time, and for pregnant women was associated with: living in a state other than New South Wales (NSW) (Adjusted Relative Risk (ARR) 2.77, 95%CI: 1.68-4.56 for vaccine intention and ARR=3.31, 95%CI: 1.52-7.20 for vaccine hesitancy), younger age <30 years, not having a university education, income <80K AUD, gestation <28 weeks, having no pregnancy risk factors, and being less satisfied with life (ARR=2.20, 95%CI: 1.04-4.65 for vaccine intention and ARR=2.53, 95%CI: 1.02-6.25 for vaccine hesitancy). For postnatal women: living in a state other than NSW or Victoria, income <80K AUD and having private obstetric care (ARR=2.06, 95%CI: 1.23-3.46) were significantly associated with vaccine hesitancy. Conclusions Around 1 in 10 pregnant women and just over 1 in 13 postnatal women reported vaccine hesitancy in this Australian survey, and hesitancy was higher in the latter 3-month period. Tailored messages to younger mothers and those from lower-middle socioeconomic groups, alongside advice from midwives and obstetricians, could help to reduce hesitancy among pregnant and postnatal women. Financial incentives may help to facilitate COVID-19 vaccine uptake. A real-time surveillance system and additional pregnancy fields added to the Australian immunisation register would support the safety monitoring of multiple vaccines in pregnancy and may build confidence.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eec0ff9f8c997dca11d01fe3d08ce1a",
  "timestamp": "2025-05-15T03:24:54.915713"
}