{
  "id": 4453,
  "title": "Factors affecting farmers' access to formal financial credit in Basona Worana District, North Showa Zone, Amhara Regional State, Ethiopia",
  "abstract": "This study examines the factors affecting farmers' access to formal credit in Basona Worana District, North Showa Zone, Amhara Regional State, Ethiopia. The study used cross-sectional data while conducting a survey. It was conducted from November 2019 to June 2020 G.C. A multistage random sampling technique was used, and 299 smallholders' farmers were selected and fully took part in the survey. Quantitative data were collected using a structured questionnaire to identify the main factors of formal financial credit access. Of the total 299 participants, only 72 (24.1%) took formal financial credit from lending institutions. The data were analyzed by descriptive statistics and logistic regression analysis. The regression result reveals that age, sex of household head, family size, extension contacts, off-farm income, interest rate, lending procedure, group lending and Rapid Repayment Period are the main determinant factors that affect formal financial credit access at the household level, and these variables are found to be statistically significant at 1 % and 5 % levels of precision. On the other hand, the other remaining variables like education status, attitude towards credit risk, experience on credit use, farm land size, livestock ownership and distance from lending institutions are found to be statistically insignificant. Thus, policy makers should work to improve credit service supply and amount of credit and assist smallholders to invest the credit on their farming. Lending institutions should revise their group lending system, interest rate, lending procedure and rigid repayment periods.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4eee49b289b658f1baea90c58f08856c",
  "timestamp": "2025-05-15T02:37:16.964143"
}