{
  "id": 3391,
  "title": "Determining If Post-Injury Financial Distress Was Preexisting or Injury-Induced A Prospective Cohort Study of Patients with Lower-Extremity Trauma",
  "abstract": "Background:Previous research has estimated that over one-half of patients with orthopaedic trauma experience financial distress after the injury. However, it is unknown what proportion of patients lived under financial distress before the injury and, therefore, the causal effect of the injury on financial distress. This study examined changes in financial distress after the injury and factors associated with new post-injury financial distress. Methods:A prospective cohort study was performed at a single academic trauma center, leveraging patients' 2-week recall of their pre-injury financial circumstances to permit a quasi-experiment design. Adult patients with a surgically treated lower-extremity fracture were included. The primary outcome was self-reported financial distress. Pre-injury financial distress was compared with financial distress in the 6 months after the injury. Multinomial logistic regression was used to identify factors associated with new financial distress after the injury. Results:A total of 200 study participants were enrolled (median age, 42 years [interquartile range, 32 to 59 years]); 56% of patients were male. Financial distress was present in 40% of the study participants before the injury. The fracture was associated with an absolute increase of 19% (95% confidence interval [CI], 5% to 34%; p < 0.001) in the prevalence of financial distress. New post-injury financial distress was associated with working before the injury (odds ratio [OR], 6.9 [95% CI, 2.2 to 22]; p < 0.001) and earning <$70,000 per year (OR, 3.6 [95% CI, 1.2 to 10]; p = 0.02). Conclusions:The findings suggest that 2 of 5 patients with a lower-extremity fracture had experienced financial distress before the injury. The prevalence of financial distress increased to 3 of 5 after the injury. Working and earning <$70,000 per year before the injury substantially elevated the patients' risk of new financial distress post-injury. Future efforts should target interventions to reduce financial distress in this at-risk population. Level of Evidence:Prognostic Level II. See Instructions for Authors for a complete description of levels of evidence.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4efd86744a5174dda05bd3f40f6e1ebf",
  "timestamp": "2025-05-15T02:25:40.189860"
}