{
  "id": 5763,
  "title": "Neural Correlates of Direct Access Trading in a Real Stock Market: An fMR1 Investigation",
  "abstract": "Background: While financial decision making has been barely explored, no study has previously investigated the neural correlates of individual decisions made by professional traders involved in real stock market negotiations, using their own financial resources. Aim: We sought to detect how different brain areas are modulated by factors like age, expertise, psychological profile (speculative risk seeking or aversion) and, eventually, size and type (Buy/Sell) of stock negotiations, made through Direct Access Trading (DAT) platforms. Subjects and methods: Twenty male traders underwent fMRI while negotiating in the Italian stock market using their own preferred trading platform. Results: At least 20 decision events were collected during each fMRI session. Risk averse traders performed a lower number of financial transactions with respect to risk seekers, with a lower average economic value, but with a higher rate of filled proposals. Activations were observed in cortical and subcortical areas traditionally involved in decision processes, including the ventrolateral and dorsolateral prefrontal cortex (vIPFC, dIPFC), the posterior parietal cortex (PPC), the nucleus accumbens (NAcc), and dorsal striatum. Regression analysis indicated an important role of age in modulating activation of left NAcc, while traders' expertise was negatively related to activation of vIPFC. High value transactions were associated with a stronger activation of the right PPC when subjects' buy rather than sell. The success of the trading activity, based on a large number of filled transactions, was related with higher activation of vIPFC and dIPFC. Independent of chronological and professional age, traders differed in their attitude to DAT, with distinct brain activity profiles being detectable during fMRI sessions. Those subjects who described themselves as very self-confident, showed a lower or absent activation of both the caudate nucleus and the dIPFC, while more reflexive traders showed greater activation of areas involved in strategic decision making. Discussion: The neural correlates in DAT are similar to those observed in other decision making contexts. Trading is handled as a well-learned automatic behavior by expert traders; for those who mostly rely on heuristics, cognitive effort decreases, and transaction speed increases, but decision efficiency lowers following a poor involvement of the dIPFC.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f0434739181870501ca6f75e7f6cef2",
  "timestamp": "2025-05-15T02:51:29.960878"
}