{
  "id": 1590,
  "title": "Financial big data management and intelligence based on computer intelligent algorithm",
  "abstract": "With the acceleration of China's economic integration process, enterprises have gained greater advantages in the fierce market competition, and gradually formed the trend of grouping and large-scale. However, as the scale of the company increases, the establishment of a branch also causes many problems. For example, in order to obtain more benefits, the business performance of the company can generate false growth, resulting in financial and operational risks. This paper analyzed the current situation and needs of enterprise financial control from two aspects of theory and practice, combined with specific engineering projects, taking ZH Group as an example, according to the actual situation of the enterprise. The article first introduces the basic situation of the enterprise; Then, the financial control strategy was designed, and different modules were designed to achieve financial control; Afterwards, use a reverse neural network to evaluate the effectiveness of financial management and risk warning; Relying on particle swarm optimization algorithm to seek the optimal solution and applying it to financial management and risk warning, in order to improve the level of introspection and risk management in decision-making. Finally, the value of computer intelligence algorithms in financial big data management is evaluated by constructing a financial risk indicator system. Through the analysis of enterprise financial management, the total asset turnover rate of ZH Group decreased by 0.39 times in 5 years. After 5 years of adjustment of the company's business, the company's overall operational capabilities still needed to be improved, and the company's comprehensive business capabilities also still needed to be improved. Therefore, the application of intelligent algorithms for financial control is very necessary.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f0a762586798e8f0fc9d86b0dc3805c",
  "timestamp": "2025-05-15T02:05:08.203216"
}