{
  "id": 8170,
  "title": "Ocular Adverse Events after Coronavirus Disease 2019 mRNA Vaccination Matched Cohort and Self-Controlled Case Series Studies Using a Large Database",
  "abstract": "Purpose: To investigate the risk of ocular adverse events after Coronavirus Disease 2019 (COVID-19) mRNA vaccination.Design: Matched cohort and self-controlled case series (SCCS) studies.Participants: We used a population-based database of medical claims and vaccination records in a large Japanese city. In the matched cohort study, we identified individuals who received COVID-19 vaccination (BNT162b2) from February 2021 to September 2021. One control was selected from nonvaccinated individuals by matching time, date of birth, sex, Charlson comorbidity index, and the enrollment period for health insurance. In the SCCS study, we analyzed individuals who developed ocular adverse events.Methods: In the matched cohort study, we applied the Kaplan-Meier estimator to estimate the cumulative incidence of ocular adverse events over 21 days after the first dose and 84 days after the second dose. In the SCCS method, we used conditional Poisson regression to estimate the incidence rate ratio (IRR) of ocular adverse events during the risk periods (0-21 days after the first dose and 0-84 days after the second dose) compared with the remaining periods.Main Outcome Measures: Composite outcome of uveitis, scleritis, retinal vein occlusion (RVO), and optic neuritis.Results: There were 99 718 pairs eligible for the matched cohort study after the first dose (mean age, 69.3 years; male, 44%). The vaccinated and control groups developed 29 and 21 events, respectively, over 21 days after the first dose, and 79 and 28 events, respectively, over 84 days after the second dose. The differences in cumulative incidence (reference, the control group) were 2.9 (95% confidence interval,-14.5 to 19.1) events/100 000 persons and 51.3 (16.2-84.3) events/100 000 persons, respectively, for the first and second doses. The SCCS study showed the IRRs of 0.89 (0.62-1.28) and 0.89 (0.71-1.11) for the first and second doses, respectively. Conclusions: The matched cohort analysis found an increased risk for the composite outcome after the second dose; however, the SCCS analysis showed no increased risk. Considering that the SCCS can cancel out time-invariant confounders, the current results suggest that COVID-19 vaccination is unlikely to causally increase the risk of ocular adverse events.Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2023;130:256-264 (c) 2022 by the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f156c46b5e42182a8798ad3d8d12fee",
  "timestamp": "2025-05-15T03:16:17.335767"
}