{
  "id": 187,
  "title": "Optimisation and economic feasibility of Battery Energy Storage Systems in electricity markets: The Iberian market case study",
  "abstract": "This study identifies the optimal operating strategy of storage systems in the electricity markets, from the perspective of a market participant with a renewables' portfolio. The energy storage system provides a balancing service for renewable sources, while also performing energy arbitrage at the considered three short-term markets. A Long Short-Term Memory (LSTM) model is developed to forecast spot price and renewable generation which are used to guide the bidding decision-making process to maximise the agents' economic profit. Additionally, the designed decision support models consider market rules and the technical constraints in the operation of the storage system. The influence of storage systems in the optimal operation, regulation costs and revenues are analysed on a daily and yearly basis. The Iberian electricity market has been utilised as a case study. It was shown that the use of forecasting techniques and battery implementation reduce daily and yearly regulation costs up to 100% and 53%, respectively and that acting in the balancing market increases the expected profit of the storage system between 21% and 36%. Additionally, the economic viability evaluation in 2018 and 2025, for several battery types, shows that only the lithium-ion battery is a profitable investment.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f3124d19ada2b47f14a5c436609f921",
  "timestamp": "2025-05-15T00:33:06.192357"
}