{
  "id": 7662,
  "title": "Child Maltreatment Prevention Service Cases are Significantly Reduced During the COVID-19 Pandemic: A Longitudinal Investigation Into Unintended Consequences of Quarantine",
  "abstract": "Unprecedented financial and emotional stress, paired with measures to slow the spread of COVID-19 (e.g., school closures), place youth at risk for experiencing increased rates of abuse. We analyzed data from New York City's Administration for Children's Services to investigate the frequency of child maltreatment prevention service case openings during this time. Longitudinal counts of case openings were compiled for January through June of the years 2014-2020. An independent samples Kruskal-Wallis H-test suggested that pre-quarantine case openings were significantly larger than case openings during quarantine. To account for the possible influence of other historical events impacting data, a secondary Kruskal-Wallis H-test was conducted comparing only the 4 months of quarantine data available to the 4 months immediately preceding quarantine orders. The second independent samples Kruskal-Wallis H-test again suggested that pre-quarantine case openings were significantly larger than case openings during quarantine. A Poisson regression model further supported these findings, estimating that the odds of opening a new child maltreatment prevention case during quarantine declined by 49.17%. These findings highlight the severity of COVID-19 impacts on child maltreatment services and the gap between demand for services and service accessibility. We conclude with recommendations for local governments, community members, and practitioners.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f4085a8da98f4690971677b069c7fb3",
  "timestamp": "2025-05-15T03:10:33.145032"
}