{
  "id": 8743,
  "title": "Risk factors of cognitive frailty in elderly chronic obstructive pulmonary disease patients and its implication for death: a cohort study",
  "abstract": "Backgrounds: Cognitive frailty, a clinical syndrome with physical frailty and cognitive impairment, leads to mortality and other adverse health outcomes in older adults. This study aimed to investigate the prevalence of cognitive frailty, and its influencing factors, and follow its impact on short-term mortality in elderly chronic obstructive pulmonary disease patients, to provide a theoretical scientific reference basis for clinical intervention and management of cognitive frailty.Methods: A sample of 243 elderly chronic obstructive pulmonary disease patients in the respiratory department of a tertiary care hospital was conveniently sampled from November 2021 to February 2023, and the prevalence of cognitive frailty was investigated using the General Information Survey Scale, the Fried Phenotype Scale, the Mini-Mental State Examination, the Anxiety Self-Rating Scale, the Brief Geriatric Depression Scale, and the Mortality Record. The mortality was recorded by telephone follow-up after 6 months. A database was created and statistical analysis such as one-way analysis of variance, logistic regression analysis, Kaplan-Meier, and Cox survival analysis were used to analyze the data.Results: A total of 47 patients (19.3%) had cognitive frailty; there were statistical differences in the prevalence of cognitive frailty by medical payment type, physical exercise, and sleeping time (P < 0.05). During a 6-month follow-up, 38 patients (15.6%) died. Cox survival analysis showed that the risk of death in elderly chronic obstructive pulmonary disease patients in the cognitive frailty group was 3.212 times higher than that in the normal cognitive function and non-frailty group (95% CI 1.646-6.270, P = 0.001), and 5.266 times higher than that in the normal cognitive function and frailty group (95% CI 3.159-8.778, P < 0.001).Conclusions: The prevalence of cognitive frailty in elderly chronic obstructive pulmonary disease patients is high, and clinical staff should pay attention to patients' medical burden and financial ability, and reduce the incidence of cognitive frailty by instructing patients to perform physical exercise and arrange sleep time. Cognitive frailty is an important risk factor for mortality within 6 months in elderly chronic obstructive pulmonary disease patients, and early intervention should be emphasised to reduce or delay cognitive frailty and mortality.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f42105507646f7fbb4ae97f75aa7f88",
  "timestamp": "2025-05-15T03:21:56.642262"
}