{
  "id": 4866,
  "title": "Cumulative Burden of Financial Hardship From Medical Bills Across the Spectrum of Diabetes Mellitus and Atherosclerotic Cardiovascular Disease Among Non-Elderly Adults in the United States",
  "abstract": "BACKGROUND: Atherosclerotic cardiovascular disease (ASCVD) has a strong association with diabetes mellitus (DM), accounting for approximately two thirds of deaths in this patient population. Many individuals with ASCVD and DM are vulnerable to financial hardship associated with treatment-related expenses. Therefore, we examined the burden of financial hardship from medical bills across the spectrum of ASCVD status with and without DM. METHODS AND RESULTS: Using data from the National Health Interview Survey from 2013 to 2017, we used logistic regression analysis to examine the association of ASCVD and DM status with financial hardship and an inability to pay medical bills from a representative sample of non-elderly adults in the United States. Our study population consisted of 121 672 individuals. Approximately 3.1% of the weighted population had ASCVD, 5.6% had DM, and 1.3% had both ASCVD and DM. Nearly 50% of individuals with ASCVD and DM reported financial hardship from medical bills (23% being unable to pay medical bills at all), whereas similar to 28% of those with neither ASCVD nor DM reported financial hardship from medical bills (8% being unable to pay medical bills at all). Individuals with concurrent ASCVD and DM had the highest relative odds of expressing an inability to pay at all when compared with those with neither condition (odds ratio, 2.69; 95% CI, 2.21- 3.28). CONCLUSIONS: Individuals with concurrent ASCVD and DM are at a disproportionately high risk of being unable to pay their medical bills. The findings provide strong evidence for developing more effective public health policies that protect vulnerable populations from financial hardship.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f44115c68137a65739423c0d319724e",
  "timestamp": "2025-05-15T02:42:04.800151"
}