{
  "id": 7002,
  "title": "Perceived Job Insecurity and Depressive Symptoms among Italian Dentists: The Moderating Role of Fear of COVID-19",
  "abstract": "Containment measures adopted to reduce the spread of coronavirus disease 2019 (COVID-19) have produced a general perception of job insecurity. Dentists have been highly affected by such measures, as they represent an easy source of contagion. As perceived job insecurity is associated with psychological distress and Italian dentists have been highly affected by the COVID-19 outbreak in terms of potential financial loss and the risk of being infected, this study aimed at assessing whether the fear of COVID-19 moderated the effect of perceived job insecurity on depressive symptoms. This cross-sectional online study has included 735 Italian dentists recruited during the lockdown and ranging in age from 27 to 70 years old (495 men and 240 women). A quantile regression model with an inference based on the median and with an interaction term between the fear of COVID-19 and perceived job insecurity has been used to estimate the hypothesized associations. The results indicated that both perceived job insecurity and fear of COVID-19 were positively associated with depressive symptoms, and that the effect of perceived job insecurity on depressive symptoms was weaker among those with a low fear of COVID-19. The findings may inform public health policies for dentists in relation to reducing the risk of developing negative mental health outcomes.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f45b203d78f0cd6c3c42ad56578d469",
  "timestamp": "2025-05-15T03:03:55.848272"
}