{
  "id": 3364,
  "title": "Enhancing corporate resilience: the impact of female board representation on financial distress in Jordanian companies",
  "abstract": "PurposeThis paper aims to examine the impact of board gender diversity on the likelihood of financial distress in 90 Jordanian companies listed on the Amman Stock Exchange from 2010 to 2021.Design/methodology/approachTo examine the hypotheses, this study used the panel logistic regression. In addition, this study used the two-staged Heckman regression model as a robust check. To proxy for the financial distress, the 2005 version of Altman's Z-score for emerging markets was used.FindingsThe results indicate that female directors can reduce the likelihood of financial distress in Jordanian listed companies. These findings align with previous literature that highlights the benefits of female directors on corporate boards.Originality/valueTo the best of the authors' knowledge, this study is the first to examine the impact of board gender diversity on financial distress in Jordan and the Middle East and highlights several practical implications. It emphasizes the need for policymakers to develop regulations that promote gender diversity on corporate boards as a strategy to enhance stability and prevent financial distress. For corporate managers, incorporating more women into board roles could strengthen decision-making and risk management. Regulators are advised to support these changes through improved governance codes. In addition, increasing female board participation could enhance corporate responsibility, reduce bankruptcy risks and boost overall economic stability, benefiting society at large.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f4eaf8dcb4e6a0feb09bf33f2f6ffcf",
  "timestamp": "2025-05-15T02:25:40.071738"
}