{
  "id": 9265,
  "title": "Effect of a multi-faceted rapid response system re-design on repeat calling of the rapid response team",
  "abstract": "Background Repeat Rapid Response Team (RRT) calls are associated with increased in-hospital mortality risk and pose an organisation-level resource burden. Use of Non-Technical Skills (NTS) at calls has the potential to reduce potentially preventable repeat calling. NTS are usually improved through training, although this consumes time and financial resources. Re-designing the Rapid Response System (RRS) to promote use of NTS may provide a feasible alternative. Methods A pre-post observational study was undertaken to assess the effect of an RRS re-design that aimed to promote use of NTS during RRT calls. The primary outcome was the proportion of admissions each month subject to repeat RRT calling, and the average number of repeat calls per admission each month was the secondary outcome of interest. Univariate and multivariable interrupted time series analyses compared outcomes between the two study phases. Results The proportion of admissions with repeat calls each month increased across both phases of the study period, but the increase was lower in the post re-design phase (change in regression slope -0.12 (standard error 0.07) post versus pre re-design). The multivariable model predicted a 6% reduction (95% confidence interval -15.1-3.1; P = 0.19) in the proportion of admissions having repeat calls at the end of the post redesign phase study compared to the predicted proportion in the absence of the re-design. The average number of calls per admission was also predicted to decrease in the post re-design phase, with an estimated difference of -0.07 calls per admission (equivalent to one fewer repeat call per 14 patients who had RRT calls) at the end of the post re-design phase (95% confidence interval -0.23-0.08, P = 0.35). Conclusion This study of an RRS re-design showed modest, but not statistically significant, reductions in the proportion of admissions with repeat calls and the mean number of repeat calls per admission. Given the economic and workforce capacity issues that all health care systems now face, even small improvements in the RRS may have lasting impact across the organisation. For the potential interest of RRS managers, this paper presents a pragmatic, low-cost initiative intended to enhance communication and cooperation at RRT calls.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f580516353d3708284bbb7bc979c1f7",
  "timestamp": "2025-05-15T03:27:24.921514"
}