{
  "id": 5946,
  "title": "Do ownership structures affect risk disclosure in Islamic banks? International evidence",
  "abstract": "Purpose Previous works assessing the determinants of banks' risk disclosure in emerging economies focused on one aspect of risk reporting such as market risk disclosure or operational risk disclosure. While banks' transparency about other major risk types (e.g. capital adequacy, liquidity risk horizontal ellipsis ) is important for both market discipline and for their financial stability, no previous research has tried to discuss their determinants for Islamic banks. This paper aims to fill the gap by assessing the effects of deposits structure and ownership concentration on risk disclosure for Islamic banks. Design/methodology/approach The authors based on a sample of 71 Islamic banks operating in 12 emerging economies and observed over the period 2009-2014. The authors used a risk disclosure index covering nine dimensions, and the authors used both generalized least squares (GLS) regression and generalized method of moments (GMMs) as econometric tools. Findings The findings suggests that the level of risk disclosure is lower for Islamic banks with higher ownership concentration, leveraged bank, listed banks and Islamic banks. However, risk disclosure is higher for Islamic banks with higher concentration of profit sharing investment account (PSIA) and higher foreign ownership, large Islamic banks, aged banks, Islamic banks operating in country with higher country transparency index, positively correlated to gross domestic products and Accounting and Auditing Organization for Islamic Financial Institutions (AAOIFI) adoption. By disaggregating total risk disclosure into the nine sub-categories, the authors are able to specify, also, the components of risk disclosure impacted by various determinants. Research limitations/implications This paper's findings are subject, also, to a number of limitations. First, there was manual scoring of annual reports (subjectivity). Second, while some items might have higher information content or be more useful than others for users of Islamic banks' annual reports, no weighting is assigned to items. Third, the research focuses exclusively on the 12 countries and excludes the other Middle East, Southeast Asia and Far East countries where ownership structure and deposits structure might affect risk disclosure differently. Originality/value The findings suggest many policy implications. First, regulators have to improve corporate governance mechanisms in Islamic banking system through the optimization of ownership structure (dispersed ownership) to promote transparency and disclosure. Second, regulators and policymakers should revise guidelines in the main purpose to protect PSIAs holders (considered as minor shareholders without voting power) through promoting disclosure and transparency. Third, the findings can be useful for many international supervisory bodies such as the IFSB and AAOIFI to evaluate transparency and disclosure standards.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f6c17b222b70d056280accd2e18a952",
  "timestamp": "2025-05-15T02:53:03.122861"
}