{
  "id": 8958,
  "title": "Implementation of a structured emergency nursing framework results in significant cost benefit",
  "abstract": "Background Patients are at risk of deterioration on discharge from an emergency department (ED) to a ward, particularly in the first 72 h. The implementation of a structured emergency nursing framework (HIRAID) in regional New South Wales (NSW), Australia, resulted in a 50% reduction of clinical deterioration related to emergency nursing care. To date the cost implications of this are unknown. The aim of this study was to determine any net financial benefits arising from the implementation of the HIRAID emergency nursing framework. Methods This retrospective cohort study was conducted between March 2018 and February 2019 across two hospitals in regional NSW, Australia. Costs associated with the implementation of HIRAID at the study sites were calculated using an estimate of initial HIRAID implementation costs (AUD) ($492,917) and ongoing HIRAID implementation costs ($134,077). Equivalent savings per annum (i.e. in less patient deterioration) were calculated using projected estimates of ED admission and patient deterioration episodes via OLS regression with confidence intervals for incremental additional deterioration costs per episode used as the basis for scenario analysis. Results The HIRAID-equivalent savings per annum exceed the costs of implementation under all scenarios (Conservative, Expected and Optimistic). The estimated preliminary savings to the study sites per annum was $1,914,252 with a payback period of 75 days. Conservative projections estimated a net benefit of $1,813,760 per annum by 2022-23. The state-wide projected equivalent savings benefits of HIRAID equalled $227,585,008 per annum, by 2022-23. Conclusions The implementation of HIRAID reduced costs associated with resources consumed from patient deterioration episodes. The HIRAID-equivalent savings per annum to the hospital exceed the costs of implementation across a range of scenarios, and upscaling would result in significant patient and cost benefit.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f724e5fe08b9bb518a99c82ce47e8ba",
  "timestamp": "2025-05-15T03:23:56.178323"
}