{
  "id": 4474,
  "title": "The Path to Sustainable Healthcare: Implementing Care Transition Teams to Mitigate Hospital Readmissions and Improve Patient Outcomes",
  "abstract": "Introduction Hospital readmissions within 30 days suggest care quality issues and increased mortality risks. They result from ineffective initial treatment, poor discharge planning, and inadequate post-acute care. These high readmission rates harm patient outcomes and financially strain healthcare institutions, inviting penalties and discouraging potential patients. Enhancing inpatient care, care transitions, and case management is crucial to lowering readmissions. Our research underscores the role of care transition teams in reducing readmissions and financial stress in hospitals. By consistently applying transition strategies and focusing on high-quality care, we can improve patient outcomes and ensure hospital success in the long run. Methods This two-phase study investigated readmission rates and risk factors in a community hospital from May 2017 to November 2022. Phase 1 determined a baseline readmission rate and identified individual risk factors using logistic regression. In phase 2, a care transition team addressed these factors by providing postdischarge patient support through phone calls and assessing social determinants of health (SDOH). Readmission data from the intervention period was compared to baseline data using statistical tests. Data, including demographics, medical conditions, and comorbidities, were collected via electronic medical records and the International Classification of Diseases (ICD-10 codes). The study focused on patients aged 20-80 with readmissions within 30 days. Exclusions were made to minimize confounding effects from unmeasured comorbidities and ensure an accurate representation of factors affecting readmissions. Results In the study's initial phase, 74,153 patients participated, with an 18% mean readmission rate. Women accounted for 46% of readmissions, and the white population had the highest rate (49%). The 40-59 age group showed a higher readmission rate than other age groups, and certain health factors were identified as risk factors for 30-day readmission. In the subsequent phase, a care transition team intervened with highrisk groups using an SDOH questionnaire. They contacted 432 patients, resulting in a reduced overall readmission rate of 9%. The 60-79 age group and the Hispanic population experienced higher readmission rates, and the previously identified health factors remained significant risk factors. Conclusion This study emphasizes the crucial role of care transition teams in reducing hospital readmission rates and easing the financial strain on healthcare institutions. By identifying and addressing individual risk factors, the care transition team effectively lowered the overall readmission rate from 18% to 9%. Continually implementing transition strategies and prioritizing high-quality care focused on minimizing readmissions are essential for improving patient outcomes and long-term hospital success. Healthcare providers should consider utilizing care transition teams and social determinants of health assessments to better understand and manage risk factors and tailor post-discharge support for patients at higher risk of readmission.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f8add7a78c6bf46c15e2c79cd80b3a9",
  "timestamp": "2025-05-15T02:37:47.493417"
}