{
  "id": 5168,
  "title": "Association Between Use of EHR-Generated Dashboards and Hospital Outcomes in 30-Day Heart Failure Readmissions",
  "abstract": "EXECUTIVE SUMMARY This study examined whether usage of clinical data from the electronic health record (EHR) to create organizational- and unit-level performance dashboards and assess adherence to clinical practice guidelines is associated with hospital outcomes in risk-adjusted 30-day readmissions for patients with a principal diagnosis of heart failure (HF). It further assesses the association between the metrics of hospital financial health and the usage of those EHR-generated tools. A cross-sectional study design was used. The study used data from the 2016 American Hospital Association Annual Survey Information Technology Supplement, the Pennsylvania Health Care Cost Containment Council's (PHC4's) 2017 Hospital Performance Report, and the PHC4 General Acute Care Hospitals Financial Analysis Report for fiscal year 2017. Contingency tables, likelihood-ratio chi-square tests, and logistic regression were applied for data analysis. Usage of the EHR to assess adherence to clinical practice guidelines and create EHR-generated unit-level performance dashboards, rather than organizational performance dashboards, was more strongly associated with the hospitals' rating in risk-adjusted 30-day readmissions for HF patients. An increase in hospitals' operating margin was associated with greater odds of the usage of the discussed EHR tools, after controlling for hospital control/ownership and the total number of beds. Usage of some EHR-generated analytical tools may be more strongly associated with lower-than-expected 30-day hospital readmissions in HF patients than with other tools. Better hospital financial health is linked with greater uptake of the discussed analytical tools. Further research could help to determine which EHR-generated tools are more effective in improving hospital outcomes in HF.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f8e6f421ca7da45a83b136a727f0ac6",
  "timestamp": "2025-05-15T02:45:17.004470"
}