{
  "id": 7195,
  "title": "Exploring Prospective Predictors of Illicit Drug-Toxicity Deaths: Evidence From the General Social Survey",
  "abstract": "Background: This study was based on over 30,000U.S. respondents who completed General Social Surveys between 1978 and 2002. Aims: We approached these respondents prospectively, comparing and contrasting the responses of those who subsequently died from drug-poisonings (N = 135) with all respondents who were still living, N = 23,559. Method: We employed cross-tabulation and logistic regression analyses to test for statistically significant differences between drug-poisoning death casualties and all living respondents. Results: Consistent with past research findings, younger males were over-represented among drug death casualties. Also consistent with past studies, drug casualties showed evidence of perceiving themselves as socially marginalized in comparison to living respondents: More reported themselves in poorer health, as having been sexual minority members during the last 5years, as having spent their younger years in homes where parents' marriages disrupted, with fewer owning homes and feeling less satisfied about their financial situations. Conclusions: These exploratory findings obtained from a general population survey reinforce findings from clinical studies and help advance clinical assessments of potential at-risk individuals who might be identified sooner, lest they succumb to future fatal drug poisonings.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4f9969359c4e9eb5cbb3b58f9f34777f",
  "timestamp": "2025-05-15T03:06:01.265015"
}