{
  "id": 2981,
  "title": "A methodology for outlier detection in audit logs for financial transactions",
  "abstract": "Database audit logs contain the information about database operations which are helpful to verify accuracy, lawfulness and to report risks. In financial systems, the audit logs should be monitored on continuous basis in order to detect and take action against any reasonably abnormal behavior. Outlier detection is a very important concept in the data mining which is useful in data analysis. Nowadays, a direct mapping can be found between the data outliers and the real world anomalies, and hence the outlier detection techniques can be applied to detect the abnormal activities in financial transactions. The purpose of the present study is to automate the process of abnormal activity detection and report generation. In the proposed framework, we will detect outliers based on rules and then we will apply Bayesian classification technique for abnormal activity risk classification. We will also generate user transaction profiles by obtaining user behavior according to historic transactions based on categorical or numerical attributes. Later we will monitor new transactions and will compare it against the corresponding user profile, in order to determine if the transaction is unusual. This framework will work on audit logs from a financial system, and thus will be useful for financial system auditors performing data analysis tasks.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4fdbf8146d2caca326f4744435c41bf3",
  "timestamp": "2025-05-15T02:21:19.231578"
}