{
  "id": 3462,
  "title": "Exploring the impact of ESG factors on corporate risk: empirical evidence for New York Stock Exchange listed companies",
  "abstract": "This paper aims to investigate the impact of influential ESG factors on risk, focusing on debt risk and liquidity risk. The influence on a sample of companies listed on the New York Stock Exchange belonging to the NYSE index is analyzed over a 10-year period, 2012-2021. The quantitative framework covers a multitude of indicators regarding debt, liquidity, corporate governance, the environment, CEO characteristics, performance, and other variables, and the research methodology uses the method of least squares to highlight their impact, using regression models with fixed and random effects, both linear and nonlinear. By estimating regression models, the empirical results confirm the hypotheses found in the existing knowledge stage that debt risk and liquidity risk are significantly influenced by asset profitability, the CEO duality significantly influences debt, while CEO gender diversity has a negative influence on corporate risk, specifically debt and liquidity risk. Additionally, it is shown that the emergence of COVID-19 brings significant changes to company autonomy and their financial performance, the COVID-19 pandemic has negatively influenced corporate risk through restrictions, economic uncertainty, and the amplification of risks. These research results are crucial for practitioners by the necessity of integrating ESG criteria into the risk assessment process and decision-making. Furthermore, concerning policy decision-makers, they help promote sustainability and a responsible approach. Therefore, ESG factors can impact companies' financial performance and influence how they are perceived by investors. By understanding and correctly evaluating these ESG factors, one can identify and manage risks more efficiently, achieve better long-term returns, make appropriate decisions, and promote sustainability in the business environment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4fe6c9b7931765544b6c0fd91cc7292e",
  "timestamp": "2025-05-15T02:26:09.270658"
}