{
  "id": 103,
  "title": "Financial Derivative Price Forecasting and Trading for Multiple Time Horizons with Deep Long Short-Term Memory Networks",
  "abstract": "Price forecasting and trading in the international crude oil market are important issues for investors in energy finance. In this study, we propose an alternative forecasting approach for financial derivative price multiple days ahead and simulated trading based on long short-term memory (LSTM). This study aims to evaluate for different multiple days ahead forecasting and trading by deep LSTM-based model using technical analytic features, which have nonlinear behaviors. The effectiveness of LSTM networks trained by backpropagation through time for test objective prediction is explored. Moreover, instead of using only one crude oil market's spot price data as a data source, we build up a crude oil database with the two most important crude oil markets. The results indicate that the proposed approach outperforms others in terms of accuracy, return, and risk aspect. The forecasting and holding (for trade) time horizons are 1-3 days ahead, respectively. For all three multiple days ahead forecasting and trading, the average test accuracy (judged by root mean square error) of two crude oil markets for four datasets of deep LSTM-based model yields best results among all methods. This study also developed trading strategies, and the proposed LSTM-based method also outperforms other benchmark methods on both return and return-risk ratio (judged by Sharpe ratio). The experimental results indicate that the proposed method can help traders make profits in the financial derivative market and is more effective than the state-of-the-art methods in actual trading.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "4ff383b87f1d93ac59c6c02a1676bf63",
  "timestamp": "2025-05-15T01:33:49.060885"
}