{
  "id": 1640,
  "title": "Investigation of finance industry on risk awareness model and digital economic growth",
  "abstract": "Financial risk is unintended to lose money on an enterprise or investment. Credit risk, Liquidity risk, and operational risk are some more prevalent and unique financial concerns. This is a form of risk that can lead to a capital loss for stakeholders. Building a company from the bottom up is expensive. Any firm may need to go for cash outside to develop at some time in their lives. Financial hazards occur and influence almost every person in various forms and sizes. Digital Financial Services are financial services that rely on customer distribution and the use of digital technologies. While digital financial inclusion (DFI) is important in stimulating economic growth, there is only relatively little empirical data. But whether digital finance is the solution both the bad and the good results of financial inclusion raise. This essay will investigate the importance of digital financial inclusion, utilizing information and communications technology (DFI-ICT) techniques to promote sustainable growth via economic stability. Fast digital technology is currently being used to deliver financial services considerably reduced cost, thereby enhancing financial inclusion and allowing large-scale economic productivity improvements. Although there has been a broad-ranging mention of the benefits of digital finance-financial services offered through mobile telephones, the internet, or cards-we try to measure the size of the economic effect. The experimental result shows that the classification risk level ratio is achieved to 18.9%, and the error rate of classification of the model is checked.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50007fefdfadc13a37be997099fe14f9",
  "timestamp": "2025-05-15T02:05:42.593916"
}