{
  "id": 5669,
  "title": "Volatility spillovers and Asymmetric effects of Chinese A-share markets-Enterprise-Level data Based on high-dimensional social network models",
  "abstract": "This paper investigates volatility spillovers and their asymmetry in the Chinese A-share market from a firm-level perspective. We calculate the connections of the 5-minute high-frequency realized semivariance volatilities of 81 stocks by using a high-dimensional social network approach. The results show that (i) the volatility spillover effect of corporate-level stocks is significant, with high dynamic total connections, and exhibits sector clustering characteristics. (ii) Both extreme contingencies and economic stimulus can exacerbate the asymmetry of volatility spillovers. During periods with economic stimulus, positive volatility spillovers are much larger than negative ones; at other times, negative spillovers are larger than positive spillovers. (iii) There is a positive linear relationship between the asymmetries in the volatility spillovers received and released by individual stocks. (iv) The financial sector is more sensitive to positive volatility spillovers and dominates the positive volatility spillover system. The telecommunication services and utilities sectors are net emitters of negative volatility spillovers. Our research has substantial ramifications for investors and policy makers with respect to distinguishing different transmission paths of upside and downside risks, conducting better portfolio optimization and establishing risk warning mechanisms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5002ddbfc947e9588d0335b383e7f3a6",
  "timestamp": "2025-05-15T02:50:21.149975"
}