{
  "id": 9254,
  "title": "Grief and Economic Stressors by Sex, Gender, and Education",
  "abstract": "Background and ObjectivesThe prevalence and impact of stressful life events (SLEs) on age-related and Alzheimer disease (AD)-related pathways may depend on social determinants including gender and education. We investigated whether specific SLEs are associated with AD pathology and neurodegeneration and how these associations differ by gender and education.MethodsThis cross-sectional study included cognitively unimpaired participants, most with a family history of sporadic AD, from the ALzheimer's and FAmilies (ALFA) cohort, based in Barcelona, Spain. Participants had available assessments on occurrence and type of lifetime SLEs and lumbar puncture and/or structural MRI. We performed multiple regression analyses to examine the associations of specific SLE type with (1) AD pathologies (CSF phosphorylated tau 181 [p-tau181] and beta-amyloid [A beta] 42/40) and (2) neurodegeneration markers (CSF neurogranin and GM volumes voxel-wise) including interaction and stratification analyses by gender (women/men) and education.ResultsIn total, 1,290 cognitively unimpaired participants (mean age = 59.4 years, range: 48-77 years, 99% White participants, 61% women) were included (393 with lumbar puncture and 1,234 with spectroscopic MRI assessments). Less educated participants and women reported more grief-related and economic-related SLEs. Furthermore, women reported more abuse and reproductive SLEs. Grief-related SLEs were associated with AD and neurodegeneration CSF outcomes while economic SLEs were associated with MRI-based GM outcomes, both in an age-independent manner. Specifically, partner's death was associated with lower A beta 42/40 (B = -5.19; 95% CI -9.61 to -0.76; p = 0.022) and higher p-tau181 (B = 0.18; 95% CI 0.05-0.32; p = 0.007) and neurogranin (B = 0.19; 95% CI 0.05-0.32; p = 0.007). The associations with A beta 42/40 were driven by less educated participants and men and associations with p-tau181 and neurogranin driven by women. Unemployment and economic loss were associated with lower GM volumes in limbic and frontal areas, driven by more educated participants and men and by women, respectively.DiscussionOlder adults at risk of cognitive decline with less education and women may be more susceptible to experience more SLEs. Men who have experienced widowhood and unemployment and women who have experienced financial difficulties may benefit from interventions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5006a7d17ed2a6cc442cc16b943f815d",
  "timestamp": "2025-05-15T03:26:54.609619"
}