{
  "id": 4017,
  "title": "A Risk Measurement Model of China's Non-Ferrous Metal Futures Market",
  "abstract": "With the impact of foreign exchange markets, risks in financial markets are becoming more complex and diversified, which underlines the importance of risk management in financial supervision. In this paper, China's non-ferrous metal futures market is selected as the research object, and Shanghai Futures Exchange's Industrial Metal Commodity Index (IMCI) data are used to measure risk using the conditional autoregressive value at risk (CAViaR) model. The US dollar index (USDX) is incorporated into the CAViaR model to study its impact on the risk. Through empirical analysis, we arrive at the following conclusions: First, the asymmetric slope CAViaR model (AS-CAViaR) is more suitable for measuring the risk in China's non-ferrous metal futures market. Second, the risk is positively impacted by the lagged risk. Moreover, the impacts of positive and negative returns on the risk are asymmetric, with a negative return having a greater impact. Third, the positive and negative shock of USDX has significant and different impacts on the risk. These impacts can be caused by global capital flows. In addition, the impact of the vector of explanatory variables on the IMCI at different quantile levels is discussed based on the CAViaR-USDX model, which reflects the comprehensive advantages of the quantile regression method and the model's applicability. The above conclusions verify the impact of USDX on China's non-ferrous metal futures market and provide a theoretical basis and direction for risk monitoring.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "501254534e7b287daa536c6784cce4a9",
  "timestamp": "2025-05-15T02:32:27.429812"
}