{
  "id": 5840,
  "title": "Validity of a Subjective Financial Situation Measure to Assess Socioeconomic Status in US Young Adults",
  "abstract": "Purpose: Young adulthood is an important period for preventing the establishment of negative health behaviors that can influence trajectories to chronic disease and early death. Given the evolving nature of educational attainment and income variation during this developmental period, identifying indicators of socioeconomic status (SES) remains a challenge. This study examines measures of subjective and objective indicators of SES to predict health risk for young adults. Methods: This study uses data from the Truth Initiative Young Adult Cohort Study from respondents aged 18 to 34 years who completed 3 consecutive surveys between June 2011 and August 2012 (n = 2182). Analyses were conducted to compare a measure of subjective financial situation (SFS) to commonly used SES measures for adults and adolescents. Age-stratified, multivariable logistic regression was used to model the relationship between 5 SES indicators (SFS, household income, respondent education, parental education, and subjective childhood financial situation) and dichotomized versions of 3 health status measures (body mass index, self-reported health status, and quality of life), controlling for gender, race/ethnicity, and region. Results: Findings indicate that SFS is associated with other commonly used SES measures. Prospective associations with health outcomes revealed that SFS is a stronger predictor of health outcomes among young adults aged 18 to 24 years as compared with other SES measures. Conclusion: This study provides evidence that subjective financial situation may be more robust than traditional SES indicators in predicting health outcomes among young adults, particularly for 18- to 24-year-olds, and should be considered a viable candidate measure for assessing SES among this age group.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5014ec211e8b13577612acf936982125",
  "timestamp": "2025-05-15T02:51:58.598854"
}