{
  "id": 4060,
  "title": "Corporate governance and financing risk in Islamic banks in Indonesia",
  "abstract": "Purpose This study aims to analyse the role of corporate governance in moderating the effects of murabahah, mudharabah and musyarakah financing on the financing risk and financial performance of Islamic banks. Design/methodology/approach The population for this study covered Islamic banks in Indonesia. Purposive sampling was performed, and statistical analysis was conducted using moderating regression analysis by selecting among the common, fixed and random effects models. Findings The results showed that murabahah financing has a positive effect on financing risk; conversely, mudharabah financing has a negative effect on financing risk. By contrast, musyarakah financing has no effect on financing risk. However, corporate governance weakens the influence of murabahah financing on financing risk and increases that of mudharabah financing on financing risk. Further, corporate governance cannot weaken the effect of musyarakah financing on financing risk. Additionally, financing risk reduces financial performance. Research limitations/implications This research focusses only on Indonesian Islamic banks; future research should be extended to Islamic insurance and Islamic micro finance. Practical implications The results serve as input for government regulations on corporate governance in Islamic bank financing and encourage Islamic banks to diversify their financing proportionally. Social implications This research can be used for optimising Islamic bank financing to empower the realty sector and reduce poverty. Originality/value Research on the role of corporate governance as a moderating variable in reducing financing risk in Islamic banks remains limited.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50176eaf99c0049c6c32c2de915a5a2a",
  "timestamp": "2025-05-15T02:32:27.642334"
}