{
  "id": 7028,
  "title": "CLINICAL CHARACTERISTICS AND HOSPITAL CHARGES AMONG THAI CHILDREN HOSPITALIZED WITH INFLUENZA",
  "abstract": "Infants and young children are at high risk for influenza-associated morbidity, mortality, and the need for hospitalization. Only limited information is available regarding the clinical findings, outcomes, and financial burden incurred by Thai children hospitalized with severe influenza, therefore, we examined these areas in this retrospective study. The children were diagnosed with having influenza by either a real-time reverse transcriptase-polymerase chain reaction or rapid testing. Two hundred eighty-nine influenza cases hospitalized at the Queen Sirikit National Institute of Child Health, Bangkok, Thailand were reviewed. Influenza A, B, and mixed A/B infections were identified in 204(70.6%), 79 (27.3%), and 6 cases (2.1%), respectively. Children aged younger than 5 years comprised the greatest proportion of cases (60.9%). Fever was the most common symptom (100%), followed by cough (90.3%) and rhinorrhea (70.6%). Diarrhea and thrombocytopenia were found in 22% and 10.4%, respectively. Most cases recovered uneventfully but 2 patients died (fatality rate =0.7%). The median (IQR) duration of hospitalization were 3 (3) days. The median hospital charge was USD169.4 (177.6). Being younger than 2 years old, having predisposing comorbidities, and/or receiving oseltamivir treatment were significantly associated with longer hospitalization; the latter two were associated with higher hospital charges. On logistic regression analyses, being younger than 2 years old was an independent risk factor for disease severity. Most children hospitalized with pediatric influenza had an uncomplicated clinical course. Young children and those with predisposing co-morbidities are at increased risk for extended hospitalization and higher treatment costs.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5024d540aa90e05bba2c85049827c53f",
  "timestamp": "2025-05-15T03:04:23.000083"
}