{
  "id": 1477,
  "title": "AI-System of Stock Exchange Trading Robot for Financial Risk Hedging",
  "abstract": "The article considered the theoretical basis for the calculation of financial risks, their hedging with the help of artificial intelligence. The article presents a neural network for the assessment of financial risk for atime sequence of VAR-methods with a view to mitigate it when engaging in stock exchange trade. A hypothesis was formulated and proved that with the help of the developed AI-system that had been taught on the basis of a combined data sample with digitilized new fluctuations information from web-sites and time sequence candlestick charts for SiU9 US Dollar futures contracts in a 15-minute timeframe, it is possible to increase the accuracy of a futures price forecast and ensure the assessment of financial risks using the VAR-method for hedging an uncovered position with a PUT option. As is shown by scientific research, today the majority of stock operations are conducted using trade systems, or trade robots, and their number is continuously increasing. Among trade systems, we can single out the ones using artificial intelligence (AI). The novelty of the research results from the fact that in order to forecast the price of a futures contract, both candlestick charts parameters and size and digitilized news fluctuations received by Skraper programme from web- sites were used to teach the neural network. The created data set was used in the perceptron with 305 parameters in the input layer, 2 hidden layers by 100 10 parameters correspondingly and an output layer with one parameter, the target price. The perceptron was created and used on the Deductor platform, and the Python -based Skraper programme was put into Spark framework and was employed with the help of parallel calculations. The results yielded by the neural network were analysed concerning the accuracy of the forecast of the price of a financial instrument, a SiU9 futures contract at MoEx, a Russian stock exchange, when working in a 15-minute timeframe. The hedging mechanism for an uncovered long position of a SiU9 futures was activate by buying two PUT Si-9 options with an increasing risk parameter that had been calculated using the VaR-method. As a result of the conducted research, a neural network trade algorithm was created for speculative trading at the stock exchange with a SiU9 USD futures contract with high accuracy and minimal loss risks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5025e75951e3d531e6eebb56c38764bd",
  "timestamp": "2025-05-15T02:03:39.745024"
}