{
  "id": 3745,
  "title": "Evaluating of attributes affecting contractors' sustainability productivity management in developing countries based on the balanced scorecard perspectives",
  "abstract": "This study evaluates the attributes affecting contractors' sustainable productivity management in developing countries, utilizing the Balanced Scorecard (BSC) framework. By synthesizing existing knowledge from previous research, the study developed a portfolio of twenty-nine attributes organized into four groups aligned with the BSC perspectives. The feasibility of these attributes was tested through semi-structured interviews with fifteen experts over three rounds using the Delphi technique based on the Knowledge Acquisition for Multiple Experts with Time Scales (KAMET) rules. Subsequently, a survey with 325 respondents from the construction sector in Vietnam was conducted. Reliability was assessed using Cronbach's Alpha, and Exploratory Factor Analysis was performed to build the model. Multiple regression analysis tested the research hypotheses. The study identified twenty-nine key attributes distributed across financial, customer, internal processes, and learning-growth perspectives, finding significant correlations with sustainable productivity management. It offers practical recommendations for stakeholders, bridging theory and practice and emphasizing balanced economic performance, environmental stewardship, and social responsibility. This study provides actionable insights through the BSC framework to enhance contractor productivity sustainably, addressing a critical need for guidance in developing countries' construction sectors and fostering long-term industry growth.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "502fcf3732d29611932903c3ccf58cd5",
  "timestamp": "2025-05-15T01:20:35.942058"
}