{
  "id": 6355,
  "title": "Funding gap in the Hungarian venture capital market",
  "abstract": "Our study investigates the size of the so-called financing gap in the Hungarian venture capital market, i.e. the amount that can potentially be lent out, which is currently not covered by the Hungarian financial intermediary system on a market basis. The relevant literature will be reviewed to assess the performance and characteristics of the Hungarian market. The Hungarian financial intermediation system, traditionally based on banking, underperforms in all segments of capital market financing, even by Central and Eastern European standards. In our research, we sought to find out whether the available sources of venture capital could meet market needs. Both the number and volume of transactions in the domestic venture capital and private equity markets are low by international standards, and the role of the state is below the average for CEE countries. The novelty of our analysis lies in the fact that there is no similar literature available in Hungary. Our estimation based on linear regression revealed a strong relationship between venture capital investment and current GDP. The difference between the estimated potential risk capital stock and the annual averages zrealized clearly shows the market gap. In addition to the public programmes already implemented, the annual amount of risk capital missing from the domestic market is in the order of EUR 12.5-31.6 million, i.e. roughly HUF 5.1-13.3 billion per year at the euro exchange rate at the time of analysis. If this resource were available, domestic startups would have greater growth opportunities. Our analysis suggests that not only a state presence but even an increase in it, seems justifiable (or at least worth exploring). The research was supported by the National Research, Development and Innovation Office (FK-142492).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50327f7176d3349f3194af457ffc3c67",
  "timestamp": "2025-05-15T02:57:07.777238"
}