{
  "id": 507,
  "title": "Reducing dropout rate through a deep learning model for sustainable education: long-term tracking of learning outcomes of an undergraduate cohort from 2018 to 2021",
  "abstract": "In recent years, initiatives and the resulting application of precision education have been applied with increasing frequency in Taiwan; the accompanying discourse has focused on identifying potential applications for artificial intelligence and how to use learning analytics to improve teaching quality and learning outcomes. This study used the established dropout risk prediction model to improve student learning effectiveness. The model was based on the academic portfolios of past students and built with statistical learning and deep learning methods. This study used this model to predict the dropout risk of 2205 freshmen enrolled in the fall semester of 2018 (graduated in June 2022) in the field of sustainable education. A total of 176 students with a dropout risk of more than 20% were considered high-risk students. After tracking and the appropriate guidance, the dropout risk of 91 students fell from > 20% to < 20%. To discuss the results from the perspective of gender and financial disadvantages, the improvement rate of the dropout risk for male students was 10.2% better than that of female students at 2.9%. The improvement rate in dropout risk for students with disadvantageous financial situations was as high as 12.0%, surpassing the 5.9% rate among general students. Overall, the dropout rate in the second year of the 2018 freshman cohort was lower than that of the 2016 and 2017 freshman cohorts. A predictive model established by statistical learning and deep learning methods was used as a tool to promote precision education, accurately and efficiently identifying students who are having difficulty learning, as well as leading to a better understanding of AI (artificial intelligence) in smart learning for sustainable education.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5033bc1886cad8c450b9fae7cce57be7",
  "timestamp": "2025-05-15T01:38:59.324848"
}