{
  "id": 9318,
  "title": "IMPLEMENTATION OF NATIONAL PROJECTS OF THE SECOND WAVE IN THE SOUTHERN REGIONS OF RUSSIA WITHIN REFERENCE POINTS COMPETITIVENESS, SUSTAINABILITY, SECURITY, BALANCE: ECONOMIC AND POLITICAL ANALYSIS",
  "abstract": "Introduction. The study is devoted to the results of the implementation of regional projects by the federal entities of the Southern Federal District in 2019 within the reference points of competitiveness, sustainability, security, balance. Its peculiarity consists in the analysis of the interrelations between the achieved state of competitiveness, sustainability, security, balance, the level of socio-economic development in a particular region, the quality of the implementation of regional projects in the context of the specifics of the regional management system, the existing relations between authorities, economic entities, civil society institutions. At the same time, along with the quality of life, it is important to achieve political stability and security. Methodology and methods. The research methodology is based on the systemic paradigm of the relationship between the instruments of state regulation of regional development and the results of regional development within the reference points of competitiveness, sustainability, security, balance of regions, for which a database on the regional implementation of national projects was formed. In order to obtain quantitative characteristics, an integral scoring method of ranking with a correlation and regression analysis was applied. Analysis. The research showed that the higher the indicators of competitiveness, sustainability, security, balance, the better the quality of regional projects' implementation. In turn, the reference points: competitiveness, sustainability, security, balance are higher in the regions with high values of gross regional product in general and per capita, as well as these federal entities have higher values of the achieved standard of living. Results. The correlation between efficiency level of territorial economic systems, assessed on the basis of indicators of competitiveness, sustainability, security, balance and the quality of the results of national projects' implementation was studied, which made it possible to determine that the higher the level of regional development, the better national projects are realized. The idea is justified that the existing form of regional projects' implementation becomes a factor not smoothing, but strengthening the territorial differentiation, since regions with a better level of development and large gross regional product values due to regional projects receive an additional stimulus for further changes. The conclusion about the limited character of the approach that connects the issues of territories mainly with the lack of financial resources is made. Significant role of the institutional factor of regional development, especially risk-oriented management, in the implementation of national projects is shown.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "504c02df13c4558e323050c809462b6e",
  "timestamp": "2025-05-15T03:27:53.297100"
}