{
  "id": 3179,
  "title": "Cleveland Clinic Lerner College of Medicine: An innovative approach to medical education and the training of physician investigators",
  "abstract": "Cleveland Clinic Lerner College of Medicine (CCLCM) is an innovative, five-year medical education track within Case Western Reserve University School of Medicine (Case) with a focused mission to attract and educate a limited number of highly qualified persons who seek to become physician investigators. CCLCM curriculum governance, faculty appointments and promotions, and admissions committees are integrated with respective Case committees. The CCLCM curriculum is based on faculty-defined professional attributes that graduates are expected to develop. These attributes were used to create curricular and assessment principles that guided the development of an integrated basic science, clinical science, and research curriculum, conducted in an active learning environment. An organ-system approach is used to solidify an understanding of basic science discipline threads in the context of relevant clinical problems presented in PBL and case-based discussion formats. Clinical skills are introduced in the first year as part of the two-year longitudinal experience with a family practice or internal medicine physician. The research program provides all students with opportunities to learn and experience basic and translational research and clinical research before selecting a research topic for their 12- to 15-month master-level thesis project. All Case students participate in required and elective clinical curriculum after the second year, but CCLCM students return to the Cleveland Clinic on selected Friday afternoons for program-specific research and professionalism-learning activities. A unique portfolio-based assessment system is used to assess student achievements in nine competency areas, seven of which reflect the Accreditation Council for Graduate Medical Education competencies.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "505393ae1a2048f9f84cebe0a234deeb",
  "timestamp": "2025-05-15T01:14:16.275782"
}