{
  "id": 273,
  "title": "RETRACTED: Green Financial Health Risk Early Monitoring of Commercial Banks Based on Neural Network Model in a Small Sample Environment (Retracted Article)",
  "abstract": "Financial innovations emerge in an endless stream, and it is difficult for the regulatory measures and efforts of banks in various countries and the credit risk management level of commercial banks themselves to adapt to the increasingly complex risk environment faced by banks. In the process of building GFR (green financial risk) mixed governance model, the division of powers and responsibilities of governance subjects should be effectively defined. Therefore, it is very necessary to comprehensively and systematically study and grasp the characteristics, performance, and causes of commercial banks' GFR and build an early-warning model of commercial banks' GFR to comprehensively monitor the risks of banks, so as to reduce risks and avoid crises. Therefore, this paper uses the forward three-layer BPNN (BP neural network) technology to establish a real-time warning model of commercial banks' GFR. IL (input layer) to HL (hidden layer) adopts Sigmoid function, while HL to OL (output layer) function adopts linear function Purelin function. The results show that the test result of this method is greatly improved compared with the traditional method, and the correct rate is increased from 81.27% to 94.38%. It shows that the model in this paper has achieved a good warning effect of GFR for commercial banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "506008b315555d0057e76122a5efc89a",
  "timestamp": "2025-05-15T01:49:04.534358"
}