{
  "id": 2494,
  "title": "Risk perceptions and risk management strategies among poultry farmers in south-west Nigeria",
  "abstract": "The poultry industry contributes significantly to the development of Nigeria's economy. Unfortunately, poultry farmers like other farmers are faced with a variety of income fluctuations arising from risks associated with the enterprise. Hence, this study investigated risk perceptions and risk management strategies among poultry farmers. Respondents were selected using multi-stage sampling techniques. The techniques resulted to selection of 263 commercial poultry farmers who provided us with relevant information with the aid of pre-tested questionnaire. The information gathered was analysed using descriptive statistics, factor analysis and linear regression models. Results showed that production risk, financial risk and human risk were perceived by farmers as most important in poultry business. Farmers have adopted disease prevention and financial management strategies to mitigate the effects of various risks. The analysis further showed that years of experience in poultry business, value of poultry and production risk are important determinants of disease prevention and financial management strategies adopted by the respondents. Factors that determine only disease prevention strategy are years of schooling, household size and human risk, while respondents' sex and financial risk are the determinants of financial strategy. Policies on risk management in poultry should be targeted at farmers' socio-economic characteristics and risk perceptions so as to enhance the growth potentials of poultry farmers and prevent collapse of the poultry industry.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5060711ce2ff9b8a4da6b6d358b81f09",
  "timestamp": "2025-05-15T02:15:59.879270"
}