{
  "id": 5369,
  "title": "Assessing factors affecting drought, earthquake, and flood risk perception: empirical evidence from Bangladesh",
  "abstract": "Understanding household disaster risk perception is crucial to formulate and apply disaster risk reduction strategies. Using survey data from 300 households from three highly disaster-prone areas of the lower Teesta River basin in Bangladesh, this study explores households' risk perception of drought, earthquake, and flood at the local level. The ordered probit regression model was applied to identify the factors influencing household disaster risk perception. Most of the respondents perceived the likelihood of occurring drought, earthquake, and flood hazards on a large scale in the selected areas which cause negative impacts on their quality of life and financial losses. They have lack knowledge on mitigation actions which makes them unable to control the devastating impacts of disasters. Econometric results show that households' age, gender, education, and income-generating sources had significantly influenced the respondent's drought, earthquake, and flood risk perception. Female participants have less knowledge on mitigations actions and are less capable of controlling the hazards than their counterparts making them more vulnerable to the impacts of hazards. Urgent action is required to improve their socio-economic conditions, and to reduce the knowledge gap between males and females as well as to improve the household's understanding of mitigation and preparedness for disaster risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50644a7e75d78a399654c0e81609dfdc",
  "timestamp": "2025-05-15T02:47:13.894661"
}