{
  "id": 8222,
  "title": "Psychosocial and demographic predictors of postpartum physical activity",
  "abstract": "Physical activity promotes better health outcomes across the lifespan, and provides physical and mental health benefits for women who have recently given birth. However, research has not adequately characterized physical activity levels or risk factors for inadequate physical activity during the postpartum period. The objective of the present study was to describe levels and correlates of physical activity at 6months postpartum in mothers of diverse race/ethnicity (55% African American, 23% White, 22% Hispanic/Latina), with the majority living in or near poverty. We analyzed data collected by the five-site Community Child Health Network study. Women (n=1581) were recruited shortly after the birth of a child. Multinomial logistic regression models tested associations of demographic factors and self-reported stress in several life domains with total physical activity levels at 6-9months postpartum, including activities done at work, at home, for transportation, and leisure. Thirty-five percent of participants in this sample reported low levels of physical activity. African American race, Latina ethnicity, and living in a rural area were associated with low levels of physical activity, whereas working outside the home was associated with high physical activity. Contrary to hypotheses, chronic stress was not associated with physical activity with the exception of financial stress, which predicted greater likelihood of being highly physically active. These findings suggest that optimal postpartum care should integrate physical activity promotion, and that African American, Latina, and rural-dwelling women may benefit most from efforts to promote activity following birth.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "506656eef226277a81055b2347180183",
  "timestamp": "2025-05-15T03:16:48.860902"
}