{
  "id": 6598,
  "title": "The cost of waiting: Association of ED boarding with hospitalization costs",
  "abstract": "Background: Emergency Department (ED) boarding, the practice of holding patients in the ED after they have been admitted to the hospital due to unavailability of inpatient beds, is common and contributes to the public health crisis of ED crowding. Prior work has documented the harms of ED boarding on access and quality of care. Limited studies examine the relationship between ED boarding and an equally important domain of quality-the cost of care. This study evaluates the relationship between ED boarding, ED characteristics and risk-adjusted hospitalization costs utilizing national publicly-reported measures. Methods: We conducted a cross-sectional analysis of two 2018 Centers for Medicare and Medicaid Services (CMS) Hospital Compare datasets: 1) Medicare Hospital Spending per Patient and 2) Timely and Effective Care. We constructed a hospital-level multivariate linear regression analysis to examine the association between ED boarding and Medicare spending per beneficiary (MSPB), adjusting for ED length of stay, door to diagnostic evaluation time, and ED patient volume. Results: A total of 2903 hospitals were included in the analysis. ED boarding was significantly correlated with MSPB (r = 0.1774; p-value: < 0.0001). In multivariate regression, ED boarding was also positively associated with MSPB (Beta: 0.00015; p < 0.0001) after adjustment for other hospital level crowding indicators. Conclusion: We found a strong relationship between measures of ED crowding, including ED boarding, and risk adjusted hospital spending. Future work should elucidate the mediators of this relationship. Policymakers and administrators should consider the financial harms of ED boarding when devising strategies to improve hospital care access and flow. (c) 2020 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "506d9f806023902e036af1cc8ddf4868",
  "timestamp": "2025-05-15T02:59:37.082663"
}