{
  "id": 7034,
  "title": "Social prescription for isolated parenting in Japan: Socioeconomic characteristics of mothers with weak social connectivity in their community",
  "abstract": "The social connection of mothers is important for the sound development of children and the prevention of child maltreatment. Understanding the attributes of mothers at risk of isolation enables community workers to support vulnerable mothers. This cross-sectional study aimed to identify the socioeconomic predictors of isolation risk for mothers and was conducted in Japan between December 2018 and February 2019. The self-administered questionnaire included the Social Connectivity of Mother Scale along with maternal age, marital status, employment status, education, number of children, years of child-rearing experience, whether childcare or kindergarten was used, family structure, years of residence, housing type, family finances, and level of neighbourhood interactions. There were 510 valid responses (51.6%). In the multiple regression analysis, five socioeconomic characteristics were associated with mothers' low social connectivity: the standardised coefficient of the maternal age of 20-24 was -0.12 (p = 0.004), lack of childcare or kindergarten usage, -0.09 (p = 0.032), and poor family finances, -0.09 (p = 0.031); mothers' perception of neighbourhood interactions was found to be poor at -0.29 (p < 0.001). The model did not take into account the effects of family finances, and the scores were low when the highest level of education of the mother was junior high or high school. Mothers' perception of neighbourhood interactions was a significant predictor of isolation risk, along with maternal age, education level, and financial comfort. Our findings give policymakers, community workers, and community leaders an insight into the importance of cultivating interactions among neighbourhood communities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5085ca66a591863e02c00707cb3c8222",
  "timestamp": "2025-05-15T03:04:23.010866"
}