{
  "id": 5291,
  "title": "ECONOMIC IMPERATIVES OF FINANCIALIZATION OF AGRICULTURAL COMMODITY MARKETS",
  "abstract": "Purpose. The purpose of the article is to substantiate the theoretical and methodological foundations and economic feasibility of intensifying the processes of financialization of the business model of Ukrainian grain producers, in particular through the formation of the grain futures market and the creation of commodity exchange in Ukraine. Methodology / approach. In the article, it is clarified the concept of financialization as one of the global trends of economic development that provides deep integration of financial and real economy on macro- and micro levels. Hedge effectiveness of price risks for Ukrainian grain (wheat and corn) using futures contracts traded on CME Group and Euronext is evaluated using regression analysis. Ukrainian wheat and corn FOB price volatility for 2016-2021 marketing years is estimated. The dynamics and volatility of the basis for Ukrainian wheat and corn and respective futures contracts traded on CME Group and Euronext are analyzed. Results. The analysis of securitization index of global agricultural markets has shown an increase of its financialization rate. The main reasons for this process were the deepening of financial and commodity markets integration, deregulation of financial markets and introduction of new financial instruments. The structure of the grain market in Ukraine is analyzed, particularly the role of agricultural holdings and international companies. The tendencies and determinants of wheat and corn market prices in Ukraine during marketing year are revealed. Regression analysis of hedge effectiveness has shown that all considered futures contracts are suitable for wheat and corn CPT and FOB price hedging in Ukraine. The highest hedge effectiveness was revealed for Black Sea Corn Financially Settled (Platts) Futures) (CME Group) and Milling Wheat / Ble de Meunerie (Euronext Matif). Short hedge efficiency of CME Group futures contracts was supported by analysis of basis dynamics for Ukrainian wheat and corn and respective futures contracts. Originality / scientific novelty. Based on the analysis of the theoretical foundations of financialization, the positive and negative consequences of the strengthening of financialization of global commodity markets and the peculiarities of the functioning of the modern grain market in Ukraine, the economic imperatives of the development of the Ukrainian market of grain derivatives, as an objectively determined trend of agricultural commodity market, are substantiated. The evaluation of the effectiveness of hedging price risks on the Ukrainian grain markets using derivatives traded on global exchanges has gained further development. Practical value / implications. It is proposed to intensify market tools usage for risk hedging in Ukraine in order to cover interests of all market participants. Risk management instruments available for Ukrainian agricultural producers are discussed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "508983a304e55493a3f7ed75c1028f17",
  "timestamp": "2025-05-15T02:46:16.243241"
}