{
  "id": 4208,
  "title": "Regression modelling of conditional morphogene expression links and quantifies the impact of growth rate, fitness and macromorphology with protein secretion in Aspergillus niger",
  "abstract": "BackgroundFilamentous fungi are used as industrial cell factories to produce a diverse portfolio of proteins, organic acids, and secondary metabolites in submerged fermentation. Generating optimized strains for maximum product titres relies on a complex interplay of molecular, cellular, morphological, and macromorphological factors that are not yet fully understood.ResultsIn this study, we generate six conditional expression mutants in the protein producing ascomycete Aspergillus niger and use them as tools to reverse engineer factors which impact total secreted protein during submerged growth. By harnessing gene coexpression network data, we bioinformatically predicted six morphology and productivity associated 'morphogenes', and placed them under control of a conditional Tet-on gene switch using CRISPR-Cas genome editing. Strains were phenotypically screened on solid and liquid media following titration of morphogene expression, generating quantitative measurements of growth rate, filamentous morphology, response to various abiotic perturbations, Euclidean parameters of submerged macromorphologies, and total secreted protein. These data were built into a multiple linear regression model, which identified radial growth rate and fitness under heat stress as positively correlated with protein titres. In contrast, diameter of submerged pellets and cell wall integrity were negatively associated with productivity. Remarkably, our model predicts over 60% of variation in A. niger secreted protein titres is dependent on these four variables, suggesting that they play crucial roles in productivity and are high priority processes to be targeted in future engineering programs. Additionally, this study suggests A. niger dlpA and crzA genes are promising new leads for enhancing protein titres during fermentation.ConclusionsTaken together this study has identified several potential genetic leads for maximizing protein titres, delivered a suite of chassis strains with user controllable macromorphologies during pilot fermentation studies, and has quantified four crucial factors which impact secreted protein titres in A. niger.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50af94e02df76cdaad4ae1f4193b710a",
  "timestamp": "2025-05-15T01:24:51.446335"
}