{
  "id": 5367,
  "title": "Predictors of depressive symptoms in older Japanese primiparas at 1 month post-partum: A risk-stratified analysis",
  "abstract": "AimOlder maternal age has become more common in Japan. Studies suggest that older maternal age and primiparity are associated with post-partum depression. The present study aimed to identify predictors of post-partum depression in older Japanese primiparas at 1 month post-partum. MethodsParticipants were 479 primiparas aged 35 years and over, drawn from a prospective cohort study. Data were collected using self-report questionnaires. Depression was measured with the Japanese version of the Edinburgh Postnatal Depression Scale. Stepwise logistic regression analysis was conducted on binary outcome variables of depression at 1 month post-partum, along with a stratified analysis based on the risk status of depression. ResultsFive predictors were identified: (i) the depression score during hospital stay; (ii) financial burden; (iii) dissatisfaction with appraisal support; (iv) physical burden in daily life; and (v) concerns about infant caretaking. Stratified analysis identified dissatisfaction with instrumental support in the low-risk group, and the Child-care Value Scale score as unique predictors in the high-risk group. ConclusionThese results highlight the importance of early assessment of depressive symptoms and the provision of continuous care.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50bf99d3307535efcf2a5c555f222f94",
  "timestamp": "2025-05-15T02:47:13.881653"
}