{
  "id": 1579,
  "title": "Precision in Prevention: Tailoring Single-Use Negative Pressure Wound Therapy Utilization Through Artificial Intelligence-Based Surgical Site Complications Risk and Cost Modeling",
  "abstract": "Background: Surgical site complications (SSCs) are common, yet preventable hospital-acquired conditions. Single-use negative pressure wound therapy (sNPWT) has been shown to be effective in reducing rates of these complications. In the era of value-based care, strategic allocation of sNPWT is needed to optimize both clinical and financial outcomes.Materials and Methods: We conducted a retrospective analysis using data from the Premier Healthcare Database (2017-2021) for 10 representative open procedures in orthopedic, abdominal, cardiovascular, cesarean delivery, and breast surgery. After separating data into training and validation sets, various machine learning algorithms were used to develop pre-operative SSC risk prediction models. Model performance was assessed using standard metrics and predictors of SSCs were identified through feature importance evaluation. Highest-performing models were used to simulate the cost-effectiveness of sNPWT at both the patient and population level.Results: The prediction models demonstrated good performance, with an average area under the curve of 76%. Prominent predictors across subspecialities included age, obesity, and the level of procedure urgency. Prediction models enabled a simulation analysis to assess the population-level cost-effectiveness of sNPWT, incorporating patient and surgery-specific factors, along with the established efficacy of sNPWT for each surgical procedure. The simulation models uncovered significant variability in sNPWT's cost-effectiveness across different procedural categories.Conclusions: This study demonstrates that machine learning models can effectively predict a patient's risk of SSC and guide strategic utilization of sNPWT. This data-driven approach allows for optimization of clinical and financial outcomes by strategically allocating sNPWT based on personalized risk assessments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50c8abe72d4eaf4d07c7e83025ab20f9",
  "timestamp": "2025-05-15T02:05:08.141174"
}