{
  "id": 3987,
  "title": "Use of a Cytosponge biomarker panel to prioritise endoscopic Barrett's oesophagus surveillance: a cross-sectional study followed by a real-world prospective pilot",
  "abstract": "Background Endoscopic surveillance is recommended for patients with Barrett's oesophagus because, although the progression risk is low, endoscopic intervention is highly effective for high-grade dysplasia and cancer. However, repeated endoscopy has associated harms and access has been limited during the COVID-19 pandemic. We aimed to evaluate the role of a non-endoscopic device (Cytosponge) coupled with laboratory biomarkers and clinical factors to prioritise endoscopy for Barrett's oesophagus. Methods We first conducted a retrospective, multicentre, cross-sectional study in patients older than 18 years who were having endoscopic surveillance for Barrett's oesophagus (with intestinal metaplasia confirmed by TFF3 and a minimum Barrett's segment length of 1 cm [circumferential or tongues by the Prague C and M criteria]). All patients had received the Cytosponge and confirmatory endoscopy during the BEST2 (ISRCTN12730505) and BEST3 (ISRCTN68382401) clinical trials, from July 7, 2011, to April 1, 2019 (UK Clinical Research Network Study Portfolio 9461). Participants were divided into training (n=557) and validation (n=334) cohorts to identify optimal risk groups. The biomarkers evaluated were overexpression of p53, cellular atypia, and 17 clinical demographic variables. Endoscopic biopsy diagnosis of high-grade dysplasia or cancer was the primary endpoint. Clinical feasibility of a decision tree for Cytosponge triage was evaluated in a real-world prospective cohort from Aug 27, 2020 (DELTA; ISRCTN91655550; n=223), in response to COVID-19 and the need to provide an alternative to endoscopic surveillance. Findings The prevalence of high-grade dysplasia or cancer determined by the current gold standard of endoscopic biopsy was 1756 (92 of 557 patients) in the training cohort and 10% (35 of 344) in the validation cohort. From the new biomarker analysis, three risk groups were identified: high risk, defined as atypia or p53 overexpression or both on Cytosponge; moderate risk, defined by the presence of a clinical risk factor (age, sex, and segment length); and low risk, defined as Cytosponge-negative and no clinical risk factors. The risk of high-grade dysplasia or intramucosal cancer in the high-risk group was 52% (68 of 132 patients) in the training cohort and 41% (31 of 75) in the validation cohort, compared with 2% (five of 210) and 1% (two of 185) in the low-risk group, respectively. In the real-world setting, Cytosponge results prospectively identified 39 (17%) of 223 patients as high risk (atypia or p53 overexpression, or both) requiring endoscopy, among whom the positive predictive value was 31% (12 of 39 patients) for high-grade dysplasia or intramucosal cancer and 44% (17 of 39) for any grade of dysplasia. Interpretation Cytosponge atypia, p53 overexpression, and clinical risk factors (age, sex, and segment length) could be used to prioritise patients for endoscopy. Further investigation could validate their use in dinical practice and lead to a substantial reduction in endoscopy procedures compared with current surveillance pathways. (C) 2022 The Author(s). Published by Elsevier Ltd.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50c9f0ad5c403622ed962261669ef612",
  "timestamp": "2025-05-15T01:22:39.432555"
}