{
  "id": 490,
  "title": "Financial implications of fourth industrial revolution: Can bitcoin improve prospects of energy investment?",
  "abstract": "Bitcoin and the blockchain technology on which it is based are the key drivers behind the accelerated pace of Fourth Industrial Revolution in the domain of Finance. The offshoots of this technology however are not limited and are rapidly spreading in other domains such as oil market. This paper investigates the causally or influences that both markets, Bitcoin price (BP) and oil price (OP) have on each other by applying the bootstrap Granger causal relationship tests considering full as well as sub-samples. Our analysis reveals that shocks originated in OP and transmitted towards BP can be both positive or negative. The positive impact indicates that Bitcoin can be viewed as an asset helpful in avoiding the risks of the high OP, which also indicates that Bitcoin and oil are in the same boat, however, the negative effects cannot support this view. The negative influence of OP on BP can be explained by the burst of the Bitcoin bubble which has weakened its hedging ability. In turn, there is also a negative influence or reverse causally running from BP to OP, highlighting that the demand for oil by investors can be threatened by the increasing BP. Keeping in view the more integrated and complexed financial dynamics which are the results of Fourth Industrial Revolution, investors can benefit from this interrelationship to diversify the risks and optimize their investment by building a more balanced portfolio. Also, governments could promote and protect the healthy development of the Bitcoin and energy market by preventing the Bitcoin bubbles and understanding the reasons of oil price volatility.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50d107555d769991a5aab769c748a82c",
  "timestamp": "2025-05-15T00:36:26.614353"
}