{
  "id": 4567,
  "title": "The Mental Health of Employees with Job Loss and Income Loss during the COVID-19 Pandemic: The Mediating Role of Perceived Financial Stress",
  "abstract": "The COVID-19 outbreak, which was followed by home confinement, is expected to have had profound negative impact on the mental health of people. Associated factors, such as losing jobs and income, can be expected to lead to an increased risk of suffering from psychopathological problems. Therefore, this study was aimed at researching the associations of job and income loss with mental health, as well as the possible mediating role of perceived financial stress during the COVID-19 outbreak. The sample included 2381 Spanish workers who were interviewed right after the first COVID-19 lockdown. Measures were taken for generalized anxiety disorder, panic attacks, depression, post-traumatic stress disorder, substance abuse, suicidal thoughts and behaviors, working conditions, sociodemographic variables, and perceived financial stress. Logistic regression models were calculated with psychological variables as outcomes, and with job loss and income loss as predictors. Mediation analyses were performed by adding the financial threat as a mediator. Nineteen point six percent and 33.9% of participants reported having lost their jobs and incomes due to the pandemic, respectively. Only income loss was related to a higher risk of suffering from depression and panic attacks. When adding financial stress as a mediator, the indirect effects of job and income loss on the mental health measures were found to be significant, therefore indicating mediation. These findings pinpoint the vulnerability of this population, and highlight the need for interventional and preventive programs targeting mental health in economic crisis scenarios, such as the current one. They also highlight the importance of implementing social and income policies during the COVID-19 pandemic to prevent mental health problems.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50e216b12babb58a1a5ade29f4a1701d",
  "timestamp": "2025-05-15T02:38:56.179208"
}