{
  "id": 5782,
  "title": "DLIFT: A deep-learning-based intelligent fund transaction system for financial Internet of Things",
  "abstract": "Analyzing the correlation between two funds can help investors control investment risks and optimize investment portfolios, which has a strong guiding significance for fund investment in reality. Constructing an intelligent investment system with fund correlation analysis capabilities can help investors automatically make profits from financial markets. In previous research, many researchers have built intelligent investment systems using Bayesian networks, support vector machines (SVM), and LSTM models. However, the strong historical dependence between fund data and the high-dimensional and high-noise characteristics of fund data prevent traditional methods from obtaining excellent performance in fund analysis. This paper designs a deep learning-based fund intelligent trading system-DLIFT which has functions such as investment push, income prediction, and risk control. The systems data analysis module is implemented using the Improved RNN model. This model employed encoder-decoder architecture. The encoder is responsible for analyzing the fund's feature, and the decoder is responsible for analyzing the dependency relationship between the historical correlation and the current correlation. LSTM and an attention mechanism are simultaneously applied to the encoder and decoder, which enabled the discovery of the implicit dependence of time series data. This article places the designed system on a historical dataset containing multiple public funds for verification. In specific experiments, the experimental results of the comparative experiments show the superiority of our model. At the same time, the results of the ablation experiment results show that LSTM and attention mechanism play critical role in the proposed system.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50f18c4eb4428281c602727b437b6de2",
  "timestamp": "2025-05-15T02:51:30.026343"
}