{
  "id": 8082,
  "title": "Factors associated with foot ulcer self-management behaviours among hospitalised patients with diabetes",
  "abstract": "Aims and objectives To determine prehospitalised diabetes-related foot ulcer (DFU) self-management behaviours and explore the factors associated with these behaviours. Background Although there are many studies that explore DFU prevention and treatment, to our knowledge, there are no quantitative studies of DFU self-management behaviours. Design Cross-sectional design. Methods From June 2015-June 2016, 199 hospitalised patients with DFU were given a survey questionnaire at a medical centre in northern Taiwan. DFU self-management behaviours, diabetes foot self-care behaviours, beliefs in regard to barriers to DFU self-management behaviours, and knowledge regarding warning signs of DFU deterioration were assessed by well-designed measurement tools. The Strengthening the Reporting of Observational Studies in Epidemiology checklist was used to ensure quality reporting during this observational study (see Supporting Information Appendix S1). Results The results revealed that 62.8% of participants never monitored their blood glucose level when they had foot ulcers, and 63.8% never sought treatment for their wounds when their wounds were not painful. After controlling for demographic and medical variables, stepwise multiple regression analysis revealed that the following eight significant variables were associated with DFU self-management behaviours: two DFU self-management barrier beliefs, foot self-care behaviour, no treatment for diabetes, poor financial status, employment, knowledge regarding the warning signs of DFU deterioration, and number of DFU hospitalisations. Conclusions Diabetes-related foot ulcer self-management behaviours were insufficient. Some modifiable factors and high-risk groups for insufficient DFU self-management behaviour were identified. Relevance to clinical practice Diabetes-related foot ulcer self-management behaviours should be promoted. Interventions that modify the risk factors that were identified in this study can be designed to promote the performance of DFU self-management behaviours.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "50f5d6d87c24f4b433a059e4345f24ac",
  "timestamp": "2025-05-15T03:15:09.333797"
}