{
  "id": 7248,
  "title": "Buy Now Pay Later-A Fad or a Reality? A Perspective on Electronic Commerce",
  "abstract": "The Millennials and Generation Z use online shopping for a holistic experience and buy more expensive or better-quality products with buy now pay later payment methods for their highly demanding needs. The authors aimed to deepen understanding of this phenomenon by finding related knowledge fields and discovering the type of economy that will represent an increasing market share for the method of domestic e-commerce payments. The methodology used combined computer-assisted review, descriptive statistics, and linear regression to explain the market share of 23 economies worldwide. Student credit card use, myopic consumer law, buying tendencies. and dark financial triangles were identified as related topics. Logistics performance, ease of doing business, and postal development were found to be significant factors. Finally, economies with medium ranks are inclined to adopt this kind of payment easily. Hence, major implications, both managerial and academic, must be addressed. High responsibility should be borne by industry associations, which should run information campaigns by collaborating with public institutions. From the point of view of theoretical implications, studying the buy now and pay later concept and its outcomes might deepen understanding of consumer behaviour, decision-making processes, risk perception mitigation, debt behaviours, and credit adoption.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5105876bdbafd9bfdd2e52304bfa22cd",
  "timestamp": "2025-05-15T03:06:35.416329"
}