{
  "id": 7268,
  "title": "Factors associated with inadequate receipt of components and use of antenatal care services in Nigeria: a population-based study",
  "abstract": "Background: Antenatal care (ANC) is an essential intervention to improve maternal and child health. In Nigeria, no population-based studies have investigated predictors of poor receipt of components and uptake of ANC at the national level to inform targeted maternal health initiatives. This study aimed to examine factors associated with inadequate receipt of components and use of ANC in Nigeria. Methods: The study used information on 20 405 singleton live-born infants of the mothers from the 2013 Nigeria Demographic and Health Survey. Multivariable logistic regression analyses that adjusted for cluster and survey weights were used to determine potential factors associated with inadequate receipt of components and use of ANC. Results: The prevalence of underutilization and inadequate components of ANC were 47.5% (95% CI: 45.2 to 49.9) and 92.6% (95% CI: 91.8 to 93.2), respectively. Common risk factors for underutilization and inadequate components of ANC in Nigeria included residence in rural areas, no maternal education, maternal unemployment, long distance to health facilities and less maternal exposure to the media. Other risk factors for underutilization of ANC were home births and low household wealth. Conclusion: The study suggests that underutilization and inadequate receipt of the components of ANC were associated with amenable factors in Nigeria. Subsidized maternal services and well-guided health educational messages or financial support from the government will help to improve uptake of ANC services.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5109106341160749b415ba44a22bec02",
  "timestamp": "2025-05-15T03:07:02.531231"
}