{
  "id": 3867,
  "title": "An Estimation of Factors influencing the Return of Stock-Bond Investment Portfolios in Nigeria",
  "abstract": "This paper identifies and estimates the influence of factors known to influence the return on stock bond portfolios in Nigeria. Via the use of a questionnaire survey, data was retrieved from the lop thirty stock brokerage firms in Nigeria between 2006 and 2015. A response rate of 57percent was achieved and same was subjected to multiple regression based on pre-market and post-market crash periods. Findings revealed that during the pre-market crash era, global oil prices, Nigerian political outlook, foreign direct investment, militancy and investor knowledge positively influenced equity returns. Also, infrastructural collapse and despair of local investors were found indirectly proportional to pre-market crash returns. During the post market crash era, factors found to negatively influence equity returns were infrastructural collapse, inflation rate, government monetary policies, global oil prices, withdrawal of foreign investments, return on investment, handicapped regulators, transition in government and exchange rate. Increased return on bond was influenced by inflation during the post market crash era and same was influenced by yield, interest rate and credit rating. The study concluded that influence on return differed as investment periods differ. Finally, portfolio managers were urged to understand the factors influencing the return attendant to investment options per-time before asset combination.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "511472902aad70a57d2c75b21e21c795",
  "timestamp": "2025-05-15T01:21:41.368814"
}