{
  "id": 6919,
  "title": "A nationwide study of risk factors for long COVID and its economic and mental health consequences in the United States",
  "abstract": "Background In the United States, concerns have been increasingly raised over the future public health and economic burden of long COVID including disability and declines in labor force participation. However, only a handful of U.S. studies have explored sociodemographic or socioeconomic characteristics that put people at risk of long COVID or have investigated its economic and mental health sequelae. Methods Using repeated cross-sectional data on over 375,000 adults including nearly 50,000 adults with long COVID pooled from U.S. nationally-representative Household Pulse Survey data collected between September and November 2022 and between August and October 2023, I fit age- and gender-adjusted and multivariable modified Poisson regression models to examine multiple sociodemographic and socioeconomic factors as predictors of long COVID. I further estimate the risks of unemployment, financial hardship, and anxiety and depression among working-aged adults and adults with current long COVID symptoms, and estimate the economic burden of lost wages due to long COVID. Results Nearly one in seven adults (similar to 35 million) and working-aged adults (similar to 30 million) reported having a history of long COVID by late 2022 and late 2023. In age- and gender-adjusted models and fully-adjusted multivariable models, I find several factors predict long COVID including lower household income, and being Hispanic, female, gay/lesbian or bisexual. I also find having long COVID is linked to higher risks of recent unemployment, financial hardship, and anxiety and depressive symptomatology, with evidence of dose-response relationships. Conclusions Overall, an estimated 24 million working-aged adults with long COVID had been or may still be at risk of adverse socioeconomic and mental health outcomes. The lost earnings due to long COVID among working-aged adults are estimated to total $211 billion in 2022 and $218 billion in 2023. These findings highlight the substantial public health and economic implications of long COVID among Americans.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "514122f8d66ff8da9b9faaf016567329",
  "timestamp": "2025-05-15T03:03:13.409163"
}