{
  "id": 438,
  "title": "Machine learning predictive models to guide prevention and intervention allocation for anxiety and depressive disorders among college students",
  "abstract": "College student mental health has been a critical concern for professional counselors. Anxiety and depressive disorders have become increasingly prevalent over the past decade. Utilizing machine learning, a subset of artificial intelligence (AI), we developed predictive models (i.e., eXtreme Gradient Boosting [XGBoost], Random Forest, Decision Tree, and Logistic Regression) to identify US college students at heightened risk of diagnosable anxiety and depressive disorders. The dataset included 61,619 students from 133 US higher education institutions and was partitioned into a 90:10 ratio for training and testing the models. We employed hyperparameter tuning and cross-validation to optimize model performance and examined multiple measures of predictive performance (e.g., area under the receiver operating characteristic curve [AUC], accuracy, sensitivity). Results revealed strong discriminative power in our machine learning predictive models with AUC of 0.74 and 0.77, indicating current financial situation, sense of belonging on campus, disability status, and age as the top predictors of anxiety and depressive disorders. This study provides a practical tool for professional counselors to proactively identify students for anxiety and depressive disorders before these conditions escalate. Application of machine learning in counseling research provides data-driven insights that help enhance the understanding of mental health determinants, guide prevention and intervention strategies, and promote the well-being of diverse student populations through counseling.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "514c0792502ea99060d98c6d6684f63e",
  "timestamp": "2025-05-15T01:50:52.650617"
}