{
  "id": 3986,
  "title": "Rethinking climate engineering categorization in the context of climate change mitigation and adaptation",
  "abstract": "The portfolio of approaches to respond to the challenges posed by anthropogenic climate change has broadened beyond mitigation and adaptation with the recent discussion of potential climate engineering options. How to define and categorize climate engineering options has been a recurring issue in both public and specialist discussions. We assert here that current definitions of mitigation, adaptation, and climate engineering are ambiguous, overlap with each other and thus contribute to confusing the discourse on how to tackle anthropogenic climate change. We propose a new and more inclusive categorization into five different classes: anthropogenic emissions reductions (AER), territorial or domestic removal of atmospheric CO2 and other greenhouse gases (D-GGR), trans-territorial removal of atmospheric CO2 and other greenhouse gases (T-GGR), regional to planetary targeted climate modification (TCM), and climate change adaptation measures (including local targeted climate and environmental modification, abbreviated CCAM). Thus, we suggest that techniques for domestic greenhouse gas removal might better be thought of as forming a separate category alongside more traditional mitigation techniques that consist of emissions reductions. Local targeted climate modification can be seen as an adaptation measure as long as there are no detectable remote environmental effects. In both cases, the scale and intensity of action are essential attributes from the technological, climatic, and political viewpoints. While some of the boundaries in this revised classification depend on policy and judgement, it offers a foundation for debating on how to define and categorize climate engineering options and differentiate them from both mitigation and adaptation measures to climate change. (C) 2013 John Wiley & Sons, Ltd.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "514e6a755f8a0ae99fab6dd71c360c38",
  "timestamp": "2025-05-15T01:22:39.431555"
}