{
  "id": 6748,
  "title": "The impact of multidimensional frailty on dependency in activities of daily living and the moderating effects of protective factors",
  "abstract": "Background: Dependency in activities of daily living (ADL) might be caused by multidimensional frailty. Prevention is important as ADL dependency might threaten the ability to age in place. Therefore, this study aimed to assess whether protective factors, derived from a systematic literature review, moderate the relationship between multidimensional frailty and ADL dependency, and whether this differs across age groups. Methods: A longitudinal study with a follow-up after 24 months was conducted among 1027 community-dwelling people aged >= 65 years. Multidimensional frailty was measured with the Tilburg Frailty Indicator, and ADL dependency with the ADL subscale from the Groningen Activity Restriction Scale. Other measures included socio-demographic characteristics and seven protective factors against ADL dependency, such as physical activity and non-smoking. Logistic regression analyses with interaction terms were conducted. Results: Frail older people had a twofold risk of developing ADL dependency after 24 months in comparison to non-frail older people (OR = 2.12, 95% CI = 1.45-3.00). The selected protective factors against ADL dependency did not significantly moderate this relationship. Nonetheless, higher levels of physical activity decreased the risk of becoming ADL dependent (OR = 0.67, 95% CI = 0.46-0.98), as well as having sufficient financial resources (OR = 0.49, 95% CI = 0.35-0.71). Conclusion: Multidimensional frail older people have a higher risk of developing ADL dependency. The studied protective factors against ADL dependency did not significantly moderate this relationship.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "518b8a6ba3f20122510048d9527c6669",
  "timestamp": "2025-05-15T03:01:03.630723"
}