{
  "id": 2037,
  "title": "Exploring the Relationship and Predictive Accuracy for the Tadawul All Share Index, Oil Prices, and Bitcoin Using Copulas and Machine Learning",
  "abstract": "Financial markets are increasingly interlinked. Therefore, this study explores the complex relationships between the Tadawul All Share Index (TASI), West Texas Intermediate (WTI) crude oil prices, and Bitcoin (BTC) returns, which are pivotal to informed investment and risk-management decisions. Using copula-based models, this study identified Student's t copula as the most appropriate one for encapsulating the dependencies between TASI and BTC and between TASI and WTI prices, highlighting significant tail dependencies. For the BTC-WTI relationship, the Frank copula was found to have the best fit, indicating nonlinear correlation without tail dependence. The predictive power of the identified copulas were compared to that of Long Short-Term Memory (LSTM) networks. The LSTM models demonstrated markedly lower Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), and Mean Absolute Scaled Error (MASE) across all assets, indicating higher predictive accuracy. The empirical findings of this research provide valuable insights for financial market participants and contribute to the literature on asset relationship modeling. By revealing the most effective copulas for different asset pairs and establishing the robust forecasting capabilities of LSTM networks, this paper sets the stage for future investigations of the predictive modeling of financial time-series data. The study highlights the potential of integrating machine-learning techniques with traditional econometric models to improve investment strategies and risk-management practices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "518d3cae5381e66f90f0868a44650b82",
  "timestamp": "2025-05-15T02:10:25.756529"
}