{
  "id": 4498,
  "title": "The Relationship between Investors' Risk Appetite Index and Fear Indices: An Empirical Application with ARDL in Turkey",
  "abstract": "Despite the increasing scientific interest in the risk appetite of investors in financial markets in recent years, we cannot say that studies on the relationship between risk appetite and the factors that playAa key role in risk management have received much attention. This article contributes to understanding the effects of the V1XI, V2TX, JNIV, VXN and VIX fear indices calculated to represent uncertainty in the markets, qualified investors, foreign investors, domestic investors, domestic funds, domestic real persons, domestic legal entities and all investors on the risk appetite index (RISE) in the context of the Turkish stock market. The study provides empirical evidence on the link between fear indices and risk appetite index using ARDL bounds test, long-term and short-term regression models. This article uses monthly data for January 2008-April 2022 period. In the results we obtained in the analyzes, it was determined that the V2TX index was the most effective fear index on the risk appetite index of all investor types. Then, in order of importance, the JNIV, VIX and V1XI indices come. In the study, the regression coefficients of the other fear indices did not give statistically significant results in any type of investor. The current study is novel in that it investigates for the first time the relationship between 7 different RISEs calculated for investors in Turkey and more than one foreign fear index.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "518e228e490b91d9fb093692f3351629",
  "timestamp": "2025-05-15T02:37:47.563208"
}