{
  "id": 2702,
  "title": "Risk Disclosures and Non-Financial Reporting: Evidence in a New European Context",
  "abstract": "The objective of this research is to determine the extent and current characteristics of risk disclosure in Europe in the context of corporate non-financial reporting practices. A multivariate linear regression analysis on risk disclosure behaviour is performed on a sample of companies included in the EURO STOXX 50 Index, whose data were collected from their annual financial reports. Additionally, a first longitudinal exploration is carried out with respect to the GRI standard. It was possible to detect which risk items are more frequently reported by the selected corporations, and which corporate documents are most likely to contain relevant risk information. It was also possible to establish a link between specific industries, countries and company financial profiles and levels of risk disclosure. This empirical research is particularly relevant in the current scenario where several events converge: the gradual evolution, since 2017, of the NFRD (Non-Financial Reporting Directive) to a new Corporate Sustainability Reporting Directive (CSRD); the subsequent legal requirements for 2020 and 2021 of the ESEF (European Single Electronic Format) to support the disclosure of annual corporate reports; the pandemic and the new war scenario in Europe. This empirical work provides novel insights into risk disclosure and non-financial information in a particular setting, i.e., pre-and post-pandemic Europe, against a backdrop of growing concern about a new war scenario.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "518f546ad391b0831774fcf3a158b785",
  "timestamp": "2025-05-15T02:18:06.268282"
}