{
  "id": 7330,
  "title": "Determinants of earnings management in Spanish SMEs and its relationship with CSR: the relevance of sector life cycle stage",
  "abstract": "Purpose This paper addresses the link between earnings management (EM) and corporate social responsibility (CSR) in small and medium-sized enterprises (SMEs). Design/methodology/approach Data were collected from 317 Spanish SMEs to perform: (1) bivariate analysis between EM, CSR and some firm-factors (i.e. size, sector, sector life cycle stage, corporate age, family ownership, profitability and financial risk); and (2) multiple regression analysis for a better understanding of EM behavior and test the influence of sector life cycle stage variable. Findings Results emphasize the relevance of the sector life cycle stage as an explanatory factor. Firms operating in sectors that are growing or declining in terms of sales are more proactive to EM than those with consolidated sales levels. Stratified regression analysis also confirms that the stage of the industry life cycle influences the EM-CSR relationship. Only for SMEs with stable sales in maturity sectors, lower interest in EM can be significantly explained by higher CSR performance. Firms with regular sales levels show a more outstanding socially responsible commitment and are less pressured to legitimize their operational decisions and therefore show lower levels of EM involvement. Originality/value This paper makes a twofold contribution. On the one hand, it examines the relationship between EM and CSR, focusing on SMEs' context, in which EM study could be considered incipient. On the other hand, the controversial empirical evidence on the significance and sign of EM and social responsibility link could be explained by the stage of the life cycle of the sector in which each company operates.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51c35945808ed2d34b341c4328f75481",
  "timestamp": "2025-05-15T03:07:31.877758"
}