{
  "id": 3849,
  "title": "Barriers in adoption of internet banking: A structural equation modeling Neural network approach",
  "abstract": "Comparatively, less attention has been paid to the factors that obstruct consumers to use internet banking. Therefore, this study aims to analyze the barriers in the adoption of Internet banking in Karachi, Pakistan. A survey research questionnaire was adopted and, in total, 300 useable responses were used from the banks' customers. First exploratory factor analysis (EFA) and confirmatory factor analysis (CFA) were applied for the establishment of measurement model and structural equation modeling (SEM) was used to find the significant influence barriers on Internet banking adoption. In the second phase, the neural network model was used to rank the relative influence of significant predictors obtained from SEM. The results indicate a significant positive relationship between value barrier, risk barrier, and image barrier with the usage of Internet banking. Only, the traditional barrier has a negative insignificant effect on the usage of Internet banking. The image barrier has a higher impact on usage of Internet banking followed by the value barrier and risk barrier. Results also indicate that males are facing high barriers in comparison with females. Findings provide guidelines to banks for developing facilities that enable the consumer to use Internet banking for their financial transactions. This study will be highly beneficial for the banking industry to improve their online services and revise their policies to facilitate consumers by meeting their needs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51ca6178a08a4bab5f418e491ce64cc1",
  "timestamp": "2025-05-15T02:30:28.769075"
}