{
  "id": 8752,
  "title": "Simvastatin and Disease Stabilization in Normal Tension Glaucoma: A Cohort Study",
  "abstract": "Purpose: To investigate whether simvastatin use is associated with visual field (VF) stabilization in patients with normal tension glaucoma (NTG). Design: Prospective cohort study (ClinicalTrials.gov Identifier: NCT00321386). Participants: A total of 256 eyes from 256 Chinese subjects with NTG. Methods: Patients were followed up at 4-month intervals for 36 months for VF progression per Anderson's criteria. Clinical parameters were checked for association with progression in multivariate analysis. Main Outcome Measures: The primary outcome was the association between simvastatin use and VF progression. Results: Thirty-one patients (12.1%) were taking simvastatin (statin+), and 225 patients (87.9%) were not taking simvastatin (statin-). Baseline age, gender, untreated intraocular pressure, VF indices, vertical cup-todisc ratio, and central corneal thickness (CCT) were comparable between the 2 groups. There were significantly more patients with a history of hypercholesterolemia, systemic hypertension, and ischemic heart disease in the statin+ group. A total of 121 patients (47.3%) showed evidence of VF progression (mean rate of mean deviation loss was -0.30 decibel per year) during the 36 months of follow-up. Simvastatin use was among 8 of 121 patients (6.6%) who progressed compared with 23 of 135 patients (17.0%) who did not progress (P = 0.011). Logistic regression revealed that history of disc hemorrhage (relative risk [RR] 3.26; 95% confidence interval [CI], 1.21-8.76; P = 0.019), history of cerebrovascular accidents (RR 2.28; 95% CI, 1.03-5.06; P = 0.043), and baseline age (per 10 years older; RR 1.38; 95% CI, 1.08-1.76; P = 0.009) were significant risk factors for VF progression, whereas simvastatin use conferred a protective effect (RR 0.36; 95% CI, 0.14-0.91; P = 0.030). Conclusions: Simvastatin use may be associated with VF stabilization in patients with NTG. A larger scale randomized controlled trial and cost-effectiveness analyses seem warranted. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2010; 117: 471-476 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51d3cbdb9dff57142eb41e98bd2d1c2b",
  "timestamp": "2025-05-15T03:21:56.687009"
}