{
  "id": 3610,
  "title": "Employment, Insurance, and Financial Experiences of Patients with Chronic Graft-versus-Host Disease in North America",
  "abstract": "Understanding the socioeconomic impact of chronic graft-versus-host disease (GVHD) on affected patients is essential to help improve their overall well-being. Using data from the Chronic GVHD Consortium, we describe the insurance, employment, and financial challenges faced by these patients and the factors associated with the ability to work/attend school and associated financial burdens. A 15-item cross-sectional questionnaire designed to measure financial concerns, income, employment, and insurance was completed by 190 patients (response rate, 68%; 10 centers) enrolled on a multicenter Chronic GVHD Consortium Response Measures Validation Study. Multivariable logistic regression models examined the factors associated with financial burden and ability to work/attend school. The median age of respondents was 56 years, and 87% of the patients were white. A higher proportion of nonrespondents had lower income before hematopoietic cell transplantation and less than a college degree. All but 1 patient had insurance, 34% had faced delayed/denied insurance coverage for chronic GVHD treatments, and 66% reported a financial burden. Patients with a financial burden had greater depression/anxiety and difficulty sleeping. Nonwhite race, lower mental functioning, and lower activity score were associated with a greater likelihood of financial burden. Younger age, early risk disease, and higher mental functioning were associated with a greater likelihood of being able to work/attend school. In this multicenter cohort of patients with chronic GVHD, significant negative effects on finances were observed even with health insurance coverage. Future research should investigate potential interventions to provide optimal and affordable care to at-risk patients and prevent long-term adverse financial outcomes in this vulnerable group. (C) 2018 American Society for Blood and Marrow Transplantation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51d83cf7e892bc9281367366c7283c84",
  "timestamp": "2025-05-15T02:27:54.146598"
}