{
  "id": 6725,
  "title": "Lower utilization of primary, specialty and preventive care services by individuals residing with persons in poor health",
  "abstract": "Background: Since household time and financial resources for health care are primarily spent for those household members with the most urgent health needs, individuals residing with persons in poor health may be at risk of underusing health-care services. We examined whether these individuals had a lower use of primary, specialty and preventive care than those who did not reside with persons in poor health. Methods: Data collected in 2000 from a representative sample of 8210 French individuals aged 18 years and older from 3810 households were analysed with logistic regression models adjusted for health, demographic and socioeconomic variables. Results: We found that individuals residing with one other survey respondent had a higher risk of not using primary care, specialty care and preventive care in the 12 months preceding the study when the health status of the other survey respondent was poorer ( fair or alternatively poor versus good). Furthermore, individuals residing with two other survey respondents had a higher risk of not using primary care, specialty care and preventive care in the 12 months preceding the study when they resided with a higher number of respondents in fair or poor health ( one or alternatively two versus zero). Conclusion: The lower use of health services by individuals residing with persons in poor health may signal a need for health practitioners to broaden the scope of care beyond their patients, and for policy makers to consider the long-term impact of this situation on the health-care system.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51e4d97644863b215b81b90aacab658d",
  "timestamp": "2025-05-15T03:01:03.539145"
}