{
  "id": 6970,
  "title": "Low physical activity and depression are the prominent predictive factors for falling in older adults: the Birjand Longitudinal Aging Study (BLAS)",
  "abstract": "BackgroundFalling in the older adults has many irreparable consequences, including hospitalization to long-term care centers and loss of independence, depression and social isolation, financial burden, and death. The present study was conducted to estimate the incidence of falls and their associated factors among community-dwelling older adults.MethodsThis program is a population-based prospective cohort study (>= 60 years) in Birjand City from 2019 to 2020. A total of 1418 participants were included in the study, and 1344 participants were analyzed according to the inclusion criteria. Thirty-nine risk factors were evaluated. Basic information included demographic information, lifestyle factors, general health and medical history, and mental and functional health.ResultThe incidence of falls among community-dwelling older adults in the previous approximately 24 months in the present study was 9.26% in women and 2.65% in men. In the multiple Cox proportional regression model based on fall risk factors, there was a strong significant relationship between male sex (HR = 0.37, CI = 0.21 to 0.64), being physically active (HR = 0.59, CI = 0.36 to 0.96), moderate-to-severe depression (HR = 2.97, CI = 1.47 to 6.01), severe depression (HR = 3.26, CI = 1.24 to 8.54), and high risk of falls according to the TUG test (HR = 1.73, CI = 1.10 to 2.72).ConclusionsInactivity and depression were recognized as important factors in falls in older adults. It is recommended for older adults to have an active lifestyle to prevent falls and to prioritize the diagnosis and treatment of depression in older adults. Women as a group at higher risk should be considered in prevention programs. In addition, the use of the TUG test to identify high-risk older adults should be considered.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "51eccdb5af969833daac5c1eb64ea975",
  "timestamp": "2025-05-15T03:03:55.680408"
}