{
  "id": 896,
  "title": "Outcomes of an Asynchronous Care Model for Chronic Conditions in a Diverse Population: 12-Month Retrospective Chart Review Study",
  "abstract": "Background: Diabetes and hypertension are some of the most prevalent and costly chronic conditions in the United States. However, outcomescontinue to lag behind targets, creating further risk of long-term complications, morbidity, and mortality for people living with these conditions. Furthermore, racial and ethnic disparities in glycemic and hypertension control persist. Flexible telehealth programs leveraging asynchronous care allow for increased provider access and more convenient follow-up, ultimatelyimprovingcritical healthoutcomesacross demographic groups. Objective: We aim to evaluate the 12-month clinical outcomesof participants in the 9amHealth web-based clinic for diabetes and hypertension. We hypothesized that participation in the 9amHealth program would be associated with significant improvements in glycemic and blood pressure (BP) control across a diverse group of individuals. Methods: We enrolled 95 patients in a completely web-based care clinic for diabetes and hypertension who received nutrition counseling, health coaching, and asynchronous physician consultations for medication prescribing. Patients received standard or cellular-connected glucose meters and BP cuffs in order to share data. Laboratory tests were completed either with at-home phlebotomy draws or a self-administered test kit. Patients' first and last hemoglobin A 1c (HbA1c) and BP results over the 12-month period were compared, and analyses were repeated across race and ethnicity groups. Results: Among all 95 patients, the average HbA1c decreased by -1.0 (from 8.2% to 7.2%; P <.001) over 12 months of program participation. In those with a baseline HbA1c >8%, the average HbA1c decreased by -2.1 (from 10.2% to 8.1%; P <.001), and in those with a baseline HbA1c >9%, the average HbA1c decreased by -2.8 (from 11% to 8.2%; P <.001). Among participants who identified as a race or ethnicity other than White, the HbA1c decreased by -1.2 (from 8.6% to 7.4%, P =.001). Further examination of subgroups confirmed HbA1c lowering within each race or ethnicity group. In the overall population, the average systolic BP decreased by 17.7 mm Hg (P=.006) and the average diastolic BP decreased by 14.3 mm Hg (P=.002). Among participants self-identifying as a race or ethnicity other than White, the results similarly showed a decrease in BP (average reduction in systolic BP of 10mm Hg and in diastolic BP of 9mm Hg). Conclusions:A fully web-based model leveraging all-asynchronous physician review and prescribing, combined with synchronous and asynchronous coaching and nutrition support, was associated with clinically meaningful improvement in HbA1c and BP control over a12-monthperiodamonga diverse group ofindividuals. Further studies should prospectively evaluate the effectiveness of such models among larger populations, assess the longer-term sustainability of these outcomes, and explore financial models to make these types of programs broadly accessible.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "520a7976474fa619d50e9ee84a69afcf",
  "timestamp": "2025-05-15T01:43:54.654900"
}