{
  "id": 8458,
  "title": "Impact of Loneliness on Brain Health and Quality of Life Among Adults Living With HIV in Canada",
  "abstract": "Background: People aging with HIV are at risk for loneliness, with stigmatization and economic marginalization added to the health challenges arising from chronic infection. This study provides evidence for the extent, contributors, and consequences of loneliness in people living with HIV, focusing on brain health and quality of life. Setting: Cross-sectional data from 856 middle-aged and older adults living with HIV recruited from 5 urban specialty clinics in Canada were drawn from the inaugural visit of the Positive Brain Health Now cohort study. Methods: Participants completed an extensive assessment of biopsychosocial variables. The prevalence, severity, and quality of life impact of self-reported loneliness were described. Clinical and environmental factors hypothesized as contributing to loneliness, and the consequences of loneliness on health and function were identified using logistic, ordinal, and linear regression. Results: Eighteen percent reported being quite often and 46% sometimes lonely. Those with more loneliness were younger, less mobile, suffered more financial hardship, and were more likely to use opioids. HIV symptoms, pain, fatigue, low motivation, stigma, and unemployment were related to loneliness. Loneliness increased the odds of cognitive impairment, low mood, stress, and poor physical health. Those who were quite often lonely were over 4 times more likely to report poor or very poor quality of life than those who were almost never lonely. Conclusion: Loneliness is common in middle-aged and older people living with HIV in Canada. Many of the associated factors are modifiable, offering novel targets for improving brain health, general health, and quality of life in HIV.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "521eb91917f0ef98bf5c36eb6f37cd61",
  "timestamp": "2025-05-15T03:18:51.744459"
}