{
  "id": 461,
  "title": "MOONA SOFTWARE FOR SURVEY CLASSIFICATION AND EVALUATION OF CRITERIA TO SUPPORT DECISION-MAKING FOR PROPERTIES PORTFOLIO",
  "abstract": "The MOORA for Neural Networks Analysis (MONNA) software was created to classify variables and evaluate the degree of correlation between them, helping to choose a property portfolio and facilitating decision making involving multiple criteria. The MONNA software presents the classification of the alternatives calculated automatically by the MOORA (Multi-Objective Optimization on the Basis of Ratio Analysis) and provides a Global Average Rate (GAR). Artificial Neural Networks (ANNs) analysis provides the degree of correlation between variables and uses GAR as the output parameter. The degree of correlation between the variables allows us to assess whether these variables are dependent on each other and can capture customer preferences. For the application we used a survey that sought to know the preferences of customers, which will serve to make the decision of which properties should be part of the company's portfolio. The contribution and originality of the MONNA software is that through the integration of the MOORA and ANN methods, the classification and criterion evaluation calculations are faster and standardized. The use of software by decision makers helps to have more accurately find and classify available options, preventing simulations from being done by iterative processes and providing validated numerical data for management evaluation.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "522da58678fdf6cbb459141e76b26be7",
  "timestamp": "2025-05-15T00:43:47.344967"
}