{
  "id": 7008,
  "title": "Insurance losses caused by residential housing flood events",
  "abstract": "Purpose The purpose of this research study is to determine whether flood-damaged residences located in the USA are remaining unrepaired because of the lack of flood insurance coverage. Unrepaired flooded dwellings are subsequently being foreclosed with mortgage-insurance claims being paid to lenders. This paper aims to examine if weather events that cause flooding impact the losses suffered by mortgage insurers and homeowners. Design/methodology/approach Two fully modified least squares regression models are done using losses experienced by two mortgage insurance companies. The AM Best insurance rating information for a 16-year period or years 2002-2017 is used to study whether the loss ratios experienced by two companies underwriting private mortgage insurance (PMI) are statistically correlated to National Flood Insurance Program (NFIP) claim levels. The assumption is that higher flood insurance claims are a proxy for more severe weather events during a particular year which results in flooding that damage residences. Findings The NFIP claims coefficient is positive and significant for both companies being examined. This indicates that the more serious the flooding event during a specific year, the higher the losses experienced by the private mortgage insurer. The R-2 results for the regression models were 0.673-0.695. The income variable has a negative coefficient which was significant. It indicates that falling income lead to rising mortgage insurer losses. The NFIP variable was significant with a positive coefficient. Research limitations/implications The mortgage insurance industry is dominated by several companies at any point in time. During the 16-year study period, some companies have become insolvent, merged with other companies or recently started underwriting mortgage insurance. One company was diversified writing multiple lines of property insurance. There were only two insurers with complete financial information for the specified study period. Practical implications There are currently five mortgage insurers operating in the USA. A serious flood event could cause the insolvency of some of these companies. This would reduce the competition existing in the default insurance market. The financial markets for real estate loans price mortgages based on the availability and the ability to secure mortgage insurance for high loan-to-value properties. There is federal mortgage insurance available for certain types of residential loans. Social implications There are a limited number of insurers writing flood insurance. These companies can pick or reject dwellings and/or commercial properties to underwrite for insurance. The goal of phasing out insurance through the NFIP may prove impossible to achieve. A flood event without insurance would cause serious financial consequences to property owners, loan delinquencies and could depress the local economy for years. Competition from private mortgage insurers may intensify the adverse selection already being experienced by the NFIP. Private insurers would select the lower risk flood applications leaving the more risky insurance to be covered by the NFIP. Originality/value Prior research focused on financial variables impacting PMI and weather factors affecting flood insurance claims. Financial ratios published in the AM Best rating guide for the USA and Canada were used to examine whether or not PMI losses are indirectly affected by flooding events as measured by NFIP variable. Comparing two separate lines of insurance and their impact on each other has not been studied by prior researchers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "524177cd1721592186fc98ec50ee982e",
  "timestamp": "2025-05-15T03:03:55.865344"
}