{
  "id": 3716,
  "title": "Introduction to the geothermal play and reservoir geology of the Netherlands",
  "abstract": "The Netherlands has ample geothermal resources. During the last decade, development of these resources has picked up fast. In 2007 one geothermal system had been realised; to date (1 January 2019), 24 have been. Total geothermal heat production in 2018 was 3.7 PJ from 18 geothermal systems. The geothermal sources are located in the same reservoirs/aquifers in which the oil and gas accumulations are hosted: Cenozoic, Upper Jurassic - Lower Cretaceous, Triassic and Rotliegend reservoirs. Additionally, the yet unproven hydrocarbon play in the Lower Carboniferous (Dinantian) Limestones delivered geothermal heat in two geothermal systems. This is in contrast to the Upper Cretaceous and Upper Carboniferous with no producing geothermal systems but producing hydrocarbon fields. Similar to hydrocarbon development, developing the geothermal source relies on fluid flow through the reservoir. For geothermal application a transmissivity of 10 Dm is presently thought to be a minimum value for a standard doublet system. Regional mapping of the geothermal plays, with subsequent resource mapping, by TNO discloses the areas with favourable transmissivity within play areas for geothermal development. The website www.ThermoGis.nl provides the tool to evaluate the geothermal plays on a sub-regional scale. The Dutch geothermal source and resource portfolio can be classified using geothermal play classification of, for example, Moeck (2014). An appropriate adjective for play classification for the Dutch situation would be the predominant permeability type: matrix, karst, fracture or fault permeability. The Dutch geothermal play is a matrix-permeability dominated 'Hot Sedimentary Aquifer', 'Hydrothermal' or 'Intra-cratonic Conductive' play. The Dutch 'Hot Sedimentary Aquifer' play is subdivided according to the lithostratigraphical annotation of the reservoir. The main geothermal plays are the Delft Sandstone and Slochteren Sandstone plays.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5253a59b2b03b6081ec6f5abddbb63a2",
  "timestamp": "2025-05-15T01:20:03.459814"
}