{
  "id": 6043,
  "title": "Research on the evaluation of China's Supply Chain Finance policy based on text mining",
  "abstract": "Supply Chain Finance (SCF) aims to manage the capital flow, logistics flow, and information flow of small and medium-sized enterprises (SMEs) in the upstream and downstream of the supply chain while optimizing supply chain risk control. Like other types of financial services, the development of SCF is highly influenced by policy factors; however, related research remains relatively limited. This study aims to explore the current state of SCF policymaking in China and provide scientific recommendations for the development of SCF from a policy perspective. First, using the BERTopic model, 3,439 SCF-related academic papers and 181 central-level SCF policy texts from the CNKI database were analyzed for thematic clustering. Then, by comprehensively considering the thematic distribution of SCF research and the operational characteristics of SCF, the Policy Modeling Consistency (PMC) Index model was constructed to evaluate SCF policy texts. The findings reveal several issues in China's SCF policymaking: limited thematic focus, fluctuating levels of policy formulation, and significant homogenization of policy content. The study proposes several optimization recommendations for SCF policies, including expanding the scope of policy focus, fostering synergy among different types of policies, diversifying the use of policy tools, and broadening the range of target groups addressed by policies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "525e9610cd43326b7b8e1ecfa83b03dd",
  "timestamp": "2025-05-15T02:54:03.464959"
}