{
  "id": 6613,
  "title": "Resilience Tested: Interplay between Mortgage Channels and Natural Disasters on Housing Price",
  "abstract": "The existing body of literature on the interaction between mortgage channels and natural disasters on housing prices is limited. As a vast archipelagic nation, Indonesia is highly susceptible to natural disasters. Our research utilizes quarterly data from Indonesian provinces between 2012 and 2019, and employs panel regression to evaluate the influence of mortgage channels and natural disasters on housing prices. The results indicate varying impacts on housing prices based on the type and intensity of natural disasters, alongside regional development, which remain robust under various tests. Despite potential disruptions, the overall availability and effects of housing loans on housing prices remain relatively stable, thus highlighting the significant role of mortgage channels in shaping housing prices under different circumstances. This understanding has the potential to guide stakeholders in enhancing disaster management strategies and overseeing housing prices, and takes into consideration the distinct vulnerabilities found in each region. Due to the unpredictable nature of natural calamities, it is crucial to establish plans for pre-disaster strategies. Using risk-disaster clusters allows the government to customize housing policies based on particular vulnerability categorizations instead of utilizing a standardized approach nationwide. Additionally, the financial sector has the opportunity to integrate regional risk assessments in the decision-making process for the distribution of housing loans.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "525e0e947bf1eb98917cffbb98e748b8",
  "timestamp": "2025-05-15T03:00:04.907004"
}