{
  "id": 7483,
  "title": "Obesity and psychopathology in women: a three decade prospective study",
  "abstract": "Objective: To evaluate prospective associations between elevations in body mass index (BMI) at average age 27 and generalized anxiety disorder (GAD) and major depressive disorder (MDD) at average age 59 in a community sample of women. Design: Three waves of data collected over three decades were drawn from mothers in the Children in the Community (CIC) Study. Binary logistic regression was used to estimate predictive effects of two BMI cutpoints (>= 30 and >= 25) on GAD and MDD independent of other risks for psychopathology. Subjects: The 544 mothers who were interviewed in the original wave of the CIC Study in 1975 and in the first and most recent follow-up waves in 1983 and 2002-2005. Measurements: Information about height and weight was obtained by self-report in face-to-face interviews. GAD and MDD were assessed by structured interview covering DSM-IV diagnostic criteria. Other potential risk factors examined included age, race, education, prior depressive symptoms and marital status, chronic disease, social support and financial strain concurrent with GAD and MDD. Results: A baseline BMI >= 30 significantly increased the odds for subsequent GAD and MDD by 6.27 and 5.25 times, respectively, after adjusting for other significant risk factors. Odds of GAD also increased significantly given a baseline BMI >= 25 (by 2.44 times); however this association was not independent of other significant risk factors. Predictive associations between a baseline BMI >= 30 and MDD were not attenuated by attained BMI assessed at outcome. Conclusion: Findings extend existing evidence of the mental health consequences of obesity in a representative sample of mothers, and suggest that obesity may have long-term implications for mental distress in women at a clinical level over the adult years.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5266e605cd6137ef5d3bb6f6c08b3fed",
  "timestamp": "2025-05-15T03:09:07.270639"
}