{
  "id": 7320,
  "title": "Early marriage, stressful life events and risk of suicide and suicide attempt: a case-control study in Iran",
  "abstract": "Background Early Marriage (EM) and associated Stressful Life Events (SLEs) and consequences such as psychological and physical well-being issues can lead to suicide and suicide attempts (SA). The study aimed to investigate the risk of suicide and SA among early married people who experienced SLEs. Methods A case-control study was conducted based on the registry for suicide in Malekan county in Iran during 2016-18. Cases included 154 SAs and 32 suicides. Simultaneously, 201 outpatients from the emergency department were chosen as controls. Holms and Rahe life event questionnaire was used to assess SLEs. Sub-group analysis (Mantel-Haenszel) by sex and age groups and multiple logistic regression were used to calculate adjusted Odds Ratios (ORs) with 95% Confidence Intervals (CIs) for the association between EM and suicide risk after adjusting for the potential confounders. Results The proportion (female vs male) of EM among suicides, controls, and SAs was 31.25% (18.7 vs 12.5%), 15.92% (11.9 vs 4.0%), and 13.0% (11.7 vs 1.3%), respectively. In subgroup analyses by sex, EM was associated with an increased risk of suicide in both females and males 2.64 and 2.36 times, respectively. Likewise, subgroup analysis by age groups revealed that EM increased suicide risk in subjects aged 10-15 years, while no association was found for age groups of 26-40 and > 40. After adjusting for the potential confounders, EM (OR: 3.01; 95% CI: 1.15 -7.29), financial problems (OR = 4.50; 95% CI: 1.83 -9.07), and family problems (OR = 2.60; 95% CI: 1.19-9.59), were associated with an increased risk of suicide. However, no association was found between EM, various types of SLEs, and the risk of SA. Conclusions We found EM and SLEs were correlated with suicide risk, while no evidence found that EM increased the risk of SA. Progress in reducing EM and addressing its serious consequences can occur by a stronger political commitment and by sharing the experiences and voices of the early married. Our study provided preliminary findings to guide future studies; however, methodological and longitudinal studies are needed to understand and address the effect of EM on suicidal behaviors.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "529507344390bde8e47999da4850cd5e",
  "timestamp": "2025-05-15T03:07:31.853036"
}