{
  "id": 1741,
  "title": "Seismic hazard analysis and financial impact assessment of railway infrastructure in the US West Coast: A machine learning approach",
  "abstract": "This research examines the seismic hazard impact on railway infrastructure along the U.S. West Coast (Washington, Oregon and California), using machine learning to explore how measures of seismic hazard such as fault density, earthquake frequency, and ground shaking relate to railway infrastructure accidents. By comparing linear and non-linear models, it finds non-linear approaches superior, particularly noting that higher fault densities and stronger peak ground shaking correlate with increased infrastructure accident rates. Shallow earthquakes with magnitudes of 3.5 or greater and hypocentral depths <20 km also exhibit a pronounced correlation with the incidence of railway infrastructure accidents The study extends to financial impact analysis through Net Present Value and Monte Carlo Simulation, and evaluates damage costs from 2000-2023 to guide financial planning and risk management strategies. It highlights the crucial role of advanced financial tools in optimizing maintenance and long-term planning that could result in better preparedness in high seismic hazard regions and emphasizes the need for robust risk management strategies in enhancing railway operational safety that considers the local and regional tectonic and seismic activity and local ground shaking intensity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "529564703c4219a59907b68abf13f221",
  "timestamp": "2025-05-15T02:06:52.704216"
}