{
  "id": 8683,
  "title": "Stakeholder-Centered Corporate Governance and Corporate Sustainable Development: Evidence from CSR Practices in the Top Companies by Market Capitalization at Shanghai Stock Exchange of China",
  "abstract": "This study aims to investigate the nature and intensity of changes in corporate sustainable development as a result of certain relationships between stakeholder-centered corporate governance (CG) and corporate social responsibility CSR practices in the leading firms with respect to their market capitalization (MC) in the Shanghai stock exchange (SSE) of China. This study selected the top 100 companies from the manufacturing sector at the Shanghai Stock Exchange by (MC) for a period of 10 years (2012-2021). For this quantitative study, financial and CSR performance data were collected from the China Securities Market and Accounting Database (CSMAR), a reliable database for examining research on Chinese listed companies. For the data analysis, we applied different statistical tools that include descriptive statistics; a correlation matrix, fixed effect regression analysis, and moderation analysis of the effect of government subsidies on the relationship between explanatory variables and the dependent variable (firm performance) were applied. The result of the adjusted R-square values suggests that there has been a considerable change in the value of explained variable Firm Performance (FP), represented by ROA, TbQ, and Grow caused by the explanatory variables of the study, including Government-centered responsibility (GCR), community-centered responsibility (COMCR), firm age (FA), firm size (FS), and leverage (LV). Supplier-centered responsibility (SCR), customer-centered responsibility (CCR), creditor-centered responsibility (CRCR), and total risk (TR) were, respectively, at a 1% and 5% level of significance. The values extracted from the moderation effect show that Sub is a key factor in motivating the well-established large firms to focus on stakeholders-centered CSR practices, which ultimately improves the FP in the short and long run.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52b9a5044c87ad029ec780a318861b17",
  "timestamp": "2025-05-15T03:21:24.662481"
}