{
  "id": 985,
  "title": "Ensemble of machine learning algorithms for cryptocurrency investment with different data resampling methods",
  "abstract": "This work proposes a system based on machine learning aimed at creating an investment strategy capable of trading on the cryptocurrency exchange markets. Additionally, with the goal of generating investments with higher returns and lower risk, rather than investing on predictions based on time sampled financial series, a novel method for resampling financial series was developed and employed in this work. For this purpose, the originally time sampled financial series are resampled according to a closing value threshold, thus creating a series prone to obtaining higher returns and lower risk than the original series. Out of these resampled series as well as the original, technical indicators are calculated and fed as inputs to four machine learning algorithms: Logistic Regression, Random Forest, Support Vector Classifier, and Gradient Tree Boosting. Each of these algorithms is responsible for generating a transaction signal. Afterwards, a fifth transaction signal is generated by simply calculating the unweighted average of the four trading signals outputted from the previous algorithms, to improve on their results. In the end, the investment results obtained with the resampled series are compared to the commonly utilized fixed time interval sampling. This work demonstrates that independently of using or not a resampling method, all learning algorithms outperform the Buy and Hold (B&H) strategy in the overwhelming majority of the 100 markets tested. Nevertheless, out of the learning algorithms, the unweighted average obtains the best overall results, namely accuracies up to 59.26% for time resampled series. But most importantly, it is concluded that both alternative resampling methods tested are capable of generating far greater returns and with lower risk relatively to time resampled data. (C) 2020 Elsevier B.V. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52bd7fc2588088ce622141b1cd27ee03",
  "timestamp": "2025-05-15T01:57:29.886154"
}