{
  "id": 6114,
  "title": "Coastal Flooding Hazard, Exposure, and Readiness of Buildings in Hong Kong in 2080-2100, and the Implications for Real Estate Management",
  "abstract": "Coastal flooding has been a significant hazard in Hong Kong. Influenced by climate change, extreme coastal flooding events have been frequently observed in the past decades. Nowadays, the real estate sector has increasingly recognized the significance of managing future coastal flooding risks. However, there are few relevant Geographic Information System (GIS)-based assessment tools and studies about future scenarios. Against this background, this study aims to understand the risk and readiness of properties in Hong Kong for future coastal flooding and to reduce the gap in the risk management decision-making process. This study included the return period, sea level rise, tide activity, and storm surge as the main factors for estimating the frequency and magnitude of coastal flooding events. The estimation and other geospatial data were calculated to describe the exposure, hazard, and readiness of every building in Hong Kong. Based on this risk data of buildings, clustering analysis was adopted to create clusters representing different building risk profiles. The results highlight that there will be 16.3% and 24.7% of buildings in Hong Kong exposed to coastal flooding under Shared Socioeconomic Pathway (SSP) 8.5 and SSP 4.5, respectively, and 2.5% of them will have an extremely high hazard level. This study then constructed an indicator-based assessment model for the real estate sector regarding future coastal flooding risks. Classifying the buildings based on characteristics of their risk profile obtained eight clusters, with clusters 1 and 2 having high risk and low readiness, and clusters 7 and 8 having low risk and low to medium readiness. In addition, distinct spatial patterns were found between the clusters that have low and high readiness of green infrastructure. Therefore, recommendations for the policymaker, planner and companies were provided based on their local situation. Specifically, the discussion suggests that although Yuen Long is an area that has a relatively larger number of high-risk buildings, clusters 3 and 4 in Yuen Long have more potential for adopting various loss mitigation measures. However, clusters 5 and 6 in the city center are more recommended to adopt financial tools and small-scale nonstructural improvements.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52cd11ff38ef544d142212b524ad31bd",
  "timestamp": "2025-05-15T02:55:12.787007"
}