{
  "id": 8229,
  "title": "The relationship between self-reported health status and signs of psychological distress within European urban contexts",
  "abstract": "Background: Self-reported health status (SRHS) reflects an individual's perception of their social, biological and psychological health, and has been linked to increased mortality risk and increased use of health services. Having a psychological co-morbidity can reduce health outcomes and increase healthcare costs. This paper investigates the relationship between SRHS and signs of psychological distress (PD) in European urban settings. Methods: The study sample comprised 20 439 adult respondents to surveys conducted across 37 urban areas. Data on SRHS, signs of PD and potential confounders were analysed in a multivariable logistic regression. Results: After adjusting for potential confounders (gender, age, time lived in country and regularity of contact with family and friends), a significant association was found between PD and self-reported poor health for all urban areas, particularly in Western European countries (adjusted OR = 3.615, 95% CI: 3.333-3.920 P < 0.001). Time lived in country of residence, financial stability and regularity of contact with family and friends were negatively associated with signs of PD in the adjusted model. Conclusions: There is a statistically significant association between self-reported poor health and signs of PD. Although the relationship was present in all geographical locations, the confounders were protective factors for Western European countries. Since the two factors are linked, interventions that target one might reduce the impact on both. Further study into causality would be of use in predicting future healthcare costs, which could be reduced by integrating their management.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52d38dfcd576655ae740c10b1a3becf6",
  "timestamp": "2025-05-15T03:16:48.921063"
}