{
  "id": 8904,
  "title": "OUT-OF-POCKET EXPENDITURE IN HYPERTENSION RELATED CARE IN INDIA: ESTIMATES FROM NATIONAL SAMPLE SURVEY 2017-18",
  "abstract": "BACKGROUND:Studies estimating treatment cost associated with hypertension care in the Indian context are limited and show considerable variations. OBJECTIVE:To estimate the extent of out-of-pocket expenditure (OOPE) for hypertension care at the population level and its financial impact on households in India.METHODS:We analysed the data of the 75th round of the of NSSO survey (India) on the social consumption of health care conducted in 2017-18. OOPE was assessed after deducting the amount reimbursed by insurance from the total medical expenditure per episode of hypertension-related hospitalisation and outpatient visit during the survey period. OOPE for hypertension care was considered catastrophic if exceeding 10% of the household's monthly per capita expenditure. The determinants of catastrophic health expenditures were examined using a multivariate logistic regression analysis.RESULTS:A total of 1,351 and 6,379 individuals reported hypertension-related hospitalization and outpatient care, respectively, in the survey. The overall hypertension-related hospitalization rate was 54 per 100,000 persons. OOPE associated with hypertension-related hospitalisation were on an average INR 3,491 (SD 6,176) and INR 24,565 (SD 37,343) in public hospitals and private hospitals, respectively. The OOPE for hypertension related to outpatient visit was INR 277 (SD 571) in public facilities but was in the range of INR 457 (SD 556) - INR 695 (SD 1,431) based on the type of private hospitals/clinics. OOPE on medicines constituted on an average 43% (95% CI: 32-52%) and 66% (95% CI: 54-64%) of public sector hospitalisation and outpatient care respectively. The risk of catastrophic expenditure due to hypertension care was 41% among the poorest households. CONCLUSION:Direct expenses on drugs and diagnostic tests contribute significantly to OOPE. The on-going public health efforts towards controlling hypertension need to ensure better access to essential hypertensive drugs and diagnostic tests in public facilities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52dc517c2c8411fb495f2b42357fde45",
  "timestamp": "2025-05-15T03:23:27.878384"
}