{
  "id": 5304,
  "title": "Related Party Transactions from the Perspective of Public Shareholders",
  "abstract": "Transactions between related parties, particularly those involving controlling shareholders, may pose a risk of financial detriment to minority shareholders while simultaneously providing a mechanism for controlling shareholders to accumulate profits in a manner that may be considered inequitable. This research seeks to examine the effects of related party transactions on shareholders from four distinct analytical angles, to enhance the investment decision-making process for investors. The study explores the relationship between related party transactions and several financial indicators of companies listed on Borsa Istanbul, including the free float ratio, stock price performance, dividend payout ratio, and Tobin's Q. The research utilized financial data from 339 companies listed on Borsa Istanbul, resulting in 1478 instances within an unbalanced panel data set. Methodologically, both fixed effects and random effects regression analyses were conducted. The analysis shows a positive relationship between debts owed to related parties and the free float ratio, as well as Tobin's Q ratio. Furthermore, a positive relationship is identified between receivables from related parties and the free float ratio, while a negative relationship is observed between receivables from related parties and Tobin's Q ratio. These findings corroborate the existence of agency costs and conflicts of interest between majority shareholders and minority shareholders. Despite the statistical significance of the findings, it is pertinent to note that the explanatory efficacy of the equations utilized is relatively modest.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52e3a920d3620e11aee0aa6d6e36005f",
  "timestamp": "2025-05-15T02:46:16.282143"
}