{
  "id": 9415,
  "title": "Septate uterus according to ESHRE/ESGE, ASRM and CUME definitions: association with infertility and miscarriage, cost and warnings for women and healthcare systems",
  "abstract": "Objectives To estimate the differences in frequency of diagnosis of septate uterus using three different definitions and determine whether these differences are significant in clinical practice, and to examine the association between diagnosis of septate uterus, using each of the three definitions, and infertility and/or previous miscarriage as well as the cost of allocation to surgery. Methods This was a secondary analysis of data from a prospective study of 261 consecutive women of reproductive age attending a private clinic focused on the diagnosis and treatment of congenital uterine malformations. Reanalysis of the datasets was performed according to three different means of defining septate uterus: following the recommendations of the American Society for Reproductive Medicine (ASRM), a 2016 update of those of the American Fertility Society from 1988 (ASRM-2016: internal fundal indentation depth >= 1.5 cm, angle of internal indentation < 90 degrees and external indentation depth < 1 cm); following the recommendations of the European Society of Human Reproduction and Embryology/European Society for Gynaecological Endoscopy (ESHRE/ESGE), published in 2013 and reaffirmed in 2016 (ESHRE/ESGE-2016: internal fundal/uterine indentation depth > 50% of uterine-wall thickness and external indentation depth < 50% of uterine-wall thickness, with uterine-wall thickness measured above interostial/intercornual line); and using a definition published last year which was based on the decision made most often by a group of experts (Congenital Uterine Malformation by Experts; CUME) (CUME-2018: internal fundal indentation depth >= 1 cm and external fundal indentation depth < 1 cm). We compared the rate of diagnosis of septate uterus using each of these three definitions and, for each, we estimated the association between the diagnosis and infertility and/or previous miscarriage, and anticipated the costs associated with their implementation using a guesstimation method. Results Although 32.6% (85/261) of the subjects met the criteria for one of the three definitions of septate uterus, only 2.7% (7/261) of them were defined as having septate uterus according to all three definitions. We diagnosed significantly more cases of septate uterus using ESHRE/ESGE-2016 than using ASRM-2016 (31% vs 5%, relative risk (RR) = 6.7, P < 0.0001) or CUME-2018 (31% vs 12%, RR= 2.6, P < 0.0001) criteria. We also observed frequent cases that could not be classified definitively by ASRM-2016 (gray zone: neither normal/arcuate nor septate; 6.5%). There were no significant differences (P > 0.05) in the prevalence of septate uterus in women with vs those without infertility according to ASRM-2016 (5% vs 4%), ESHRE/ESGE-2016 (35% vs 28%) or CUME-2018 (11% vs 12%). Septate uterus was diagnosed significantly more frequently in women with vs those without previous miscarriage according to ASRM-2016 (11% vs 3%; P = 0.04) and CUME-2018 (22 vs 10%; P = 0.04), but not according to ESHRE/ESGE-2016 (42% vs 28%; P = 0.8) criteria. Our calculations showed that global costs to the healthcare system would be highly dependent on the criteria used in the clinical setting to define septate uterus, with the costs associated with the ESHRE/ESGE-2016 definition potentially being an extra US$ 100-200 billion over 5 years in comparison to ASRM-2016 and CUME-2018 definitions. Conclusions The prevalence of septate uterus according to ESHRE/ESGE-2016, ASRM-2016 and CUME-2018 definitions differs considerably. An important limitation of the ASRM classification, which needs to be addressed, is the high proportion of unclassifiable cases originally named, by us, the 'gray zone'. The high rate of overdiagnosis of septate uterus according to ESHRE/ESGE-2016 may lead to unnecessary surgery and therefore unnecessary risk in these women and may impose a considerable financial burden on healthcare systems. Efforts to define clinically meaningful and universally applicable criteria for the diagnosis of septate uterus should be encouraged. Copyright (C) 2019 ISUOG. Published by John Wiley & Sons Ltd.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52ecd8bf52a7ef03e1287b215c2b9499",
  "timestamp": "2025-05-15T03:28:46.205509"
}