{
  "id": 9184,
  "title": "Association between distance traveled and abortion consideration and completion among people with fetal myelomeningocele",
  "abstract": "BACKGROUND: Due to the small number of centers performing maternal-fetal surgery for fetal myelomeningocele, many people are required to travel significant distances for perioperative counseling at an experienced center. As part of the decision-making process for the management of myelomeningocele, some pregnant individuals are interested in, and may ultimately proceed with, termination of pregnancy. Additional travel for abortion care may compound psychological and financial burdens for pregnant individuals, given the existing barriers to accessing abortion care across the United States. OBJECTIVE: The objective of this study was to evaluate the association between the distance traveled to a fetal care center and the consideration and completion of abortion among patients with fetal myelomeningocele. STUDY DESIGN: We performed a retrospective cohort analysis of all singleton myelomeningocele consultations at a single fetal care center in Illinois from 2018 to 2024. The exposure was the distance traveled to the fetal care center defined as miles from the patient's zip code of residence to the fetal care center. Distance was analyzed in two ways: categorically (dichotomized based on median value) and continuously. The primary outcomes were abortion consideration, ascertained by a nurse during fetal care center intake, and abortion completion. Bivariate and multivariate log-binomial regression analyses were performed. A subgroup analysis was performed by participant state of residence. Statistical significance was considered P<.05. RESULTS: There were 133 participants available for the abortion consideration analysis and 157 participants for the abortion completion analysis. Median distance traveled was 39 miles (IQR 15-116 miles). People traveling below the median distance were more likely to identify as Latinx, reside within Illinois, and present at an earlier gestational age when compared with those traveling above the median distance. Distance traveled was independently associated with abortion consideration, after controlling for gestational age at the time of presentation to the fetal care center (aRR 0.44, 95% CI 0.27-0.72). When treating the distance traveled as a continuous outcome, for every mile traveled the risk of considering abortion decreased by 1% (aRR 0.99, 95% CI 0.98-0.99). On subgroup analysis, this finding was persistent only among individuals living in Illinois. There was no significant relationship between the distance traveled to the fetal care center and abortion completion. CONCLUSIONS: Increased distance traveled is associated with a lower risk of abortion consideration among individuals presenting to a fetal care center for fetal myelomeningocele consultation. These data emphasize the nuanced relationship between fetal diagnosis and abortion and the importance of providing comprehensive reproductive counseling to patients seeking consultation at a fetal care center.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52f2631525d65221c6e1a71497dcbe15",
  "timestamp": "2025-05-15T03:26:25.973537"
}