{
  "id": 9144,
  "title": "The applicability of fingernail lead and cadmium levels as subchronic exposure biomarkers for preschool children",
  "abstract": "Preschool children are exposed daily to metals in their homes and at daycare centers (DCC). Metal exposure and health effects are associated even at low levels, and children comprise a group of public health concern. Nail metals have been studied for exposure biomonitoring and compared to other biological media. The aim of this study was to explore the applicability of preschool fingernail lead and cadmium as subchronic exposure biomarkers. Nail lead and cadmium levels (NLL and NCL) of 602 preschool children (age: 1-4 years) who attended 21 DCC in Sao Paulo, Brazil, in 2013 were analyzed. Results were compared against blood lead and cadmium levels (BLL and BCL) found in a previous study. Inductively coupled plasmamass spectrometry (ICP-MS) analyses were performed for both samples. DCC and metal contaminated sites (MCS) were georeferencing. Logistic regression tests were applied to verify associations between nail metal levels and risk factors (sex, age, maternal education, secondary smoking, DCC geographic district, vehicle flow density, relative altitude and distance between DCC and nearest MCS) (p < 0.05). BLL was stratified by exposure level (low: <5 mu g.dL(-1); high: >13.9 mu g.dL(-1); medium: >= 5 mu g.dL(-1) and <= 13.9 mu g.dL(-1)) and also tested the associations in order to verify if nail lead levels are affected by exposure intensity defined by blood metals concentrations. Radius distance and relative altitude of DCC to nearest MCS were associated with high NLL and NCL. Abnormal appearance of nails was associated with high NLL and low NCL. Lead and cadmium exposure magnitude had no significant impact on NLL. NLL should only be used for initial screening, and when financial resources are scarce, especially in areas located near contaminated sites. Preschool children were co-exposed to both lead and cadmium, reinforcing the need for broader studies evaluating exposure to environmental pollutants for more than one chemical element. (C) 2020 Elsevier B.V. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52f3011e9cc79e67080f27647b5f0cfc",
  "timestamp": "2025-05-15T03:25:54.645113"
}