{
  "id": 6026,
  "title": "Natural disasters, resilience-building, and risk: achieving sustainable cities and human settlements",
  "abstract": "Reducing natural disasters and their related economic losses remains critical to achieving sustainable development. However, there is a lack of comprehensive studies that assess sustainable cities and human settlements in efforts to attain sustainable development goal 11.5. Here, the present research explains the effect of disaster risk and disaster resilience on human loss due to natural disasters (deaths, injured, and affected) in 90 countries spanning 1995 to 2019. We develop global risk and resilience indices through IMF index-making steps across 24 high, 24 upper-middle, 30 lower-middle, and 12 low-income countries. The negative binomial regression shows an increase in disaster-related loss to human beings (deaths, injured, and affected) due to disaster risk in all panels. The empirical results reveal a favorable impact of disaster resilience--resilience declines disaster-related losses in developed countries. We observe that focusing on basic infrastructure, economic stability, public awareness, hygiene practices, ICT, and effective institutions leads to disaster resilience, mitigation, and speedy post-disaster recovery. Due to the insignificant impact of resilience in developing countries, high-income countries could provide financial resources, modern and DRR technologies, especially to low-income economies. This study encourages countries to follow seven targets and four dimensions of the Sendai Framework to enhance disaster resilience.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52f67400d786e31dbec139a9c05f43db",
  "timestamp": "2025-05-15T02:54:03.365050"
}