{
  "id": 1405,
  "title": "Portfolio default losses driven by idiosyncratic risks",
  "abstract": "We consider a portfolio of general defaultable assets with low individual default risk and study the probability of the portfolio default loss exceeding an arbitrary threshold. The latent variables driving defaults are modeled by a mixture structure that combines common shock, systematic risk, and idiosyncratic risk factors. While common shocks and systematic risk have been found by many studies to contribute significantly to portfolio losses, the role of idiosyncratic risks is often found to be negligible. Such conclusions are usually established under the assumption that the portfolio size tends to infinity and idiosyncratic risk factors are not dominant. We study under-investigated scenarios where the portfolio size is fixed and the idiosyncratic risk factors are heavy- tailed, exploring two distinct scenarios: an independence scenario and an asymptotic dependence scenario. The former is standard in the literature, while the latter is motivated by recent studies that have found the inadequacy of relying solely on common factors to capture default clustering. This consideration also reflects the possibility that idiosyncratic reasons can trigger contagion among firms with liabilities to each other. In the independence scenario, even with heavy-tailed idiosyncratic risk factors, the probability of a substantial portfolio loss remains low unless a single asset carries a disproportionately large weight. Conversely, in the asymptotic dependence scenario, the primary drivers of increased exceedance probability are the dependent idiosyncratic risk factors.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52fb1f3de2bed3d8f1efb153e21d81e4",
  "timestamp": "2025-05-15T00:55:28.460223"
}