{
  "id": 3275,
  "title": "Impact of Corporate Social Responsibility Disclosures on Bankruptcy Risk of Vietnamese Firms",
  "abstract": "This study investigates the nexus between the level of Corporate Social Responsibility Disclosures (CSRD) and Risk of Bankruptcy of companies that are listing in the Stock Exchanges of Vietnam. To investigate that relationship, this study collected secondary data from annual audited financial statements from 2014 to 2018 of listing companies. Applying two different regression models with two dependent variables and six independent and control variables, we find out that Vietnamese firms with higher level of CSRD performance can rapidly reduce their risk of bankruptcy. This phenomenon happens in the current year and in the coming years in all firms in the research sample. This result may be that the disclosures of social responsibility information can bring financial and non-financial benefits to the firms. In addition, the results also point out that there is a difference in risk of bankruptcy between the group of companies, which discloses and the one which does not disclose corporate social responsibility on their annual reports. This might be from the effects of various factors such as business size, financial leverage, market to book ratio, return on assets, cash flow from operations, etc. Our research results can be applied to other firms in Vietnam and in other similar jurisdictions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52fd558880e34b0e810b6238dcc3e6d1",
  "timestamp": "2025-05-15T02:24:39.587067"
}