{
  "id": 7698,
  "title": "Predicting Ship Maintenance and Repair Labor with Artificial Neural Networks",
  "abstract": "Ship maintenance and repair work cost estimation is often regarded as an Art, which may contribute to the financial success or distress of a shipyard. Regarded as experts by senior management, estimators are among the most valued resources, and nonetheless, human. Over time, estimators learn from mistakes, and get better with tenure at sharpening assessments. When estimators retire without having groomed an apprentice, shipyards may be at risk of losing a lot of know-how, all at once. These shipyards may well find very costly to experience, for a while, estimating skills stepping back on the learning curve. Yet, even shipyards relying on less advanced information technology may have unwittingly accumulated a lot of valuable data relevant to ship maintenance and repair works. These shipyards may overlook how easily accessible knowledge can be turned into a competitive advantage through predictive analytics. Not only can this data be literally mined, but machine learning algorithms, such as Artificial Neural Networks (ANN), can now process it for a speedy and preliminary estimate through faster and cheaper computing power. To be clear, the purpose is not to replace the human estimator but to help the expert quickly assess, when times are busy, whether to bid or not on a specific project opportunity. In the absence of The Master Estimator, an Apprentice may also look for a quick and cheap sanity check of the prepared estimate before submitting a bid. The study carried out in this article is based on all ship maintenance and repair data recorded at a single North American shipyard over the last 19 years since the current information systems were implemented. This raw data extract with all directly paid hours logged daily by workers on 1277 ship maintenance and repair projects was screened through advanced data cleansing. To enrich the cleansed data tables, additional independent variables were subsequently collected internally and externally to develop a training-testing data set. The final 657 projects represent 136 vessels regrouped in eight types, for which 28 other independent variables were all made available for training up to testing simple ANN models. The scope of this article is limited to the estimation of the direct labor required to complete ship maintenance and repair projects on a specific type of vessels for which workforce planning and tactical pricing was deemed the most relevant to keep the business afloat.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "52fe832f8b17e57aceae6f028f5ec94f",
  "timestamp": "2025-05-15T03:11:04.611463"
}