{
  "id": 9243,
  "title": "Financial Strain, Parental Smoking, and the Great Recession: An Analysis of the UK Millennium Cohort Study",
  "abstract": "Introduction: During the recent Great Recession, many families in the United Kingdom experienced increased financial strain (FS). The aim of this study was to determine if increases in FS, occurring over the period of the Great Recession, were associated with increased risks of persistent and relapsed tobacco use among parents. Methods: We analyzed the Millennium Cohort Study, a longitudinal study of 18 819 children born in the United Kingdom between 2000 and 2002. Surveys at 7 (T1, 2008) and 11 years (T2, 2012) spanned the Great Recession. Three measures of increased FS were defined; became income poor (self-reported household income dropped below the poverty line between T1 and T2); developed difficulty managing (parental report of being financially comfortable at T1 and finding it  difficult to manage at T2); felt worse off (parental report of feeling financially worse off at T2, compared to T1). Poisson regression was used to estimate risk ratios (RR), adjusted RRs (aRR), and 95% confidence intervals for three outcomes: persistent tobacco use, new reported tobacco use, and relapsed tobacco use. Results: Parents in households which became income poor over the period of the Great Recession were significantly more likely to report persistent tobacco use (aRR = 2.17 [1.83-2.57]) or new reported tobacco use (aRR = 1.72 [1.04-2.83]). Ninety-five percent of new reported tobacco users had evidence of prior tobacco use suggesting the majority were relapsed tobacco users. Similar patterns were seen for those who  developed difficulty managing and felt worse off. Conclusions: Increased tobacco use among financially strained families has the potential to widen inequalities and undermine the public health policies that have had positive impacts on tobacco consumption in the United Kingdom. Implications: While several studies have shown that FS is associated with a higher prevalence of tobacco use, heavier smoking, and relapsed tobacco use, most of this work used cross-sectional data and none has focused on parents. We used longitudinal data from the UK Millennium Cohort Study, between 2008 and 2012, to examine the association between FS and parental smoking. We show that parents who experienced increased FS, over the period of the Great Recession, were more likely to continue using tobacco or to relapse.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5303677ea3332b804ddce68aa1029400",
  "timestamp": "2025-05-15T03:26:54.584587"
}