{
  "id": 6962,
  "title": "Corporate waste disclosure, risk-taking and foreign ownership: Evidence from Indonesia",
  "abstract": "The role of corporations in waste management can reflect the superior performance in innovation and the risk a company is willing to take to engage in the circular economy. The superior performance of corporate waste management can be reflected in the corporate disclosure as a media of accountability and transparency. This research investigates the association between waste disclosure and corporate risk-taking and the moderating role of foreign ownership in companies in Indonesia as an emerging country struggling to find an effective solution toward environmental problems, including waste. The observation was performed on non-financial companies listed on the Indonesian Stock Exchange for the period 2018-2021. Panel regression was used to find the answers to the research questions of the direct and moderate associations among corporate waste disclosure, risk-taking and foreign ownership. The results show that waste disclosure encourages increased corporate risk-taking, which means that companies that disclose waste are companies with good accountability and environmental performance and tend to take risks that can increase value. Foreign ownership was not found to statistically strengthen the relationship between waste disclosure and corporate risk-taking, which is different from the expectation that improving the transparency of waste information can attract a greater inflow of foreign investor resources. This brings implication that investors need to increase attention to the issue of corporate waste management and put pressure on companies to provide information on corporate waste performance for investment decision-making. Furthermore, the results of the study also found that waste disclosure in Indonesia is still low compared to the international disclosure standard. This research contributes to the sustainability accounting literature in developing countries by outlining the role of waste disclosure.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53078375e9d1c0c75407fa6c4d3fe695",
  "timestamp": "2025-05-15T03:03:13.560316"
}