{
  "id": 3025,
  "title": "THE CONTROL OF TRANSACTIONS WITH DERIVATIVES IN THE NON-FINANCIAL ORGANIZATIONS IN THE REPUBLIC OF BELARUS",
  "abstract": "Nowadays derivatives as a risk management instruments can be the source of increased risk themselves. Non-financial institutions are more likely to use derivatives to hedge market risks rather than to engage in speculative strategies in order to profit from short-term changes in market variables, which priori implies an increased level of risk. Hedging with derivatives can be considered as a less risky activity than speculation, however we cannot say that it is absolutely risk-free. Unfair actions in the department of finance, errors in the development and implementation of the hedging strategy, counterparty defaults on derivatives all these are potential losses for the company, which applies hedging. In order to eliminate or minimize the negative consequences, which may occur from the presence of derivatives in the portfolio of the organization, well-structured control procedures are necessary. The aim of the study is to develop such control procedures. For this purpose general scientific research methods were used: analysis, synthesis, generalization, induction, deduction, observation. Methods of theoretical research: idealization, formalization, method of logical analysis, classification. According to the results of the study, the factors that increase the risk of applying derivatives in non-financial organizations were identified. They are the following: specificity of derivatives, the risk of unfair actions of employees and contractors, low creditworthiness of counterparties, difficulties in reflecting derivatives in financial statements, etc. Taking into account the identified factors controlling procedures on transactions with derivatives for non-financial organizations of the Republic of Belarus was proposed. Those techniques will provide non-financial organizations confidence that non-core risks, associated with derivatives, are under the control of both responsible managers and senior management, which will convince investors in the reliability of investments in such organizations.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53070047749fc411bc58df887ad28216",
  "timestamp": "2025-05-15T02:21:52.170419"
}