{
  "id": 4265,
  "title": "CREDIT RISK, CREDIT AND ECONOMIC CYCLES IN CROATIAN BANKING",
  "abstract": "The purpose of this paper is to investigate the relationship between credit risk and credit cycle on the one hand and economic cycle on the other hand in Croatian banking and economy. Potential threats to correct credit risk management in banks and to stability of the financial system, which result from the influence of different factors, will he identified as well At the theoretical level there is no agreement on these questions. However, the dependence of the economic Cycle towards the credit cycle and risk hay been clearly proved in numerous empirical studies. Such researches have not been done in Croatia. The results of our regression analysis have shown, among other things, that credits to enterprises have a greater influence on GDP than credits to households. Statistically, we have identified two credit booms and between them one credit bust. During the first credit bust, which was a result of a bank crisis, the rates of economic growth decreased drastically. Bank crisis was the consequence of poor credit risk management and supervisor's neglect. Everything shows that a new credit bust and a financial crisis could follow. Existing GDP growth rates, mostly based on the growth of consumption Stimulated by credits, cannot be sustained, The limitation of deficit and the slowing down of economic activity might make the banks even more vulnerable to credit risk.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5317127ac99b8797aad01dc114a38a85",
  "timestamp": "2025-05-15T02:35:26.225072"
}