{
  "id": 9139,
  "title": "Bidirectional Causal Relationships between Corneal Biomechanics and Glaucoma or Intraocular Pressure",
  "abstract": "Objective: To investigate the bidirectional causal relationships between corneal biomechanics (corneal hysteresis [CH] and corneal resistance factor [CRF]) and glaucoma subtypes or intraocular pressure (IOP), and to evaluate the mediating role of IOP in these associations. Design: Bidirectional univariable 2-sample Mendelian randomization (MR), multivariable MR, and mediation MR Subjects: Genetic data from large-scale GWAS cohorts of European ancestry, including individuals with measurements of CH/CRF, glaucoma subtypes (primary open-angle glaucoma [POAG], primary angle-closure glauglaucoma suspect, neovascular glaucoma, secondary glaucoma, and other unspecified glaucoma), and glaucoma Methods: Bidirectional univariable 2-sample MR analyses were performed to assess the causal effects between CH/CRF and glaucoma subtypes. Multivariable MR and mediation analysis were used to evaluate the role of IOP. Inverse-variance weighted, weighted median, MR-Egger regression, and MR-Pleiotropy RESidual Sum and Outlier were used to evaluate the causal effects, pleiotropy, and heterogeneity. Main Outcome Measures: The primary outcomes included causal estimates (odds ratios or b-coefficients) for the and the mediation effects of IOP. Secondary outcomes included relationships between glaucoma medication or surgery Results: Corneal hysteresis and CRF were causally associated with increased risks of total glaucoma and most subtypes, except for the protective effect of CH against neovascular glaucoma. Both CH and CRF elevated IOP. Adjusting for IOP attenuated CH/CRF-glaucoma associations. Glaucoma inversely affected CH but positively influenced CRF. Glaucoma surgery reduced CH and CRF. Conclusions: This study suggests that CH and CRF are risk factors for glaucoma and its subtypes, with IOP playing a mediating role in this relationship. These findings highlight the role of corneal biomechanics in glaucoma pathophysiology and clinical management. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2025;5:100742 (c) 2025 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "531c2df5a88a919d0e8cfccf863d8220",
  "timestamp": "2025-05-15T03:25:54.617657"
}