{
  "id": 2284,
  "title": "Assessing financial risks using a multicriteria sorting procedure: the case of country risk assessment",
  "abstract": "The assessment of financial risks is a problem of major interest for corporate entities (organizations, financial institutions, firms, etc.). The vulnerable economic and financial environments necessitate the development of operational approaches to measure and control financial risks. Most of the methodologies that have been proposed in the past employ a probabilistic notion of risk. This paper proposes an alternative approach to measure financial risks, considering their multidimensional nature. The proposed approach is based on the multicriteria decision aid (MCDA) method Multi-Group Hierarchical DIScrimination (M.H.DIS). The aim of the M.H.DIS method within the financial risk assessment context is to develop a set of additive utility functions that classify the considered alternatives (firms, investment projects, portfolios, countries, etc.) into predefined risk classes. The efficiency of the method is illustrated through a case study regarding the country risk assessment problem. Using the M.H.DIS method a discrimination model is developed that classifies the countries into Four groups, and measures the corresponding creditworthiness and risk of the countries. Several validation tests are performed in order to compare the classification results obtained through M.H.DIS to the results obtained through multiple discriminant analysis. (C) 2000 Elsevier Science Ltd. All rights reserved.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "531f54870bdbc76153cf843cdb0c30f6",
  "timestamp": "2025-05-15T02:13:31.795503"
}