{
  "id": 3387,
  "title": "ECONOMIC POLICY UNCERTAINTY IN THE UNITED STATES: DOES IT MATTER FOR EQUITY, COMMODITY AND CRYPTOCURRENCY MARKETS?",
  "abstract": "In recent years, the issue of worldwide uncertainty has gained more attention in academic literature. Therefore, the current study examines how the United States (U.S.) economic policy uncertainty (EPU) affects various stock indices, commodities and cryptocurrencies. This study takes data on stock indices and commodities from February 2005 to December 2023 and data on cryptocurrency from October 2017 to December 2023. For estimations, we employ the Quantile-on-Quantile regression (QQR) approach to investigate the impact and to understand how changes in EPU affect stock indices, commodities, and cryptocurrency returns at different levels of quantiles. The findings reveal that EPU has a negative impact on the stock indices and cryptocurrencies. For stocks, high uncertainty leads to more volatility, while EPU exhibits higher volatility for cryptocurrencies, indicating sensitivity to policy changes. Similarly, commodities react differently to the U.S. EPU, while gold tends to appreciate in uncertain times. Furthermore, we employ quantile regression for robustness check, and the findings validate the outcome of QQR at various levels of quantiles from lower to higher. Moreover, the findings of this study are helpful for investors, portfolio managers and policymakers to develop better investment strategies and effectively manage risks across different asset classes.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53205c251eec7cefe698e817b016a738",
  "timestamp": "2025-05-15T01:16:22.227294"
}