{
  "id": 8111,
  "title": "Cultural, material, and psychosocial correlates of the socioeconomic gradient in smoking behavior among adults",
  "abstract": "Background. The aim was to identify the correlates of educational differences Methods. We used data from the baseline of a Dutch longitudinal study, relating to a population of 2,462 respondents, ages 25-74. Logistic regression was used to assess the educational gradient in smoking. Current smokers were compared with former and never smokers, respectively. Results. The risk of being a current smoker compared with being a former/never smoker was higher among lower educational groups. For example, the odds of being a current smoker compared with never smoker among persons in the lowest level was more than five times as high as that for persons in the highest level. A substantial part (20-40%) of the increased risk of being a smoker among lower groups appeared to be associated with adverse material conditions. The financial situation especially accounted for that effect. One of the cultural factors, i.e., locus of control, was found to account for approximately 30% of the educational gradient in the case in which smokers were compared with former smokers. Psychosocial factors, i.e., neuroticism and coping styles, accounted for less of the gradient in smoking than cultural and material factors. Conclusions. On the basis of the results, we hypothesize that both cultural and material factors contribute to the higher smoking rates among lower socioeconomic groups. Psychosocial factors seem to be less important. If our results are confirmed in more powerful studies, this would indicate, first, that possibilities for a reduction of smoking differences may be found in tailoring smoking cessation programs to the more externally oriented locus of control and the coping styles that are common among lower educational groups, and second, that a reduction of smoking differences may follow from an improvement of the material living conditions of lower socioeconomic groups. (C) 1997 Academic Press.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5322892952e95568c4923914b3498e01",
  "timestamp": "2025-05-15T03:15:09.464030"
}