{
  "id": 5593,
  "title": "Volatility spillover dynamics between fintech and traditional financial industries and their rich determinants: New evidence from Chinese listed institutions",
  "abstract": "This study investigates the dynamics and determinants of volatility spillovers between Chinese financial technology (fintech) and traditional financial industries. We use stock prices of listed institutions and the elastic net vector autoregression (VAR) network approach to assess institution-, industry-, and system-level volatility spillovers in normal states between 2015 and 2023. Subsequently, we analyze 50 variables in terms of global environment, economic fundamentals, capital market, industry development, and other shocks and examine their impact on system- and industry-level volatility spillovers through variable selection and regression analysis. Furthermore, heterogeneous and asymmetric effects in extreme states are explored under a quantile-based framework. The empirical results show that (i) at the institutional level, volatility spillovers surge in the postCOVID-19 era, and large-cap institutions play vital roles in emitting volatility shocks. (ii) At the industry level, the fintech, securities, and diversified financial industries are net volatility transmitters, while the banking, insurance, and real estate industries are net receivers. Fundamental economic determinants prevail in explaining the net spillover index. (iii) At the system level, the total spillover index demonstrates a W-shape curve throughout the period. All determinants together explain over 85 % of the total spillover index. (iv) In extremely low and high volatility states, spillover effects are more obvious than in normal states. Industry development and capital market determinants fail to explain the respective total spillover indices. These findings offer valuable insights into how to foster effective risk management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5323aea06ddc762a36c11bf96e63b209",
  "timestamp": "2025-05-15T02:49:21.718320"
}