{
  "id": 7991,
  "title": "The need for cardiac surgery differential tariffs in Israel at the era of aging population and emerging technology: Importance of procedure type and patient complexity as assessed by EuroSCORE",
  "abstract": "Background Reimbursement for cardiac surgical procedures in Israel is uniform and does not account for diversity in costs of various procedures or for diversity in patient mix. In an era of new and costly technology coupled with higher risk patients needing more complex surgery, these tariffs may not adequately reflect the true financial burden on the caregivers. In the present study we attempt to determine whether case mix and complexity of procedures significantly affect cost to justify differential tariffs. Methods We included all patients undergoing cardiac surgery at Shaare Zedek Medical Center between the years 1993-2016. Patients were stratified according to (1) type of surgery and (2) clinical profile as reflected by the predicted operative risk according to the European System for Cardiac Operative Risk Evaluation (EuroSCORE). Approximate cost of each group of patients was estimated by the average number of days in the Intensive Care Unit and days in the postoperative ward multiplied by the respective daily costs as determined by the Ministry of Health. We then added the fixed cost of the components used in the operating room (manpower and disposables). The final estimated cost (the outcome variable) was then evaluated as it relates to type of surgery and clinical profile. ANOVA was used to analyze cost variability between groups, and backward regression analysis to determine the respective effect of the abovementioned variables on cost. Because of non-normal distribution, both costs and lengths of stay were Log-transformed. Results Altogether there were 5496 patients: 3863, 836, 685 and 112 in the isolated CABG, CABG + valve, 1 valve and 2 valves replacement groups. By ANOVA, the costs in all EuroSCORE subgroups were significantly different from each other, increasing with increased EuroSCORE subgroup. Cost was also significantly different among procedure groups, increasing from simple CABG to single valve surgery to CABG + valve surgery to 2-valve surgery. In backward stepwise multiple regression analysis, both type of procedure and EuroSCORE group significantly impacted cost. ICU stay and Ward stay were significantly but weakly related while EuroSCORE subgroup was highly predictive of both ICU stay and ward stay. Conclusions The cost of performing heart surgery today is directly influenced by both patient profile as well as type of surgery, both of which can be quantified. Modern day technology is costly yet has become mandatory. Thus reimbursement for heart surgery should be based on differential criteria, namely clinical risk profile as well as type of surgery. Our results suggest an urgent need for design and implementation of a differential tariff model in the Israeli reimbursement system. We suggest that a model using a fixed, average price according to the type of procedure costs, in addition to a variable hospitalization cost (ICU + ward) determined by the patient EuroSCORE or EuroSCORE subgroup should enable an equitable reimbursement to hospitals, based on their case mix.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5342ba659f333b12fc06e035f01bdf31",
  "timestamp": "2025-05-15T03:14:07.264086"
}