{
  "id": 8395,
  "title": "Adaptation to climate change in Afghanistan: Evidence on the impact of external interventions",
  "abstract": "Climate change is a significant obstacle for farmers in the least developed countries like Afghanistan and adaptation support is exceptionally scarce. This paper provides evidence on the impact of the agriculture-related external support on farmers' adaptation to climate change in the Central Highlands of Afghanistan. To this end, we collected primary data from 1434 farmers whom we interviewed across 14 districts in Bamiyan, Ghazni, and Diakundi provinces. We employ quasi-experimental econometric methods, including an endogenous switching regression analysis, to estimate the treatment effects on various adaptation-related outcomes. We find significant impacts of support interventions on the use of improved types of seeds and farmers' access to irrigation water. Further impacts on the risk of flood, economic and financial as well as government and institutional adaptation constraints appear to be significant, but sensitive to the existence of unobserved factors. We conclude that farmers perceived changes in the climate, and most of them tried to adapt by employing measures available to them. The impact of external support has been partially effective in addressing immediate and short-term farming challenges related to climate change and extreme weather events. They, however, have not been effective in treating long-term fundamental climate change-related risks. Based on our analysis of the past treatments and farmers' self-reported priorities, we provide a list of policy recommendations for adaptation to climate change in farming communities in Afghanistan. (c) 2019 Economic Society of Australia, Queensland. Published by Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "534b43bc2dab0ce76448fa286c2ee153",
  "timestamp": "2025-05-15T03:18:19.631400"
}