{
  "id": 2618,
  "title": "Editorial for the special issue on financial econometrics in the age of the digital economy",
  "abstract": "In the age of the digital economy, conducting business in the market based on digital computing technology and the internet is common practice. The digital transformation of the economy has deeply impacted financial markets through the widespread adoption of internet-based banking, the faster speeds of executing financial transactions and highfrequency trading, and the availability of easy-to-access big data, etc. The digital economy and the associated technological innovations have led to structural changes in the financial system, for example, by offering an opportunity to provide financial services at a much lower cost and thus offering substantial productivity gains. At the same time, the fast adoption of technology in the economy and the financial sector, in particular, has also led to potential market vulnerabilities, as exemplified by the sporadic occurrence of so-called flash crashes in stock markets. As a result, identifying the potential risks of financial systems in real-time, measuring, monitoring, and managing the risks are important tasks both for market participants and for regulators whose job is to maintain and promote financial stability. It is clear that financial econometrics can play a core role in these tasks. The goal of the special issue of the Journal of Econometrics on financial econometrics in the age of the digital economy is to collect recent advances in this field on a wide range of topics. The breadth of topics reflects, in part, the multifaceted nature of the impact the digitalization of the economy has had on the field. We hope that this work will stimulate the development of reliable and easy-to-implement financial econometrics and statistics tools for dealing with big data and, more generally, for various applications where the adoption of digital technology has had its impact already. This special issue gathers together contributions from leading experts in the fields of finance, econometrics, statistics, and engineering. The idea of editing the special issue has been stimulated by the excellent invited talks given at the 2018 International Symposium on Financial Engineering and Risk Management (FERM 2018, Shanghai). Within the theme of financial econometrics, experts in the field were invited to present their recent research at the conference. All submitted papers to the special issue have gone through the journal?s regular submission and review process. Sixteen of the submitted papers were accepted for publication in this special issue. The accepted papers address a wide range of important problems in current financial econometrics research. Broadly defined, the topics covered in the special issue are: (1) factor models (augmented, quantile, time-varying), (2) measuring risks (risk factors and tail risks), (3) volatility models (implied, realized, and observed asymptotic variance), (4) asset pricing, information aggregation, and implied arbitrage mechanism, (5) multivariate semi-nonparametric GARCH models and quantile models, (6) mean?variance predictability and minimum variance portfolio, (7) matrix autoregressive, (8) digital information gathering and prediction, and (9) a new type of max-linear regression with competing factors. Of course, these topics are far from exhaustive of the recent developments in the field of financial econometrics in the age of the digital economy. Still, nevertheless, we believe that the wide range of topics covered in the issue should inspire further research in the field in many directions. Below, we summarize all contributions in the order of their publication, which was determined on the basis of their natural clustering by topic. Fan et al. (2021), in ?Augmented Factor Models with Applications to Validating Market Risk Factors and Forecasting",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5357912b8a132dff06b4215c846bc3e1",
  "timestamp": "2025-05-15T02:17:32.070376"
}