{
  "id": 4295,
  "title": "Sports-related leisure behavior in Alpine regions during the COVID-19 pandemic-A cross-sectional study in Austria, Germany and Italy",
  "abstract": "IntroductionAs a planetary health challenge, COVID-19 forced governments around the world to take action to prevent the most severe consequences resulting from the spread of the virus. These measures ranged from stay-at-home orders to limitations on indoor and outdoor activities, travel restrictions and the cancelation of sports events, all of which affected people's leisure activities and daily lives. Therefore, the aim of this study is to examine changes in sports-related leisure behavior in terms of attending major sports events, following major sports events via media, travel intentions and the use of new sports offerings. Furthermore, we aimed to identify variables associated with changed sports-related leisure behavior during the pandemic. MethodsA cross-sectional online survey (n = 1,809) was conducted from December 2020 to January 2021 in the Alpine regions of Austria, Germany and Italy. Sports-related leisure behavior was investigated for changes during the pandemic compared to the time before the coronavirus outbreak and for differences between the three countries. ResultsResults showed that the self-reported importance of attending major sports events decreased significantly in the Alpine regions of all three countries during COVID-19. Prevailing restrictions affected vacation planning for over 80% of participants. A majority of approximately three quarters of respondents stated they had spent their holidays at home during the travel restrictions. Sports facilities and opportunities played an important role in the choice of vacation destination for more than half of participants. A binary logistic regression showed significant correlations between vacation planning during COVID-19 and the variables gender, income, quality of life and mental health. 31.9% of all respondents tried new sports offerings during extended restrictions, with a large proportion (72.4%) using apps, online tools or courses. Furthermore, approximately 30% of respondents increased their e-sports consumption. DiscussionThe results showed that sports-related leisure behavior in Alpine regions changed in the course of the COVID-19 pandemic. In the future, policymakers as well as sports and leisure providers should react to these behavioral changes and adapt their portfolio and services to meet consumers92 demands.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "536bc6cd2fab82649d9906ad0a97c051",
  "timestamp": "2025-05-15T01:25:50.475046"
}