{
  "id": 5079,
  "title": "Cognitive Decline Impairs Financial and Health Literacy Among Community-Based Older Persons Without Dementia",
  "abstract": "Literacy is an important determinant of health and well-being across the life span but is critical in aging, when many influential health and financial decisions are made. Prior studies suggest that older persons exhibit lower literacy than younger persons, particularly in the domains of financial and health literacy, but the reasons why remain unknown. The objectives of this study were to: (a) examine pathways linking diverse resources (i.e., education, word knowledge, cognitive function, and decision making style) to health and financial literacy among older persons and determine the extent to which the relation of age with literacy represents a direct effect versus an indirect effect due to decrements in specific cognitive functions (i.e., executive functions and episodic memory); and (b) test the hypothesis that declines in executive function and episodic memory are associated with lower literacy among older persons without dementia. Six-hundred and forty-five community-based older persons without dementia underwent detailed assessments of diverse resources, including education, word knowledge, cognitive function (i.e., executive function, episodic memory) and decision making style (i.e., risk aversion), and completed a measure of literacy that included items similar to those used in the Health and Retirement Study, such as numeracy, financial concepts such as compound inflation and knowledge of stocks and bonds, and important health concepts such as understanding of drug risk and Medicare Part D. Path analysis revealed a strong effect of age on literacy, with about half of the effect of age on literacy due to decrements in executive functions and episodic memory. In addition, executive function had an indirect effect on literacy via decision making style (i.e., risk aversion), and education and word knowledge had independent effects on literacy. Finally, among (n = 447) persons with repeated cognitive assessments available for up to 14 years, regression analysis supported the association of multiple resources with literacy; moreover, more rapid declines in executive function and episodic memory over an average of 6.4 years prior to the literacy assessment predicted lower literacy scores (ps < 0.02), but rate of decline in word knowledge did not. These findings suggest that diverse individual resources contribute to financial and health literacy and lower literacy in old age is partially due to declines in executive function and episodic memory.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5379ccc438e3f65ff9465e23b8b1595e",
  "timestamp": "2025-05-15T02:44:10.998266"
}