{
  "id": 5837,
  "title": "RETRACTED: Tech Optimization in Cybersecurity Defenses by Advanced ML Methods: The Use Case of Volleyball Industry (Retracted Article)",
  "abstract": "Individual and team performance can be improved by utilizing smart devices and applications that are connected through networks. In sports, the Internet of Things (IoT) refers to all of the smart devices and applications linked through networks to reduce injuries to the bare minimum, develop advanced training techniques, and apply analytical advanced sports improvement methodologies to improve sports performance in general. The Internet of Things (IoT) in sports is closely related to the objective of both security and privacy in sports, which has become a topic of crucial concern for the sports business in recent years, as evidenced by the adoption of IoT in sports years. For this reason, security flaws can have catastrophic consequences, including the disclosure of personal data, the manipulation of statistical findings, the harming of organizations' reputations, and enormous financial losses for the sporting organization. One or more of the consequences, as previously mentioned, is related to sports organizations and the athletes who are members of those organizations, and they have a direct impact on the corresponding set of sports-related, medical-related, and paramedical enterprises, specifically those that provide specialized sports equipment and associated services. A critical need to detect and quantify threats has long been recognized to better support decision-making when adopting or constructing a safe and reliable sports Internet-of-Things infrastructure, which is becoming increasingly common. Using advanced machine learning algorithms, this research provides a methodology for technology optimization in cybersecurity defenses that is then used in a unique case study utilizing volleyball players to demonstrate its effectiveness. In conjunction with a Monte Carlo optimization technique, an upgraded variant of fuzzy cognitive maps (FCM) is presented in greater detail. This model is utilized for a specific scenario of risk identification of volleyball industry, assessment, and optimization for IoT sports networks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "537ea8864baa43c5e4a1ebd3292a049b",
  "timestamp": "2025-05-15T02:51:58.587746"
}