{
  "id": 1068,
  "title": "Self-tuning portfolio-based Bayesian optimization",
  "abstract": "Portfolio strategies for Bayesian optimization (BO) aim to mitigate the issue of choosing an acquisition function when performing black-box optimization with Gaussian processes (GP) surrogate models. In that sense, the GP-Hedge is a straightforward portfolio framework commonly used in practice. Our work proposes to overcome existing limitations on the GP-Hedge and related methods, such as reducing the influence of far past evaluations and promoting better exploration. Moreover, we aim to achieve such improvements without sacrificing the practicality of simpler portfolio strategies. More specifically, we propose a new BO method equipped with the aforementioned enhancements enabled by additional self-tuned hyperparameters, which are sampled during the optimization via Thompson sampling. We are able to update the posteriors analytically at each iteration by carefully choosing meaningful conjugate priors. The new approach, named Self-Tuning Portfolio-based BO (SETUP-BO), improves standard portfolio strategies without the need for manually tuning hyperparameters, which preserves easiness of use. We evaluate our method and its competitors in the task of hyperparameter optimization (HPO), a critical step towards automated machine learning (AutoML), following a thorough meta-surrogate benchmarking approach. We also consider a real-world scenario related to the task of fault detection in energy plants. Our methodology achieves promising results, which indicates the viability of the proposed SETUP-BO.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5388ac42c6cff8edb41abf73813db1a7",
  "timestamp": "2025-05-15T00:51:25.933778"
}