{
  "id": 4004,
  "title": "Identifying the effects of a land-use policy on willingness to pay for open space using an endogenous switching regression model",
  "abstract": "An open space offers a stream of economic, social and environmental benefits. Population growth and extensive forms of economic growth have encroached onto large amounts of open space, converting forests, parks, grasslands and crop fields to developed uses, including residential, commercial and industrial. Analysts have used hedonic pricing techniques to estimate the capitalization of the values of open space into residential property values and the effects of changes in land-use policies on property values. Few of those studies have considered the possibility that property transactions may not occur randomly under different policy regimes. House sellers, buyers and developers respond to land use policies in their sale and purchase behaviors, thus changing the portfolio of houses for which sales data are available in a particular period. Such non-randomness can further bias the policy assessment using regression analysis. We address this issue by estimating the effects of a new development policy on WTP for open space as well as property values while correcting the selection bias that can arise as the result of self-selection. The empirical case is the Town of Okotoks, Alberta, Canada, where a conservation-oriented land use policy was replaced by a more development-oriented policy in 2012. An endogenous switching regression model is utilized to address the bias that could arise through self-selection. Key findings include: (1) selection does have an impact on estimating people's WTPs, and ignoring this issue leads to biased welfare calculations; (2) properties with nearby pastures and croplands were less likely to be traded on the real estate market after the introduction of the policy; (3) WTP for nearby cropland declined by about 1% (CAD 5148) of the average property price, due to the implementation of the new pro-development land policy; and (4) the pro-development policy led to a 8.4 % reduction in the value of Okotoks residential real estate.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "539971481e7fb70f0b4883f580e9151a",
  "timestamp": "2025-05-15T01:23:07.287044"
}