{
  "id": 8642,
  "title": "Micro- and meso-level influences on obesity in the former Soviet Union: a multi-level analysis",
  "abstract": "Background: Limited evidence exists on obesity in the former Soviet Union (fSU), particularly its micro- and meso-level determinants. The objectives of this study were to determine age- and gender-adjusted prevalence of self-reported overweight and obesity in nine fSU countries; explore the relationship between individual and household (micro-level) factors and obesity; and explore the relationship between features of nutritional and physical environments (meso-level) and obesity. Methods: Data were collected from 18 000 adults using household surveys and from 333 communities using community profiles in Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia and Ukraine in 2010. Individual- and community-level determinants of self-reported obesity (body mass index epsilon 30 kg/m(2)) were analysed using multi-level random intercept logistic regression models. Results: A total of 13% of the males and 18% of the females were categorized as obese. Factors associated with obesity in males were older age, increasing educational achievement, declining self-reported health, alcohol consumption and automobile ownership. Males who were current smokers, not married and perceived physical activity to be important were less likely to be obese. For females, obesity was associated with older age, completion of secondary-level education, declining self-reported health and average household financial situation. Unmarried women were less likely to be obese. Multi-level analysis indicated that individuals living in communities with higher presence of garbage were more likely to be obese. Conclusions: This is the first study to examine both micro- and meso-level influences on obesity in fSU using multi-level analysis. Findings indicate a similar obesity risk profile to countries in Western Europe and North America.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "539bfd345839a3d6012fa0530f07c024",
  "timestamp": "2025-05-15T03:20:55.971157"
}