{
  "id": 4090,
  "title": "Procuring authorities and project performance: a case study of PPP highway projects in India",
  "abstract": "PurposePublic-private partnership (PPP) highway projects in India are undertaken at both state and national levels, such that differences exist in how the procuring authorities manage project risk during the development and construction phase under different institutional frameworks. This study assesses the performance implication of the different administrative positionings of the procuring authority.Design/methodology/approachA data set of 516 PPP highway projects implemented in India formed the basis of this study. Means comparison, ordinary least squares (OLS) regression and seemingly unrelated regression were used to assess the impact of procuring authority on schedule performance.FindingsThe findings suggest that the state and the national highway projects were no different in achieving financial closure. However, the administrative positioning of the procuring authorities had a significant impact on other schedule performance variables. The construction of the state highway projects started quickly after the financial closure compared to the national highway projects. Moreover, the state highway projects were not only planned to be implemented at a faster rate but they were actually implemented at a faster rate and had a lower time overrun.Practical implicationsProcuring authorities under the state governments, being closer to the project, are better placed to manage project risk than those under the national government.Originality/valueThe administrative distance of the procuring authority from the PPP project and its implication on performance has never been studied.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53a80c596a0bd9012540ac4fc6179bfa",
  "timestamp": "2025-05-15T02:33:03.449389"
}