{
  "id": 1830,
  "title": "Multivariate portfolio optimization under illiquid market prospects: a review of theoretical algorithms and practical techniques for liquidity risk management",
  "abstract": "Purpose This study aims to examine the theoretical foundations for multivariate portfolio optimization algorithms under illiquid market conditions. In this study, special emphasis is devoted to the application of a risk-engine, which is based on the contemporary concept of liquidity-adjusted value-at-risk (LVaR), to multivariate optimization of investment portfolios. Design/methodology/approach This paper examines the modeling parameters of LVaR technique under event market settings and discusses how to integrate asset liquidity risk into LVaR models. Finally, the authors discuss scenario optimization algorithms for the assessment of structured investment portfolios and present a detailed operational methodology for computer programming purposes and prospective research design with the backing of a graphical flowchart. Findings To that end, the portfolio/risk manager can specify different closeout horizons and dependence measures and calculate the necessary LVaR and resulting investable portfolios. In addition, portfolio managers can compare the return/risk ratio and asset allocation of obtained investable portfolios with different liquidation horizons in relation to the conventional Markowitz ' s mean-variance approach. Practical implications The examined optimization algorithms and modeling techniques have important practical applications for portfolio management and risk assessment, and can have many uses within machine learning and artificial intelligence, expert systems and smart financial applications, financial technology (FinTech), and within big data environments. In addition, it provide key real-world implications for portfolio/risk managers, treasury directors, risk management executives, policymakers and financial regulators to comply with the requirements of Basel III best practices on liquidly risk. Originality/value The proposed optimization algorithms can aid in advancing portfolios selection and management in financial markets by assessing investable portfolios subject to meaningful operational and financial constraints. Furthermore, the robust risk-algorithms and portfolio optimization techniques can aid in solving some real-world dilemmas under stressed and adverse market conditions, such as the effect of liquidity when it dries up in financial and commodity markets, the impact of correlations factors when there is a switching in their signs and the integration of the influence of the nonlinear and non-normal distribution of assets' returns in portfolio optimization and management.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53bed61d2804e51a7a72589af4b5ea17",
  "timestamp": "2025-05-15T02:08:03.931961"
}