{
  "id": 4461,
  "title": "Management of Operational Risk in the Context of Financial Performance of SMEs",
  "abstract": "Owners and managers of small and medium-sized enterprises (SMEs) have changed their perspective on risk management due to the current global negative threats in the business environment. If they want to be successful and ensure the financial performance of their business, they must adopt a proactive approach to reducing strategic risks in connection with operational risks. The aim of the article is to identify and quantify the differences in operational risk management and its effect on the financial management of SMEs between four Central European countries. The statistical sample of SMEs consisted of 1090 owners and top managers. Data collection was carried out through a questionnaire in the period December 2022-January 2023. Statistical hypotheses were evaluated with the application of correlation analysis and linear regression modelling. Empirical findings have confirmed that operational risk management has a significant positive impact on improving the profitability of the enterprise and on reducing the enterprise's indebtedness, as well as in the context of reducing the enterprise's inability to pay its obligations. However, there are disparities in the perception of this influence between owners/managers with regard to the country in which they carry out their business activities. The findings are important for both national and multinational organizations and entities dealing with risk management in the business environment of small and medium-sized enterprises.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53c38431bb26547dee3ae9ddffd551d8",
  "timestamp": "2025-05-15T02:37:17.010994"
}