{
  "id": 9188,
  "title": "The prevalence of intimate partner violence and risk factors for women and men in China during the Shanghai 2022 lockdown",
  "abstract": "Aims Intimate partner violence (IPV) is a global public health concern with negative effects on individuals and families. The present study investigated the prevalence, risk factors and gender disparities associated with IPV during the Shanghai 2022 Covid-19 lockdown - a public health emergency which may have exacerbated IPV.Methods We estimated the total IPV prevalence and prevalence of physical, sexual and verbal IPV by using an adapted version of the Extended-Hurt, Insult, Threaten, Scream scale. This cross-sectional study was carried out using a population quota-based sampling of Shanghai residents across 16 districts during the 2022 Shanghai lockdown (N = 2026; 1058 men and 968 women).Results We found a distinct gendered dynamic, where women reported a significantly higher prevalence of experienced IPV (27.1%, 95% confidence interval [CI]: 23.1-31.4) compared to men (19.8%, 95% CI: 16.1-24.0). Notably, the prevalence estimate mirrored the national lifetime IPV prevalence for women but was over twice as high for men. In multivariable logistic regression analyses, economic stress (income loss: adjusted OR [aOR] = 2.42, 95% CI: 1.28-4.56; job loss: aOR = 1.73, 95% CI: 1.02-2.92; financial worry much more than usual: aOR = 1.89, 95% CI: 1.00-3.57) and household burden (one child at home: aOR = 1.81, 95% CI: 1.12-2.92; not enough food: aOR = 1.67, 95% CI: 1.04-2.70) were associated with increased odds of overall IPV victimization among women but not men. With regard to more serious forms of IPV, job loss (aOR = 2.27, 95% CI: 1.09-4.69) and household burden (two or more children at home: aOR = 2.95, 95% CI: 1.33-7.69) were associated with increased odds of physical IPV against men. For women, a lack of household supplies was associated with increased odds of physical IPV (water: aOR = 3.33, 95% CI: 1.79-6.25; daily supplies: aOR = 2.27, 95% CI: 1.18-4.35). Lack of daily supplies (aOR = 2.17, 95% CI: 1.03-4.55) and job loss (aOR = 2.66, 95% CI: 1.16-6.12) were also associated with increased odds of sexual IPV.Conclusions Although a larger proportion of women reported IPV, men experienced greater IPV during the lockdown than previously estimated before the pandemic. Economic stressors, including job loss, and household burden were critical risk factors for serious forms of IPV. Improving gender equality that my account for disparities in IPV in China is critically needed. Policies that mitigate the impact of economic losses during crises can potentially reduce IPV.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53c72361003476303f8aaebe77cd5131",
  "timestamp": "2025-05-15T03:26:25.981461"
}