{
  "id": 4801,
  "title": "Condition Modeling of Railway Drainage Pipes",
  "abstract": "Condition of drainage asset systems can have substantial impact on the structural and operational integrity of railway tracks. It is therefore important to ensure that the various components of the drainage system are well-maintained. To this end, decision makers in the railway industry have been moving toward predictive, risk-informed drainage asset management. The approach aims to optimize the allocation of the limited time and financial resources for maintenance works. To achieve this more research is required to develop predictive condition models for railway drainage assets. This paper describes the development of data-driven condition prediction models using drainage pipe asset records. The models were tested for both structural and service condition prediction. Nine input factors were considered in the prediction models. Significance of the factors was evaluated using connection weight analysis. Four machine learning (ML) algorithms, namely neural networks, decision trees, bagged trees, and k-nearest neighbor, were compared based on their condition prediction performance for pipe drainage assets. The models were developed and tested using field data collected from the UK owner of rail assets, Network Rail. The results demonstrated that bagged trees performed best on a balanced data set with 87% overall accuracy for structural condition prediction and 72% accuracy for service condition prediction. It was found that pipe length, previous condition, years since previous condition, and maintenance were the most significant factors in predicting condition. (C) 2022 American Society of Civil Engineers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53cd8de00c03e264da57cb78c2eacc63",
  "timestamp": "2025-05-15T02:41:00.903095"
}