{
  "id": 3573,
  "title": "The impact of superstition on corporate tax avoidance: how do CEOs trade off risks associated with tax avoidance?",
  "abstract": "PurposeWe examine how superstition shapes corporate tax avoidance and do so by taking a risk perspective and focusing on the zodiac-year belief prevalent in China.Design/methodology/approachWe adopt a difference-in-differences research design to compare the degree of corporate tax avoidance in the CEOs' zodiac year with that in the adjacent years. We do propensity-score matching to form a sample of Chinese listed firms for the regression analysis.FindingsWe find causal evidence that firms exhibit a greater magnitude of tax avoidance in the CEOs' zodiac years, a result attributable to relatively weak tax enforcement in the Chinese context. We also find that the zodiac-year effect on corporate tax avoidance is more pronounced for firms with tight financial constraints, firms with high business risk, firms headquartered in regions with a high degree of superstition and non-state-owned firms.Originality/valueThis study is the first to show that superstition is a determinant factor of tax avoidance and contributes to the tax literature by shedding light on the behavioral risk factors that shape corporate tax avoidance. We take the perspective of CEOs' risk appetite to analyze how tax avoidance is influenced by the CEOs' trade-off between the costs and benefits of avoiding taxes. Our results suggest that, when CEOs are more risk-averse, they attach more importance to financial risk than the risk of reputational losses and litigation associated with corporate tax avoidance. The findings imply that tax avoidance can be curbed by increasing (or decreasing) the tax (financial) risk confronting the CEOs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53d66958308339a7178b6603e3ed1132",
  "timestamp": "2025-05-15T02:27:53.976834"
}