{
  "id": 154,
  "title": "Unidirectional and bidirectional LSTM models for edge weight predictions in dynamic cross-market equity networks",
  "abstract": "Predicting financial networks has important implications in finance. However, less research attention has been given in this direction. This study aims to predict cross market linkage strengths in financial networks using dynamic edge weight prediction. The study builds edge weight prediction models using deep learning based unidirectional and bidirectional long short-term memory (LSTM and BiLSTM) approaches. The models are built on temporally variant equity cross market networks in Asia. A rolling window approach is used to generate temporally synchronous observations of edge weight structures and subsequent networks. The models are trained with a series of historical network structure information. Tuning of hyperparameters was performed to obtain the optimized models. The models were validated using nested cross validation methods. The applicability of the optimized models was assessed for different scenarios, and promising results were found for edge weight pre-dictions on both unfiltered and filtered structures. The study also shows that the predictive performance of the BiLSTM model is the same across correlated (positively weighted) and anti-correlated (negatively weighted) edges. However, for LSTM the same does not hold true. The results also demonstrate that the proposed models predict edge weights better during normal conditions than in the crisis period. The proposed models are benchmarked against ARIMA and RNN. To our knowledge, this is the first attempt to build network prediction models for cross market equity networks. The findings can have key implications such as managing international portfolio diversifications and controlling systemic risk transmissions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53d78704256e9f3af143229841ed4c08",
  "timestamp": "2025-05-15T01:34:25.457947"
}