{
  "id": 2848,
  "title": "Financial stress and gambling motivation: the importance of financial literacy",
  "abstract": "PurposePoor, Stressed, Drink (alcohol), and Gambling is one of the campaigns for poverty eradication in Thailand. This study focuses on informal workers-gamblers-who belong to low-income groups and are not covered by the law as an employer. The main objective was to investigate the factors affecting financial stress among informal laborers and determine the factors that drive informal workers to buy lottery tickets (classified by economic, psychological and social motives).Design/methodology/approachThe authors applied binary logistic regression to determine what factors affected financial stress and multinomial logistic regression was applied to examine the factors affecting the motives for buying the lottery.FindingsAccording to the study's results, factors including education, income, gambling intensity, level of financial literacy, saving and knowledge about finance in general influenced both economic and psychological motives negatively. However, gender, status, age, level of risk tolerance, self-evaluated level of acceptable risk and knowledge about compound interest influenced both economic motives and psychological motives positively. It is worth noting that both the self-evaluation of their level of financial literacy and knowledge about inflation resulted in effects moving in different directions, with self-evaluation of their level of financial literacy and knowledge about inflation negatively affecting economic motives, but positively affecting psychological motives.Practical implicationsThe results of this study are expected to help policymakers understand more about this issue since it will illustrate the relationships between financial stress and financial literacy, financial behaviors, financial attitudes and risk tolerance and gambling behaviors. After all, financial stress is a significant problem affecting individuals, their families and the community, and it stems from various complex factors. Therefore, the government and counseling agencies should apply active strategies to mitigate these issues and lessen the resulting financial stress by providing financial literacy projects, as well as financial counseling.Social implicationsLow financial literacy, especially being inefficient at managing one's finances, unusually comes with unhealthy financial thought patterns, as well as a lack of systematic financial management. Furthermore, the lack of financial literacy can potentially lead to unfavorable circumstances. When one falls into uncontrollable situations, including divorce, becoming unemployed, having health problems, being in toxic relationships, loss of a breadwinner, an unexpected pregnancy, etcetera, they could easily find themselves failing to properly cope with these problems and become stressed. Finally, they are also more at risk to take illicit drugs or begin gambling more frequently.Originality/valueOne of the key elements that reduces financial stress is a person's finances, which is thought to have a significant role in reducing their betting behaviors. The findings of this study can be used to guide policy making intended to deter those who have never gambled from starting. Gambling is considered a risk-taking activity with a higher value reward in return. Money, enjoyment, socialization and excitement were all popular motives for gambling. These findings were consistent with what has been observed in Thai society related to the factors influencing individual to gamble, in other words, economic, psychological and social motives. The study focused on gamblers who were informal laborers. They are laborers without an employer according to the Thai labor law, do not have any social security from the government and, usually, have low incomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53e01178616b0fb7d769e083ce3db873",
  "timestamp": "2025-05-15T02:19:46.702152"
}