{
  "id": 837,
  "title": "Credit Management Based on Improved BP Neural Network",
  "abstract": "Credit management is a key factor in reducing credit risk of companies. The performance of credit departments in good standing guarantees stability and profitability of small and medium-sized loan companies. However, loan companies encounter credit risk more and more seriously. Credit managers cannot do very well on supporting the credit decision because credit risk factors are complicated and diversified. Besides, there are different credit risk factors in different cities in terms of their economic development, consumption levels, and competition in the market etc. Loan companies in Ji'nan City, Shandong Province are regarded as critical and competitive financial organizations that make contribution to the economic development of Ji'nan City and control loan risk. This paper analyses the original customer data from a company of Ji'nan City and then predicts overdue status of customers with improved Back Propagation algorithm (improved BP algorithm) by adding momentum coefficient and learning rate, which makes contribution to reducing credit risk. The overall accuracy rate of training has reached 90% and its testing accuracy rate has reached 80%, which contributes to any credit decision objectively instead of the subjective shortage of credit managers in analysis, judgment, and not accuracy.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53eac920ee82fbc6a3f689dbd9dc9de5",
  "timestamp": "2025-05-15T01:43:20.595689"
}