{
  "id": 6383,
  "title": "Energy insecurity during temperature extremes in remote Australia",
  "abstract": "Indigenous communities in remote Australia face dangerous temperature extremes. These extremes are associated with increased risk of mortality and ill health. For many households, temperature extremes increase both their reliance on those services that energy provides, and the risk of those services being disconnected. Poor quality housing, low incomes, poor health and energy insecurity associated with prepayment all exacerbate the risk of temperature-related harm. Here we use daily smart meter data for 3,300 households and regression analysis to assess the relationship between temperature, electricity use and disconnection in 28 remote communities. We find that nearly all households (91%) experienced a disconnection from electricity during the 2018-2019 financial year. Almost three quarters of households (74%) were disconnected more than ten times. Households with high electricity use located in the central climate zones had a one in three chance of a same-day disconnection on very hot or very cold days. A broad suite of interrelated policy responses is required to reduce the frequency, duration and negative effects of disconnection from electricity for remote-living Indigenous residents. Temperature extremes increase energy use and reliance on the services that energy provides, which can increase energy insecurity and the associated risks of harm. This study examines energy use of Indigenous communities in remote Australia and finds increased disconnection rates for prepayment-meter users during temperature extremes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "53f26740fe0cf6df5dbc9cd126332feb",
  "timestamp": "2025-05-15T02:57:38.733732"
}