{
  "id": 5585,
  "title": "Supply chain risks in Industry 4.0 environment: review and analysis framework",
  "abstract": "In Industry 4.0 environment, supply chains have become prone to various risks due to rapid globalization and process digitalization. The uncertainties and unplanned and unnatural events that are internal to supply chain networks and external to the environment of a firm pertaining to global supply chains are regarded as supply chain risks. The objective of this study is to identify and analyze the various emerging supply chain risks for strategy formulation in Industry 4.0 environment. Based on a systematic literature review and experts' opinion, different supply chain risks in the present business environment have been analyzed. Major identified risks are operational and manufacturing process risk, behavioural risk, demand risk, governmental and organisational risk, system risk, financial risk, product recovery risk, social and environmental risk, supply risk, disruption risk, cyber security, and safety risk. For developing risk mitigation strategies, risk prioritization is very important. Sufficient research has not been done on ranking and categorization of these risks in the Industry 4.0 environment. Therefore, this study has tried to rank these emerging supply chain risks by the Technique for Order Preferences by Similarity to an Ideal Solution (TOPSIS) approach. These risks are further categorized as cause and effect using a Decision Making Trial and Evaluation Laboratory (DEMATEL). This classification of risks will facilitate top management of the organization in formulating strategies for risk mitigations in the Industry 4.0 environment. The findings of the study imply that supply chain managers should focus on disruption risk; cyber security and safety risk in the current Industry 4.0 environment. As supply chain risk management is an emerging research area in Industry 4.0 environment, the findings of this study will be very useful for industry professionals and researchers for further studies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "540531531c886018088c0078a2d62c34",
  "timestamp": "2025-05-15T02:49:21.675260"
}