{
  "id": 4088,
  "title": "Gender Disparity in the Funding of Diseases by the US National Institutes of Health",
  "abstract": "Background: Gender bias has been an ongoing issue in health care, examples being underrepresentation of women in health studies, trivialization of women's physical complaints, and discrimination in the awarding of research grants. We examine here a different issue-gender disparity when it comes to the allocation of research funding among diseases. Materials and Methods: We perform an analysis of funding by the U.S. National Institutes of Health (NIH) to ascertain possible gender disparity in its allocation of funds across diseases. We normalize funding level to disease burden, as measured by the Disability Adjusted Life Year, and we specifically consider diseases for which both disease burden and funding level are provided. We apply a power-law regression analysis to model funding commensurate with disease burden. Results: We find that in nearly three-quarters of the cases where a disease afflicts primarily one gender, the funding pattern favors males, in that either the disease affects more women and is underfunded (with respect to burden), or the disease affects more men and is overfunded. Moreover, the disparity between actual funding and that which is commensurate with burden is nearly twice as large for diseases that favor males versus those that favor females. A chi-square test yields a p-value of 0.015, suggesting that our conclusions are representative of the full NIH disease portfolio. Conclusions: NIH applies a disproportionate share of its resources to diseases that affect primarily men, at the expense of those that affect primarily women.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54093f49a79c59285238d2f12bb7f802",
  "timestamp": "2025-05-15T01:23:27.471570"
}