{
  "id": 6599,
  "title": "Prevalence and related factors of Salmonella spp. and Salmonella Typhimurium contamination among broiler farms in Kerman province, Iran",
  "abstract": "Salmonella is one of the most important pathogens in the poultry industry that not only causes financial and economic damage, but also, some serovars of this bacterium, including the S. Typhimurium, can infect humans through poultry-to-human transmission. The purpose of this study was to investigate the prevalence of this pathogen among broiler poultry houses in the Kerman region, southeast of Iran and to identify factors which could increase the risk for Salmonella contamination in the chickens. In a cross-sectional study, 110 poultry houses were surveyed from June to October 2018. Twenty-eight variables related to the prevalence of Salmonella contamination were considered by a questionnaire template with farmers' and laborers' help. Also, the prevalence of Salmonella in poultry manure was determined based on fecal sampling, microbiological tests and polymerase chain reaction (PCR) technique. A multivariable logistic regression model was developed to measure the influence of independent variables on Salmonella contamination. Results showed that a time interval less than one month between the two breeding periods (OR=6.530), the number of fans less than 5 in each poultry house (OR=4.094) and the number of houses less than 4 in each farm significantly increased the probability of infection with Salmonella spp. (ORs were respectively 9.650, 29.427 and 7.140 for one, two and three houses). Also, the results of multivariable logistic regression showed that the use of a bell drinking system (OR=4.379) and the presence of fewer than 5 fans in each poultry house (OR=2.512) increased significantly the risk of infection with Salmonella Typhimurium.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "541701fc8de5f4d087dadb96d5de176e",
  "timestamp": "2025-05-15T02:59:37.083763"
}