{
  "id": 639,
  "title": "Data Mining in Credit Card Approval: Feature Importance Testing Comparison",
  "abstract": "Understanding the significance of features in data mining is crucial for accurately analyzing customer behavior, constructing reliable credit scoring models, and detecting fraud within the credit card approval process. This paper explores the application of data mining techniques in the credit industry, with a specific focus on credit card approval classification. We investigate seven feature importance testing techniques and three classification methods, assessing their performance through various metrics. The research demonstrates that FLOFO with linear regression and ShapFlex with agnostic causal relations substantially improve the performance of all classifiers, with SVM emerging as the most effective classifier across all feature selection techniques. Feature importance testing is pivotal as it not only enhances model accuracy but also provides deeper insights into the factors driving credit card approval decisions. The findings underscore the essential role of data mining in financial risk analysis and credit approval processes, offering valuable perspectives for advancing research and practices in financial technology. The results emphasize the potential of specific feature importance testing techniques and classificationmethods in refining credit card approval classification tasks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "541e1cfa67f4be4860ac425fd8d53bc6",
  "timestamp": "2025-05-15T01:53:24.868058"
}