{
  "id": 6848,
  "title": "The influence of personality traits and demographic factors on cryptocurrency investment decisions",
  "abstract": "Cryptocurrencies have garnered global attention due to their volatility and potential for high returns, yet the psychological and demographic drivers behind investment intentions remain underexplored. This study investigates the role of three Big Five personality traits-openness, conscientiousness, and agreeableness-along with age and gender, in shaping cryptocurrency investment intentions. Using survey data from 208 U.S. participants, hierarchical regression analysis examined direct effects of personality traits and moderating effect of gender. Results show that conscientiousness and agreeableness negatively affect investment intentions, reflecting the risk-averse tendencies of individuals in high in these traits. Age also negatively predicts willingness to invest, with younger individuals displaying a stronger inclination toward cryptocurrencies. Gender moderates the relationship between age and investment intentions, revealing that men exhibit a sharper decline in willingness to invest with age, while women maintain more consistent patterns. Openness did not significantly predict investment intentions. These findings contribute to behavioral finance literature by highlighting the interplay between personality, age, and gender in financial decision making. Additionally, this study advances understanding of psychological and demographic factors in cryptocurrency adoption.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5428ff49140472e3bf96c04f77bbd29c",
  "timestamp": "2025-05-15T03:02:07.529627"
}