{
  "id": 2942,
  "title": "Analysis of the financial derivatives for risk management in the context of financial market instability",
  "abstract": "The study aimed to analyse the possibilities and efficiency of financial derivatives as instruments for hedging and minimizing risks in financial markets. The research methodology included the classification of financial derivatives according to various criteria, including their structure and underlying assets. The main types of derivatives were identified: futures, forwards, options and swaps used to hedge risks in the commodity and financial instruments markets. The results of the study indicate that financial derivatives are substantial in reducing the impact of negative changes in the market, opening new opportunities for investors and companies in the context of hedging, speculation and arbitrage. The study determined that the evolution of financial derivatives was driven by the need to adapt to constantly changing market conditions, especially during crises and periods of volatility. The study also addressed the impact of financial technologies (fintech) and blockchain technologies on the derivatives market, emphasising the importance of automation and increased transparency of transactions. As noted, the derivatives market had undergone significant changes due to the introduction of new technologies that had improved the availability and speed of trading. Particular attention was devoted to the analysis of the Ukrainian derivatives market, where economic and political instability creates a need for effective risk management. A separate element of the study was the development of a model for the effective use of financial derivatives for risk management based on the example of Kernel. The model included the stages of risk assessment, selection of appropriate financial instruments, as well as monitoring and adjustment of strategies. The findings of the study emphasize that the derivatives market in Ukraine is still in the development stage, which is due to the limited understanding of these instruments among market participants",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "543fdfdbf3a990262240f2b1bc44bb0e",
  "timestamp": "2025-05-15T02:20:48.243604"
}