{
  "id": 212,
  "title": "Exploring the role of microfinance in encouraging entrepreneurship using unsupervised learning",
  "abstract": "Microfinance institutions in India have a significant role in providing financial services to a large sector of users who would otherwise be unable to access these services. These institutions have an important role in the reduction of poverty by providing small loans to the users. This study examines the impact of microfinance on entrepreneurial activities in Indian context. Two widely used machine learning approaches, Principal Component Analysis (PCA) and clustering have been employed to identify correlation among the microfinance and a set of selected factors. The selected factors have been associated with Gross Loan Portfolio (GLP), since the GLP has been used in the literature as a significant control variable for computing the entrepreneurship level. Initially, PCA technique has been applied to determine main principal components, and then K-Means clustering has been applied to get clusters, in order to get the labelled dataset. The labelled data obtained from K-Means clustering is useful for applying classification techniques, through which we can predict level of entrepreneurship using Supervised Learning. Finally, the results obtained from machine learning algorithms indicate that GLP being the main contributing factor for computing the entrepreneurship level.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5441c991f4561dd951c035a0110138ee",
  "timestamp": "2025-05-15T00:40:34.152768"
}