{
  "id": 7651,
  "title": "Spatio-temporal analysis of malaria incidence in the Peruvian Amazon Region between 2002 and 2013",
  "abstract": "Malaria remains a major public health problem in the Peruvian Amazon where the persistence of high-risk transmission areas (hotspots) challenges the current malaria control strategies. This study aimed at identifying significant space-time clusters of malaria incidence in Loreto region 2002-2013 and to determine significant changes across years in relation to the control measures applied. Poisson regression and purely temporal, spatial, and space-time analyses were conducted. Three significantly different periods in terms of annual incidence rates (AIR) were identified, overlapping respectively with the pre-, during, and post-implementation control activities supported by PAMAFRO project. The most likely space-time clusters of malaria incidence for P. vivax and P. falciparum corresponded to the pre- and first two years of the PAMAFRO project and were situated in the northern districts of Loreto, while secondary clusters were identified in eastern and southern districts with the latest onset and the shortest duration of PAMAFRO interventions. Malaria in Loreto was highly heterogeneous at geographical level and over time. Importantly, the excellent achievements obtained during 5 years of intensified control efforts totally vanished in only 2 to 3 years after the end of the program, calling for sustained political and financial commitment for the success of malaria elimination as ultimate goal.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "544463bc50fe88a8e4c6c9380a89033e",
  "timestamp": "2025-05-15T03:10:33.106941"
}