{
  "id": 6088,
  "title": "Financial Difficulties Correlate With Mental Health Among Bangladeshi Residents Amid COVID-19 Pandemic: Findings From a Cross-Sectional Survey",
  "abstract": "Background: The COVID-19 pandemic is a global threat which has challenged mental resilience and impacted the psychological well-being of people across all age groups globally. The present study aimed to investigate how financial difficulties during the pandemic correlate with mental health among residents of Bangladesh.Methods: A cross-sectional survey was conducted on 4,020 residents from different parts of Bangladesh between July and September 2020, during a period of elevated risk of COVID-19 infection. A self-reported online questionnaire comprising socio-demographic, financial difficulties and psychometric measures (to assess depression, anxiety and stress) was used to gather information from participants. Multivariable logistic regression analysis was performed to determine the factors associated with mental health consequences.Results: The prevalence of depression, anxiety, and stress in the sample were 71.1%, 62.3%, and 56.7%, respectively. Levels of depression, anxiety, and stress were significantly higher among participants who reported female sex, being unmarried, smaller families, higher monthly family income, poor self-perceived health status, living near people who had been infected by COVID-19, probability of decreased income, food scarcity (both during the pandemic and in the future) and the possibility of unemployment. However, due to the nature of the cross-sectional study performed with a convenience sampling method, the causal relationship between variables cannot be justified.Conclusions: After several months of the COVID-19 pandemic in Bangladesh, more than half of the respondents rated their mental health concerns as moderate to severe. The findings highlight the contributing factors of poor mental health which warrant the creation of interventions that address the economic, financial and mental health impacts of the pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5444ab0f58af22bca4ed9f3a0dcb1824",
  "timestamp": "2025-05-15T02:54:38.826508"
}