{
  "id": 4250,
  "title": "On the differential response of loans to shocks in the USA",
  "abstract": "Purpose The purpose of this paper is to gain insights useful to explain the loan puzzle: the unexpected increase of loans to firms in case of a monetary tightening. To this end, the authors develop the analysis using several loan categories distinguished by lender, scope and borrower. This approach helps to unveil significant differences on how those categories respond to the same shock and allow to evaluate possible alternative explanations for such differences. Design/methodology/approach The paper is empirical. The analysis is based on a large vector auto-regression, estimated using Bayesian techniques and has as object the US economy. Findings The findings support a supply-side explanation of the loan puzzle, i.e. banks reshuffle their portfolio in favor of short-term business loans after a monetary tightening. Moreover, the authors achieve the following results. First, the analysis shows that loans to small firms increase as well, but less than what observed with large firms: small firms stay between large firms and households. Second, considering advances and other loans allows to conclude that finance companies behave very much as banks. Third, some limited evidence suggests that not just industrial and commercial loans to firms might increase but also more long-term loans, such as mortgages. Originality/value The authors develop an analysis, based on state-of-the-art Bayesian techniques, that reveals the differential response of well-distinguished loan categories to several shocks; monetary and real shocks in the first place. After showing their heterogenous response, the authors discuss it in detail, with specific reference to supply and demand factors of credit intrinsic to the transmission mechanism. With respect to previous contributions, the authors consider a plurality of loan categories functional to understand the reason behind each specific response. This allows to conclude in favor of supply factors as an explanation of the unexpected increase of loans to corporate firms in case of a monetary shock.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "544c7b05436cceb8f846e2b5d6c65f81",
  "timestamp": "2025-05-15T01:25:23.228387"
}