{
  "id": 9410,
  "title": "Longitudinal changes of health-related quality of life over 10 years in breast cancer patients treated with radiotherapy following breast-conserving surgery",
  "abstract": "PurposesThe study intended to (1) assess changes of health-related quality of life (HRQoL) between early treatment-related time points and 10 years post-treatment in a cohort of breast cancer (BC) patients who received radiotherapy (RT), (2) to evaluate differences in HRQoL between long-term BC survivors and unaffected women from the same geographical region and (3) to identify determinants of long-term HRQoL in the survivor cohort.Methods292 BC patients were recruited prior to RT after breast-conserving surgery between 1998 and 2001 in Germany and prospectively followed up for a median of 11.4 years (range 10.3-12.8 years). HRQoL was assessed using EORTC QLQ-C30 at pre-RT (baseline), during RT, 6 weeks after RT, and at the 10-year follow-up. Changes in mean HRQoL scores over time were assessed using linear-mixed models. HRQoL in long-term survivors and controls was compared using Wilcoxon rank-sum test, stratified by age groups. Multivariable linear regression models were used to identify determinants for HRQoL in long-term BC survivors.ResultsCompared to baseline level (mean summary score of 64.9), global health status/quality of life (GHS/QoL) declined during RT (62.4) and improved 6 weeks after RT (69.9) before decreasing to baseline level at the 10-year follow-up (66.7). Most functional domains deteriorated or remained stable at 10 years post-diagnosis compared to post-RT scores, except for role functioning which improved, while dyspnea and diarrhea significantly deteriorated between those two time points. There were no significant differences in long-term GHS/QoL between BC survivors 10 years post-RT and controls for all age groups (p > 0.05). However, deficits in specific HRQoL domains such as emotional burden, sleep problems or fatigue were found to more strongly affect survivors, in particular those younger than 65 years, compared to controls. In the determinant analysis, being overweight was associated with lower GHS/QoL and physical functioning, while living with others was found to be associated with better physical functioning, and decreased dyspnea and pain levels. Certain comorbidities such as depression had a strong association with multiple HRQoL domains, including lower GHS/QoL and functioning as well as a higher level of fatigue, pain, sleep/intestinal problems, and financial difficulties. Side effects such as lymphedema/pain and fibrosis were associated with worse physical and social functioning, respectively.ConclusionThe long-term GHS/QoL remained comparable when compared with the control population while restrictions in certain functional and symptoms domains in long-term BC survivors persisted over 10 years, in particular among younger survivors. Targeted screening to identify cancer survivors at risk for psychosocial/other impairment accounting also for comorbidities and treatment side effects may be warranted in long-term aftercare to address unmet health needs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "545779a281dcca0b212d3aff91eddf65",
  "timestamp": "2025-05-15T03:28:17.671622"
}