{
  "id": 4869,
  "title": "Financial constraints of ethnic entrepreneurship: evidence from Germany",
  "abstract": "Purpose - The theory of small business finance predicts that ethnic minority-owned businesses are more likely to be credit constrained in the start-up process than are native-owned businesses. In Germany, empirical evidence for this issue is scarce because of missing data. This paper aims to address these issues. Design/methodology/approach - The paper reviews previous studies and uses data from a survey of ethnic and native entrepreneurs in Germany that include detailed information about start-up financing. The hypotheses were tested for differences in financial constraints using univariate analyses and apply multivariate regression models to identify the causes of credit constraints in start-up financing. Findings - The data provide evidence that entrepreneurs with an immigration background (ethnic entrepreneurs), defined as German residents who hold foreign citizenship or who were born outside Germany, are significantly more likely to be denied credit or to be awarded smaller loans than requested than are native entrepreneurs. However, the underlying reasons for this effect may be differences in risk factors and financial relationships, rather than ethnicity. Research limitations/implications - The dataset consists of 234 observations. The results refer to the sample and might not be representative of ethnic minority start-ups in general. Practical implications - Apart from the risk factors observed in the study, communication problems and lack of information about possible sources of external financing may be relevant. Better communications between financial institutions and ethnic minority businesses may help to reduce the financing gap vis-a-vis native entrepreneurs. Originality/value - This is the first examination of the financial constraints of ethnic entrepreneurship in Germany using univariate and multivariate analyses. Previous evidence has been limited to observations about possible discrimination against ethnic minorities and has not tested the significance of observed differences in access to credit.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54647ede84c31340def838f03cd3eb62",
  "timestamp": "2025-05-15T02:42:04.813762"
}