{
  "id": 836,
  "title": "Do Alliance portfolios encourage or impede new business practice adoption? Theory and evidence from the private equity industry",
  "abstract": "Research Summary We show that the existing alliance portfolio of a firm can impede the adoption of a new business practice. We analyze the private equity industry which features alliances in the form of deal syndication and has recently seen the rise of a novel investment practice: add-on deals. Using algorithm-supported induction, we first document robust empirical patterns using machine learning techniques, and then test the theory we construct to explain these patterns using standard econometric methods in a hold-out sample. We find that when the capabilities required for the new business practice require new partners, existing alliance portfolio members who support current practices can impede access to these new partners (and hence the adoption of the new business practice) through capacity constraints and inter-partner rivalry. Managerial Summary Alliance partners play a valuable role in many industries, and particularly in the PE industry as syndication partners. While the benefits of working with such partners are well understood, we uncover a potential weakness that alliance portfolio managers should be aware of. If a new business practice relies substantially on a new type of alliance partner, the existing alliance portfolio may impede access to this partner, thus impeding the adoption of the new practice. For PE fund managers, in particular, this implies balancing their deal syndication strategy with the development of new relationships with corporate partners to adopt add-on models to complement the traditional LBOs. We also show how to use machine learning techniques to uncover patterns of strategic interest in past transaction data.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54653d409481f3b3a55fb27191ecae9f",
  "timestamp": "2025-05-15T00:48:22.526491"
}