{
  "id": 8497,
  "title": "Investigating identity crime and misuse in Australia: the role of prevention technologies and the likelihood of victimisation",
  "abstract": "PurposeThis study examines identity theft as a significant and growing issue in Australia, not only due to its financial impact but also because of the emotional, psychological, and physical harm it causes, making it a public health concern. This study aims to analyse the results of the 2019 Australian Institute of Criminology (AIC) survey to identify factors associated with an increased likelihood of identity theft victimisation.Design/methodology/approachThis study involved a detailed analysis of the 2019 AIC survey, which had 9,968 respondents from a sample of 10,000. The research focused on whether respondents had ever been victimised by identity theft and analysed various characteristics, including demographics (gender, age, Indigenous status, education), income, computer usage, and preventive technology use, as potential indicators of future victimisation. Univariate analyses (chi-squared test and two-sample t-test) were used to assess individual associations, whereas a multivariate analysis (logistic regression) identified significant predictors of victimisation.FindingsThe univariate analyses indicated that all sub-variables were individually associated with identity theft victimisation. However, the multivariate analysis revealed that only identifying as Aboriginal and Torres Strait Islander, having an income between $18,201 and $37,000, and using multiple preventive technologies were significant predictors of victimisation. The unexpected finding that increased preventive technology use correlates with a higher risk of victimisation contradicts the survey's suggestion that victims adopt more careful behaviour post-victimisation.Practical implicationsThe research highlights the need for further investigation into the counterintuitive finding that greater use of preventive technologies may increase the risk of identity theft. Understanding this discrepancy could inform the development of more effective identity theft prevention strategies by the government and related agencies.Originality/valueThis study contributes to the existing literature by offering a nuanced understanding of the factors associated with identity theft victimisation in Australia that may be applicable globally. The unexpected findings regarding the use of preventive technologies provide a basis for further research and have the potential to influence future policymaking and identity theft prevention efforts.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54668b5780bef206d95e90e50e1af201",
  "timestamp": "2025-05-15T03:19:21.352075"
}