{
  "id": 8638,
  "title": "Social Determinants and Perinatal Hardships During the COVID-19 Pandemic",
  "abstract": "Background: This study examined perinatal experiences of pandemic-related hardships and disparities by race/ethnicity, income, insurance type at childbirth, and urban/rural residency.Materials and Methods: We used cross-sectional survey data from the 2020 Pregnancy Risk Assessment Monitoring System COVID-19 supplement in 26 states, the District of Columbia, and New York City to explore: (1) job loss or cut work hours/pay, (2) having to move/relocate or becoming homeless, (3) problems paying the rent, mortgage, or bills, or (4) worries that food would run out. We estimated the prevalence of outcomes overall and by race/ethnicity, income, insurance, and urban/rural residency. We used weighted multivariable logistic regression models to calculate adjusted predicted probabilities.Results: Due to the COVID-19 pandemic, 31.9% of respondents reported losing their job or having a cut in work hours or pay, 11.2% of respondents had to move/relocate or became homeless, 21.8% had problems paying the rent, mortgage, or bills, and 16.86% reported worries that food would run out. Compared to overall, rates of all hardships were higher among respondents who were non-Hispanic Black, Hispanic, uninsured, or Medicaid insured. The adjusted predicted probability of employment instability, financial hardships, and food insecurity was significantly higher among non-Hispanic Black respondents and respondents who were uninsured. The adjusted predicted probability of all hardships was significantly higher among respondents with Medicaid.Conclusions: Black, Medicaid-insured, and uninsured respondents were particularly vulnerable to perinatal hardships during COVID-19. Our results suggest a need to alleviate the overall and disparate consequences of hardships for individuals who gave birth during the COVID-19 pandemic.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5467babccac9c7e614b7708531156dfa",
  "timestamp": "2025-05-15T03:20:55.958475"
}