{
  "id": 4279,
  "title": "Twins Less Frequent Than Expected Among Male Births in Risk Averse Populations",
  "abstract": "Male twin gestations exhibit higher incidence of fetal morbidity and mortality than singleton gestations. From an evolutionary perspective, the relatively high rates of infant and child mortality among male twins born into threatening environments reduce the fitness of these gestations, making them more vulnerable to fetal loss. Women do not perceive choosing to spontaneously abort gestations although the outcome may result from estimates, made without awareness, of the risks of continuing a pregnancy. Here, we examine whether the non-conscious decisional biology of gestation can be linked to conscious risk aversion. We test this speculation by measuring the association between household surveys in Sweden that gauge financial risk aversion in the population and the frequency of twins among live male births. We used time-series regression methods to estimate our suspected associations and Box-Jenkins modeling to ensure that autocorrelation did not confound the estimation or reduce its efficiency. We found, consistent with theory, that financial risk aversion in the population correlates inversely with the odds of a twin among Swedish males born two months later. The odds of a twin among males fell by approximately 3.5% two months after unexpectedly great risk aversion in the population. This work implies that shocks that affect population risk aversion carry implications for fetal loss in vulnerable twin pregnancies.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "547bbbc2f55f85a0954bf375edf02d8c",
  "timestamp": "2025-05-15T02:35:26.258681"
}