{
  "id": 2178,
  "title": "Climate risk analysis: Definitions, measurements, strategies, and sectoral impacts",
  "abstract": "The paper reviews and integrates the definitions, measurement techniques of climate risk, and its economic, social, and financial impacts. It systematizes the various dimensions of climate risk, including climate transition risks and physical risks, and how these risks are defined and understood in the current literature. The paper compiles the methodologies used to measure climate risks, highlighting innovative approaches such as big data analytics, machine learning, and complex network models. Additionally, it assesses the societal impacts of climate change, examining how different sectors, including agriculture, energy, transportation, and finance, are affected. By synthesizing findings from a broad range of studies, this review provides a detailed understanding of the multifaceted nature of climate risk and offers insights into effective risk management strategies. Significantly, this research serves as a crucial theoretical foundation for policymakers in formulating policies to combat climate change and for industry practitioners in devising investment strategies, thus providing practical implications that are essential for mitigating the adverse effects of climate change on society. The paper aims to be a valuable resource for those working in this area.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5482f9917cbcda971bfe53f683423f3a",
  "timestamp": "2025-05-15T02:12:17.376945"
}