{
  "id": 8714,
  "title": "Retinal Nerve Fiber Layer Optical Texture Analysis Detecting Axonal Fiber Bundle Defects in Patients with Ocular Hypertension",
  "abstract": "Purpose: To apply retinal nerve fiber layer (RNFL) optical texture analysis (ROTA) to investigate the prevalence, patterns, and risk factors of RNFL defects in patients with ocular hypertension (OHT) who showed normal optic disc and RNFL configuration in clinical examination, normal RNFL thickness on OCT analysis, and normal visual field (VF) results. Design: Cross-sectional study. Participants: Six hundred eyes of 306 patients with OHT. Methods: All participants underwent clinical examination of the optic disc and RNFL, OCT RNFL imaging, and 24-2 standard automated perimetry. To detect RNFL defects, ROTA was applied. The risk score for glaucoma development was calculated according to the Ocular Hypertension Treatment Study and European Glaucoma Prevention Study (OHTS-EGPS) risk prediction model. Risk factors associated with RNFL defects were analyzed using multilevel logistic regression analysis. Main Outcome Measures: Prevalence of RNFL defects. Results: The average intraocular pressure (IOP) measured from 3 separate visits within 6 months was 24.9 +/- 1.8 mmHg for the eye with higher IOP and 23.7 +/- 1.7 mmHg for the eye with lower IOP; the respective central corneal thicknesses were 568.7 +/- 30.8 mm and 568.8 +/- 31.2 mm. Of 306 patients with OHT, 10.8% (33 patients, 37 eyes) demonstrated RNFL defects in ROTA in at least 1 eye. Of the 37 eyes with RNFL defects, the superior arcuate bundle was the most frequently involved (62.2%), followed by the superior papillomacular bundle (27.0%) and the inferior papillomacular bundle (21.6%). Papillofoveal bundle defects were observed in 10.8% of eyes. The smallest RNFL defect spanned 0.0 degrees along Bruch's membrane opening margin, whereas the widest RNFL defect extended over 29.3 degrees. Age (years) (odds ratio [OR], 1.08; 95% confidence interval [CI], 1.03-1.13), VF pattern standard deviation (decibels [dB]) (OR, 1.82; 95% CI, 1.01-3.29), cup volume (mm3) (OR, 1.24; 95% CI, 1.01-1.53), and the OHTS-EPGS risk score (OR, 1.04; 95% CI, 1.01-1.07) were associated with RNFL defects. Conclusions: A considerable proportion of patients with OHT who showed no signs of optic disc and RNFL thickness abnormalities on clinical and OCT examination exhibited RNFL defects on ROTA. Axonal fiber bundle defects on ROTA may represent the earliest discernible sign of glaucoma in the glaucoma continuum. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2023;130:1080-1089 (c) 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/ 4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5484e845795de67eb516a3f02760d7aa",
  "timestamp": "2025-05-15T03:21:56.557460"
}