{
  "id": 8956,
  "title": "The Suicidal Ideation of Disaster Victims: A Nationwide Cross-Sectional Study",
  "abstract": "Purpose: Various natural and human made disasters occur worldwide. This study aimed to identify the factors affecting suicidal ideation in victims of disasters such as typhoons, heavy rainfall, fires, and earthquakes.Methods: Data were obtained from a long-term survey on life changes among disaster victims conducted in 2019 by the National Disaster Management Research Institute. The study included 2234 victims of natural and social disasters occurring in Korea between 2012 and 2018. Suicidal ideation was assessed using the Korean version of the Composite International Diagnostic Interview developed by the World Health Organization. The participants' demographic characteristics, disaster-related characteristics, physical characteristics, psychological characteristics, and social characteristics were analyzed as the influencing factors. The data were analyzed using the chi-square test, t-test, and logistic regression.Results: Of the 2234 subjects in this study, 32 were disaster victims who had experienced suicidal ideation, accounting for 1.4%. The results showed that the factors affecting suicidal ideation included disaster-related injury/disease, depression, and social support. The odds ratio of suicidal ideation was higher when there was injury/disease (OR=1.89, 95% CI=0.07-0.48), with higher depression levels (OR=1.31, 95% CI=1.18-1.47) and with lower social support (OR=0.94, 95% CI=0.90-0.99).Conclusion: This study identifies the significant influencing factors of suicidal ideation in disaster victims, which were as follows: disaster-related injury or disease, depression, and social support. Our study's findings would contribute to screening high-risk groups of suicidal ideation and developing effective support, interventions, and suicide prevention programs for disaster victims. Furthermore, to prevent suicide and promote the healthy recovery of disaster victims, mental health care services aimed at suicide prevention should be reinforced and the victims should be provided with psychological support and treatment without financial burden.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "548aeb1929c4e8ffaf893e3d869f94e1",
  "timestamp": "2025-05-15T03:23:56.163301"
}