{
  "id": 5644,
  "title": "Impact of morbidity on care need increase and mortality in nursing homes: a retrospective longitudinal study using administrative claims data",
  "abstract": "BackgroundA growing number of older people are care dependent and live in nursing homes, which accounts for the majority of long-term-care spending. Specific medical conditions and resident characteristics may serve as risk factors predicting negative health outcomes. We investigated the association between the risk of increasing care need and chronic medical conditions among nursing home residents, allowing for the competing risk of mortality.MethodsIn this retrospective longitudinal study based on health insurance claims data, we investigated 20,485 older adults (>= 65years) admitted to German nursing homes between April 2007 and March 2014 with care need level 1 or 2 (according to the three level classification of the German long-term care insurance). This classification is based on required daily time needed for assistance. The outcome was care level change. Medical conditions were determined according to 31 Charlson and Elixhauser conditions. Competing risks analyses were applied to identify chronic medical conditions associated with risk of care level change and mortality.ResultsThe probability for care level change and mortality acted in opposite directions. Dementia was associated with increased probability of care level change compared to other conditions. Patients who had cancer, myocardial infarction, congestive heart failure, cardiac arrhythmias, renal failure, chronic pulmonary disease, weight loss, or recent hospitalization were more likely to die, as well as residents with paralysis and obesity when admitted with care level 2.ConclusionThis paper identified risk groups of nursing home residents which are particularly prone to increasing care need or mortality. This enables focusing on these risk group to offer prevention or special treatment. Moreover, residents seemed to follow specific trajectories depending on their medical conditions. Some were more prone to increased care need while others had a high risk of mortality instead. Several conditions were neither related to increased care need nor mortality, e.g., valvular, cerebrovascular or liver disease, peripheral vascular disorder, blood loss anemia, depression, drug abuse and psychosis. Knowledge of functional status trajectories of residents over time after nursing home admission can help decision-makers when planning and preparing future care provision strategies (e.g., planning of staffing, physical equipment and financial resources).",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "549a4743336a9fce20164cc463629770",
  "timestamp": "2025-05-15T02:49:50.347508"
}