{
  "id": 2637,
  "title": "Financial inclusion and energy efficiency: role of green innovation and human capital for Malaysia",
  "abstract": "One of the top priorities of most countries around the world is sustainable development, to achieve which financial inclusion is identified as one of the key elements. Thus, unlike previous studies, the current study aims to channel the impact of financial inclusion on energy efficiency by constructing a parametric-based index that covers availability, accessibility, and usage of the former. The index provides an overall picture of financial services in all the three covered aspects. The analysis based on novel econometric time-series approaches, the method of moment quantile regression and the robust least square approach, shows that financial inclusion increases energy efficiency. The impact is overall positive for each quantile, i.e. 25th-90th. The impact of green innovation, human capital, and political risk is also supportive for energy efficiency. However, the impact of political risk improvement exhibits negative in the initial stages and turns positive later. In terms of policy implications, broadening financial inclusion base with the promotion of green innovation and human capital is important to achieve higher energy efficiency. In the meantime, improvement in the political risk profile should also be considered for a stable financial system to pave the way for increasing energy efficiency.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54a05811f3804237dd51c947f10ec369",
  "timestamp": "2025-05-15T02:17:32.184468"
}