{
  "id": 6399,
  "title": "A Comparison of Count and Zero-Inflated Regression Models for Predicting Claim Frequencies in Thai Automobile Insurance",
  "abstract": "This study investigates the estimation of claim frequencies in voluntary automobile insurance, a critical component of actuarial risk assessment and premium rating. As automobile usage in Thailand continues to rise, accurately predicting claim occurrences becomes increasingly vital for insurers to maintain financial stability and appropriate reserve allocation. The research employs a dataset of 4,986 automobile insurance policies from 2017 to compare the efficacy of six regression models including Poisson, Negative Binomial (NB), Conway-Maxwell-Poisson (CMP), and their Zero-Inflated (ZI) versions; ZIP, ZINB, and ZICMP. Then, the model performance was evaluated using likelihood based methods including Akaike's Information Criterion (AIC), Bayesian Information Criterion (BIC), Likelihood Ratio test (LRT), and Vuong test. The numerical results indicate that the ZICMP model demonstrates superior performance in predicting claim frequencies, yielding the lowest AIC and BIC of 3,923.10 and 3,968.70, respectively. The LRT and Vuong test also support our conclusion. The crucial factors influencing claim occurrence were identified as premium, no-claim bonus, and incurred loss. These findings contribute to the actuarial literature by providing insights into optimal modeling techniques for claim frequency prediction in the Thai voluntary automobile insurance market. The results have practical implications for insurers in premium calculation, reserve setting, and risk factor identification, potentially enhancing overall risk management strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54b6e5d056abfa0c34c4e06137af2cdc",
  "timestamp": "2025-05-15T02:57:38.800266"
}