{
  "id": 7408,
  "title": "Debt types and burdens by family structures",
  "abstract": "Purpose - The purpose of this study was to examine family structure differences in debt types and burdens of American families. Design/methodology/approach - Data was from the 2016 Survey of Consumer Finances. Eight types of family structures, five specific debts, and two debt burden indicators are examined with multivariate logistic regressions. Findings - After controlling for several socioeconomic variables, multivariate logistic regression results show that married with children families are more likely than five other family types to have any debt. In terms of specific debt, married with children families are more likely than six other types of families to have mortgages, four other types to have credit card loans, five other types to have to vehicle loans, three other types to have education loans, and one other type to have purchase loans. Married with children families are more likely than three other types of families (childless married couples, single males, and single females) to be late in debt payment for 60 or more days. Research limitations/implications - The data is limited to one-year cross-sectional data. To gain more insights on this topic, panel data could be used. Practical implications - The findings can be used for financial service professionals to identify loan demand and risk associated with various family structures and develop effective marketing strategies to serve these clients. Social implications - The findings are informative for public policymakers to develop family friendly economic policies and for consumer educators who help consumers make effective financial decisions when borrowing various types of loans. Originality/value - First, this study uses an innovative definition of family structure that counts several nontraditional family structures. Second, this study examines family structure differences in holdings of five specific debts together.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54c3a75ec2b14974490c51ad4b54341b",
  "timestamp": "2025-05-15T03:08:00.905879"
}