{
  "id": 9362,
  "title": "Does Really Innovative Work Behaviors of Emloyees Mediate the Innovative Performance Impacts of Intrapreneurship?",
  "abstract": "In today's highly dynamic and innovation based competitive environments force corporations to develop distinctive employee skills and competencies which were difficult to replicate or to imitate by the competitors. Resource based view suggests that developing, deploying and protecting intangible assets are crucial to gain and sustain competitive advantage. Internal corporate entrepreneurship (intrapreneurship) plays the key role for sustainable rejuvenation of ultimate organizational performance. The literature on intrapreneurship and organizational innovativeness has focused on the managerial competencies and managerial tools to achieve effective intrapreneurship rather than the role of employees who are the essence of organizations. In the literature there are five managerial tools that are needed to support an innovation oriented entrepreneurial climate within the large organizations to orient employees to be more entrepreneurial and thereby innovative; namely (1) management support, (2) time availability, (3) individual freedom and autonomy, (4) reward availability/reinforcement (5) management's and employees' absorption capacity of risk. Innovation is the process of discovery, diffusion, action. In this multi stage process, ideas are captured; filtered, funded, developed, modified, clarified and eventually commercialized. Therefore this study complements the literature by taking into account the innovative work behavior of employee as a mediator factor with a multi-dimensional structure between intrapreneurial climatic factors and innovative performance. Management support, reward system, autonomy, tolerance for failure and allocation of free time have been employed as the compounds of innovative work behavior where idea generation, idea promotion and idea realization have been employed as innovative work behavior. Survey method was used to conduct the data of this study. All scales have been adopted from existing literature. 65 manufacturing firms without any industrial limitations were chosen randomly for the field study. The final sample includes 199 respondents from 45 different firms mostly located in Izmir Ataturk Organized Industrial Zone and ITOB Organized Industrial Zone. The respondents of this study were the employees' of manufacturing firms from all hierarchical levels. After collecting the surveys and processing survey data into SPSS 17.0 statistical software, Exploratory Factor Analysis was used to test the validity of the scales. Reliability tests of each factor structure and their Pearson correlations scores were calculated and presented with descriptive statistics. Finally multiple regression analysis was utilized to test the hypotheses of the study. The results indicate that intrapreneurial climate dimensions of management support and reward availability together with civic virtue are strong drivers of Innovative Work Behaviors (IWBs), these types of behaviors are also effective instruments for the Innovative Performance of the firms which lead to effective functioning of the organization in terms of manufacturing, new product and financial performance.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54c7ca26e1fcbaf6fc8c56094cb29209",
  "timestamp": "2025-05-15T03:27:53.445093"
}