{
  "id": 7984,
  "title": "Household external vulnerability due to climate change in Selangor coast of Malaysia",
  "abstract": "Coastal areas are already facing various risks due to increasing climate-related hazards that are likely to amplify with changing climate and make the households living in these areas even more vulnerable in terms of livelihoods and living conditions. This study attempted to evaluate vulnerability mapping of the coastal areas due to climate change using an integrative external and internal framework from three dimensions at the household level: exposure (E) to coastal hazards, sensitivity (S) due to demographic, socio-economic and structural characteristics and adaptive capacity (AC) relating to available assets and adaptive behaviour to cope with climate change impacts. Primary data on relevant indicators for assessing vulnerability were collected from ten historically eroded critical coastal areas along Selangor coastline, Malaysia. Using a pre-tested questionnaire, face-to-face interviews were conducted with 1050 randomly selected households. The collected data were used to estimate a composite vulnerability index (VI) from E, S, and AC indices. The vulnerability was classified according to four categories (low, moderate, high, very high) based on quarterly percentile distribution to evaluate the status. The results showed that about 96% of households had moderate exposure, and 4% had high exposure to climate change. All of the households exhibited moderate sensitivity. Low adaptive capacity was observed in 76% of households, moderate adaptive capacity in 17% and high adaptive capacity in 7%. Composite VI indicated that eight coastal areas (84% of households) are highly vulnerable, and two coastal areas (16%) are moderately vulnerable to climate change. The high vulnerability was attributed to increased exposure to shoreline erosion, high-risk perception, limited income, weak housing structures and lack of financial capital. The variation in exposure, socio-economic characteristics and available capitals resulted in different degrees of vulnerability in Selangor coastal areas indicating the diversified need for proactive adaptation planning at the local level. It is recommended that an appropriate mix of equitable community-based adaptations that adequately address the needs of the most vulnerable, focusing on poverty reduction, financial incentives and livelihood resilience and climate policies based on equity and justice, cultural and societal values are implemented to contribute to rural coastal households' resilience. This study is limited by the selective indicators of the external household vulnerability and subjective range of vulnerability classification.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54ea958660a624be26cc69a9d7d0ddc3",
  "timestamp": "2025-05-15T03:14:07.218937"
}