{
  "id": 284,
  "title": "Application of Machine Learning Models for Predictions on Cross-Border Merger and Acquisition Decisions with ESG Characteristics from an Ecosystem and Sustainable Development Perspective",
  "abstract": "From an ecosystem perspective, mergers and acquisitions (M&A) are one of the key paths for firms to foster complementary sectors and gain complementary assets. From the perspective of sustainable development, M&A can reallocate resources from target to asset to achieve better synergy and prolong the operation of a merged firm. However, M&A activities are characterized by high risk due to the high cost and uncertainty. Thus, a prediction model of M&A decisions is valuable for firms' strategy design from an ecosystem and sustainable development perspective. By adopting a machine learning technique, this study measured the cross-border M&A decisions by analyzing firm-level cross-sectional data of the global financial marketplace under ecosystem mapping for the application of various country, deal and firm-level indicators related to sustainable development. Our paper can support the hypotheses of corporate governance, ecosystem stakeholder theory, ecosystem risk and institution theory in explaining that firms can increase their success rate of M&A to achieve sustainable development. Methodologically, we used AdaBoost to train several weak classifiers (decision trees) to achieve a strong decision-making model with a large financial transaction database of 215,160 deal activities. Results achieved 80.1% prediction accuracy by using the AdaBoost model through 10-fold cross validation. We found that differences exist on prediction features of M&A with different characteristics of sustainable development. For a robustness check, comparable results were obtained with a support vector machine (SVM) model. By analyses of the features during the cross-border M&A decision-making processing, this study is expected to contribute to the utilization of machine learning in ecosystem studies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "54ecc4ace57827d58c2e70100b1e520a",
  "timestamp": "2025-05-15T01:49:04.578358"
}