{
  "id": 6824,
  "title": "Effects of the bank levy introduction on the interbank market",
  "abstract": "One of the proposals that have been brought forward regarding ways of discouraging banks from taking unnecessary risk, widely debated these days, is the introduction of taxes in the financial sector. Although recent empirical investigations document a positive effect of the bank levies (BL), it may also reduce banks' activity. In this paper, we aim to analyse the Polish BL on assets. Poland's interbank market might be affected by a new BL introduced in 2016, as interbank positions of the balance sheet have been also taxed. The analysis covers the panel structure of data of Polish banks with unconsolidated financial statements. To evaluate the impact of the BL on the above interbank market features, we use the OLS regression with fixed effects in relation to the bank. Data has been sourced from OrbisFocus and Central Banks' websites and covers the period 2011-2017. The result demonstrates that the BL on assets applied in Poland has a negative impact on the interbank market. Estimation results shows that the BL on assets significantly decrease the value of 1y and increases the value of 3 months interbank loans. In addition, the BL on assets in the banking sector positively affects the value of government securities and negatively affects the interest income on interbank loans. Moreover, the dispersion of 1 and 3 months quotations was reduced as a result of the BL introduction. In case of short-term transactions, dispersion amplifies. Additionally, the volatility of quotation decreases due to reduced trading after the BL implementation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55107941a3cd888c7232cdf5ba5c9d79",
  "timestamp": "2025-05-15T03:02:07.452343"
}