{
  "id": 3883,
  "title": "Trajectories of income offending: examining PTSD as a predictor of development",
  "abstract": "Income offending presents a major criminal justice issue associated with generating financial gain through illicit means. Such crimes may cause financial harm on an individual level and lead to additional strain on our criminal justice system when criminals who engage in such offending are caught and prosecuted. Post-traumatic stress disorder (PTSD) may present one mental health risk factor associated with differential development of income offending patterns across the life-course. This is because issues like low impulse control and potentially substance use habits that are often observed in PTSD may result in an increased risk for income offending among individuals with the disorder. This study sought to identify heterogeneity in income offending patterns and determine the relevance of PTSD as a risk factor. The Pathways to Desistance data were used in analyses. Group-based trajectory modeling was utilized to identify heterogeneity in developmental patterns of income offending. Multinomial logistic regression was used to examine the relevance of PTSD as predictor of development. Results indicated that a six-group trajectory model best fit the data. Meeting criteria for a lifetime diagnosis of PTSD predicted increased risk of assignment to the High Chronic income offending group. Implications are discussed.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55293f770841af4717ac485d45c55f45",
  "timestamp": "2025-05-15T02:30:58.283341"
}