{
  "id": 4286,
  "title": "Heterogeneity of investor sentiment, geopolitical risk and economic policy uncertainty: do Islamic banks differ during COVID-19 pandemic?",
  "abstract": "PurposeThis study examined the impact of; COVID-19 investor sentiment, COVID-19 cases, geopolitical risk (GPR), economic policy uncertainty (EPU), oil returns and Islamic banking on bank stock returns. In addition, it examined whether Islamic bank stock returns differed from conventional banks when interacting with selected variables.Design/methodology/approachThis study consisted of 137 conventional and Islamic stock market listed banks in 16 Middle East and North Africa (MENA) countries from February 2020 to July 2021. Monthly data were used for bank stock returns, number of COVID-19 cases, COVID-19 investor sentiment, oil price and EPU, while GPR data were obtained annually. This paper used unconditional quantile regression (UQR) in its analysis.FindingsCOVID-19 investor sentiment and EPU negatively influenced bank stock returns. However, oil returns were only positive and significant in first quantile. Conversely, GPR negatively impacted bank returns up to the median quantile, while the impact was positive in upper quantiles. Islamic banks outperformed conventional banks in all quantiles. Additionally, GPR negatively influenced Islamic bank returns up to 75th quantile, while oil returns negatively impacted Islamic bank returns up to 95th quantile. Ultimately, COVID-19 investor sentiment and EPU positively influenced Islamic bank returns up to 95th quantile.Practical implicationsMarket conditions must be considered when implementing investment decisions and policies, as the effects of market shocks are mostly asymmetrical. For example, it is important for international investors to take into consideration asymmetric factors, such as market uncertainty in oil market. Especially in bearish Islamic markets, bad news concerning uncertainty can be perceived as riskier than good news.Social implicationsA change in health sentiment, such as COVID-19 cases and COVID-19 investor sentiment, can be used to determine future direction of conventional and Islamic stock markets. Asymmetric effects associated with market news can make portfolio management more effective. COVID-19 investor sentiment states can be used to predict Islamic market index dynamics in MENA region.Originality/valueThis paper offered insight into heterogeneity of market conditions and dependencies of Islamic banks' stock market returns on COVID-19 investor sentiment and uncertainty, among others that should be considered when implementing investment decisions and policies.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "552d8a874fe1b5189b064356e0fecec9",
  "timestamp": "2025-05-15T01:25:23.418263"
}