{
  "id": 6695,
  "title": "Substance use and duration of untreated psychosis in KwaZulu-Natal, South Africa",
  "abstract": "Background: Substance use and psychiatric disorders cause significant burden of disease in low- and middle- income countries. Co- morbid psychopathology and longer duration of untreated psychosis (DUP) can negatively affect treatment outcomes. Objectives: The study assessed substance use amongst adults with severe mental illness receiving services at a regional psychiatric hospital in KwaZulu- Natal (South Africa). We describe the prevalence and correlates of lifetime substance use and examine the association between substance use and DUP. Methods: A cross- sectional survey recruited adults diagnosed with severe mental illness and assessed lifetime and past 3- month substance use using the World Health Organization Alcohol, Smoking and Substance Involvement Screening Test. Regression analyses were conducted to determine associations between lifetime substance use (other than alcohol and tobacco) and DUP as measured by the World Health Organization Encounter Form. Results: Amongst 87 participants, alcohol (81.6%), tobacco (75.6%) and cannabis (49.4%) were the most common substances reported for lifetime use. Risk of health- related problems (health, social, financial, legal and relationship) of cannabis use was associated with younger age, single marital status and lower education. Adjusted regression analyses indicated that use of amphetamines and methaqualone is associated with longer DUP. Conclusions: Substance use is prevalent amongst psychiatric patients in KwaZulu- Natal and may contribute to longer DUP. Mental health services in this region should address co- morbid substance use and psychiatric disorders.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "553cb8dad100716c37747691c3c88c23",
  "timestamp": "2025-05-15T03:00:35.477832"
}