{
  "id": 7240,
  "title": "Farmers' adaptation choices to climate change: a case study of wheat growers in Western Iran",
  "abstract": "Climate change is expected to disproportionately affect farmers by further exacerbating the risks that they face. These risks have a huge negative impact on their livelihood. However, mounting evidence has revealed that farmers can effectively manage this negative impact by adapting their farming practices to climate change. The objectives of this study were to evaluate the farmers' ongoing adaptation measures, and to identify factors that influence their choice of adaptation methods in wheat production in the Kermanshah district in Western Iran. A sample of 350 farmers living in this region was selected through a multi-stage stratified and random sampling method. Principal component analysis revealed that three components play a role in the farmers' decisions on adaptation methods, namely, farm production practices, farm financial management, and government programs and insurance. The relative influence of the factors listed under each of the three components was assessed using a multiple linear regression analysis. Our analysis showed that these factors accounted for 50%, 25%, and 40% of the adaptation responses analyzed, respectively. In sum, our findings yield recommendations for agriculture extension and risk communication strategies that could promote adaptation behavior among Iranian farmers.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "553d7a6026bac742451389fd71d200b4",
  "timestamp": "2025-05-15T03:06:35.399821"
}