{
  "id": 8689,
  "title": "Association of Structural Variables with Quality of Care in German Hospitals",
  "abstract": "Background The Hospital sector in Germany is undergoing uncoordinated structural changes for financial reasons. At the same time, quality-oriented control measures are used to ensure and improve the quality of treatment. It is unclear whether the right structures, namely those that guarantee positive results, will be maintained. Objective Investigation of the association between different structural hospital characteristics with quality of care. Methods In a secondary data analysis, the association of quality of care and the structural characteristics of hospital size, type of ownership, region, teaching status and case mix index (CMI) were compared based on hospital quality reports. Quality indices were calculated for each hospital using selected quality indicators of external quality assurance (eQA). First, the associations were examined univariately using the Mann-Whitney U test or Kruskal-Wallis test and then using multiple linear regression analysis, taking into account the interaction effects of the independent variables. Findings About 90% of the indices examined showed significant associations between structural hospital characteristics and the quality of care. Positive associations with the quality of care were found in the structural characteristics of hospital size of less than 100 beds, private ownership, no teaching hospital and a low CMI. Negative associations were observed in the structural variables hospital size more than 500 beds, public ownership, teaching-status and higher CMI. Conclusion According to the results of this study, small hospitals seem to provide the best quality of care. This counterintuitive result suggests thatthe examined eQA quality indicators used in the index calculation may not be sufficiently risk-adjusted or scientifically evaluated, and their use as quality management tools is not recommended.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5549b473b2e75ef281e07baa1b1da840",
  "timestamp": "2025-05-15T03:21:24.684510"
}