{
  "id": 8659,
  "title": "Atopic dermatitis is associated with increased use of social benefits: a register-based cohort study",
  "abstract": "Background The comprehensive consequences of atopic dermatitis (AD) include a negative influence on work life. However, data regarding use of social benefits in patients with AD are sparse. Objective To examine the association between AD and use of social benefits, with a specific focus on paid sick leave and disability pension. Methods The study cohort comprises citizens born in the period 1964-1999 with a diagnosis of AD registered in the Danish National Patient Registry (DNPR) and a 20-fold match control group from the background population. Cross-linkage of data from 1964 up to 2015 by four national registers (the DNPR; the Central Person Register; the Register of Medicinal Product Statistics; and the Danish Register for Evaluation of Marginalisation) enabled the comparison of AD patients and controls with respect to social benefits. Prescription of systemic medication served as a proxy for AD severity. Social benefits were analysed as a function of AD status using Cox regression. Results A total of 28 156 AD patients were registered in the DNPR, and the control group comprised 473 836 individuals not registered with AD in the DNPR. AD was found to be associated with increased risk of receiving social benefits, paid sick leave in particular, and most pronounced for younger patients with severe AD (OR = 1.37, 95% CI: 1.25-1.52). The use of disability pension was increased for all groups of AD patients compared to controls and most pronounced for older patients with severe AD [HR 1.67 (95% CI: 1.45-1.93)]. Conclusion Our data emphasize that AD significantly impacts work life negatively for the patients and is a financial burden for the society.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5560ed273e12ed3bcba05793bd79e5de",
  "timestamp": "2025-05-15T03:20:56.003868"
}