{
  "id": 2215,
  "title": "Sustainable Financing and Financial Risk Management of Financial Institutions-Case Study on Chinese Banks",
  "abstract": "This study examines the relationship between sustainable financing and financial risk management of Chinese financial institutions, using data from Chinese banks. Financial risk management is a comprehensive measure of operating performance, asset quality and capital adequacy ratio. The structural vector auto-regression model determines the relationship between two variables. The positive shock of sustainable financing business negatively impacts the financial risk management of banks. In contrast, positive shock of banks' financial risk management positively affects sustainable financing. Further subdivision of the sample revealed that sustainable financing does not always negatively impact the financial risk management of large state-owned banks. However, the positive shock of financial risk management reduces urban banks' green credit proportions. The results are consistent whenever compared between the empirical outcome of the entire sample and the sample consisting of national joint stock bank accounts. This comparison helps eliminate the possibility of a biased outcome as a major portion of the sample is from a national joint-stock bank account. Apart from data limitations, the results of the sub-sample test are influenced due to the difference in deposit and loan interest rates, as well as different ownership structures of banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "557c1de8ffd3187229e14716f387d032",
  "timestamp": "2025-05-15T02:12:50.937061"
}