{
  "id": 8022,
  "title": "The Relationship Between Health Insurance Status and Diabetic Retinopathy Progression",
  "abstract": "Objective: To determine if baseline diabetic retinopathy (DR) severity mediates the relationship between health insurance status and DR progression. Design: Retrospective cohort study. Subjects: Seven hundred sixteen patients aged > 18 years with a diagnosis of type 1 or 2 diabetes mellitus, and a diagnosis of nonproliferative DR (NPDR) were identified from the electronic health record of a tertiary academic center between June 2012 and February 2022. Methods: NPDR severity at baseline was the proposed mediator in the relationship between insurance status and proliferative DR (PDR) progression. Logistic regression was used to determine the association between insurance status and NPDR severity at baseline, and Cox proportional hazards regression was used to assess the association between insurance status and time to PDR progression. To analyze the mediation effect of NPDR severity at baseline, a counterfactual approach, which decomposes a total effect into a natural direct effect and a natural indirect effect was applied. Main Outcome Measures: Time to progression from first NPDR diagnosis to first PDR diagnosis. Results: Of the 716 patients, 581 (81%) had Medicare or private insurance, 107 (15%) had Medicaid, and 28 (4.0%) were uninsured at their baseline eye visit. Uninsured or Medicaid patients had a higher proportion of moderate or severe NPDR at their baseline eye visit and a higher proportion of progression to PDR. After adjusting for confounders and NPDR severity at baseline, patients who were uninsured had significantly greater risk of progression to PDR compared with that of patients with Medicare/private insurance (hazard ratio [HR]: 2.63; 95% confidence interval [CI]: 1.10-6.25). Patients with Medicaid also had an increased risk of progression to PDR compared with that of patients with Medicare/private insurance, although not statistically significant (HR: 1.53; 95% CI: 0.81-2.89). NPDR severity at baseline mediated 41% of the effect of insurance status (uninsured vs. Medicare/private insurance) on PDR progression. Conclusions: Patients who were uninsured were more likely to have an advanced stage of NPDR at their baseline eye visit and were at significantly greater risk of progression to PDR compared with patients who had Medicare or were privately insured. Mediation analysis revealed that differences in baseline NPDR severity by insurance explained a significant proportion of the relationship between insurance status and DR progression. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2024;4:100458 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5585c04f9bf705f330d08e0ac948fb27",
  "timestamp": "2025-05-15T03:14:37.276641"
}