{
  "id": 9095,
  "title": "Population groups and banks: a comparative study on the survival analysis of Indian commercial banks",
  "abstract": "Purpose Banks in India have started opening their branches in different areas to make sure that their customers get a high-touch experience and they see them as a premier brand. This could be ensured only if the banks show a stable physical presence in the market as well as provide the recent high-tech services to their customers as per the population group. The purpose of this study is to examine the survival rates of the commercial banks in India across the four population groups along with the differences that exist in their survival rates in all the population groups. Design/methodology/approach The analysis is based on the quarterly data of the number of functioning offices of the commercial banks in India as per the four population groups from March 2006 to December 2019. The survival is estimated using the Kaplan-Meier estimator. Findings From the analysis, it is revealed that survival of the banks changes as per the population group. In addition to this, it is found that the survival time of each category of the bank varies in each population group. Research limitations/implications This study focuses only on the commercial banks of India; a similar research could be done for other categories of Indian banks. Also, the results would have been different if the variables such as the size of the bank, bank risk, etc. are included and studied. Moreover, this study is done using the Kaplan-Meier estimator, i.e. time-to-event. Further, an advance study could be done after considering the financial parameters of banks using the Cox's regression model, which explores the relationship between various predictors and the time-to-event. Social implications Due to the changes in the preferences of societies, the banks should also adopt different strategies to ensure that their products are understood and accepted by their customers. This will eventually increase the survival rate of the banks. Originality/value The work made in this study is completely new.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5586e08623aa9d23150c16b1e80b11b5",
  "timestamp": "2025-05-15T03:25:27.759543"
}