{
  "id": 4374,
  "title": "Neural Networks Modeling for Prediction of Required Resources for Personalized Endourologic Treatment of Urolithiasis",
  "abstract": "When scheduling surgeries for urolithiasis, the lack of information about the complexity of procedures and required instruments can lead to mismanagement, cancellations of elective surgeries and financial risk for the hospital. The aim of this study was to develop, train, and test prediction models for ureterorenoscopy. Routinely acquired Computer Tomography (CT) imaging data and patient data were used as data sources. Machine learning models were trained and tested to predict the need for laser lithotripsy and to forecast the expected duration of ureterorenoscopy on the bases of 474 patients over a period from May 2016 to December 2019. Negative predictive value for use of laser lithotripsy was 92%, and positive predictive value 91% before application of the reject option, increasing to 97% and 94% after application of the reject option. Similar results were found for duration of surgery at <30 min. This combined prediction is possible for 54% of patients. Factors influencing prediction of laser application and duration <30 min are age, sex, height, weight, Body Mass Index (BMI), stone size, stone volume, stone density, and presence of a ureteral stent. Neuronal networks for prediction help to identify patients with an operative time <30 min who did not require laser lithotripsy. Thus, surgical planning and resource allocation can be optimised to increase efficiency in the Operating Room (OR).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5596ce59cfeaa67321e8f1acb302b2b5",
  "timestamp": "2025-05-15T02:36:38.393952"
}