{
  "id": 2214,
  "title": "The role of financial strain and self-control in explaining health behaviours: the GLOBE study",
  "abstract": "Background: Why lower socioeconomic groups behave less healthily can only partly be explained by direct costs of behaving healthily. We hypothesize that low income increases the risk of facing financial strain. Experiencing financial strain takes up cognitive 'bandwidth' and leads to less self-control, and subsequently results in more unhealthy behaviour. We therefore aim to investigate (i) whether a low income increases the likelihood of experiencing financial strain and of unhealthy behaviours, (ii) to what extent more financial strain is associated with less self-control and, subsequently, (iii) whether less self-control is related to more unhealthy behaviour. Methods: Cross-sectional survey data were obtained from participants (25-75 years) in the fifth wave of the Dutch GLOBE study (N = 2812) in 2014. The associations between income, financial strain, self-control and health-behaviour-related outcomes (physical inactivity in leisure-time, obesity, smoking, excessive alcohol intake, and weekly fruit and vegetable intake) were analysed with linear regression and generalized linear regression models (log link). Results: Experiencing great compared with no financial strain increased the risk of all health-behaviour-related outcomes, independent of income. Low self-control, as compared with high self-control, also increased the risk of an unhealthy lifestyle. Taking self-control into account slightly attenuated the associations between financial strain and the outcomes. Conclusion: Great financial strain and low self-control are consistently associated with unhealthy behaviours. Self-control may partly mediate between financial strain and unhealthy behaviour. Interventions that relieve financial strain may free up cognitive bandwidth and improve health behaviour.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55a3024f6fb0e302e4b84621ec4acd0f",
  "timestamp": "2025-05-15T02:12:50.927457"
}