{
  "id": 9219,
  "title": "An analysis of customer-based and supplier-based trade credit gaps",
  "abstract": "PurposeThis paper aims to examine the customer-based and supplier-based trade credit gaps for USA firms from 1970 to 2020.Design/methodology/approachThe authors' study examines USA companies from 1970 to 2020. The authors begin with an analysis of the trends in aggregate working capital, the capital's components and the trade credit gaps. Various regression models are used to estimate the impacts of identified firm characteristics and unidentified sources on customer-based and supplier-based trade credit gaps over time. The authors then decompose the impacts of firm characteristics to further understand whether changing firm characteristics and/or changing sensitivity to firm characteristics drive the variation in trade credit gaps.FindingsThere is a gradual reduction in the customer-based trade credit gap and a substantial expansion in the supplier-based trade credit gap. Though identified firm characteristics have dominant impacts on observed trade credit gaps, there is evidence of the effects of time and unobservable factors. The main source of changes in customer-based and supplier-based trade credit gaps lies in changes in sensitivity to firm characteristics. In addition, the authors find that firm age is the factor with the largest average effect on both trade credit gaps when examining the full sample period. However, different firm characteristics appear to be the key driver of variations in trade credit gaps over time and across the two types of trade credit gaps. The authors also find that financial distress has the least impact on both customer-based and supplier-based trade gaps. There are variations in the firm characteristics with the largest impacts when evaluating decade-long evaluation periods.Originality/valueTo the authors' knowledge, this is the first paper to examine the customer-based and supplier-based trade credit gaps. The connection between trade credit and the trade credit's corresponding inventory (INV) component extends prior literature on the joint management of trade credit and INV. The authors analyze both identified firm characteristics and unidentified sources in the search for explanations of the trade credit gaps. Furthermore, the authors' study explores the channels through which firm characteristics affect different types of trade credit gaps. The authors' findings help identify relevant and irrelevant risk factors of corporate working capital policy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55b1fc33bddd54b66e229a0a66aced01",
  "timestamp": "2025-05-15T03:26:54.494510"
}