{
  "id": 8434,
  "title": "Deconstructing three-stage overall efficiency into input, output and stability efficiency components with consideration of market power and loan loss provision: An application to Chinese banks",
  "abstract": "The current study proposes a new three-stage network data envelopment analysis (DEA) model to estimate three different types of efficiencies. More specifically, the input efficiency is estimated in the first stage, followed by the evaluation of stability efficiency in the second stage, and finally, the output efficiency is derived from the final stage. In particular, we consider market power in deposits and market power in loans in the banking production process. Rather than using non-performing loans as an undesirable output, this paper innovatively uses loan loss provisions in bank production. We argue that the loan loss provisions are helpful to improve bank stability because they provide a cushion to absorb unexpected losses, therefore we treat it as a good intermediate output in the second stage and a good intermediate input in the third stage. The results exhibit that the scores of stability inefficiency are the highest, followed by output inefficiency, while Chinese commercial banks have the lowest level of input inefficiency. Not only did we observe that the Chinese banking industry has the highest level of stability inefficiency, but we also noticed that the stability inefficiency had the strongest volatility during 2007-2017. We also explore the impact of non-performing loan ratios from three different geographical areas on bank efficiency in China in a second-phase regression analysis, the results of which show that the input inefficiency results from higher levels of financial risk from the central area in China, while the western area in China has the opposite sign.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55ca95b70e8e6407364c768185d145db",
  "timestamp": "2025-05-15T03:18:51.598173"
}