{
  "id": 8182,
  "title": "Regional differences in rates of HIV-1 viral load monitoring in Canada: Insights and implications for antiretroviral care in high income countries",
  "abstract": "Background: Viral load (VL) monitoring is an essential component of the care of HIV positive individuals. Rates of VL monitoring have been shown to vary by HIV risk factor and clinical characteristics. The objective of this study was to determine whether there are differences among regions in Canada in the rates of VL testing of HIV-positive individuals on combination antiretroviral therapy (cART), where the testing is available without financial barriers under the coverage of provincial health insurance programs. Methods: The Canadian Observational Cohort (CANOC) is a collaboration of nine Canadian cohorts of HIV-positive individuals who initiated cART after January 1, 2000. The study included participants with at least one year of follow-up. Generalized Estimating Equation (GEE) regression models were used to determine the effect of geographic region on (1) the occurrence of an interval of 9 months or more between two consecutive recorded VL tests and (2) the number of days between VL tests, after adjusting for demographic and clinical covariates. Overall and regional annual rates of VL testing were also reported. Results: 3,648 individuals were included in the analysis with a median follow-up of 42.9 months and a median of 15 VL tests. In multivariable GEE logistic regression models, gaps in VL testing > 9 months were more likely in Quebec (Odds Ratio (OR) = 1.72, p < 0.0001) and Ontario (OR = 1.78, p < 0.0001) than in British Columbia and among injection drug users (OR = 1.68, p < 0.0001) and were less likely among older individuals (OR = 0.77 per 10 years, p < 0.0001), among men having sex with men (OR = 0.62, p < 0.0001), within the first year of cART (OR = 0.15, p < 0.0001), among individuals on cART at the time of the blood draw (OR = 0.34, p < 0.0001) and among individuals with VL < 50 copies/ml at the previous visit (OR = 0.56, p < .0001). Conclusions: Significant variation in rates of VL testing and the probability of a significant gap in testing were related to geographic region, HIV risk factor, age, year of cART initiation, type of cART regimen, being in the first year of cART, AIDS-defining illness and whether or not the previous VL was below the limit of detection.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55cc062903b3673526f66b1e556a2f4d",
  "timestamp": "2025-05-15T03:16:17.384874"
}