{
  "id": 769,
  "title": "DETECTION AND CHARACTERISATION OF POLLUTANT ASSETS WITH AI AND EO TO PRIORITISE GREEN INVESTMENTS: THE GEOASSET FRAMEWORK",
  "abstract": "Detailed and complete data on physical assets are required in order to adequately assess environment-related risk and impact exposure and the diffusion of these risks and impacts through the financial system. Investors need to know where the physical assets (e.g., power plant, factory, farm) are located of companies in their portfolios, and what their polluting characteristics are. This is essential to manage these environment-related risks and to channel investments to more sustainable alternatives. At present, data on physical assets is typically incomplete, inaccurate, or not released in a timely manner. As a result, key stakeholders including asset owners, asset managers, regulators and policymakers are frequently forced to make crucial decisions with incomplete information. Accurate and comprehensive global asset-level databases are a prerequisite for meaningful innovation in green and digital finance. They provide the link between the financial system and the real economy and allows the wealth of EO datasets and insights that we have available to be made actionable for sustainable finance decision making. We created a framework to derive a global database of pollutant plants, such as cement, iron, and steel, which represent about 15% of the global CO2 emissions. Our solution makes use of state-of-the-art deep learning architectures coupled with Earth observation data.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55dbae006a2a7d4eff121afb2fe2b405",
  "timestamp": "2025-05-15T01:42:44.382503"
}