{
  "id": 3882,
  "title": "Overweight and obesity among low-income women in rural West Virginia and urban Los Angeles County",
  "abstract": "We described the prevalence of overweight and obesity among low-income women in rural West Virginia (WV) and urban Los Angeles County (LA County). Both communities participated in the national Communities Putting Prevention to Work program during 2010-2012. In each community, we completed health assessments on adult women recruited from public-sector clinics serving low-income populations. All participants answered survey questions regarding socio-demographics and diets. In both jurisdictions, we assessed obesity using objectively measured height and weight (calculated BMI). As part of each community case study, we performed multivariable regression analyses to describe the relationships between overweight and obesity and selected covariates (e.g., dietary behaviors). Overweight and obesity were prevalent among low-income women from WV (73%, combined) and LA County (67%, combined). In both communities, race and ethnicity appeared to predict the two conditions; however, the associations were not robust. In LA County, for example, African American and Hispanic women were 1.4 times (95% CI = 1.12, 1.81) more likely than white women to be overweight and obese. Collectively, these subpopulation health data served as an important guide for further planning of obesity prevention efforts in both communities. These efforts became a part of the subsequent Community Transformation Grants portfolio. (C) 2014 Elsevier Inc. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55dce474f81468f57e04ad424e237be4",
  "timestamp": "2025-05-15T01:21:41.415400"
}