{
  "id": 8652,
  "title": "The effect of health insurance reimbursement rates on middle-aged and elderly people's hospital choices: evidence from China",
  "abstract": "BackgroundAdjusting the health insurance reimbursement rate is essential to optimize the allocation of medical resources. This paper investigates the effect of health insurance reimbursement rates on middle-aged and elderly people's choice of hospitals in China.MethodsThis study is conducted using the China Health and Retirement Longitudinal Study (CHARLS) database. This paper uses the widely used ordered logit model for estimation. We build three types of instrumental variables, Bartik instrumental variable, per capita financial income, and health risk perception bias, with the help of the propensity score matching method, aiming at the cleanest possible identification of causal relationship. Furthermore, we use a mediating effects model to investigate the specific mechanism by which the reimbursement rate influences patients' choice of hospitals.ResultsOur findings reveal that the higher a hospital's reimbursement rate, the more likely a patient is to choose to seek care. This paper further calculates the marginal effects based on the benchmark regression. For every 1% increase in health insurance reimbursement rates, the probability of patients choosing primary hospitals decreases by 5.75%, choosing secondary hospitals decreases by 1.47%, and choosing tertiary hospitals increases by 7.22%. According to mechanistic analysis, this paper reveals for the first time that health signals from medical checkups significantly impact patients' health care choices. In addition, we discuss the heterogeneity of hospital choices by region, age, and health status.ConclusionsThe results mean that when individuals are faced with a multitude of hospitals and are overwhelmed with choices, some small institutional designs can act as a nudge to help policymakers achieve a desirable outcome. The government should fully utilize health insurance's benefit adjustment role and implement a differentiated reimbursement strategy.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55dd35e1bc50b0720a3931fb98a20a50",
  "timestamp": "2025-05-15T03:20:55.987922"
}