{
  "id": 3852,
  "title": "Brand names on packaging and their impact on purchase preference",
  "abstract": "This study examines whether appearance of corporate, product and dual brand names (or a combination of brand names used together) on packaging influence consumer purchase preference. The face-to-face survey consists of consumers rating their purchase preference on a 7-point scale sixteen random brand names, and combinations of brand names on packaging along with three different prices, each for two product categories: chocolate and cereals a total of 4032 observations are examined. Hypotheses are tested using multiple linear regression models. The findings show corporate, product and dual brand names have little impact on purchase preference per se, instead brand category dominance influence consumer choice, and corporate names do not add value as previously thought. The study suggests trends and contexts in which, a corporate name and a product brand name may be extended to optimise consumer brand associations and influence purchase, as well as strategies for extending in remote product categories. Future research needs focusing on international consumers' response on brand linkages in the international arena, and the issues of brand building and brand equity maintenance in international markets. The study makes contribution to brand extension, brand portfolio management and strategic brand management research. Copyright (C) 2011 John Wiley & Sons, Ltd.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55e5a5903b7aaf629c47f63b807638c1",
  "timestamp": "2025-05-15T01:21:41.301533"
}