{
  "id": 3052,
  "title": "CEOS' climate risk perception bias and corporate debt structure",
  "abstract": "Climate risk, the biggest challenge faced by the human society, poses great complexities and difficulties to the corporate operations. Unlike previous studies focus on either the objective level of climate risks or the subjective perception for such risk, we quantify the difference between the objective level and subjective perception of climate risk and define as CEOs' climate risk perception bias, and further explore the impact of the bias on the corporate debt structure. The empirical results reveal several key findings. First, the baseline regression results indicate that an increase in CEOs' climate risk perception bias is positively associated with debt concentration, while simultaneously leading to a reduction in the number of debt instruments. Robustness checks confirm the stability of these findings across various model specifications and sample sets, enhancing the reliability of the observed relationships. Additionally, heterogeneity tests show that the significant effects of climate risk perception bias on debt structure are primarily present in firms with a proper understanding of climate risks, while those that underestimate or overstate such risks display non-significant changes. Mechanistically, our analysis highlights that CEOs' climate risk perception bias significantly reduce R&D expenditures, reflecting a trade-off between immediate financial stability and long-term innovation potential. Furthermore, heightened perception biases correlate with decreased risk tolerance and increased financial constraints, limiting firms' flexibility in adapting to changing market conditions. These findings emphasize the need for accurate climate risk assessments to inform corporate financial strategies. Policy- makers should facilitate access to diverse financing options to help companies manage climate- related uncertainties while maintaining financial flexibility.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55f215c16ac99946d17998d92613844b",
  "timestamp": "2025-05-15T02:21:52.284860"
}