{
  "id": 1585,
  "title": "Natural resources and sustainable financial development: Evidence from South Asian economies",
  "abstract": "In contemporary times, the existing literature provides a blurred image regarding the connection between nat-ural resources and financial market development. Some studies validate the financial resource curse, while others reveal financial resource blessings. To reach a true conclusion, this study analyzes the impact of natural resources on financial market development in the presence of financial risk and technological innovation. Exploring the nexus in four South Asian economies, this study covers the period from 1990 to 2020. Due to the data's asymmetric distribution, this study uses the novel non-parametric (bootstrap quantile regression) technique. The empirical results revealed that natural resources are a curse in the development of financial markets. That is, natural resources are negatively associated with financial market development. On the other hand, financial risk and technological innovation are the substantial factors of financial market development, which positively affect financial markets throughout quantiles. The robustness of the model is also tested via parametric (robust regression) and non-parametric (panel quantile regression) approaches. Unidirectional causal impact is observed from natural resources, financial risk, technological innovation, and financial market development. Based on the empirical findings, this study directed the channelization of natural resources, reducing financial risk and enhancing investment in research, development, and human capital.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "55ffd5d0df5430d6dc9755cf923de680",
  "timestamp": "2025-05-15T02:05:08.158429"
}