{
  "id": 4739,
  "title": "Analysing the risk factors of doxorubicin-associated heart failure by a retrospective study of integrated, nation-wide databases",
  "abstract": "Introduction: The incidence of dilated cardiomyopathy after anthracycline chemotherapy is mainly influenced by anthracycline cumulative dose. Previous researches showed doxorubicin treatment under cumulative dose of 450 mg/m(2) associated with a low incidence of heart failure. Nowadays, doxorubicin is administered with a lower dose, the development of heart failure is largely determined by other factors. Aim: Our purpose was to identify the risk factors for heart failure due to doxorubicin therapy. Method: With the use of the Hungarian financial healthcare databases merged with the National Cancer Registry, we performed a retrospective study. All the patients having confirmation for breast carcinoma between 2004 and 2015 were enrolled. The subjects with a preceding period characterized by any chemotherapy or diagnoses suggesting heart failure were excluded. Heart failure outcome event was defined by the assignment of I50 diagnosis code at hospital discharge or in autopsy reports. Statistical analysis: We used multivariate binary logistic regression to calculate odds ratios for heart failure. Besides the baseline characteristics, oncological state and cumulative doses of the chemotherapies were also taken into account. Results: Among the analysed 3288, doxorubicin-treated patients, heart failure cumulative incidence was 6.2%. Doxorubicin cumulative dose over 400 mg/m2 increased the risk. The heart failure incidence was essentially influenced by age, even over 50 years the risk rose. Diabetes mellitus and the treatments with pyrimidine-analogues, carboplatin or bevacizumab were also associated with higher risk. Conclusion: By the integration of national financial and clinical databases, we could identify the risk factors for doxorubicin-associated heart failure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56002b58d7b89df3b4e97bedb79d28bc",
  "timestamp": "2025-05-15T02:40:27.957713"
}