{
  "id": 9418,
  "title": "The Impact of an Incentive on the Use of an Online Self-Directed Wellness and Self-Management Program",
  "abstract": "Background: Those who pay for health care are increasingly looking for strategies to influence individuals to take a more active role in managing their health. Incenting health plan members and/or employees to participate in wellness programs is a widely used approach. Objective: In this study, we examine financial incentives to health plan members to participate in an online self-management/wellness program-US $20 for completing the patient activation measure (PAM) and an additional US $40 for completing 8 learning modules. We examined whether the characteristics of plan members differed by the degree to which they responded to the incentives. Further, we examined whether participation in the wellness program was associated with improvements in PAM scores and changes in health care utilization. Methods: This retrospective study compared demographic characteristics and change in PAM scores and health utilization for 144,625 health plan members in 2011. Four groups were compared: (1) those who were offered the incentives but chose not to participate (n=128,634), (2) those who received the initial incentive (PAM only) but did not complete 8 topics (n=7099), (3) those who received both incentives (completing 8 topics but no more) (n=2693), and (4) those who received both incentives and continued using the online program beyond what was required by the incentives (n=6249). Results: The vast majority of health plan members did not participate in the program (88.91%, 128,634/144,675). Of those who participated, only 7099 of 16,041 (44.25%) completed the PAM for the first incentive, 2693 (16.79%) completed 8 topics for the second incentive, and 6249 (38.96%) received both incentives and continued using the program beyond the incentive requirements. Nonparticipants were more likely to be men and to have lower health risk scores on average than the other three groups of participants (P<.001). In multivariate regression models, those who used the online program (8 topics or beyond) increased their PAM score by approximately 1 point more than those who only took the PAM and did not use the wellness program (P<.03). In addition, emergency department visits were lower for all groups who responded to any level of the incentive as compared to those who did not (P<.01). No differences were found in other types of utilization. Conclusions: The incentive was not sufficient to spark most health plan members to use the wellness program. However, the fact that many program participants went beyond the incentive in their use of the online wellness program suggests that the users of the online program found value in using it, and it was their own internal motivation that stimulated this additional use. Providing an incentive for program participation may be an effective pathway for working with less activated patients, particularly if the program is tailored to the needs of the less activated.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5608f04ef403b4ff58c88659148434cf",
  "timestamp": "2025-05-15T03:28:46.226618"
}