{
  "id": 8760,
  "title": "Multiscale characteristics of the emerging global cryptocurrency market",
  "abstract": "Modern financial markets are characterized by a rapid flow of information, a vast number of participants having diversified investment horizons, and multiple feedback mechanisms, which collectively lead to the emergence of complex phenomena, for example speculative bubbles or crashes. As such, they are considered as one of the most complex systems known. Numerous studies have illuminated stylized facts, also called complexity characteristics, which are observed across the vast majority of financial markets. These include the so-called fat tailsof the returns distribution, volatility clustering, the long memory, strong stochasticity alongside non-linear correlations, persistence, and the effects resembling fractality and even multifractality. The striking development of the cryptocurrency market over the last few years-from being entirely peripheral to capitalizing at the level of an intermediate-size stock exchange-provides a unique opportunity to observe its evolution in a short period. The availability of high-frequency data allows conducting advanced statistical analysis of fluctuations on cryptocurrency exchanges right from their birth up to the present day. This opens a window that allows quantifying the evolutionary changes in the complexity characteristics which accompany market emergence and maturation. The purpose of the present review, then, is to examine the properties of the cryptocurrency market and the associated phenomena. The aim is to clarify to what extent, after such an impetuous development, the characteristics of the complexity of exchange rates on the cryptocurrency market have become similar to traditional and mature markets, such as stocks, bonds, commodities or currencies. The review introduces the history of cryptocurrencies, offering a description of the blockchain technology behind them. Differences between cryptocurrencies and the exchanges on which they are traded have been consistently shown. The central part of the review surveys the analysis of cryptocurrency price changes on various platforms. The statistical properties of the fluctuations in the cryptocurrency market have been compared to the traditional markets. With the help of the latest statistical physics meth-ods, namely, the multifractal cross-correlation analysis and the q-dependent detrended cross-correlation coefficient, the non-linear correlations and multiscale characteristics of the cryptocurrency market are analyzed. In the last part of this paper, through applying matrix and network formalisms, the co-evolution of the correlation structure among the 100 cryptocurrencies having the largest capitalization is retraced. The detailed topology of cryptocurrency network on the Binance platform from bitcoin perspective is also considered. Finally, an interesting observation on the Covid-19 pandemic impact on the cryptocurrency market is presented and discussed: recently we have witnessed a phase transitionof the cryptocurrencies from being a hedge opportunity for the investors fleeing the traditional markets to become a part of the global market that is substantially coupled to the traditional financial instruments like the currencies, stocks, and commodities. The main contribution is an extensive demonstration that, fueled by the increased transaction frequency, turnover, and the number of participants, structural self -organization in the cryptocurrency markets has caused the same to attain complexity characteristics that are nearly indistinguishable from the Forex market at the level of individual time-series. However, the cross-correlations between the exchange rates on cryptocurrency platforms differ from it. The cryptocurrency market is less synchronized and the information flows more slowly, which results in more frequent arbitrage opportunities. The methodology used in the review allows the latter to be detected, and lead-lag relationships to be discovered. Hypothetically, the methods for describing correlations and hierarchical relationships between exchange rates presented in this review could be used to construct investment portfolios and reduce exposure to risk. A new investment asset class appears to be dawning, wherein the bitcoin assumes the role of the natural base currency to trade.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "560d3d253171303e86b2cd19bcab7246",
  "timestamp": "2025-05-15T03:21:56.759773"
}