{
  "id": 8079,
  "title": "A model for predicting chronic TMD: Practical application in clinical settings",
  "abstract": "Background. Substantial cost is associated with the treatment of chronic temporomandibular disorders, or TMDs, and patients with TMDs often experience significant psychosocial distress. Early intervention based on identified risk factors has potential financial and functional benefits. Methods. Two hundred four patients with acute TMD were evaluated via an assessment battery that included physical, psychological and social measures. All participants were diagnosed as having TMD on the basis of the research diagnostic criteria for TMD, Axis I. At the six-month follow-up assessment, patients were considered to have chronic TMD if they continued to have TMD pain. This resulted in 144 of the patients being classified in the chronic group and 60 being classified in the nonchronic group. Results. A comparison of the acute TMD data demonstrated that the group that went on to develop chronic TMD and the group that did not differed significantly in their scores on numerous biopsychosocial indexes. Although several biopsychosocial measures were found to differentiate these two groups before the onset of chronic TMD, logistic regression analysis demonstrated that a two-variable predictive model consisting of the presence of a muscle disorder and characteristic pain intensity (that is, the mean of these three ratings: patient's report of current pain, worst pain in the last three months and mean pain in the last three months) accurately classified 91 percent of the subjects who went on to develop chronic TMD. Conclusions. During the acute phase of TMD, two variables allowed for an accurate prediction rate of 91 percent among patients who went on to develop chronic TMD. Clinical Implications. This model provides clinicians with the opportunity to identify at-risk patients early and initiate adjunctive or alternative treatments, thus reducing the likelihood of the development of TMD chronicity.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "560e11a729bfd5c684ed0b3e8de79b00",
  "timestamp": "2025-05-15T03:15:09.330154"
}