{
  "id": 7931,
  "title": "The care of patients with tuberculosis in Chad: a multicenter analysis in N'djamena and Moundou (2009)",
  "abstract": "TB is a major public health concern throughout the world. In the developing world, informal care is one of the factors that contribute to the spread of the epidemic through delayed treatment initiation. The objective of this study was to examine the care-seeking behavior of TB patients from the onset of symptoms to the start of treatment and to assess the risk factors associated with the informal treatment of symptoms of tuberculosis in N'djamena and Moundou (Chad). A questionnaire survey was conducted among 286 newly diagnosed pulmonary tuberculosis patients (>= 15 years old). A logistic regression model was used to assess the factors associated with informal care use. The study found that 40% of the patients had used informal care before undergoing treatment. Informal care use was found to be associated with the treatment site, belonging to a lower social class, the belief in the effectiveness of traditional treatment methods, a chronic disease and the belief that other people hide their disease. Although the diagnosis and treatment of tuberculosis are both free in Chad, delayed treatment initiation is common among many patients, who often resort to informal care. Health education, interventions aimed at reducing the financial impact of the disease and the active involvement of traditional healers in the detection of tuberculosis can contribute to promoting early access to public health services for the treatment of TB symptoms.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5613eb3ea7014ba735c3063ff47d8346",
  "timestamp": "2025-05-15T03:13:30.665133"
}