{
  "id": 553,
  "title": "PsyCredit: An interpretable deep learning-based credit assessment approach facilitated by psychometric natural language processing",
  "abstract": "With the prosperity of the social web, individuals' social media information alleviates the information asymmetry between individuals and online financial institutions, e.g., online lending and has been applied to predict their credit scores. Most existing studies use semantic or sentiment-related information excavated from their textual postings to construct credit evaluation models. However, despite the essential role of borrowers' personalities on their financial decisions, psychological factors, which can also be mined from their personally written text, receive less attention in current literature. It is challenging to apply extant psychometric approaches for online credit assessment tasks. Specifically, under the chaotic social media environment, social media postings published by the borrowers may not be composed by themselves, and therefore their real psychological statuses are difficult to be uncovered through existing approaches. To solve this problem, guided by the design science methodology and grounded on the Systemic Functional Linguistic Theory, we propose a novel IT artifact, named as PsyCredit, which is a deep learning-based online risk assessment framework driven by a novel psychometric approach. Unlike traditional deep learning approaches, which is a black box, results given by PsyCredit are interpretable by leveraging the Layer-wise Relevance Propagation technique, for the sake of high usability. Based on a dataset from a real-world P2P lending company, our experiments verify that, by leveraging the proposed psychometric approach, the credit risk assessment performance gets promotion successfully.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "561f1a622cb01e897572c8c0150a2d6c",
  "timestamp": "2025-05-15T01:39:38.317462"
}