{
  "id": 4305,
  "title": "Spatial epidemiology of cystic echinococcosis in livestock from a hyper-endemic region in southern Chile",
  "abstract": "Cystic echinococcosis (CE) is a parasitic zoonosis, caused by the larval stage of Echinococcus granulosus. This disease has a worldwide distribution and is considered an important zoonosis in Chile, especially in regions where raising livestock dominates. We aimed to describe the spatial distribution and risk factors for CE in cattle and sheep slaughtered in the Aysen Region, Chile between 2015 and 2016, to inform disease control in this hyper-endemic region. Clustering and hotspot analyses of CE at the farm-level were performed (Moran's global index, local indicator of spatial autocorrelation (LISA), and the scan statistic Poisson model), and we used spatial interpolation to display areas with a higher risk of CE. Mixed effects logistic regression models were fit to assess the association between municipality of origin and age of animals and CE detected at slaughter, with the farm of origin included as a random effect. Overall, data from 1532 cattle farms (1078 geocoded) and 30,805 cattle were analyzed, with a 64 % and 39 % CE prevalence at the farm and animal-level, respectively. For sheep farms, data from 381 (296 geocoded) farms and 58,223 sheep were analyzed, with a 71 % and 18 % CE prevalence at the farm and animal-level, respectively. Globally, the CE prevalence in both cattle and sheep farms was not clustered. However, we found 14 cattle and 23 sheep farms with high prevalence that were locally clustered. We also detected 6 and 11 clusters in cattle and sheep farms, respectively. Risk of reported CE varied according to municipalities of origin, and the age of animals. This study confirms that the Aysen region is a hyper-endemic region for CE. It demonstrates the usefulness of the traceability of animals slaughtered for understanding the epidemiology of CE. The results suggest that in this hyper-endemic region in which there are limited financial resources available, that intervention activities - at the beginning of a control program - should be focused on farms with high prevalence and identified disease clusters.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56229eed299cf894fdaa61de37866edc",
  "timestamp": "2025-05-15T02:35:26.354999"
}