{
  "id": 8672,
  "title": "Robotic mitral valve operations by experienced surgeons are cost-neutral and durable at 1 year",
  "abstract": "Background: Robotic mitral valve surgery has potential advantages in patient satisfaction and 30-day outcome. Cost concerns and repair durability limit wider adoption of robotic technology. This study examined detailed cost differences between robotic and sternotomy techniques in relation to outcomes and durability following robotic mitral program initiation. Methods: Between April 2013 and October 2015, 30-day and 1-year outcomes of 328 consecutive patients undergoing robotic or sternotomy mitral valve repair or replacement by experienced surgeons were examined. Multivariable logistic regression informed propensity matching to derive a cohort of 182 patients. Echocardiographic follow-up was completed at 1 year in all robotic patients. Detailed activity-based cost accounting was applied to include direct, semidirect, and indirect costs with special respect to robotic depreciation, maintenance, and supplies. A quantitative analysis of all hospital costs was applied directly to each patient encounter for comparative financial analyses. Results: Mean predicted risk of mortality was similar in both the robotic (n = 91) and sternotomy (n = 91) groups (0.9% vs 0.8%; P > .431). The total costs of robotic mitral operations were similar to those of sternotomy ($27,662 vs $28,241; P = .273). Early direct costs were higher in the robotic group. There was a marked increase in late indirect cost with the sternotomy cohort related to increased length of stay, transfusion requirements, and readmission rates. Robotic repair technique was associated with no echocardiographic recurrence greater than trace to only mild regurgitation at 1 year. Conclusions: Experienced mitral surgeons can initiate a robotic program in a cost-neutral manner that maintains clinical outcome integrity as well as repair durability.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5625f6f1abada49e40bfab37743dcac1",
  "timestamp": "2025-05-15T03:21:24.635500"
}