{
  "id": 6675,
  "title": "Social skills and their relationship to drug use among 15-16-year-old students in Estonia: An analysis based on the ESPAD data",
  "abstract": "AIM - to investigate the relationship between levels of social skills and drug use among 15-16-year-old students in Estonia. METHODS - A total of 2,460 Estonian schoolchildren, born in 1995, participated in the ESPAD study in 2011. Individual social skills levels were measured with questions on prosocial and antisocial behaviours assessing how children perform within their social milieu. The relationship between social skills levels and drug use was estimated using chi-squared tests and logistic regression analysis. Odds ratios (OR) were adjusted for gender, parents' education and financial well-being, and 95% confidence intervals (CI) were used to estimate risks of drug use by social skills level. RESULTS - Students with lower social skills were at greater risk of starting smoking and smoking daily (50% risk increase). Students with low social skills had a higher risk of lifetime use of cannabis (OR = 1.4; 95% CI 1.1-1.9), sedatives/tranquillisers without a prescription (OR = 2.3; 1.4-3.9), and inhalants (OR = 1.9; 1.2-3.0). The number of students with lower social skills was significantly higher among boys than girls: 35% vs 19%. CONCLUSIONS - Students' social skill levels were related to their licit and illicit drug use. A low level of social skills can increase adolescents' vulnerability to drug use. As boys' social skills levels appeared much lower and their drug use higher than that of girls, we suggest that gender-related risk prevention programmes of social skills training could be beneficial in preventing drug use.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "563450555c5bcbbbbdc0afc9056090f3",
  "timestamp": "2025-05-15T03:00:35.350431"
}