{
  "id": 7905,
  "title": "Drivers of technical efficiency in Malaysian banking: a new empirical insight",
  "abstract": "Restructuring and rationalisation of Malaysian banking in 2000 and the subsequent policy of deregulation and liberalisation adopted by Bank Negara Malaysia (BNM) have resulted in a significant transformation of Malaysian banking. Banks are now poised to play a pivotal role in the economic transformation of the economy as envisaged in the Financial Sector Blue Print 2011-20 of BNM. Using the data envelopment analysis technique, the technical efficiency of 19 commercial banks (8 domestic banks and 11 foreign banks) operating in Malaysia during 2005-12 is evaluated. Then, using bootstrap-corrected efficiency scores, the drivers of bank efficiency were estimated using the Tobit regression approach. Results clearly show that three large domestic banks are not only more efficient than their counterparts, but are also more efficient than the foreign banks. Bank size and return on assets are found to be the significant drivers of technical efficiency of Malaysian banks. Capital adequacy and the advances to deposit ratio also have a role in driving technical efficiency. The results also indicate that banks that are more effective in managing credit risk, as reflected in a lower level of non-performing assets as a percentage of total assets, and have lower levels of personnel expenses to total assets, are more efficient. The findings have significant implications at the individual bank level and also at the policy level.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56478551ce11e1aac1ac24145a446f4c",
  "timestamp": "2025-05-15T03:13:04.983728"
}