{
  "id": 6305,
  "title": "Ecological footprint, tourism development, and country risk: International evidence",
  "abstract": "This research empirically explores the economic-, tourism-, and country risk ratings-induced Environmental Kuznets Curve (EKC) hypothesis by employing ecological footprints (EFs) as indicators of international environmental degradation. To account for distributional heterogeneities across countries as well as possible asymmetric relationships among variables, we apply a quantile regression approach by using panel data from 123 countries spanning 1992-2016. Our findings partially support that income, tourism, and country risk EKCs (i.e., inverted U-shape relation) exist in grazing land and forest land, signifying that these 2 types of land are sacrificed (increased) and then shift toward enhancing more environmental protection lifestyles as GDP, tourism revenues, and country risk ratings further rise. Conversely, U-shape relations generally exist in carbon-absorption land, cropland, and fishing ground, implying that growths of tourism, GDP, and country risk ratings have shifted from enhancing more environmentally protective policies to encouraging EF-consuming lifestyles for these EF components. In addition, we uncover that income development is largely responsible for increases in EF, while tourism generally and salient decreases forest land and grazing land. We also confirm the income EKC hypothesis in European countries. Tourism increases (reduces) fishing ground at lower (higher) fishing quantiles, suggesting the asymmetric impacts of tourism across different quantiles. The political risk rating shows a mostly positive impact on EF than those of economic and financial risk ratings, denoting the important impact of a country's political rating on environment degradation. Overall, the findings herein advocate the need for analysis that considers heterogeneities across countries, different EF quantiles, and different EF components in the tourism-, economic-, and country risk-induced EKC estimations. (c) 2020 Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56498188fd29202974c1b4594db7ccb1",
  "timestamp": "2025-05-15T02:56:37.519184"
}