{
  "id": 8562,
  "title": "A Review of Cost-Effectiveness of Preimplantation Genetic Testing for Aneuploidy",
  "abstract": "ImportancePreimplantation genetic testing for aneuploidy (PGT-A) is an important focus area of reproductive medicine because of its potential to improve the odds of a live birth from in vitro fertilization (IVF) treatment.ObjectiveDespite growing interest and use of this technology, there has been a limited, albeit growing, body of literature that has evaluated the cost-effectiveness of PGT-A for patients compared with IVF without PGT-A. This review aims to further explore this relationship and summarize current findings.Evidence AcquisitionStudies were selected entering terms such as PGT-A, IVF, and cost-effectiveness in the PubMed database.ResultsIn some studies, PGT-A has been shown to be cost-effective in older patients and patients who have experienced recurrent pregnancy loss. In other studies, PGT-A use has shown comparable live birth rates to traditional IVF while carrying a more expensive price tag. In addition, PGT-A carries risk, including embryo damage and improper embryo classification, and has significant financial cost. Specifically with regards to cost-effectiveness, considerations such as age, reproductive timeline, and economic burden have been identified.ConclusionsUltimately, there is incomplete data addressing factors such as mosaicism, patient perspectives of the economic cost, and patient experiences surrounding PGT-A. Further studies are needed to fully evaluate PGT-A outcomes, patient experiences, and cost-effectiveness.RelevanceAs utilization of assisted reproductive technology continues to increase, a careful analysis of the cost-effectiveness of additional genetic screening tests is critical to patient counseling and shared decision making.Target AudienceObstetricians and gynecologists, family physiciansLearning ObjectivesAfter completing this activity, the reader will be better able to describe how preimplantation genetic testing for aneuploidy works; discuss the existing literature surrounding PGT-A use and its cost-effectiveness; and identify patient populations for which PGT-A might be beneficial.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5661b4c7aaf5ced338ca12ee9129a895",
  "timestamp": "2025-05-15T03:19:52.269922"
}