{
  "id": 7254,
  "title": "Nomogram for predicting prolonged postoperative ileus after laparoscopic low anterior resection for rectal cancer",
  "abstract": "BackgroundProlonged postoperative ileus (PPOI) is a common complication after colorectal surgery that increases patient discomfort, hospital stay, and financial burden. However, predictive tools to assess the risk of PPOI in patients undergoing laparoscopic low anterior resection have not been developed. Thus, the purpose of this study was to develop a nomogram to predict PPOI after laparoscopic low anterior resection for rectal cancer.MethodsA total of 548 consecutive patients who underwent laparoscopic low anterior resection for mid-low rectal cancer at a single tertiary medical center were retrospectively enrolled between January 2019 and January 2023. Univariate and multivariate logistic regression analysis was performed to analyze potential predictors of PPOI. The nomogram was constructed using the filtered variables and internally verified by bootstrap resampling. Model performance was evaluated by receiver operating characteristic curve and calibration curve, and the clinical usefulness was evaluated by the decision curve.ResultsAmong 548 consecutive patients, 72 patients (13.1%) presented with PPOI. Multivariate logistic analysis showed that advantage age, hypoalbuminemia, high surgical difficulty, and postoperative use of opioid analgesic were independent prognostic factors for PPOI. These variables were used to construct the nomogram model to predict PPOI. Internal validation, conducted through bootstrap resampling, confirmed the great discrimination of the nomogram with an area under the curve of 0.738 (95%CI 0.736-0.741).ConclusionsWe created a novel nomogram for predicting PPOI after laparoscopic low anterior resection. This nomogram can assist surgeons in identifying patients at a heightened risk of PPOI.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "568d8e7f49def26a111b0c01749a6798",
  "timestamp": "2025-05-15T03:06:35.439496"
}