{
  "id": 9442,
  "title": "Evaluating the risk of Chinese housing markets: What we know and what we need to know",
  "abstract": "Real estate is an important driver of the Chinese economy, which itself is vital for global growth. However, data limitations make it challenging to evaluate competing claims about the state of Chinese housing markets. This paper brings new data and analysis to the study of supply and demand conditions in nearly three dozen major cities. We first document the most accurate measures of land values, construction costs, and overall house prices. We then create and investigate a number of supply and demand metrics to see if price growth reasonably can be interpreted as reflecting local market fundamentals. Key results include the following: (1) Real house price growth has been high, averaging 10% per annum since 2006. However, there is substantial heterogeneity across markets, ranging from 2.8% (Jinan) to 19.8% (Beijing). House price growth is driven by rising land values, not by construction costs. Real land values have risen by 14.4% per annum on average. In Beijing, the increase has been by a remarkable 27.5% per year (or by 1036%) since 2004. (2) There is variation about the strong positive trend in house price and land value growth. Land values fell by nearly one-third at the beginning of the global financial crisis, but more than fully recovered amidst the 2009-2010 Chinese stimulus. More recent growth has been much more modest, with some markets beginning to decline. Quantities of land sales by local governments to private residential developers have dropped sharply since 2013. The most recent data show transactions volumes down by half or more. This should lead to a reduced supply of new housing units in coming years. (3) Market-level analysis of short- and longer-run changes in supply demand balances finds important variation across markets. In the major East region markets of Beijing, Hangzhou, Shanghai and Shenzhen which have experienced very high rates of real price growth, we estimate that the growth in households demanding housing units has outpaced new construction since the turn of the century. However, there are thirteen large markets, primarily in the interior of the country, in which new housing production has outpaced household growth by at least 30% and another eleven in which it did so by at least 10%. Regression results show that a one standard deviation increase in local market housing inventory is associated with a 0.45 standard deviation lower rate of real house price growth the following year. (4) There are no official data on residential vacancy rates in China, but some researchers have reported very high figures (17%+). We develop a new series at the provincial level which yields a much lower vacancy rate on average, but it has been rising from 5.2% in 2009 to 7.8% in 2014. (5) The risk of housing even in markets such as Beijing which show no evidence of oversupply, is best evidenced by price-to-rent ratios. They are well above 50 in the capital city. Poterba's (1984) user cost model suggests these levels can be justified only if owners have sufficiently high expectations of future capital gains. Even a modest one percentage point drop in expected appreciation (or increase in interest rates) would result in a drop in prices of about one-third, absent an offsetting increase in rents. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56b98d341ef94b79994fa25273fd30ec",
  "timestamp": "2025-05-15T03:28:46.325784"
}