{
  "id": 8737,
  "title": "A prospective study of effects of psychological factors and sleep on obstetric interventions, mode of birth, and neonatal outcomes among low-risk British Columbian women",
  "abstract": "Background: Obstetrical interventions, including caesarean sections, are increasing in Canada. Canadian women's psychological states, fatigue, and sleep have not been examined prospectively for contributions to obstetric interventions and adverse neonatal outcomes. Context and purpose of the study: The prospective study was conducted in British Columbia (BC), Canada with 650 low-risk pregnant women. Of those women, 624 were included in this study. Women were recruited through providers' offices, media, posters, and pregnancy fairs. We examined associations between pregnant women's fatigue, sleep deprivation, and psychological states (anxiety and childbirth fear) and women's exposure to obstetrical interventions and adverse neonatal outcomes (preterm, admission to NICU, low APGARS, and low birth weight). Methods: Data from our cross-sectional survey were linked, using women's personal health numbers, to birth outcomes from the Perinatal Services BC database. After stratifying for parity, we used Pearson's Chi-square to examine associations between psychological states, fatigue, sleep deprivation and maternal characteristics. We used hierarchical logistic regression modeling to test 9 hypotheses comparing women with high and low childbirth fear and anxiety on likelihood of having epidural anaesthetic, a caesarean section (stratified for parity), assisted vaginal delivery, and adverse neonatal outcomes and women with and without sleep deprivation and high levels of fatigue on likelihood of giving birth by caesarean section, while controlling for maternal, obstetrical (e.g., infant macrosomia), and psychological variables. Results: Significantly higher proportions of multiparas, reporting difficult and upsetting labours and births, expectations of childbirth interventions, and health stressors, reported high levels of childbirth fear. Women who reported antenatal relationship, housing, financial, and health stressors and multiparas reporting low family incomes were significantly more likely to report high anxiety levels. The hypothesis that high childbirth fear significantly increased the risk of using epidural anaesthesia was supported. Conclusions: Controlling for some psychological states and sleep quality while examining other contributors to outcomes decreases the likelihood of linking childbirth fear anxiety, sleep deprivation, and fatigue to increased odds of caesarean section. Ameliorating women's childbirth fear to reduce their exposure to epidural anaesthesia can occur through developing effective interventions. These include helping multiparous women process previous experiences of difficult and upsetting labour and birth.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56c931a1b17821f51969ea93d1497150",
  "timestamp": "2025-05-15T03:21:56.619507"
}