{
  "id": 4729,
  "title": "Injured and broke: The impacts of the Ghana National Health Insurance Scheme (NHIS) on service delivery and catastrophic health expenditure among seriously injured children",
  "abstract": "Introduction: Ghana implemented a National Health Insurance Scheme (NHIS) in 2003 as a step toward universal health coverage. We aimed to determine the effect of the NHIS on timeliness of care, mortality, and catastrophic health expenditure (CHE) among children with serious injuries at a trauma center in Ghana. Methods: We performed a retrospective cohort study of injured children aged <18 years who required surgery (i. e., proxy for serious injury) at Komfo Anokye Teaching Hospital from 2015 to 2016. Household income data was obtained from the Ghana Statistical Service. CHE was defined as out-of-pocket payments to annual household income >= 10%. Differences in insured and uninsured children were described. Multivariable regression was used to assess the effect of NHIS on time to surgery, length of stay, in-hospital mortality, out-of-pocket expenditure and CHE. Results: Of the 263 children who met inclusion criteria, 70% were insured. Mechanism of injury, triage scores and Kampala Trauma Score II were similar in both groups (all p > 0.10). Uninsured children were more likely to have a delay in care for financial reasons (17.3 vs 6.4%, p < 0.001) than insured children, and the families of uninsured children paid a median of 1.7 times more out-of-pocket costs than families with insured children (p < 0.001). Eighty-six percent of families of uninsured children experienced CHE compared to 54% of families of insured children (p < 0.001); however, 64% of all families experienced CHE. Insurance was protective against CHE (aOR 0.21, 95%CI 0.08-0.55). Conclusions: NHIS did not improve timeliness of care, length of stay or mortality. Although NHIS did provide some financial risk protection for families, it did not eliminate out-of-pocket payments. The families of most seriously injured children experienced CHE, regardless of insurance status. NHIS and similar financial risk pooling schemes could be strengthened to better provide financial risk protection and promote quality of care for injured children.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56d3bfd4ec57f02f576d73c117953f05",
  "timestamp": "2025-05-15T02:40:27.922129"
}