{
  "id": 1216,
  "title": "Exposure knowledge impact on regional seismic risk assessment of bridge portfolios",
  "abstract": "The lack of structural information on existing bridges is a common problem faced by engineers when performing regional seismic risk assessment of large bridge portfolios. In most regions, the bridge inventory is composed of structures built over decades and detailed structural information of the existing configurations is difficult to obtain and can be expensive to survey. Most of the regional risk studies for bridges are done with incomplete exposure knowledge and usually rely on macro taxonomy-based approaches that average fragility information of assets with similar configurations. This leads to an unknown level of uncertainty in the results that is commonly not quantified or accurately communicated to the stakeholders. Accordingly, there is a need for a better understanding on how much uncertainty can be expected in results using such approaches, as well as for recommendations to those dealing with this type of project to define an appropriate required minimum knowledge of the inventory to obtain reasonable results. In this study, the seismic risk assessment of a portfolio of 617 bridges with complete structural information was performed and its results were used as a benchmark to quantify the expected uncertainty when considering different knowledge levels using a taxonomy-based approach as well as a machine learning model. The obtained results suggest that having detailed information on at least one third of the portfolio leads to a considerable reduction in uncertainty and that machine learning models can outperform traditional taxonomy-based methodologies when a sufficient level of knowledge of the inventory is available.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56d67bd12d5f4379837b589e8d459148",
  "timestamp": "2025-05-15T00:53:09.927607"
}