{
  "id": 313,
  "title": "Financial Risk Management Prediction of Mining and Industrial Projects using Combination of Artificial Intelligence and Simulation Methods",
  "abstract": "Feasibility studies of mining and industrial investment projects are usually associated with uncertain parameters; hence, these investigations rely on prediction. In these particular conditions, simulation and modelling techniques remain the most significant approaches to reduce the decision risk. Since several uncertain parameters are incorporated in the modelling process, distribution functions are employed to explain the parameters. However, due to the usual constrain of limited data, these functions cannot significantly explain the variation of those uncertain parameters. Support vector machine, one of the efficient techniques of artificial intelligence, provides the appropriate results in the classification and regression tasks. The principal aims of this research work are to integrate the simulation and artificial intelligence methods to manage the risk prediction of an economic system under uncertain conditions. The financial process of the Halichal mine in the Mazandaran province, Iran, is considered a case study to prove the performance of the support vector machine technique. The results show that integrating the simulation and support vector machine techniques can provide more realistic results, especially when including uncertain parameters. The correlation between the net present value obtained from the simulation and the net present value is about 0.96, which shows the capability of artificial intelligence methods and the simulation process. The root mean square error of the support vector machine prediction is about 0.322, which indicates a low error rate in the net present value estimation. The values of these errors prove that this method has a high accuracy and performance for predicting a net present value in the Halichal granite mine.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56e46c5ac6eef06659bf1f250ea992c8",
  "timestamp": "2025-05-15T01:49:40.944188"
}