{
  "id": 9162,
  "title": "Relationship between oral health and Fried's frailty criteria in community-dwelling older persons",
  "abstract": "Background: Oral health and frailty might be linked through several pathways, but previous studies are scarce. This study examined the association between oral health and components of Fried's frailty phenotype. Methods: This cross-sectional analysis was based on a sample of 992 community-dwelling persons aged 73 to 77 years observed in the 2011 follow-up of the Lausanne 65+ cohort (Lc65+) study. Data were collected through annual mailed questionnaires, interview and physical examination. Oral health was assessed according to self-reported oral pain and masticatory ability. Frailty was defined as meeting at least one criterion of the Fried's phenotype. Results: Oral pain was reported by 14.8% and chewing problems by 9.7%. Impaired masticatory ability (IMA) was more frequent in subjects with missing teeth or removable dentures (13.5%) than among those with full dentition or fixed dental prostheses (3.2%). In logistic regression analyses adjusting for demographics, alcohol consumption, smoking, comorbidity and financial difficulties, persons with oral pain and those with chewing problems had significantly higher odds of being frail (adjusted ORpain = 1.72; 95% CI 1.17-2.53 and adjOR(IMA)1.70; 1.07-2.72, respectively). Lack of endurance was associated with both oral pain (adjOR = 3.61; 1.92-6.76) and impaired masticatory ability (adjOR = 2.20; 1.03-4.72). The latter was additionally linked to low physical activity (adjOR = 2.35; 1.29-4.28) and low gait speed (adjOR = 3.12; 1.41-6.90), whereas oral pain was associated with weight loss (adjOR = 1.80; 1.09-2.96) and low handgrip strength (adjOR = 1.80; 1.17-2.77). Conclusion: Self-reported oral pain and chewing impairment had a significant relation with frailty and its components, not only through a nutritional pathway of involuntary weight loss. Longitudinal analyses are needed to examine whether a poor oral condition might be a risk factor for the onset of frailty.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56f456070022a214185a295eb3d780c3",
  "timestamp": "2025-05-15T03:25:54.703350"
}