{
  "id": 2929,
  "title": "Understanding gender differences on the choices of a portfolio of climate-smart agricultural practices in sub-saharan Africa",
  "abstract": "Gender-based intra-household differences in resource ownership, management and control are important bar-gaining powers on the division of authority regarding agriculture-related decisions within the household. Yet, not much is known about the gender role played by intra-household resource distribution between spouses on the adoption of a portfolio of Climate-smart Agriculture (CSA) practices. In this study, we use plot-level panel data from four Sub-Saharan African countries, namely Ethiopia, Tanzania, Malawi, and Nigeria. We employ a correlated random effect Tobit regression model to examine how land ownership, plot management and control of outputs by the spouses individually and jointly influenced the rate of adoption of multiple CSA practices. We find that the gender-linked adoption of CSA practices is more likely to be made if plot management rights overlap with land ownership and control of economic rights from the land along gender lines. The result implies that women do have a role in the decision to adopt CSA practices due to their intra-household bargaining power. The findings indicate interesting nuances with respect to gender-differentiated impacts of policies to enhance resource entitlement and decision making thereby increasing adoption of a portfolio of CSA practices.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "56ffda2c41392cfb4b4761eb09ec36d7",
  "timestamp": "2025-05-15T01:11:48.477627"
}