{
  "id": 3523,
  "title": "Financial reporting quality, audit fees and risk committees",
  "abstract": "Purpose The purpose of this paper is to examine the association between the existence of a risk committee (RC) in a firm and financial reporting quality. We also investigate whether having an RC has an effect on audit pricing. We argue that the existence of an RC in a firm contributes to higher financial reporting quality and this, eventually, affects audit pricing. Design/methodology/approach This study uses two different proxies for RC measures and investigates the impact on financial reporting quality and audit pricing. Multivariate regression analysis and propensity score matching techniques are both applied to data from the Australian Stock Exchange's listed companies for the years 2001-2013. Findings The results indicate that the existence of an RC reduces the discretionary accruals; this means the financial reporting quality improves when RCs are in operation. Our findings also indicate that the existence of an RC increases audit fees. Practical implications The findings from this study will be beneficial to the regulatory authorities responsible for improving the compliance of corporate governance (CG). An RC can serve as a risk-mitigating tool in the investment decision-making process. Finally, the results are beneficial for the development of best practices in CG by promoting the existence of an RC. Originality/value This study goes beyond the traditional focus on CG as we use the existence of an RC as an indicator of better governance practices to mitigate financial and non-financial risk factors. To the best of our knowledge, this paper is among the first to investigate the consequences for firms operating with RCs. This issue has implications for investors, auditors, directors and regulators.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "570c3bfa0079174dc05514763af79c69",
  "timestamp": "2025-05-15T02:27:19.081992"
}