{
  "id": 2608,
  "title": "Financial toxicity is more than costs of care: the relationship between employment and financial toxicity in long-term cancer survivors",
  "abstract": "PurposeThe aim of this study was to examine the relationship between employment and financial toxicity by examining the prevalence of, and factors associated with, financial toxicity among cancer survivors.MethodsWe conducted a secondary analysis of a sub-sample from the Dutch Patient Reported Outcomes Following Initial Treatment and Long-term Evaluation of Survivorship (PROFILES) registry. Descriptive statistics, bivariate analysis and logistic regression were used.ResultsA total of 2931 participants with diverse cancer types were included in the analysis with a mean age of 55years (range 18 to 65). Nearly half (49%) of participants were employed at the time of the survey, and 22% reported financial toxicity. Those who were not employed were at greater risk of financial toxicity (27% vs 16%, p<0.001), and this did not vary according to time since diagnosis. The odds of reporting financial toxicity were greater for participants who were male, younger, unmarried, with low education, low socioeconomic status, or without paid employment. Those with basal cell carcinoma had lower risk of financial toxicity, while those with haematological or colorectal cancer had highest risk of financial toxicity.ConclusionsThis research confirms that unemployment is significantly associated with financial toxicity and that those with limited financial resources are most at risk.Implications for cancer survivorsIncreased awareness of financial toxicity and its associated factors among clinicians may result in improved screening and appropriate referrals for support services. The implementation of effective multidisciplinary return to work interventions, as part of standard cancer survivorship care, may reduce financial toxicity among cancer survivors.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5710b3a904934251d918b89b181c4fc1",
  "timestamp": "2025-05-15T02:17:01.809277"
}