{
  "id": 3765,
  "title": "Perceived stress and study-related behavior and experience patterns of medical students: a cross-sectional study",
  "abstract": "Background Distress and burnout are common in physicians. Both may already arise during medical training and persist throughout residency. An analysis of needs is necessary in order to develop target group specific curricular concepts at medical faculties. Aim of this study was to assess the perceived stress of medical students, to explore study-related behavior and experience patterns, and to investigate associated factors. Methods We conducted a cross-sectional survey of medical students at the Hannover Medical School. The web-based questionnaire consisted of 74 items and included two standardized instruments: the Work-related Behavior and Experience Patterns (Arbeitsbezogene Verhaltens- und Erlebensmuster, AVEM) and the Perceived Medical School Stress scale (PMSS). Students were asked to state their self-perceived actual stress level on a scale from 0% (no stress at all) to 100% (maximum stress). We performed a classification and regression tree (CART) analysis to identify factors that can discriminate between the four different AVEM patterns. Results Five hundred ninety-one medical students (female 75.8%, response rate: 34.0%) participated in the survey. The mean sum score of the PMSS was 37.2 (SD 8.3; median score 37, min.-max. = 18-65). Overall, 68.5% of the students showed a risk pattern (risk pattern A overexertion: 38.9%; risk pattern B burnout: 29.6%). Pattern G healthy was shown in 8.3% and pattern S protection in 23.1% of the students. Multilevel analysis revealed that the self-perceived stress level and the PMSS sum score were the most important predictors for the AVEM pattern assignment. Furthermore, academic year, gender, and financial dependency were relevant influencing factors: students in higher academic years with no financial support had a higher probability to be in risk pattern B whereas male students in the first academic year tended to be in pattern G. Conclusions The PMSS sum score could objectify medical students' high self-perceived stress level. The majority of participating students showed a risky study-related behavior and experience pattern. Medical faculties should be aware of the still existing and relevant problem of stress and burnout among medical students. Our results lay the groundwork for an evaluation and further development of medical curricula at the own faculty.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57222851db4118d70d5f764021e20668",
  "timestamp": "2025-05-15T02:29:59.104146"
}