{
  "id": 657,
  "title": "Optimizing Financial Engineering Time Indicator Using Bionics Computation Algorithm and Neural Network Deep Learning",
  "abstract": "The present work aims to optimize the time index of financial engineering to improve the efficiency of financial decision-making. A Back Propagation Neural Network (BPNN) model is designed and optimized by the Ant Colony Algorithm (ACA) based on the bionic algorithm and Deep Learning (DL). After introducing the basic knowledge of neural networks and bionic algorithms, the advantages and disadvantages of the algorithms are integrated for maximal effects. Besides, ACA optimizes the weights and thresholds in the neural network in complex problems to reduce the relative error, enhance the stability and accuracy, and improve the classification speed of the BPNN model. The experimental results indicate that the classification accuracy of the ACA model is 91.3%, and the area under the receiver operating characteristic curve is 0.867. Moreover, the running time of BPNN based on ACA is 2.5 s, the error is 0.2, and the required number of iteration steps is 36 times, better than the test results of similar algorithms. These results demonstrate that the improved BPNN based on ACA has higher classification efficiency, better efficiency and smaller errors than the traditional BPNN. In terms of financial engineering decision-making, the time index of decision-making has been significantly improved, which is conducive to reducing the decision-making risk of financial institutions and has a positive effect on improving the overall operational efficiency of enterprises.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "572711e9f35ebe4688109c9a8731e83c",
  "timestamp": "2025-05-15T01:53:24.979599"
}