{
  "id": 2483,
  "title": "Applied AI for finance and accounting: Alternative data and opportunities",
  "abstract": "Big data and artificial intelligence (AI) have transformed the finance industry by altering the way data and information are generated, processed, and incorporated into decision-making processes. Data and information have emerged as a new class of assets, facilitating efficient contracting and risk-sharing among corporate stakeholders. Researchers have also increasingly embraced machine learning and AI analytics tools, which enable them to exploit empirical evidence to an extent that far surpasses traditional methodologies. In this review article, prepared for a special issue on Artificial Intelligence (AI) and Finance in the Pacific-Basin Finance Journal, we aim to provide a summary of the evolving landscape of AI applications in finance and accounting research and project future avenues of exploration. Given the burgeoning mass of literature in this field, it would be unproductive to attempt an exhaustive catalogue of these studies. Instead, our goal is to offer a structured framework for categorizing current research and guiding future studies. We stress the importance of blending financial domain expertise with state-of-the-art data analytics skills. This fusion is essential for researchers and professionals to harness the opportunities offered by data and analytical tools to better comprehend and influence our financial system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "572b494bcc267b78c68fef3113d32fc3",
  "timestamp": "2025-05-15T02:15:59.843629"
}