{
  "id": 779,
  "title": "Optimal Therapy in Hypertensive Subjects with Diabetes Mellitus",
  "abstract": "Diabetes and its micro- and macrovascular complications represent a worldwide epidemic that will place an enormous financial burden on poorer countries in the years to come. In patients with diabetes and hypertension, the main determinant of the cardiovascular and renal benefits of antihypertensive drugs is the blood pressure (BP) level achieved under treatment. Quite recently, the paradigm of a BP target < 130/80 mm Hg in these patients has been questioned by a number of trials, including data from the Action to Control Cardiovascular Risk in Diabetes (ACCORD) blood pressure-lowering arm and from the diabetic cohort of International Verapamil SR-Trandolapril Study (INVEST). At the same time, even if the key role of BP control is unquestionable, a growing number of published trials suggest that different antihypertensive combinations may offer specific cardio-, vasculo-, and renoprotective advantages that go beyond BP reduction per se. The present review focuses on the most recent and important literature that explored the optimal antihypertensive therapy in patients with type 2 diabetes and concomitant hypertension, and it discusses in detail the various areas of uncertainty, including the specific renoprotective effects of renin-angiotensin system blocking agents and the long-term effects of angiotensin-converting enzyme/angiotensin receptor blocker combinations on the progression of diabetic nephropathy.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "572b86d355f1c3504740343cf9c5beb0",
  "timestamp": "2025-05-15T01:42:44.414905"
}