{
  "id": 7877,
  "title": "Association between perceived decline in family income due to COVID-19 and alcohol consumption among Korean adolescents",
  "abstract": "Background: This study examines the relationship between the perceived decline in family income due to COVID-19 and alcohol consumption among Korean adolescents. Methods: Korea Youth Risk Behavior Web-Based Survey 2020 data were used. The study included 42,922 participants (20,672 males; 22,250 females). Multiple logistic regression estimated the relationship between the decline in family income due to COVID-19 and drinking (yes or no) and alcohol-induced blackout (yes or no) status among Korean adolescents. Results: Adolescent males who perceived worsened family income due to COVID-19 had a higher OR for drinking status and alcohol-induced blackout within 30 days (drinking status: OR 1.27, CI 1.15-1.42, alcohol-induced blackout: OR 1.60, CI 1.19-2.15). Females had a higher OR for current drinking (OR 1.22, CI 1.09-1.38). 7th grade females and 10th grade males were more likely to drink alcohol when their household income decline, compared to high school students (10th grade male: OR 1.54 CI 1.18-2.00; 7th grade female: OR 1.57 CI 1.08-2.27). The male group perceiving family financial loss were likely to have an increased frequency of drinking within 30 days (1-9 days: OR 1.26 CI 1.11-1.42, 10-19 days; OR 1.70 CI 1.22-2.36 over 20 days; OR 1.74 CI 1.15-3.09). Limitations: Cross-sectional design and self-reported data are the main limitation of our study. And the cut-off points for drinking status and heavy drinking factors may be difficult to generalize our findings to different population. Conclusions: A significantly positive association of perceived decline in family income due to COVID-19 with increased risks of alcohol consumption was observed among Korean adolescents of both sexes. 7th grade females and 10th grade males were more likely to drink alcohol when their household income changed, compared to high school students. Further, adolescents who perceived family financial loss had an increased frequency of drinking.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "572e5a0330a315b1e389123f4be8f9db",
  "timestamp": "2025-05-15T03:13:04.896154"
}