{
  "id": 7549,
  "title": "Access, literacy and behavioural correlates of poor self-rated oral health amongst an Indigenous South Australian population",
  "abstract": "Objective: To better understand the determinants of self-rated oral health within an Indigenous population by: 1, examining potential individual-level correlates of socio-demographic, health behaviours, dental care access and oral health literacy-related outcomes with self-rated oral health; and, 2, examining the relative contribution of these domains to self-rated oral health in multivariable modelling. Methods: We conducted nested logistic regression analyses on self-reported status of 'fair or poor' versus 'better' oral health using data from a convenience sample of rural dwelling Indigenous Australians (n=468). Data were collected on background characteristics, health behaviours, access to dental care, oral health literacy-related outcome variables and REALD 30, an oral health literacy scale. Results: Overall 37.0 % of the Indigenous adult population reported fair or poor oral health. In multivariable modelling, risk indicators for fair or poor self-rated oral health that persisted after adjusting for other covariates included being aged 38+ years (OR 2.9, 95%CI 1.9,4.6), holding a Government Health Concession card (OR 2.3, 95%CI 1.1,4.5), avoiding the dentist due to financial constraints (OR 2.3, 95%CI 1.4,3.6), not knowing how to make an emergency dental visit (OR 1.7, 95%CI 1.1,2.7) and poor understanding of the prevention of dental disease (OR 1.7, 95%CI 1.1,2.7). Conclusions: In this vulnerable population, risk indicators contributing to poor self-rated oral health included socio-demographic, dental care access and oral health literacy-related factors. Health behaviours were not significant.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5737b07badcae746fa13f5cef1200a83",
  "timestamp": "2025-05-15T03:09:36.947327"
}