{
  "id": 8044,
  "title": "Complement Component C3 and Risk of Age-Related Macular Degeneration",
  "abstract": "Objective: To explore the association between polymorphisms in the complement component 3 (C3) gene and age-related macular degeneration (AMD), and to investigate the modifying effect of complement factor H (CFH) Y402H, LOC387715 A69S and smoking. Design: Pooled data from the prospective, population-based Rotterdam Study (enrolment between 1990 and 1993, and 3 follow-up examinations between September 1, 1993, and December 31, 2004) and an independent case-control study from the Netherlands. Participants: The Rotterdam Study comprised a total of 6418 persons aged >= 55 years who had gradable fundus photographs. The case-control study consisted of 357 unrelated AMD patients and 173 control individuals aged >= 55 years. Methods: The variants R102G and P314L of the C3 gene, CFH Y402H and LOC387715 A69S, were genotyped in all study participants. Information on cigarette smoking was obtained by interview at baseline. Main Outcome Measures: Early and late stages of prevalent and incident AMD, graded according to the international classification and grading system for AMD. Results: We found a population frequency of 0.217 for R102G and 0.211 for P314L in the Rotterdam Study. Both alleles significantly increased the risk of early AMD and all subtypes of late AMD, and this risk seemed to be independent of CFH Y402H, LOC387715 A69S, and smoking. Detailed analysis showed that the haplotype carrying both alleles had the highest frequency difference between cases and controls (P = 0.006). We estimated a total population-attributable risk of 14.6%. A meta-analysis of all currently available data yielded a pooled odds ratio (OR) of 1.61 (95% confidence interval [CI], 1.46-1.78) for the R102G allele, and an OR of 1.50 (95% Cl, 1.31-1.71) for the P314L allele. Conclusions: Our study showed a significant association between variants in the C3 gene and AMD and further highlights the crucial role of the complement pathway in the etiology of AMD. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:474-480 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "573810b070a6f295548d0dcc1e013832",
  "timestamp": "2025-05-15T03:14:37.362173"
}