{
  "id": 6739,
  "title": "Risk-based internal audit: factors related to its implementation",
  "abstract": "Purpose This study aims to investigate the factors associated with the implementation of risk-based internal audit (RBIA). Design/methodology/approach As a first step, a literature review of the relevant literature is performed and five potential factors related to the implementation of RBIA are identified. Based on that, this paper constructs a questionnaire survey sent out to 185 internal auditors, executives and accountants in Greece to receive 90 responses during the period of November 2019-January 2020. Multiple regression analysis is conducted to identify the factors related to the implementation of RBIA. Findings This paper shows that there is a statistically significant positive relationship between the implementation of RBIA and: the provision of risk management training, an active audit committee role and the establishment of a formalized risk management system. Practical implications The results have important implications for internal auditors, chief executive officers and accountants who wish to enhance internal audit effectiveness and the accuracy and quality of financial information. Originality/value Empirical studies on the factors related to the implementation of RBIA are rare. This is the first study to create empirical variables based on a thorough review of the relevant literature to empirically investigate the factors that are related to the implementation of RBIA in an emerging economy. By focusing on the Greek context, this study also sheds light to other countries with similar corporate governance systems, thus providing insights to settings where the Type II agency problem exists (La Porta et al., 1999).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "573c280c885762e2dcc4b0d759741e19",
  "timestamp": "2025-05-15T03:01:03.617700"
}