{
  "id": 943,
  "title": "DeepPricing: pricing convertible bonds based on financial time-series generative adversarial networks",
  "abstract": "Convertible bonds are an important segment of the corporate bond market, however, as hybrid instruments, convertible bonds are difficult to value because they depend on variables related to the underlying stock, the fixed-income part, and the interaction between these components. Besides, embedded options, such as conversion, call, and put provisions are often restricted to certain periods, may vary over time, and are subject to additional path-dependent features of the state variables. Moreover, the most challenging problem in convertible bond valuation is the underlying stock return process modeling as it retains various complex statistical properties. In this paper, we propose DeepPricing, a novel data-driven convertible bonds pricing model, which is inspired by the recent success of generative adversarial networks (GAN), to address the above challenges. The method introduces a new financial time-series generative adversarial networks (FinGAN), which is able to reproduce risk-neutral stock return process that retains the unique statistical properties such as the fat-tailed distributions, the long-range dependence, and the asymmetry structure etc., and then transit to its risk-neutral distribution. Thus it is more flexible and accurate to capture the dynamics of the underlying stock return process and keep the rich set of real-world convertible bond specifications compared with previous model-driven models. The experiments on the Chinese convertible bond market demonstrate the effectiveness of DeepPricing model. Compared with the convertible bond market prices, our model has a better convertible bonds pricing performance than both model-driven models, i.e. Black-Scholes, the constant elasticity of variance, GARCH, and the state-of-the-art GAN-based models, i.e. FinGAN-MLP, FinGAN-LSTM. Moreover, our model has a better fitting capacity for higher-volatility convertible bonds and the overall convertible bond market implied volatility smirk, especially for equity-liked convertible bonds, convertible bonds trading in the bull market, and out-of-the-money convertible bonds. Furthermore, the Long-Short and Long-Only investment strategies based on our model earn a significant annualized return with 41.16% and 31.06%, respectively, for the equally-weighted portfolio during the sample period.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5744fcdecbe5ac316d9762415e0cd357",
  "timestamp": "2025-05-15T01:44:35.495094"
}