{
  "id": 5487,
  "title": "Trends in, and projections of, indicators of universal health coverage in Bangladesh, 1995-2030: a Bayesian analysis of population-based household data",
  "abstract": "Background Many countries are implementing health system reforms to achieve universal health coverage (UHC) by 2030. To understand the progress towards UHC in Bangladesh, we estimated trends in indicators of the health service and of financial risk protection. We also estimated the probability of Bangladesh's achieving of UHC targets of 80% essential health-service coverage and 100% financial risk protection by 2030. Methods We estimated the coverage of UHC indicators-13 prevention indicators and four treatment indicators-from 19 nationally representative population-based household surveys done in Bangladesh from Jan 1, 1991, to Dec 31, 2014. We used a Bayesian regression model to estimate the trend and to predict the coverage of UHC indicators along with the probabilities of achieving UHC targets of 80% coverage of health services and 100% coverage of financial risk protection from catastrophic and impoverishing health payments by 2030. We used the concentration index and relative index of inequality to assess wealth-based inequality in UHC indicators. Findings If the current trends remain unchanged, we estimated that coverage of childhood vaccinations, improved water, oral rehydration treatment, satisfaction with family planning, and non-use of tobacco will achieve the 80% target by 2030. However, coverage of four antenatal care visits, facility-based delivery, skilled birth attendance, postnatal checkups, care seeking for pneumonia, exclusive breastfeeding, non-overweight, and adequate sanitation were not projected to achieve the target. Quintile-specific projections showed wide wealth-based inequality in access to antenatal care, postnatal care, delivery care, adequate sanitation, and care seeking for pneumonia, and this inequality was projected to continue for all indicators. The incidence of catastrophic health expenditure and impoverishment were projected to increase from 17% and 4%, respectively, in 2015, to 20% and 9%, respectively, by 2030. Inequality analysis suggested that wealthiest households would disproportionately face more financial catastrophe than the most disadvantaged households. Interpretation Despite progress, Bangladesh will not achieve the 2030 UHC targets unless the country scales up interventions related to maternal and child health services, and reforms health financing systems to avoid high dependency on out-of-pocket payments. The introduction of a national health insurance system, increased public funding for health care, and expansion of community-based clinics in rural areas could help to move the country towards UHC. Copyright (c) The Author(s). Published by Elsevier Ltd.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5759277a5b29ceca966ffa6686f3bd7c",
  "timestamp": "2025-05-15T02:48:23.698852"
}