{
  "id": 7501,
  "title": "Narcissism, risk and uncertainties: analysis in the light of prospect and fuzzy-trace theories",
  "abstract": "Purpose - This study aims to analyze the relationship between the nonpathological traits of narcissism and decisions under conditions of uncertainty and risk in light of the prospect (PT) and fuzzy-trace theories (FTT). Design/methodology/approach - This paper conducted an empirical-theoretical study with 210 Brazilian academics from the business area (accountants and managers), using a self-reported questionnaire to collect data. This paper analyzed the data through descriptive statistical techniques, correlation, test of hypotheses and logistic regression. Findings - The results point to a lower disposition of respondents to narcissistic traits, although the characteristics of self-sufficiency, authority, exploitation and superiority have been demonstrated. Most participants chose the sure gain in positive scenarios and risk in light of possibility of losses. However, those with high levels of narcissism showed higher propensity to make risky decisions, both in positive and negative scenarios. Research limitations/implications - The empirical results about risky decision-making behavior of individuals with narcissist traits spur further investigation on the impacts of attitudes and behaviors in organizations as they are affected by psychosocial factors. These attitudes and behaviors, reflected in administrative and financial reports, influence future decisions of investors. Originality/value - The interaction between the areas of business administration and psychology in regard to the effects of the narcissist personality trait and the FTT is both original and valuable for the business area. The simplest scenario based on the FTT theory can help eliminate issues around the interpretation and complexities of calculations regarding decision-making scenarios in PT format.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "576a2ff234b3834930809b5ddf999913",
  "timestamp": "2025-05-15T03:09:07.347184"
}