{
  "id": 3096,
  "title": "Effect of medical insurance and family financial risk on healthcare utilisation by patients with chronic diseases in China: a cross-sectional study",
  "abstract": "Objective To assess the joint cumulative effects of medical insurance and family health financial risk on healthcare utilisation among patients with chronic conditions in China. Design A nationwide population-based case-control study with multinomial logistic regression was conducted and used to estimate the ORs of healthcare utilisation against type of medical insurance and family health financial risk using the Anderson model as a theoretical framework. Setting China Family Panel Studies (CFPS) database. Participants The study sample included 5260 patients with chronic conditions identified from the 2014 CFPS database. Main outcome measures The participants were classified by their health insurance coverage: urban employee basic medical insurance (UEBMI), Gong Fei Medical Insurance (GFMI), new rural cooperative medical scheme (NCMS) and urban residents basic medical insurance. Healthcare utilisation was measured by assessing the care level provided by the health institutions selected by patients when they were sick. Health financial risk was measured using the cost of medical expenditures and annual family income over the past year. Results Patients were more likely to choose hospital care than care from primary health centres. Patients with NCMS preferred primary healthcare, compared with patients with no medical insurance (OR 1.852, 95% CI 1.458 to 2.352). Patients with UEBMI and GFMI made use of hospital healthcare services (OR 2.654, 95% CI 1.85 to 3.81; OR 1.629, 95% CI 1.15 to 2.30, respectively). Patients who had medium or high financial risk were more likely to choose tertiary/specialised hospital care, compared with those at low financial risk (OR 1.629, 95% C11.15 to 2.30; OR 1.220, 95% CI 1.04 to 1.43, respectively). Conclusions The majority of patients chose hospital care in our sample. There was a joint effect and relationship between degree of family health financial risk and medical insurance on healthcare utilisation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5772f0537923494794b08cd76219f5eb",
  "timestamp": "2025-05-15T02:22:25.163513"
}