{
  "id": 3702,
  "title": "Gaussian mixture models reveal highly diverse targeting tactics in a coastal fishing fleet",
  "abstract": "Fishermen make repeated choices with respect to when, where, and how to catch their target species. While these targeting tactics-and the factors shaping them-are known to fishers and some experts, knowledge about them is largely informal and not well utilized for management purposes. To formalize information on targeting tactics, we propose a set of methods combining model-based classification of target species with generalized linear models. We apply these methods to Norwegian coastal fishing vessels that caught Atlantic cod (Gadus morhua) as a part of their catch portfolio in 2019. The data contains nearly 32000 fishing trips by 761 vessels. Gaussian mixture models identify eight latent targeting tactics. Cod contributes significantly to three of the tactics. The Herfindahl-Hirschman Index, a measure of vessel-level diversity of tactics, shows that one quarter of the vessels had a specialized strategy (targeting cod plus at most one additional tactic). While cod is often studied as a single-species fishery, we show that cod-catching vessels can be engaged in relatively pure fisheries during some fishing trips but switch to different, often more mixed targets during other trips. We term this as sequential mixed fisheries. This is both a challenge and an opportunity for the fisheries management.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "577ffd06cf0941a581f8d1489fd574f3",
  "timestamp": "2025-05-15T01:20:03.398290"
}