{
  "id": 6801,
  "title": "Characteristics of community-dwelling older individuals who delayed care during the COVID-19 pandemic",
  "abstract": "Background: Disruptions and reductions in healthcare services, coupled with infection concerns in the public, have caused widespread delay in health care during the COVID-19 pandemic. Persons with disability were at increased risk for deferred care. This study aimed to examine the extent of delayed care among older US individuals by disability status, identify characteristics associated with delayed care, and explore potential barriers to care during the pandemic. Methods: Data were drawn from the Health and Retirement Study (HRS) 2020 Core Early Release. Community-dwelling adults over age 50 (n = 15145) were classified as having ADL (or IADL) impairment versus no impairment. Distributions of demographic, clinical, and psychosocial characteristics, delayed care, and barriers to care were compared between disability groups. Characteristics associated with delayed care were identified with the multivariable logistic regression model with multiple imputation. Results: 30.7% of older individuals delayed care. ADL/IADL impairment was associated with delayed care overall and in specific domains. Sociodemographic (e.g., younger age and higher socioeconomic status), clinical (e.g., disability, psychiatric conditions, pain, and severe fatigue), and psychosocial (e.g., concerns about the pandemic, perceived financial insecurity, and loneliness) characteristics were associated with delayed care. Financial barrier to care and fear disproportionately affected those with social and clinical vulnerabilities, whereas reductions in healthcare services had a greater impact on those with socioeconomic well-being. Conclusion: Efforts should be directed to increase receipt of needed care among vulnerable older individuals. Both pandemic-induced and long-standing barriers to care among disparate subpopulations should be considered in alternative care delivery models.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57851dea5f80bbafa0d0ae402d1d25d2",
  "timestamp": "2025-05-15T03:01:31.475254"
}