{
  "id": 3199,
  "title": "How Do Financial Distress Risk and Related Party Transactions Affect Financial Reporting Quality? Empirical Evidence from Iran",
  "abstract": "The paper aims to investigate the effects of financial distress risk (FDR) and related party transactions (RPT) on financial reporting quality (FRQ) in an emerging market called Iran. In this study, the ordinary least squares regression (OLS) method is employed to test the hypotheses; moreover, Jones' discretionary accruals model is used to assess the financial reporting quality (FRQ). The results show financially distressed companies have a lower financial reporting quality because they try to mislead other stakeholders about the corporate actual performance to attract more investors and lenders. Consistent with the tunneling or conflict of interests transaction assumption, our findings confirm there is a positive association between related party transactions through loan and accrual-based profit management. In other words, Iranian managers participate in loan-related party transactions to expropriate their firm's resources and then manipulate financial statements to mask such expropriation. Finally, additional analysis indicates that financial reporting quality is seen well among firms having higher sale growth and more institutional owners, whereas the variables of ROA and financial leverage negatively affect financial information quality.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5789412b1cb8900b0872281c28880faa",
  "timestamp": "2025-05-15T02:23:33.585832"
}