{
  "id": 9285,
  "title": "History of Low Hourly Wage and All-Cause Mortality Among Middle-aged Workers",
  "abstract": "IMPORTANCE Earning a low wage is an increasingly recognized public health concern, yet little research exists on the long-term health consequences of sustained low-wage earning. OBJECTIVE To examine the association of sustained low-wage earning and mortality in a sample of workers with hourly wage reported biennially during peak midlife earning years. DESIGN, SETTING, AND PARTICIPANTS This longitudinal study included 4002 US participants, aged 50 years or older, from 2 subcohorts of the Health and Retirement Study (1992-2018) who worked for pay and reported earning hourly wages at 3 or more time points during a 12-year period during their midlife (1992-2004 or 1998-2010). Outcome follow-up occurred from the end of the respective exposure periods until 2018. EXPOSURES Low-wage-less than the hourly wage for full-time, full-year work at the federal poverty line-earning history was categorized as never earning a low wage, intermittently earning a low wage, and sustained earning a low wage. MAIN OUTCOMES AND MEASURES Cox proportional hazards and additive hazards regression models sequentially adjusted for sociodemographics, and economic and health covariates were used to estimate associations between low-wage history and all-cause mortality. We examined interaction with sex or employment stability on multiplicative and additive scales. RESULTS Of the 4002 workers (aged 50-57 years at the beginning of exposure period and 61-69 years at the end), 1854 (46.3%) were female; 718 (17.9%) experienced employment instability; 366 (9.1%) had a history of sustained low-wage earning; 1288 (32.2%) had intermittent low-wage earning periods; and 2348 (58.7%) had never earned a low wage. In unadjusted analyses, those who had never earned low wages experienced 199 deaths per 10 000 person-years, those with intermittent low wages, 208 deaths per 10 000 person-years, and those with sustained low wages, 275 deaths per 10 000 person-years. In models adjusted for key sociodemographic variables, sustained low-wage earning was associated with mortality (hazard ratio [HR], 1.35; 95% CI, 1.07-1.71) and excess deaths (66; 95% CI, 6.6-125); these findings were attenuated with additional adjustments for economic and health covariates. Significant excess death and elevated mortality risk were observed for workers with sustained low-wage exposure and employment fluctuations (eg, for sustained low-wage x employment fluctuated, HR, 2.18; 95% CI, 1.35-3.53; for sustained low-wage x stable employment, HR, 1.17; 95% CI, 0.89,-1.54; P for interaction =.003). CONCLUSIONS AND RELEVANCE Sustained low-wage earningmay be associated with elevated mortality risk and excess deaths, especially when experienced alongside unstable employment. If causal, our findings suggest that social and economic policies that improve the financial standing of low-wage workers (eg, minimum wage laws) could improve mortality outcomes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "578c501bc8e74eb653c4dc39a742e786",
  "timestamp": "2025-05-15T03:27:24.975509"
}