{
  "id": 3159,
  "title": "A COMPARISON OF CAPM AND FAMA-FRENCH THREE-FACTOR MODEL UNDER MACHINE LEARNING APPROACHING",
  "abstract": "With the economy experiencing rapid growth in recent years, more individuals have started venturing into the stock market. Precisely forecasting the rate of return can mitigate investment risks for stock investors and significantly enhance their investment returns. The Capital Asset Pricing Model (CAPM) and the 3-factor Fama-French model (FF3) are widely recognized in academic and practical settings. This model comparison provides frameworks to analyze the relationship between portfolio risk and return in inefficient markets, contributing to applied data science in finance behavior. This research utilized the Support Vector Regression (SVR) algorithm to forecast the returns of a diversified portfolio in the Hanoi stock market (HNX) from 2010 to 2022. Initially, this study calculated the factors and subsequently constructed diversified portfolios. Subsequently, the explanatory power of the CAPM and FF3 models were compared using the Ordinary Least Squares (OLS) algorithm. Finally, this research incorporated the SVR algorithm within the FF3 framework to develop a predictive model. The research findings demonstrate that the FF3 model provides a superior explanation to the CAPM model. Additionally, the study reveals that the SVR algorithm outperforms the OLS algorithm in terms of efficiency, as it yields lower Root Mean Square Error (RMSE) values. Nevertheless, despite its advantages, the FF3 model still falls short regarding explanatory factors. Consequently, the next research direction entails replacing the FF3 model with a more comprehensive multi-factor model, anticipating obtaining an enhanced predictive model.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "578de646b0d87fc7d6beae18ec4f4df7",
  "timestamp": "2025-05-15T01:14:16.189781"
}