{
  "id": 2435,
  "title": "Use of Machine Learning Algorithms to Study the Hospitalization for Coronary Artery Bypass at University Hospital Federico II",
  "abstract": "Coronary artery bypass graft (CABG) is a surgical treatment performed to treat coronary artery disease. During CABG, the patient's coronary arteries are cleaned out of obstructions and new, heart-blood-supplying arteries are implanted in their place. Following the CABG, the objective of postoperative care is aimed at fostering the patient's recovery by reducing the risk of complications. Given that a prolonged length of stay may result in a significant financial burden and ineffective management of hospital resources, the length of stay (LOS) in the hospital is an important component for a good organizational structure. The LOS of patients receiving bypass surgery has been predicted in this study using Machine Learning (ML) techniques. Computer systems can automatically learn from data without explicit programming thanks to a combination of mathematical models and statistical techniques called machine learning (ML). The dataset comprises 243 patients having heart bypass surgery in 2019-2020, was obtained from the University Hospital Federico II - Complex Operative Unit (C.O.U.) of Cardiology. The data were compared with those obtained from two other hospitals (University Hospital San Giovanni di Dio e Ruggi d'Aragona and those of the national hospital Antonio Cardarelli) to identify the algorithm with the best performance in predicting length of stay of patient undergoing CABG by analyzing personal and clinical information like age, presence/absence of comorbidities.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "578f2f6d8b4644c22707ab2b4321c723",
  "timestamp": "2025-05-15T02:15:26.994828"
}