{
  "id": 2849,
  "title": "Volatility co-movements and spillover effects within the Eurozone economies: A multivariate GARCH approach using the financial stress index",
  "abstract": "The Eurozone crisis is one the most important economic event in recent years. At its peak, the effects of the crisis have put at serious risk the outcome of the euro project, exposing the inherent weaknesses and vulnerabilities of the monetary union. As the degree of economic and financial integration of these countries is significant, we aim to investigate in details the potential cross-covariance and spillover effects between the Eurozone economies and financial markets. In order to do this, we employ financial stress indexes, as systemic risk metrics in a multivariate GARCH model. This method is able to capture markets' dependencies and volatility spillovers and is employed on a single market level as well as on the full spectrum of Eurozone markets. The empirical results have shown the important and intensive stress transmission on banking and money markets. Moreover, the role of peripheral countries as stress transmitter is verified, but only for particular periods. The significant spillover effects from core countries are also evident, indicating their important role in the Euro Area and its overall financial stability. The decoupling hypothesis is empirically verified, underling the gradually decreasing intensity of spillovers between Euro Area countries. Overall, this paper exhibits the complex structure of spillover effects for Eurozone, along with a clustering effect in the most recent times. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57a7082e26e195a6d21df6ce5b9e4172",
  "timestamp": "2025-05-15T02:19:46.710644"
}