{
  "id": 7173,
  "title": "Common mental disorders, unemployment and welfare benefits in England",
  "abstract": "Objectives: Individuals who are out of work have a higher rate of common mental disorders (CMD) than individuals who are employed. People who are unemployed in the UK are entitled to welfare benefits to alleviate financial strain. This study examined rates of CMD in individuals who were employed, unemployed and receiving various UK benefits. It also investigated associations between duration of unemployment, gender and CMD. Study design: An analysis of 5090 working-age participants from the Adult Psychiatric Morbidity Survey 2007, a stratified probability sample survey conducted among adults aged 16 years and over living in private households in England. Methods: CMD was assessed using the Clinical Interview Schedule (Revised). Information was gathered on sociodemographics, employment, income, benefits and debt. Data were analysed using logistic regression. Results: Risk of CMD was significantly greater in individuals classified as: unemployed; economically inactive; not working due to physical health reasons; unable to find a suitable job; receiving housing, care or sickness benefit; and receiving income support. However, risk of CMD was not significantly greater in individuals receiving jobseeker's allowance. Individuals unemployed for less than 1 year or more than 3 years had a higher risk of CMD. Some interactions with gender were significant, with associations being greater in men than women. Conclusions: Job loss events are not the only reason for unemployed people to develop CMD. The state of unemployment itself may be detrimental to mental health. Risk of CMD is increased in those who have been out of work for 3 years or more. Associations between benefits and mental health are likely to be due to social, health or economic circumstances associated with benefit eligibility. (C) 2010 The Royal Society for Public Health. Published by Elsevier Ltd. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57aab1b459303e16dae1c84bd0dfd3ec",
  "timestamp": "2025-05-15T03:06:01.141412"
}