{
  "id": 8251,
  "title": "Depressive symptoms and psychosocial aspects of work in bank employees",
  "abstract": "The financial sector has seen an increase in the number of cases of violence and stress, which can result in adverse health outcomes, including depressive symptoms, but studies related to stress at work and depression for these workers are scarce. To investigate the association between exposure to psychosocial work stressors and depressive symptoms in bank employees. A self-administered questionnaire was completed by a sample of bank employees in Para and Amapa, Brazil. The survey assessed sociodemographic characteristics, mental health (Patient Health Questionnaire-9), Demand-Control-Support and Effort-Reward Imbalance (ERI). Outcomes included two levels of depressive symptoms: major depressive symptoms (MDS) and other forms of depressive symptoms (ODS). Logistic regression models were used to estimate associations between depressive symptoms, the two job stress models and relevant covariates. Of 2806 eligible subjects, there were 1445 respondents (52% response rate) and the final analyses included 1046 participants. The overall prevalence of depressive symptoms was 32% (MDS = 18%; ODS = 14%), with no statistically significant difference between men and women. High demands, low levels of control and low social support were associated with MDS and/or ODS, adjusted for gender, age and other work-related conditions. High effort/low reward, over-commitment and ERI were also associated with MDS and ODS. Psychosocial conditions in banking activity involving high strain, low social support at work, high effort with low reward and over-commitment may represent possible risk factors for depressive symptoms in bank employees.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57ac1d77c09f404238c678424d4bc996",
  "timestamp": "2025-05-15T03:16:49.025356"
}