{
  "id": 8834,
  "title": "Health system productivity in China: a comparison of pre- and post-2009 healthcare reform",
  "abstract": "In 2009, China launched an ambitious health system reform that combined extending social health insurance scheme with improving efficiency, access and quality of care in the country. To assess the impact of the policy on efficiency and productivity change, we investigated the country's health system performance at provincial levels during pre- and post-reform period. Outputs were measured using multiple health outcomes (namely, non-communicable diseases free healthy life years and infant and maternal survival rates), while health expenditure, number of medical personnel and hospital beds per 1000 residents were used as proxy measures for health inputs. Changes in productivity were quantified using a bootstrap Malmquist productivity index (MPI). The analysis focused on the period between 2004 and 2015. This was to capture pre- and post-policy implementation experience and to ensure that enough time was allowed for the policy to work through. Finally, a bootstrap Tobit regression model for panel data was applied to examine the potential effects of contextual factors on productivity change. The result showed that the reform has had negative effects on productivity. Only scale efficiency had improved steadily, but the decline in the scale of technological change observed during the same period meant that the progress in scale efficiency had been masked. Better economic performance (as measured by per capita Gross Domestic Product (GDP)) and higher human resource to capital investment ratio (as measured by density of medical staff per hospital beds) tended to boost productivity growth, while population aging, low educational attainment and higher percentage of out-of-pocket (OOP) payments had adverse effects. Improving health system productivity in China requires improving financial risk protection and maintaining proper balance between human and capital investment in the country.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57ad99299023fa4b9e3c303904c79758",
  "timestamp": "2025-05-15T03:22:57.905384"
}