{
  "id": 2627,
  "title": "Does AI Adoption in Financial Management Enhance Corporate Risk Resilience?",
  "abstract": "As artificial intelligence (AI) becomes increasingly integrated into financial decision-making, its impact on corporate risk resilience remains an open question. Addressing this gap, our study empirically investigates how AI adoption influences firms' financial stability by examining a large-scale dataset of 23,700 firm-year observations from Chinese A-share listed companies (2013-2022). Using text mining techniques, we construct an AI-related lexicon from annual reports to quantify AI adoption and employ fixed-effects regression models alongside instrumental variable estimation to assess AI's impact on corporate financial leverage as a proxy for risk resilience. Our empirical results indicate that a one-standard-deviation increase in AI adoption is associated with a 10.6% reduction in financial leverage ( $\\beta = -0.106$ , p <0.01), reinforcing AI's role in enhancing financial resilience. Furthermore, executives' technical expertise significantly strengthens this effect ( $\\beta = -0.083$ , p <0.05), while international background shows a relatively modest influence. These findings provide new insights into the interplay between AI adoption, financial risk management, and executive characteristics, offering practical implications for firms leveraging AI to enhance financial stability. Furthermore, this study introduces senior executives' international backgrounds, technical expertise, and innovation orientation as moderating variables. Empirical analysis reveals differences in their moderating effects: executives' technical proficiency demonstrates the strongest positive impact on the AI-risk resilience relationship, followed by innovation orientation, with overseas experience showing a relatively modest influence. This study enhances the theoretical understanding of AI applications in financial management, offering practical insights for companies to improve risk resilience and financial decision-making. Given the ongoing advancements and deeper integration of AI, its influence on corporate financial decision-making and risk management is expected to grow, warranting further exploration.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57bc96117417d2e2f518d6a16e8d9ccd",
  "timestamp": "2025-05-15T02:17:32.126684"
}