{
  "id": 7477,
  "title": "Using Natural Language Processing in the LACE Index Scoring Tool to Predict Unplanned Trauma and Surgical Readmissions in South Africa",
  "abstract": "Background: Unplanned and potentially avoidable readmission within 30 days post discharge is a major financial burden. Aim: To use text-based electronic patient records to calculate the Charlson Comorbidity Index (CCI) score using a natural language processing technique to establish the feasibility and usefulness of the text-based electronic patient records in identifying patients at risk for unplanned readmission. Methods: A retrospective review of electronic patient records for general and trauma surgery in a hospital in South Africa (2012-2022) was conducted using the LACE score. Validated sentiment analysis analyzed free text components of electronic patient records to compute the CCI score and to establish the feasibility and usefulness of the LACE score in identifying patients at risk for unplanned readmission. Results: Trauma surgery patients had a mean LACE score of 5.91 (SD = 2.41), with 8.44% scoring 10 or higher and a specificity and sensitivity of 91.63% and 13.81%, respectively. The general surgery patients had a mean LACE score of 7.75 (SD = 3.04), with 10.63% scoring 10 or higher and a specificity of 71.47% and a sensitivity of 44.80%, respectively. Logistic regression analysis revealed that LACE scores significantly predicted unplanned readmissions in both trauma (beta = 0.11, p < 0.001; OR = 1.112, 95% CI [1.082, 1.143]) and general surgery (beta = 0.15, p < 0.001; OR = 1.162, 95% CI [1.130, 1.162]) patients. Conclusion: The LACE score demonstrated the predictive value for readmission in trauma and general surgery patients. The LACE score was relatively effective in identifying patients who were less likely to be readmitted but showed limitations in identifying patients at higher risk of readmission. However, the successful use of natural language processing for data extraction of comorbidities shows promise on addressing the challenges around text-based medical records.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57bfa4352c37312173acf5b52ec96b10",
  "timestamp": "2025-05-15T03:09:07.254437"
}