{
  "id": 2303,
  "title": "Real-Time Detection of Fake-Shops through Machine Learning",
  "abstract": "E-commerce fraud has been surging at an alarming rate, reaching an all-time high in Austria in 2019, with an increase of 32.3% since the previous year. Illegitimate subscription services, counterfeit goods and fake-shops cause consistent and enormous financial damage. Manual preventive measures fall short due to the sheer number and increasing volume of cases reported for evaluation. Reducing the window of opportunity and increasing the efficiency in flagging fake-shops is therefore key. This paper presents an approach to classify fraudulent online shops solely on the basis of the similarity of their source code structure using machine learning processes. The trained models show an Accuracy of up to 97% and a very high degree of certainty in classifying fraudulent e-commerce, with 61% of all absolute prediction values being nearly identical to the ones made by human experts. Additionally, an aggregated model was developed that plays an important factor in balancing the overall quality of predictions. The open source software components developed include the Fake-Shop Detection API and Middleware, which enables a risk assessment of any website based on the trained models. By using the developed models, the system was able to issue warnings for 48% of fake-shops at the highest prediction confidence level, meaning that these could have immediately been blacklisted by consumer protection agencies, without a single false-classification and an error rate of zero.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57c9ac3330c15b4d7b08439f89aacf31",
  "timestamp": "2025-05-15T02:13:31.892530"
}