{
  "id": 8477,
  "title": "What stresses men? predictors of perceived stress in a population-based multi-ethnic cross sectional cohort",
  "abstract": "Background: Perceived stress (PS) is a risk factor for a variety of diseases. However, relatively little is known about age- or ethnicity-specific differences in the effect of potential predictors of PS in men. Methods: We used a population-based survey of 6,773 White, 1,681 Black, and 617 Hispanic men in Southeastern Pennsylvania to evaluate the relationship of self-reported PS and financial security, health status, social factors, and health behaviors. Interactions across levels of age and ethnicity were tested using logistic regression models adjusted for overall health status, education, and household poverty. Results: High PS decreased significantly with age (p < 0.0001) and varied by ethnicity (p = 0.0001). Exposure to health-related and economic factors were more consistently associated with elevated PS in all ethnicities and ages, while social factors and health behaviors were less strongly or not at all associated with PS in most groups. Significant differences in the relationship of high PS by age and ethnicity were observed among men who are medically uninsured (p = 0.0002), reported missing a meal due to cost (p < 0.0001), or had spent a night in the hospital (p = 0.020). In contrast, not filling a prescription due to cost and diagnosed with a mental health condition were associated with high PS but did not differ by age and ethnicity subgroup. Conclusions: These data suggest that some, but not all, factors associated with high PS differ by age and/or ethnicity. Research, clinical, or public health initiatives that involve social stressors should consider differences by age and ethnicity.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57d19fba8f953dac66b0bc63bee79dd9",
  "timestamp": "2025-05-15T03:19:21.285061"
}