{
  "id": 2784,
  "title": "China's First Natural Language-based AI ChatBot Trader",
  "abstract": "Repo (repurchase agreement) trading provides easy access to short-term financing secured by a pledge of collateral and plays an important role in the global financial system. However, repo traders face many tough challenges in their job, from managing complex financial transactions to keeping up with changing market trends and regulations in the complex financial transactions involved. Besides the difficult and tedious processes that take a lot of time and energy, repo traders need to keep up to date with various laws, regulations, and financial trends that may affect their job, worsened by the exposure to a variety of market risks. As the leader of the FinTech industry, Ant Group launched a new initiative to alleviate the affliction of the repo traders at MyBank1. By leveraging many existing platform technologies, such as AI ChatBot and forecasting platforms, and with the collective work of various engineering groups, we are able to create a ChatBot that communicates with other human traders in natural language and create electronic contracts based on the negotiated terms, equipped with proper trading strategies based on forecasting results. The fully automatic workflow not only frees our trader from tedious routines, but also reduces potential human errors. At the same time, it enables refined portfolio and risk management, while opening up the possibility to apply neural network-based trading strategies, and yielding greater returns comparing to traditional workflow reliant on human experiences. Our system has evolved beyond just providing services to our own traders, to now a fully commercialized product, covering other types of interbank trading.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57e7993c3926999a5fdc8aec2543334c",
  "timestamp": "2025-05-15T02:19:08.451053"
}