{
  "id": 7523,
  "title": "The development of an HIV-specific complexity rating scale",
  "abstract": "As treatment for HIV improves, an ageing population is experiencing comorbidity which often leads to complex clinical presentations requiring an interdisciplinary care approach. This study sought to quantify clinician assessment of the level of clinical complexity, through the development of a rating scale for people living with HIV (PLHIV), to improve client care through an interdisciplinary care model. An existing alcohol and other drug complexity rating scale was selected and modified for use with PLHIV. HIV-specific items were included through consultation with an interdisciplinary team. A risk-prediction model was developed and validated using clinician ratings of clients attending The Albion Centre, a tertiary HIV clinic in Sydney, Australia, resulting in the development of the Clinical Complexity Rating Scale for HIV (CCRS-HIV). Multivariable logistic regression models identified eight characteristics based on clinician assessment of complexity in PLHIV: financial instability, social isolation, problematic crystal methamphetamine use, mental illness and/or other problematic substance use, cognitive/neurological impairment, polypharmacy, current hepatitis C infection and/or cancer, and other physical health comorbidity. A weighted risk-prediction model was developed and validated. The final model accurately predicted 85% of complex clients, with a sensitivity of 80% and specificity of 91%. This study developed an HIV-specific clinician-rated complexity scale. Further investigations are required to validate the CCRS-HIV with broader HIV populations. This simple complexity screening tool is a promising adjunct to clinical assessment to identify clients with complex physical and psychosocial needs who may benefit from interdisciplinary care interventions and allocation of resources.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57f3ba7304d0d338dfae83a069d2a80c",
  "timestamp": "2025-05-15T03:09:36.852552"
}