{
  "id": 1117,
  "title": "The Front-End's Lending Decision System for the Agricultural Bank in Thailand",
  "abstract": "The main objective of this study is to develop the front-end's lending decision system of the Bank for Agriculture and Agricultural Cooperatives, a major lender in Thailand's agricultural sector. The logit model and the artificial neural network model have been developed to reflect risk factors to identify the probability of default by each new borrower. The study supports the use of the logit model to develop the system because it gives more accuracy in predicting the probability of default and debtor classification than the artificial neural network model. The working process of the system is classified into two sections including credit risk management, which is the process of screening the loan applications and setting the credit approval or rejection criteria, and affordability risk management, which is the process of determining the maximum loan amount for the debtor who has passed the credit approval criteria. In this study, the author caps the debt service ratio as a threshold for determining the amount of credit (the loan amount approved and interest expense) at 70% and determines that the maximum loan principal is 63% of the debtor's total annual income. The system is also used as an instrument to support the implementation of appropriate credit policies in handling agricultural households' excess debt and promote the building of financial discipline for agricultural households in the rural sector of Thailand.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "57fb9b86fee791cda5295da8e159f89f",
  "timestamp": "2025-05-15T01:59:21.567937"
}