{
  "id": 4094,
  "title": "Green cryptocurrencies and portfolio diversification in the era of greener paths",
  "abstract": "The shift towards cleaner fuels from hydrocarbons has influenced nearly all market types and asset classes, and cryptocurrencies are no exception. The complex mechanism of blockchain and mining consumes high levels of electricity and surges environmental footprints in electronic waste generation. Existing studies that examine green and sustainable investments are limited to sustainable equities or green bonds; therefore, this study opens up a new research direction by considering green (energy-efficient) cryptocurrencies. First, this study develops a four-step screening process to systematically select cryptocurrencies that are greener than others. A comprehensive set of green and non-green assets and a battery of empirical tests are then employed to examine the diversification benefits of selected green cryptocurrencies against several well-diversified equity portfolios at the global, regional, and country levels. The diversification benefits of green cryptocurrencies are compared with non-green cryptocurrencies using (i) the four-moment modified value at risk and conditional value at risk, (ii) four different portfolio optimization strategies, and (iii) dynamic correlation-based hedge and safe-haven regression analyses. The results show that green cryptocurrencies provide diversification benefits that are at least comparable to, and in some cases, superior to, non-green (energy-intensive) cryptocurrencies. Cardano and Tezos are identified as green cryptocurrencies offering the most diversification benefits to investors, followed by EOS, Steller, and IOTA. This study provides valuable insights to investors and policymakers, specifically those concerned with achieving sustainability and ESG-compliance (environmental-social-governance) goals and seeking green assets to hedge and diversify various traditional investments.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5809d0061403e78ed37687db42b007f0",
  "timestamp": "2025-05-15T01:23:58.020192"
}