{
  "id": 4879,
  "title": "A clinical and biological review of keratoacanthoma",
  "abstract": "Keratoacanthoma (KA) is a common skin tumour that remains controversial regarding classification, epidemiology, diagnosis, prognosis and management. Classically, a KA manifests as a rapidly growing, well-differentiated, squamoid lesion with a predilection for sun-exposed sites in elderly people and a tendency to spontaneously regress. Historically, KAs have been considered a variant of cutaneous squamous cell carcinoma (cSCC) and are often reported as KA-type cSCC. However, the penchant for regression has led many to categorize KAs as biologically benign tumours with distinct pathophysiological mechanisms from malignant cSCC. The clinical and histopathological similarities between KA and cSCC, particularly the well-differentiated variant of cSCC, have made definitive differentiation difficult or impossible in many cases. The ambiguity between entities has led to the general recommendation for surgical excision of KAs to ensure a potentially malignant cSCC is not left untreated. This current standard creates unnecessary surgical morbidity and financial strain for patients, especially the at-risk elderly population. There have been no reports of death from a definitive KA to date, while cSCC has an approximate mortality rate of 1 center dot 5%. Reliably distinguishing cSCC from KA would shift management strategies for KAs towards less-invasive treatment modalities, prevent unnecessary surgical morbidity, and likely reduce associated healthcare costs. Herein, we review the pathophysiology and clinical characteristics of KA, and conclude on the balance of current evidence that KA is a benign lesion and distinct from cSCC.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5811431c822691daaa39ba25cddf6fb0",
  "timestamp": "2025-05-15T02:42:04.851486"
}