{
  "id": 3483,
  "title": "The stability of Chinese stock network and its mechanism",
  "abstract": "Based on the multi-fractal properties of financial time series, Value-at-Risk (VaR) and price fluctuation correlation, we construct China's stock market networks and analyze empirically three networks' topological features, their stability and their relationship with international stock market indices. The results show that: (1) In the three types of networks, the stock price network does not have scale-free features, multi-scale network and risk network both have small-world and scale-free characteristics; (2) The stock market volatility and the network stability coefficient are Granger causality, the early changes of the stock market volatility can effectively explain the changes of the network stability coefficient, the network connectivity and clustering coefficient are negatively correlated with the stock market volatility, the volatility of the international stock index in Hong Kong, Japan, and the United States has a positive effect on the network stability coefficient, and the international gold or crude oil markets has a negative effect on it; (3) By applying the probit binary selection model test, we found that the network structure is more capable of explaining abnormal fluctuations than international market factors and that the stock network with higher network stability coefficient and higher eigenvector centrality of financial institutions indicates that downward fluctuation of stock price will intensify in the future. From the empirical results, we see that the risk network is more robust and provides a reference for the analysis of the short-term risks and stability of the Chinese stock market. In order to maintain the stability of the stock market, the regulatory authorities should pay a close attention to internal and external factors, increase network connectivity and integration, and actively guard against the risk spillover effects of financial institutions. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58161073492df0910e59cfdc6b413ba1",
  "timestamp": "2025-05-15T02:26:48.518418"
}