{
  "id": 1948,
  "title": "Exploring the essential features influencing the synthesis of methylenedianiline to support industrial processes",
  "abstract": "The most important intermediate of methylene diphenyl diisocyanate (MDI), the most widely and quantitatively produced isocyanate in the world, is methylenedianiline (MDA). MDA is industrially produced from the reaction of aniline and formaldehyde catalysed by inorganic acids, most commonly HCl. The reaction parameters used during the synthesis of MDA have a fundamental impact on the quality parameters of the resulting MDA product mixture, and thus on the properties of the final MDI product mixture as well. Although MDA is an important industrial intermediate, currently its synthesis at the industrial level is based on empirical rules, knowledge and rule of thumbs, the effects of production parameters and their magnitude on product properties are not known and not published in the literature. In this study, the correlations between the independent operating parameters and dependent product quality parameters characterizing the MDA mixture were explored by developing different regression models with the use of experimental laboratory synthesis data in order to support the industrial synthesis process with easily deployable models with satisfactorily high accuracy. After investigating the laboratory experiment data from a total of 46 individual laboratory experiments, it was found that with machine learning models almost all of the independent parameters can be described with satisfactory accuracy. The models presented in this work demonstrate that it is possible to develop models that can be used to adjust the ring distribution, isomer ratios and selectivity of the reaction with minimising by-product quantities according to market demands or to different objective functions by fine-tuning the production parameters., thus achieving an optimal product portfolio and operating cost for the industrial process as well.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "581b6fd9f7409ac413bc4b997075884e",
  "timestamp": "2025-05-15T01:01:41.581813"
}