{
  "id": 7660,
  "title": "Research of investment attractiveness based on cluster analysis",
  "abstract": "The continued economic development of various countries or regions has resulted in increased competition in global markets, leading to a concentration of investors and skilled labour in locations with high investment attractiveness. The investment attractiveness of a given country or region is determined by its investment potential and risk, which are characterized by a combination of various significant factors.This paper seeks to develop an econometric model to estimate the amount of investment in fixed capital in a specific region, taking into consideration the linear relationship between the observed results, in order to determine the main conditions that are necessary for achieving stable and high economic growth. These conditions include the acceleration of investment activity and the implementation of major national reforms to ensure the effectiveness of the investment process. To assess the overall influence of the financial and economic indicators studied on the volume of investment, multiple regression analysis was utilized as the primary mathematical tool of the study. Furthermore, assumptions were made regarding the rank of the observations. To validate this hypothesis, a cluster analysis was conducted, grouping the observations into four clusters based on their results, depending on the volume of investment or the geographical characteristics of the region.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "583286adad200664deb901b24be829c8",
  "timestamp": "2025-05-15T03:10:33.142988"
}