{
  "id": 1936,
  "title": "Prevalence and Determinants of Angle Closure in Central Sri Lanka: The Kandy Eye Study",
  "abstract": "Purpose: To determine the prevalence and determinants of angle closure in the Kandy District of central Sri Lanka. Design: Population-based, cross-sectional study. Participants: Inhabitants aged 40 years or more from villages in the Kandy District were selected by randomized cluster sampling; 1721 eligible participants were identified, and 1375 participated in the study. Methods: The examination included slit-lamp examination of the anterior segment, applanation tonometry, static and dynamic gonioscopy, dilated stereoscopic optic disc examination, and ultrasonic ocular biometry. Eyes that were primary angle-closure suspects (PACS) or had primary angle closure (PCA) or primary angle-closure glaucoma (PACG) were identified. Definitions were based on recommendations from the International Society for Geographic and Epidemiological Ophthalmology (ISGEO). Univariate and multivariate logistic regression analyses were performed with angle closure as the outcome variable. Main Outcome Measures: Subjects with PACG, PACS, or PCA were pooled into a group considered to have angle closure. Results: The prevalence of PACS, PCA, and PACG in at least 1 eye was 2.35% (95% confidence interval [CI], 0.0-4.7; 32 subjects), 1.86% (95% CI, 0.6-3.1, 25 participants), and 0.57% (95% CI, 0.0-1.2; 7 participants), respectively. The overall prevalence of angle closure was 4.7% (95% CI, 1.1-9.3; 64 participants). The mean axial length in those with angle closure (21.99 mm) was significantly shorter (P<0.001) than in those with open angles (22.47 mm), as was the mean anterior chamber depth (ACD)(2.47 mm compared with 2.81 mm), but the mean lens thickness in those with angle closure (4.51 mm) did not significantly differ (P = 0.44) from those with open angles (4.45 mm). Neither age nor nuclear opalescence was a significant predictor of angle closure in the multivariate model (P = 0.09 and 0.61, respectively); however, female gender was associated with a 9.2 times (P<0.001) increased risk of angle closure, and each millimeter decrease in ACD was associated with a 2.6 times increased risk of angle closure (P<0.001). Conclusions: The overall prevalence of angle closure was 4.7%. Female gender and shallow ACD were significant independent predictors of angle closure in this Sri Lankan population. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:1444-1449 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5834505e16607c5f8a797d10c5658ebd",
  "timestamp": "2025-05-15T02:09:14.372377"
}