{
  "id": 7350,
  "title": "Corporate social responsibility and firm value: the role of enterprise risk management and corporate governance",
  "abstract": "PurposeCorporate social responsibility (CSR) has gained tremendous importance after several corporate scandals, financial crises and the rise of the hyper-competitive world. Firms must address multiple stakeholders' interests to increase firm value. This study aims to investigate the effect of CSR on firm value. This study also examines the mediating role of enterprise risk management (ERM) and the moderating influence of corporate governance (CG) in this CSR-firm value relationship.Design/methodology/approachThe sample of the study comprises 119 Pakistan Stock Exchange (PSX) listed firms and the study covers the period from 2010 to 2021. The corporate social responsibility performance has been quantified across five dimensions. These aspects are product, environment, employee relations, diversity and community. Four proxies i.e. strategy, operation, reporting and compliance, have been used to measure ERM. The governance quality of the sample companies was evaluated using the governance index, which included 29 governance provisions. The authors used the dynamic panel data technique (system-GMM) is used to achieve the objectives of the study. Furthermore, a firm's engagement in CSR activities can also be measured through a multinational financial approach to check the robustness of the result.FindingsBased on the regression analysis, the authors discovered that CSR was positively connected with firm value, validating the stakeholder view of CSR. Furthermore, following Baron and Kenny's (1986) mediation technique, the findings confirm that ERM mediates this association. These results are robust by using the bootstrapping tests by Preacher and Hayes (2004). Furthermore, the result shows that corporate governance (CG) is positively connected with firm performance, and this relationship is strengthened in the presence of an effective governance system in the organization.Practical implicationsThis study provides useful insights to regulators, investors and policymakers to consider CSR as a value-enhancing factor and encourage the development of enterprise risk management and compliance with CG mechanisms to improve firm value.Originality/valueThe presented analysis strengthens the existing CSR-firm value relationship by analyzing the mediating and moderating roles of ERM and CG, which have not yet been tested, particularly in the context of Pakistan.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5845a7ca49d33bbcfa8f1ef29cfeb36d",
  "timestamp": "2025-05-15T03:07:31.966949"
}