{
  "id": 4850,
  "title": "Risk Preference, Overconfidence and Job-seeker's Choice of Compensation Plans",
  "abstract": "The study examined the influence of two performance basis of variable pay (team/individual), two types of team size (large/small) and two incentive plans(high probability of receiving a small bonus/smaller probability of receiving a large bonus) on the 200 graduating students' (with different types of risk preference and overconfidence) choice of compensation plans with Kuhn & Yockey's study paradigm(2003). The results show that(1) college students prefer variable pay plan to fix salary.(2) the performance basis of variable pay, team size and incentive plans do not obviously affect the Chinese college students' choice of variable pay.(3) both independent and reference overconfidence have significant positive correlations with the choice of variable pay, so does the risk preference, the reference overconfidence has no relationship with the choice of variable pay when it was based on team performance; only the independent overconfident and risk preference have remarkable contributions to the compensation plans choice regression model.(4) the effects of overconfidence and risk preference on pay choice were influenced by performance basis of variable pay and incentive plans, the overconfident has significant contribution to the regression model when the pay is individual-based, but only the reference overconfidence has significant effect when the pay is team-based. The independent overconfidence and risk preference have significant contribution to the regression model when the incentive plan is a smaller probability of receiving a large bonus, but both overconfidence and risk preference have no significant contribution to the model when the incentive plan is the other case. (5) other individual differences such as major, self-efficient and group work preference also have some effect on the college students' compensations choice. Implications for designing compensation plans and employee recruitment and retention under financial crisis are discussed.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "585799adc3607dd7ebbeef2c3be5b8d2",
  "timestamp": "2025-05-15T02:41:32.810678"
}