{
  "id": 9101,
  "title": "Self-Directed Home Exercises vs Outpatient Physical Therapy After Total Knee Arthroplasty: Value and Outcomes Following a Protocol Change",
  "abstract": "Background: The need for outpatient physical therapy (OPPT) has been questioned following primary total knee arthroplasty (TKA). Recent studies have suggested that similar outcomes may be possible with self-directed home exercise programs (HEP) compared to OPPT, which can be costly to both the patient and healthcare system. The aim of the present study is to compare the safety, efficacy, and health economics of formal OPPT with self-directed home exercises after TKA following a protocol change. Methods: A single-surgeon, retrospective study of 520 consecutive patients undergoing primary unilateral TKA from 2016 to 2018 was performed. All 251 TKAs performed in 2016 were routinely prescribed OPPT, while all 269 TKAs in 2017 completed a self-directed HEP alone for 2 weeks. At their 2-week visit, OPPT was prescribed if patients had less than 90 degrees range of motion or per patient request. Financial data of postdischarge costs were collected for all patients. Multivariate logistic regression evaluated for variables associated with failure of the HEP program. Results: Overall, 65.8% (177/269) of patients in the HEP group did not require OPPT. There was no significant difference in percentage of patients whose range of motion was less than 90 degrees at 2-week followup between OPPT and HEP (14% vs 11.9%, P =.467). Between OPPT and HEP, there were no differences in manipulation under anesthesia (3.2% vs 3%, P =.883). On average, patients who received OPPT incurred an increase in average cost of $ 1340.87 and $ 1893.42 for Medicare and private insurer patients, respectively. We did not identify any significant risk factors for failing HEP. Conclusion: Comparable outcomes were demonstrated between patients receiving HEP compared to OPPT with a substantial cost saving. While a portion of patients still require formal OPPT, the majority do not. Surgeons should consider an initial trial of HEP with close follow-up in order to limit unnecessary costs associated with OPPT. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "585e61f08e28aa2b544b24663c4b8c48",
  "timestamp": "2025-05-15T03:25:27.778739"
}