{
  "id": 3800,
  "title": "What do risk disclosures reveal about banking operational risk processes? Content analysis of banks' risk disclosures in the Visegrad Four countries",
  "abstract": "This paper analyzes the operational risk disclosure practices of twenty-six large banks in the Visegrad group of countries (Czech Republic, Hungary, Poland and Slovakia) in the period 2008-16. Within a content analysis framework, we examine the content and the quality of operational risk reporting, relying on annual reports and Pillar 3 disclosure reports. Both descriptive statistics and multiple regression analysis are applied to evaluate how the firms' financial and governance characteristics are associated with operational risk disclosures. Regression analysis of risk disclosures shows that a high number of total assets and the implementation of the Basel advanced measurement approach result in more risk-sensitive and more informative reports. However, although reporting practices improved to a certain extent in the period examined, our results indicate that reports are quite limited in content and contain hardly any relevant information. Most banks do not provide information on their operational losses and exposures. Most of the reports do not reflect the heterogeneous and diverse nature of operational risk; emerging risk types such as conduct, model and reputational risks are not adequately addressed. Based on the results, we propose the disclosure practices related to operational risk should be reconsidered.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58a11ce81b1c510183353394629df625",
  "timestamp": "2025-05-15T02:29:59.221603"
}