{
  "id": 1869,
  "title": "Application of artificial intelligence for nutrient estimation in surface water bodies of basins with intensive agriculture",
  "abstract": "Eutrophication is one of the most relevant concerns due to the risk to water supply and food security. Nitrogen and phosphorus chemical species concentrations determined the risk and magnitude of eutrophication. These analyses are even more relevant in basins with intensive agriculture due to agrochemical discharges. However, analyzing these nutrients is labor intensive, as sampling to intercalibration in the laboratory requires considerable financial and human resources. Currently, artificial intelligence allows the modeling of phenomena and variables in various fields. This research focuses on the exploration of other machine learning methods, including multilayer perceptron (MLP), k-nearest neighbor (KNN), convolutional neural network (CNN), and random forest (RF) for the estimation of nutrients in surface waters of Sinaloa, Mexico (11 model basins), the states with the highest exports of agricultural products. Nutrients were considered in all possible chemical forms, such as total nitrogen, Kjeldahl nitrogen, ammonia nitrogen, total phosphorus, and orthophosphate. For estimation, the selected input parameters are characterized by pH, dissolved oxygen, conductivity, water temperature, and total suspended solids, which do not require chemical reagents and can be measured in real time. The parameter information was obtained from the National Network for Water Quality Monitoring database (6,200 data recorded since 2012). Finally, hyperparameter normalization and optimization (HPO) methods were implemented to maximize the best-performing model. Each model obtained different coefficient of determination values (R2): MLP between 0.64 and 0.77, CNN from 0.65 to 0.76, KNN from 0.64 to 0.79, and RF from 0.79 to 0.85. The latter is considered the best performer, with values of 0.95 in training and 0.94 in validation after applying HPO. Notably, the models are valid for any surface water body and in any climatic season in the state of Sinaloa, M & eacute;xico. Therefore decision-makers can use them for science-based environmental regulation of land use and pesticide application.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58c31fae62a5f23d1c15990ca0ab9d67",
  "timestamp": "2025-05-15T02:08:38.932852"
}