{
  "id": 5547,
  "title": "Performance comparison of Islamic and conventional banks: empirical evidence from Pakistan",
  "abstract": "Purpose - This study aims to investigate the performance differences of Islamic and conventional banks in Pakistan by using financial ratios. Design/methodology/approach - This study analyzed 5 Islamic and 19 conventional banks for the periods of 2007-2014. Two types of analyses were performed - sample t-test and logistic regression. Analysis was also performed on sub-sample considering crisis effects. Findings - It was found that Islamic banks are relatively better in profitability, efficiency, risk and liquidity management, while conventional banks are superior in asset quality. Higher efficiency of Islamic banks contradicts with previous studies conducted in Pakistan. Probable reasons for this include phenomenal expansion of Islamic banking industry and its broad appeal to customers in Pakistan. Risk management practices of Islamic banks are superior to conventional banks, as Shariah rules restrict pure speculation in monetary terms. Better asset quality of conventional banks is attributed to their recognition and product diversity. During the crisis, Islamic banks were found less profitable than their counterparts. Research limitations/implications - This study suggests that high operational efficiency of Islamic banks should be converted into technical efficiency by improving human resource, introducing innovative market-oriented products and prudent resource allocations. As operational efficiency does not promise returns in long term, to sustain ongoing phenomenal growth of Islamic banking, management needs to gain customer trust. Originality/value - This is an original research that compares performance differences across Islamic and conventional banks by using financial ratios.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58c836941ba741ed1a42330c9387495a",
  "timestamp": "2025-05-15T02:48:51.359862"
}