{
  "id": 469,
  "title": "Symmetry-Aware Credit Risk Modeling: A Deep Learning Framework Exploiting Financial Data Balance and Invariance",
  "abstract": "With the proliferation of mobile devices and payment systems in modern financial services, there is an increasing need to process and analyze continuous streams of transaction data for credit risk assessment. Leveraging the inherent symmetries in financial markets and data structures, this paper introduces DeepCreditRisk, a symmetry-aware deep learning framework that addresses key challenges while maintaining critical invariance properties in financial data representation. The framework incorporates three main components: an adaptive temporal fusion mechanism, a heterogeneous graph neural network, and an attention-based interpretable output layer. The temporal fusion mechanism effectively models both short-term fluctuations and long-term trends in financial time series, while the heterogeneous graph neural network captures intricate relationships within the financial ecosystem. The framework maintains important symmetrical properties in both temporal and structural representations, ensuring balanced feature learning and invariant risk assessment. The attention-based output layer preserves representation symmetry while enhancing model interpretability. Extensive experiments on a large-scale credit risk dataset demonstrate DeepCreditRisk's superior performance, achieving a 7.2% improvement in the Area Under the Receiver Operating Characteristic Curve (AUC-ROC) and an 18.6% improvement in the Kolmogorov-Smirnov (KS) statistic over state-of-the-art baseline models. The framework maintains high predictive power across various time horizons and provides interpretable insights into feature importance. DeepCreditRisk represents a significant advancement in applying deep learning to credit risk assessment, offering financial institutions a more accurate, robust, and transparent approach for evaluating creditworthiness and managing risk.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58d6e1241aa60b812fd8b901ce388d1e",
  "timestamp": "2025-05-15T01:51:31.197455"
}