{
  "id": 3511,
  "title": "Financial management, division of financial management power and financial literacy in the family context - evidence from relationship partner dyads",
  "abstract": "Purpose - The article aims to study the relationship between the assignments of financial management responsibilities and the level of financial literacy within married and cohabitating couples. Design/methodology/approach - The link between household financial management and the financial literacy of union partners was examined using dyadic survey data. In the dyadic multilevel regression analysis, the financial management process was scrutinized, and two distinct measures of financial literacy (tested and self-assessed) were used as the outcomes in the analysis. Findings - The extent to which married and cohabitating individuals engage in household financial management was found to positively correlate with their financial literacy. Self-reports about the division of financial management responsibilities were found to be biased with individuals typically overestimating their share in household financial management. Consequently, the status of household financial manager was not as crucial for financial literacy as was the self-perception of engagement in household financial management. Despite the benefits of intrahousehold labor specialization, delegation of sole responsibility for household financial matters may place the person who waives the responsibility at a serious risk of self-exclusion from lifelong financial learning. Originality/value - The article uses dyadic data (from married and cohabiting couples), which ensures more rigorous and accurate evidence for the link between the household financial management and financial literacy. A novel approach to the analytical treatment of partners' contradictory reports on the role of couple's financial manager is also proposed. The breadth of household financial management is captured by analyzing three stages of the process: proposing, decision-making and implementation of financial solutions or actions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58f5924371cb7094701c5e726c7f98d8",
  "timestamp": "2025-05-15T02:26:48.608444"
}