{
  "id": 5738,
  "title": "Financial Risk and Financial Performance: Evidence and Insights from Commercial and Services Listed Companies in Nairobi Securities Exchange, Kenya",
  "abstract": "In Kenya, the last few years has seen the performance of companies listed under the commercial and services segment on the Nairobi Securities Exchange (NSE), experience mixed fortunes. The study sought to assess the implications of financial risk on the performance of these companies. The study applied explanatory research design. The target population were the 14 companies listed under this segment of NSE. Secondary panel data contained in published annual reports for the period 2013-2017 was collected. Panel regression model was applied with the random effect model being used based on the Hausman specification test. Findings showed that credit risk had an insignificant positive effect on return on equity (ROE) while liquidity risk had a significantly negative effect on ROE and operational risk had a positive insignificant effect on ROE. The positive coefficients from the data analysis indicated that commercial and service companies at NSE were able to take in more credit to boost performance of these companies however the negative coefficients shows that within the period of study these companies experienced high liquidity problems in that the current liabilities exceeded the current assets. Thus, concluding that these companies were unable to pay all their obligation when they were due.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58fd973d712c1eed4ee9296cf46ff9bb",
  "timestamp": "2025-05-15T02:50:53.910290"
}