{
  "id": 9201,
  "title": "THE EFFECTS OF COMPLIANCE WITH INTERNAL CONTROL AND RISK MANAGEMENT SYSTEM PRINCIPLES ON OPERATIONAL PERFORMANCE OF ITALIAN",
  "abstract": "Although the scientific community has widely recognized the importance of the Internal Control and Risk Management System (ICRMS) as an internal corporate governance mechanism useful from different perspectives for the creation of business value, many conclusions are still controversial and different aspects still remain unexplored (Chalmers et al., 2019). Contrary to what is found in the US landscape, where there are numerous theoretical and especially empirical contributions on the positive relationship between the Internal Control System (Over Financial Reporting) and business (operational and financial) performance, in the European context there are still very few studies analysing the economic effects of the ICRMS. Especially the European contributions relating to the particular relationship between ICRMS and business operating performance seems almost nonexistent. The European context notoriously characterized by less enforcement of shareholder protection than those studied so far, has been recognized worthy of further study by the scientific community (Chalmers et al., 2019). Furthermore, the different legislative (Deumes and Knechel, 2008; van de Poel and Vanstraelen, 2011) and cultural connotations (Hooghiemstra et al., 2015) assumed by the internal control system in each country, which seem to play a fundamental role, force us to a national based analysis. The aim of the work is to analyse the relationship between the so-called compliance or explanation with the best practices recommended by the Corporate Governance Code relating to the ICRMS and the operational performance of Italian listed companies. The Italian context is an excellent representative example of the majority of the countries that make up the overall European panorama as it has typical characteristics, such as the principle based approach and a weak market system in protecting investors. For this purpose, an OLS regression model is implemented considering appropriate robustness control and check variables to reduce possible distortions typically present in problems relating to the relationship between corporate governance and performance. The degree of compliance with the recommendations of the Corporate Governance Code inherent to the ICRMS is broadly understood as compliance or explanation (Rose, 2016; Arcot and Bruno, 2006). It is appreciated through a constructed score. The latter provides for the implementation of a content analysis of the annual corporate governance reports of the sampled companies. The validity and reliability of the results of the related coding process are verified by appropriate tests generally used in this type of analysis (Krippendorff, 2004; Mackey and Gass, 2005). Operational performance is intended as an indicator of management's ability to make optimal choices in managing the business. Consistently with the major literature on the subject, it is measured with ROA. The reference period covers two years (2015 and 2018) in order to capture the changes in governance, albeit relative, subsequent to the main regulatory innovations regarding internal control and risk management. The work is believed to contribute to the national and international debate relating to the relationship between corporate governance and performance, compliance with the Corporate Governance Codes, the economic effects deriving from the application of the ICRMS and the consequences of reporting in scenarios dominated by the voluntary disclosure. We want to check whether the application of these recommendations aims at a substantial improvement in investor protection, an increase in the efficiency and effectiveness of management operations and the safeguarding of corporate assets as supported by the Committee of Sponsoring Organizations of the Treadway Commission (CoSO, 2013). It is also useful for policy makers, practitioners and market agent to verify whether the adoption of the recommendations of the Corporate Governance Code regarding internal controls represents a mere tick the box exercise driven by reasons for legitimizing the action of companies on the global market - as typically happens in civil law countries -(Arcot and Bruno, 2006; Zattoni and Cuomo, 2008), or is aimed at concretizing the participation of companies in the sustainable development of the economy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "58fdf80ecc529720cae5b0f008cb15ee",
  "timestamp": "2025-05-15T03:26:26.032540"
}