{
  "id": 8025,
  "title": "Exclusive Breastfeeding, Diarrhoeal Morbidity and All-Cause Mortality in Infants of HIV-Infected and HIV Uninfected Mothers: An Intervention Cohort Study in KwaZulu Natal, South Africa",
  "abstract": "Introduction: Antiretroviral drug interventions significantly reduce the risk of HIV transmission to infants through breastfeeding. We report diarrhoea prevalence and all-cause mortality at 12 months of age according to infant feeding practices, among infants born to HIV-infected and uninfected mothers in South Africa. Methods: A non-randomised intervention cohort study that followed both HIV-infected and HIV-uninfected mothers and their infants until 18 months of age. Mothers were supported in their infant feeding choice. Detailed morbidity and vital status data were collected over the first year. At the time, only single dose nevirapine was available to prevent mother-to-child transmission of HIV. Results: Among 2,589 infants, detailed feeding data and vital status were available for 1,082 HIV-exposed infants and 1,155 HIV non-exposed infants. Among exclusively breastfed (EBF) infants there were 9.4 diarrhoeal days per 1,000 child days (95% CI. 9.12-9.82) while among infants who were never breastfed there were 15.6 diarrhoeal days per 1,000 child days (95% CI. 14.62-16.59). Exclusive breastfeeding was associated with fewer acute, persistent and total diarrhoeal events than mixed or no breastfeeding in both HIV-exposed infants and also infants of HIV uninfected mothers. In an adjusted cox regression analysis, the risk of death among all infants by 12 months of age was significantly greater in those who were never breastfed (aHR 3.5, p< 0.001) or mixed fed (aHR 2.65, p< 0.001) compared with those who were EBF. In separate multivariable analyses, infants who were EBF for shorter durations had an increased risk of death compared to those EBF for 5-6 months [aHR 2.18 (95% CI, 1.56-3.01); p< 0.001]. Discussion: In the context of antiretroviral drugs being scaled-up to eliminate new HIV infections among children, there is strong justification for financial and human resource investment to promote and support exclusive breastfeeding to improve HIV-free survival of HIV-exposed and non-exposed infants.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59010a1d34feb4f16c56fc7a6a27c639",
  "timestamp": "2025-05-15T03:14:37.288734"
}