{
  "id": 2999,
  "title": "Local House Price Paths: Accelerations, Declines, and Recoveries",
  "abstract": "Mortgage credit risk measurement hinges on the choice of a house price stress path, which is used to project loan losses and determine financial capital requirements. House price paths are commonly constructed at national or state levels and shock scenarios are created to mimic historical adverse market conditions. We provide evidence that this level of geographic aggregation is not granular enough in many casescollateral risk often varies within cities. Using local house price indices that cover the United States from 1975 to 2016, we focus on house price performance in the years immediately following sustained periods of rapid acceleration. Price accelerations tend to exhibit temporal clustering and occur with greater frequency in large versus small cities. We exploit within-city variation in price dynamics to provide evidence that price initially overshoot sustainable levels but, in some areas, dynamics may reflect positive underlying economic fundamentals and can be sustained. After accelerating, price reach their trough after 4 or 5years. Small cities show uniform declines whereas large cities exhibit greater price decreases farther away from city centers. These findings suggest differential collateral risk exists in large cities, financial losses can be predictable based on real estate location theory, and localized house price paths could aid credit risk management.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5909cf716fb737be16a8d6217d65b3ae",
  "timestamp": "2025-05-15T02:21:19.286259"
}