{
  "id": 8876,
  "title": "Access to healthcare and prevalence of anxiety and depression in persons with epilepsy during the COVID-19 pandemic: A multicountry online survey",
  "abstract": "Objective: The objective of this study was to assess access to healthcare and to estimate the prevalence of depression and anxiety among persons with epilepsy (PWE) during the ongoing coronavirus disease 2019 (COVID-19) pandemic. Methods: We conducted a multicountry online survey among PWE Persons with epilepsy were invited to participate through various social media channels. The Hospital Anxiety and Depression Scale (HADS) and 9-item Patient Health Questionnaire (PHQ-9) scale were used to score anxiety and depression. Logistic regression modeling was used to investigate factors associated with anxiety and depression. Results: Three hundred ninety-nine PWE were included (mean age: 38.22 +/- 12.09 years), the majority were female (802%) and living in high-income countries (832%). Two hundred three PWE reported symptoms of a cold since January 2020. Nine (25%) of the 36 PWE tested for COVID were positive. A total of 72 PWE (19.6%) reported problems to obtain antiseizure medication (ASM), which in 25% of cases was directly COVID-related. Of the 399 PWE, 201 (50.4%) screened positive for anxiety according to the HADS; 159 (39.8%) and 187 (46.9%) PWE screened positive for depression based on the HADS and PHQ-9 scale, respectively. Female gender and financial problems were associated with both depression and anxiety. A planned follow-up consultation with the treating physician was associated with a lower risk of depression, whereas difficulties to access ASM treatment increased the odds of depression. In 65/137 (47.4%) PWE with a planned follow-up visit with the treating physician, this consultation was canceled. Conclusions: Innovative approaches are needed to ensure continuity in access to ASM treatment. Healthcare workers should ensure continued follow-up, either through inperson or telehealth appointments, to timely identify symptoms of anxiety and depression and act accordingly. (C) 2020 The Authors. Published by Elsevier Inc.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5924a485d15def1475043fb0e947745d",
  "timestamp": "2025-05-15T03:23:27.770288"
}