{
  "id": 7363,
  "title": "Social contact and the perceived impact of social distancing on health outcomes during the COVID-19 pandemic among community dwelling older adults taking part in the OPAL cohort study",
  "abstract": "BackgroundDuring the COVID-19 pandemic, social distancing and reduced social contact may have affected older adults' health.ObjectivesTo evaluate the perceived impact of social distancing on older adults' health and explore the association between social contact and health outcomes.DesignCross-sectional and longitudinal analyses of the OPAL cohort study.SubjectsCommunity dwelling older adults.MethodsWe sent questionnaires to participants of an existing cohort study (n = 4328). Questions included the amount and type of social contact, and how often they went outside. Participants rated the impact of social distancing on their health. Sociodemographic factors and quality of life were available from previous questionnaires. We examined quality of life prior to and during the pandemic and explored the cross-sectional relationship between social contact and health using logistic regression.ResultsThere were 3856/4328 (89%) questionnaires returned. EQ-5D scores changed little compared to pre-pandemic scores but 25% of participants reported their overall health had worsened. The telephone was the most used method of contact (78%). Video calls were used least with 35% of participants not using them or having no access to them. 13% of respondents never went outside. Lower levels of contact were associated with increased risk of reporting worse health (Odds ratio (OR) 1.04 (95% CI 1.01-1.08)). Those experiencing financial strain and who spent less time outside experienced the largest increase in risk of reporting perceived worsened overall health. Those reporting a strain to get by financially were 4 times more likely to report worsened health than those who described themselves as quite comfortably off (OR 4.00 (95% CI 1.86-8.16)). Participants who reported never going outside were twice as likely to report worsened health compared to those who went outside daily (OR 2.00 (95% CI 1.57-2.54)).ConclusionsLess contact with other people was associated with perceived worsening in overall health. Although many older people reported using online technology, such as video calls, a substantial proportion were not using them. Older people facing financial strain were more likely to report worsened health, highlighting the impact of social inequalities during the pandemic. Going outside less was also associated with perceived worsened health.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "592ee5355085fe0cf1c8433b00da27ae",
  "timestamp": "2025-05-15T03:08:00.721038"
}