{
  "id": 515,
  "title": "A Two-Part Beta Regression Approach for Modeling Surrenders and Withdrawals in a Life Insurance Portfolio",
  "abstract": "Beta regression is a flexible tool in modeling proportions and rates, but is rarely applied in th actuarial field. In this article, we propose its application in the context of policyholder behavior and particularly to model surrenders and withdrawals. Surrender implies the expiration of the contract and denotes the payment of the surrender value, which is contractually defined. Withdrawal does not imply the termination of the contract and denotes the payment of a cash amount, left to the discretion of the policyholder, within the limits of the surrender value. Moreover, the Actuarial Standard of Practice 52 states that, for surrender and withdrawal estimation, the actuary should take into account several risk factors that could influence the phenomenon. To this aim, we introduce a two-part Beta regression model, where the first part consists in the estimate of the number of surrenders and withdrawals by means of a multinomial regression, as an extension of the logistic regression model frequently used in the empirical literature just to estimate surrender. Then, considering the uncertainty on the amount withdrawn, we express it as a proportion of surrender value; in this way, it assumes values continuously in the interval (0,1) and it is compliant with a Beta distribution. Therefore, in the second part, we propose the adoption of a Beta regression approach to model the proportion withdrawn of the surrender value. Our final goal is to apply our model on a real-life insurance portfolio providing the estimates of the number of surrenders and withdrawals as well as the corresponding cash amount for each risk class considered.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "593c5ea1b1c42cdbae6049b886279701",
  "timestamp": "2025-05-15T00:44:21.023805"
}