{
  "id": 1844,
  "title": "Novel evolutionary multi-objective soft subspace clustering algorithm for credit risk assessment",
  "abstract": "The financial liberalization and globalization have increased the need for expert and intelligent systems to deal with credit risk management works. Clustering algorithms are widely used for knowledge acquisition in such systems to assess the credit risk from a data point of view. Conventional clustering algorithms fall short in credit risk assessment because credit datasets are typically high-dimensional, class-imbalanced, and with large sample size. To address these problems, this paper proposes a novel evolutionary multi-objective soft subspace clustering (EMOSSC) algorithm for credit risk assessment. Firstly, we develop a soft subspace clustering validity index for credit risk assessment, by which we can detect the underlying subspace for each cluster from the entire high-dimensional feature space, and we also incorporate the weight of each cluster and the between-cluster separation into the clustering validity index to obtain a comprehensive data structure in the clustering process. Secondly, we propose to optimize the clustering criteria of the new clustering validity index simultaneously by a multi-objective evolutionary algorithm without any predefined weighting coefficients, which guarantees the robustness of the algorithm. We also further provide a local search strategy which significantly accelerates the convergence of the algorithm. Thirdly, we design a GPU-based parallel computation framework for updating the weights of features in our proposed algorithm to improve the computational efficiency on credit datasets with large sample size. Finally, we conduct a comprehensive experiment, with its results demonstrate the superiority of our proposed algorithm in credit risk assessment. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "593d4490068a376003b66828d5acfe24",
  "timestamp": "2025-05-15T02:08:03.976121"
}