{
  "id": 3026,
  "title": "Mapping fear in financial markets: Insights from dynamic networks and centrality measures",
  "abstract": "Investor sentiment, particularly fear sentiment, significantly influences financial markets by increasing uncertainty and triggering extreme judgments during volatile periods. This study delves into the impact of fear sentiment on market dynamics and interdependencies between various financial assets, focusing on implied volatility indices for stocks, oil, gold, foreign currency, and bonds. The COVID-19 pandemic created an unprecedented economic shock in 2020, necessitating an examination of how fear sentiments propagated across these assets during times of crisis. By analyzing network dependencies and centralities, this research provides novel insights into financial market fear spillovers. It distinguishes itself by employing implied volatilities instead of historical volatilities and investigating these dynamics during the pandemic. The fear indices, specifically stock and Eurocurrency (stock and gold), exhibited the highest dependency effects during COVID-19 (Russia-Ukraine war), with clustering effects among these indices. We notice also that stock and Eurocurrency (Stock and gold) played a central role in connecting various fear indices, during extreme market conditions. The study also uncovers time-varying dependencies among the fear indices of the considered variables in this study, offering a comprehensive understanding of how extreme events like the pandemic impact financial market fear. This research contributes to the literature on financial market interdependencies during periods of fear, helping investors and policymakers make informed decisions about asset allocation, policy development, and risk assessment in times of financial distress.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "593ef41b6eec9af12de3cc5991fbfdb8",
  "timestamp": "2025-05-15T02:21:52.175953"
}