{
  "id": 7654,
  "title": "Exploratory study of geographic segment reporting practices of multinationals operating in CEE",
  "abstract": "It is generally considered that countries are competing for attracting investments of multinational corporations (MNC) due to their expected positive effects on the local business environment. But how transparent are MNC in reporting financial information regarding the various countries where they operate? By compiling an original dataset of MNC subsidiaries from Central and Eastern Europe (CEE), this study aimed to determine if MNC report individual country segments for their foreign operations and to identify the factors that influence their segmentation practices. Descriptive statistics and binary logistic regression analyses were conducted in order to assess geographic segment reporting practices of MNC during 2011-2015 period. It was found that decision of country segment reporting is most likely influenced by a sum of company-related and country-related factors, such as size of operations, overall segmentation policy of reporting entity, market valuation of MNC, and risk ratings of operating countries. This innovative approach of studying subsidiary - parent company relationship reveals a tendency of secrecy in geographic reporting practices of MNC and indicates that more geographic segment requirements may increase the level of disclosure. Useful in decisions about the future of country-by-country reporting, this study highlights the attitude of MNC towards country level disclosure.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "594d7507560c8e40b2c6ff2fc6249c97",
  "timestamp": "2025-05-15T03:10:33.122417"
}