{
  "id": 7368,
  "title": "Relative associations of cattle movements, local spread, and biosecurity with bovine viral diarrhoea virus (BVDV) seropositivity in beef and dairy herds",
  "abstract": "The success of bovine viral diarrhoea virus (BVDV) eradication campaigns can be undermined by spread through local transmission pathways and poor farmer compliance with biosecurity recommendations. This work combines recent survey data with cattle movement data to explore the issues likely to impact on the success of BVDV control in Scotland. In this analysis, data from 249 beef suckler herds and 185 dairy herds in Scotland were studied retrospectively to determine the relative influence of cattle movements, local spread, and biosecurity on BVDV seropositivity. Multivariable logistic regression models revealed that cattle movement risk factors had approximately 3 times greater explanatory power than risk factors for local spread amongst beef suckler herds, but approximately the same explanatory power as risk factors for local spread amongst dairy herds. These findings are most likely related to differences in cattle husbandry practices and suggest that where financial prioritization is required, focusing on reducing movement-based risk is likely to be of greatest benefit when applied to beef suckler herds. The reported use of biosecurity measures such as purchasing cattle from BVDV accredited herds only, performing diagnostic screening at the time of sale, implementing isolation periods for purchased cattle, and installing double fencing on shared field boundaries had minimal impact on the risk of beef or dairy herds being seropositive for BVDV. Only 28% of beef farmers and 24% of dairy farmers with seropositive herds recognized that their cattle were affected by BVDV and those that did perceive a problem were no less likely to sell animals as replacement breeding stock and no more likely to implement biosecurity measures against local spread than farmers with no perceived problems. In relation to the current legislative framework for BVDV control in Scotland, these findings emphasize the importance of requiring infected herds take appropriate biosecurity measures to prevent further disease transmission and conducting adequate follow-up to ensure that biosecurity measures are being implemented correctly in the field. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "595fb040ee301546beb5b7935fa6c5bd",
  "timestamp": "2025-05-15T03:08:00.743181"
}