{
  "id": 3289,
  "title": "Entrepreneurial exit by acquisition: the impact of heterogeneity in products and technology portfolio and marketing capabilities",
  "abstract": "Purpose This paper aims to study the effect of two important marketing decisions on the extent of value capturing by the firm owners. First, it addresses the debate whether acquirers of young technology-based firms value targets that span multiple technology and market categories indicating multiples options for growth or prefer more narrowly defined targets with a clear product and market focus. Second, it investigates to what extent the use of alliances for marketing purposes contributes to value capturing and how they moderate the effect of diversification of technology and marketing. Design/methodology/approach To estimate the acquisition price, a linear regression model is used, including a Heckman correction controlling for the likelihood of being acquired. The hypotheses are tested in a sample of British venture capital backed firms. Findings Firms that convey focus in their marketing activities (either because they focus on a few market categories or because they rely on downstream alliance to market their inventions) receive higher valuations at acquisition than those that diversify. Further, also the size of the product portfolio is negatively correlated to the acquisition price. Finally, the results reveal that firms with a broad patent portfolio can reduce the negative effects on firm value by engaging in less downstream alliances. Originality/value This paper advances existing research on exit strategies for entrepreneurial firms by considering factors explaining acquisition prices, instead of acquisition probabilities. Further, it adds the categorization research by demonstrating how acquirers respond to complex combinations of technology and market categories.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "596a088e4270cf2762a373f5f684063e",
  "timestamp": "2025-05-15T01:15:26.210675"
}