{
  "id": 7978,
  "title": "OPTION PRICING USING STOCHASTIC VOLATILITY MODEL UNDER FOURIER TRANSFORM OF NONLINEAR DIFFERENTIAL EQUATION",
  "abstract": "The purposes are to solve the option pricing problem in financial derivatives and provide a practical basis for reducing the risk rate of the financial market. First, the classification of fractal theory and option pricing is outlined, the connotation of stochastic volatility is analyzed, and a stochastic volatility model is established. According to the Fourier transform and nonlinear differential equation, the pricing method in the volatility swap process and the pricing method of volatility derivatives are analyzed. Finally, the option pricing parameters are set, and the Origin 75 software is employed to visually analyze the mathematical results. The forward prices under stochastic volatility are compared monthly and weekly, and the resulted values are all close to 235. There is a gap between the forward prices of each month and each quarter, and the difference between the forward prices of each quarter is large, close to 50. The average relative percentage errors (ARPEs) within and out of the sample calculated by the stochastic volatility model are close to 16%, and the error gaps between different monetary intervals are also large. With the increase in strike price, the change rate of options under the random volatility model is faster than that of options under VIX index. When the strike price increases to 0.6, the two options are equal. The fitting trend of the stochastic volatility model for implied volatility at different maturity dates first decreases and then tends to a fixed value. The implied volatility of the 60-day-expiring option has changed significantly, showing a trend of increasing first and then tending to a fixed value (0.8). In contrast, the implied volatility of the 90-day-expiring option and the 120-day-expiring option almost have no change. When w (fractional operator) takes 1 and Y takes 1.6 and 1.3, the solution to the stochastic volatility model is consistent with that to the classic CGMY model. When w takes 1, the stochastic volatility model has the same solution as the classic CGMY and BS models. As the fractional order of time increases, the trend of asset price changes becomes smaller.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59753a08d84344e31a04b8cffa346f5c",
  "timestamp": "2025-05-15T03:14:07.181931"
}