{
  "id": 663,
  "title": "Defensive financial decisions support for retailers in Greek pharmaceutical industry",
  "abstract": "In this paper, we present a decisions support solution designed for Greek pharmacies comprising a cash flow management system for early warning of financial distress and a financial advisor based on a neural network. The cash flow monitoring system integrates accounting elements with real time transactions and a predictive linear regression model while the decision support module is developed with the help of a neural network. For any given business unit the system associates accounting entries with information about credit times to reflect the precise instants of cash flows and using inflows/outflows equations monthly, eventually build its liquidity curve and cash flow balance over time. Alongside, a linear regression module is introduced to estimate future cash reserves based on past profitability ratios. Lastly, combining the power of artificial neural networks with expertise in this sector of pharmaceutical business, the financial decision support tool focuses on the retailers that face financial difficulties and suggests alternative solutions for escaping from distress and insolvency. The model has an ambitious and useful purpose, to inform and consult the owners of the business units and other members of the pharmaceutical chain, thus reduce financial risk for the chain.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "597995a83af70cbad311ff6b94e37d03",
  "timestamp": "2025-05-15T01:53:59.283245"
}