{
  "id": 7459,
  "title": "Understanding student radiographer attrition: Risk factors and strategies",
  "abstract": "Introduction: Diagnostic student radiographer attrition is reported at 14%, 6% higher than the average for higher education, however, little research has been undertaken on this subject. This study explored risk factors for attrition and strategies that enabled these to be overcome. Methods: A two-phase study was undertaken. Phase one: data for 579 former student diagnostic radiographers (468 completers and 111 non-completers) from 3 English universities were analysed. Logistic regression was used to estimate odds ratios and 95% confidence intervals for completion based on individual characteristics. Phase two: content analysis of data from an online survey of 186 current UK student diagnostic radiographers exploring their experiences was undertaken. Results: Phase one: Attrition was 19%. Increased age, non A-level entry qualifications and poor academic performance were predictors of attrition (p < 0.005). Phase two: Challenges reported by groups identified as 'at risk' showed that for mature students and those with non-traditional entry qualifications, external responsibilities/pressures and financial pressures were likely to be the greatest cause of attrition and for younger students with traditional qualifications, academic difficulty and excessive workload were most significant. Scientific learning and academic writing were identified as the most common academic difficulties by all groups. Poor mental health may also be a risk factor. Conclusion: Although characteristics were identified that increased the chance of attrition, the study concluded that attrition is most likely to be multi-factorial. Academic and personal support were identified as key in students continuing their studies when they considered leaving. Clinical placement experience is likely to influence continuation decisions. Implications for practice: Transparency around course expectations and academic requirements together with ensuring high quality clinical placements may assist in reducing attrition. (C) 2019 The College of Radiographers. Published by Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "597fa1634dd29875a62b15f49df5cab7",
  "timestamp": "2025-05-15T03:08:37.988004"
}