{
  "id": 1889,
  "title": "Deep-Learning-Based Detection of Segregations for Ultrasonic Testing",
  "abstract": "Ultrasonic testing (UT) has been used in the industry for many years to successfully detect internal defects in bulk material. This study focuses on the inspection of materials made out of the superalloy IN718 which is often used for manufacturing turbine components. A recent accident in 2016 with a turbine engine failure led to the incorporation of a new type of defect into the portfolio of defect types that UT might be able to detect. This defect called discrete Clean White Spot Segregation poses new challenges to the conventional UT due to its very different material characteristic in comparison to traditional defects such as cracks or voids. Its reliable detection in an industrial setup remains unsolved and requires new nondestructive techniques. To our best knowledge, our work is the first study that uses deep learning techniques in combination with conventional UT for the detection of this kind of defect. For the new approach presented in this article, artificial defects with similar material characteristics as real ones are defined and successfully manufactured. Then a Recurrent Convolutional Neural Network with Attention and Spectral representations (RCAS) is trained and compared with a convolutional neural network and the conventional UT. In the executed experiments, RCAS proves its superior capability of detection with an AUC(ROC)=0.93 in comparison to conventional UT with an AUC(ROC)=0.16 over the course of six measurements with three different types of ultrasonic probes.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "598d53c552138c18e755db4569fd258f",
  "timestamp": "2025-05-15T01:00:27.448942"
}