{
  "id": 3177,
  "title": "Digital Innovation Hubs and portfolio of their services across European economies",
  "abstract": "Research background: Digital ecosystems in Europe are heterogenous organizations involving different economies, industries, and contexts. Among them, Digital Innovation Hubs (DIHs) are considered a policy -driven organization fostered by the European Commission to push companies' digital transition through a wide portfolio of supporting services. Purpose of the article: There are DIHs existing in all European economies, but literature needs more precise indications about their status and nature. The purpose is to study a distribution of DIHs and differences in portfolios of DIHs' services across European economies. Therefore, the paper wants to deliver more precise data on effects on national and European policies. This is required to define their final role and scope in the complex dynamics of the digital transition, depending on regional context and heterogeneity of industries. Methods: Data on 38 economies was collected from the S3 platform (on both existing and in preparation DIHs) and further verified by native speaking researchers using manual web scrapping of websites of DIHs identified from S3. To find potential similarities of digital eco- systems in different economies as emanated by the existence of DIHs, clusterization (Ward's method and Euclidean distances) was applied according to the services offered. Economies were clustered according to the number of DIHs and the spread of DIHs intensity in different cities. The results were further analyzed according to the scope of the provided services. Findings & value added: The applied clustering classified European economies in four dif- ferent sets, according to the types of services offered by the DIHs. These sets are expression of the different digitalization statuses and strategies of the selected economies and, as such, the services a company can benefit from in a specific economy. Potential development-related reasons behind the data-driven clustering are then conjectured and reported, to guide compa- nies and policy makers in their digitalization strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59942d63a8e2dc5692f0c2f4a3931d40",
  "timestamp": "2025-05-15T01:14:16.264630"
}