{
  "id": 3248,
  "title": "Linkage between Financial Inclusion and Economic Growth: An Empirical Study of the Emerging Indian Economy",
  "abstract": "Inclusive financial system is a key to sustainable development and growth of a nation wherein all segments of the society have timely access to financial services at an affordable cost. It facilitates safe custody of savings, availability of loan for multiple purposes, diversification of risk through investment in different avenue, coverage of risk through various insurance products, etc., which make the life of people easier and comfortable. Therefore, inclusive finance leads to prosperity and economic growth by eliminating or minimizing poverty, unequal distribution of income and dominance of indigenous bankers. Financial inclusion is not a single dimension that can be achieved directly; rather, it is a process which completes after different dimensions such as access to and usage of financial services and banking penetration are accomplished. The present study considers three main dimensions of financial inclusion: usage, penetration and accessibility. The purpose is to observe how financial inclusion is linked with economic growth in India. Spread over 2005 to 2017, the study uses Bayesian vector auto-regression model to explore the linkage of economic growth with financial inclusion and its different dimensions (accessibility, penetration, and usage). The findings show a considerable relationship between economic growth and the usage dimension of financial inclusion in India. As far as financial inclusion index is concerned, it does not explain economic growth significantly. This study is based on recent data extracted from IMF and World Bank databases. The study is useful for policymakers and banks to frame appropriate policies to achieve complete financial inclusion that would lead to a robust growth of an economy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59987df4fab0edf84a2ad180a7e75dee",
  "timestamp": "2025-05-15T02:24:05.216692"
}