{
  "id": 73,
  "title": "Real-Time Pricing and Hedging of Options on Currency Futures with Artificial Neural Networks",
  "abstract": "High-frequency trading and automated algorithm impose high requirements on computational methods. We provide a model-free option pricing approach with neural networks, which can be applied to real-time pricing and hedging of FX options. In contrast to well-known theoretical models, an essential advantage of our approach is the simultaneous pricing across different strike prices and parsimonious use of real-time input variables. To test its ability for the purpose of high-frequency trading, we perform an empirical run-time trading simulation with a tick dataset of EUR/USD options on currency futures of 4 weeks. In very short non-overlapping 15-minute out-of-sample intervals, theoretical option prices derived from the Black model compete against nonparametric option prices through two different neural network topologies. We show that the approximated pricing function of learning networks is suitable for generating fast run-time option pricing evaluation as their performance is slightly better in comparison to theoretical prices. The derivation of the network function is also useful for performing hedging strategies. We conclude that the performance of closed-form pricing models depends highly on the volatility estimator, whereas neural networks can avoid this estimation problem but require market liquidity for training. Nevertheless, we also have to take particular enhancements into account, which give us useful hints for further research and steps. Copyright (c) 2014 John Wiley & Sons, Ltd.",
  "year": 2014,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59a3744121e0954db96825ed48d69b13",
  "timestamp": "2025-05-15T01:28:03.911223"
}