{
  "id": 3799,
  "title": "Capturing features of hourly-resolution energy models in an integrated assessment model: An application to the EU27 region",
  "abstract": "Hourly resolution is essential to realistically address the matching of supply and demand for fluctuating energy sources like solar and wind. This work introduces a novel method to model energy variability in an Integrated Assessment Model building upon a previous work, where regression analysis was utilized to extract hourly -level information from an energy system model. The enhancements include: (1) improved experimental design and more efficient computing, and (2) modelling the management of variability in an integrated assessment model by (i) incorporating a portfolio of flexibility options, and (ii) offering the ability to regulate system curtailment by limiting the expansion of renewables. The scenarios focus on the electricity sector, mirroring current EU27 ' s policies that aim for higher renewable energy and electrification contributions by 2050. Without any variability control measures, significant curtailment (up to 60 %) is observed, the introduction of flexibility options reducing it to half (30 %). Controlling the capacity expansion of renewables is introduced to avoid this unrealistically high curtailment, allowing the model to achieve a penetration of renewables in electricity of 80 % and a 53 % reduction in greenhouse gas emissions compared to 2015 levels in the electricity system. In conclusion, the methodology employed yields broadly consistent outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59a9ddefdbf87a828296c0fbd9a1338d",
  "timestamp": "2025-05-15T01:21:08.048913"
}