{
  "id": 3879,
  "title": "Sectoral Response to Economic Policy Uncertainty in Japan: An Empirical Evidence from the Cross-Quantilogram Approach",
  "abstract": "The purpose of this study is to investigate the responses of sector economic activity of the Japanese stock market to Economic Policy Uncertainty (EPU). To investigate this relationship, we take monthly data covering ten sectors of Japan's economy and the EPU index spanning from January 2000 to January 2024. For the empirical analysis, we used a recently introduced approach, namely Cross-Quantilogram (CQ), and Quantile-on-Quantile Regression (QQR) for the robustness of the estimation output. Our findings indicate that EPU transmits negative and positive shocks to the Japanese sectors from bearish to bullish market states. Surprisingly, at the bearish state, we find that sector stocks respond negatively to the higher quantiles of EPU under short memory. Moreover, we also observed that EPU transmits a weak positive signal to sectors at medium quantiles. Similarly, we report a less pronounced effect of EPU on different sectors considering different memories (quarterly, bi-annual, and annual). Furthermore, our findings indicate that some sectors could serve as diversifiers in normal market conditions and are considered to be safe-haven against the EPU in bearish periods of economic activity. Our research has profound implications for portfolio managers, policy makers, and investors in terms of ensuring proactive strategies and regulatory measures.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59ba2b9ae1909b0e3166bab9716d8c10",
  "timestamp": "2025-05-15T01:21:41.409901"
}