{
  "id": 7301,
  "title": "Sensitivity of bank profitability to changing in certain internal and external variables: the case of Bosnia and Herzegovina",
  "abstract": "Banking profit plays a very crucial role in terms of providing a base for internal growth as well as a signal for additional borrowing. Profit is also a source for dividend payments to shareholders and expectations for future dividend payments. This research includes all banks in Bosnia and Herzegovina and testing endogenous and exogenous variables on bank profitability indicators. In addition to credit risk, the profitability of banks in B&H is also influenced by the financial result of operations, which is determined by price and interest rate risk. The primary goal of this paper is to attempt to identifying and recognizing the factors affecting the profitability of banks operating in Bosnia and Herzegovina. Therefore, this research focuses on the determinants of banking sector profitability that can be divided into two groups, namely: internal and external factors. The research period covered the years from 2007q1-2019q4 on a quarterly database. The total number of observations was 52. The paper included the OLS regression model (FE model) and the random-effects GLS model. Both models were appropriate for the obtained results through the Hausman test. The results showed that the significant influence on the dependent variables were the return on asset (ROA) and return on equity (ROE), which has been achieved by the following independent variables, such as the growth rate of net profit/loss, cost to income ratio and the growth rate of gross domestic product.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59c32142c2f02a06203dc6dd8d4aaf8e",
  "timestamp": "2025-05-15T03:07:02.691230"
}