{
  "id": 4949,
  "title": "FINANCIAL SOURCES AND FIRMS' INNOVATION OUTPUTS: ANALYSIS OF JASDAQ MARKET",
  "abstract": "The consensus that innovation is an essential strategy for firms, which aim to competitively survive over the long term, motivates growing literature to understand the drivers of firms' innovation outputs. It is widely acknowledged that access to financial sources is fundamentally important for the survival of innovative firms. The lack of financial support may prevent the firms from entirely pursuing innovation activity and producing innovative outputs. However, this is rarely addressed in the finance literature. Focusing on both types of financing sources (internal and external), this study investigates their influence on firms' innovation outputs. Leveraging on the spirit in Pecking Order Theory, this study proposes that firms adopt a hierarchy between types of financing from internal or self-financing to external, starting from low risk to risky debts and followed by the issuance of shares on their efforts in financing innovation and producing the outputs. Poisson regression results, using a sample of 113 manufacturing firms listed in JASDAQ market of the Tokyo Stock Exchange, revealed that both financing sources (internal and external) are important in driving volume and value of firms' innovation outputs. However, the reliance of firms on self-generated financing conquers. This study, using patent-based data (application, publication, citation) to estimate firms' technology outputs, also finds the complementary power of debt financing as an important financial source, particularly when firms' internal financing source has exhausted. The findings of this study offer support to the assertion in the Pecking Order Theory concerning the risk inherited in the different financing sources.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59c4fdad70f0608e1ef81d669d27f0c3",
  "timestamp": "2025-05-15T02:42:36.226745"
}