{
  "id": 2909,
  "title": "Safety Analysis of High-Dimensional Anonymized Data from Multiple Perspectives",
  "abstract": "Recently, large-scale data collection has driven data utilization in the medical, financial, advertising, and several other fields. This increasing use of data necessitates privacy risk considerations. K-anonymization and other anonymization methods have been used to minimize data privacy risks, but they are unsuitable for large and high-dimensional datasets required in machine learning and other data mining techniques. Although subsequent methods such as matrix decomposition anonymization can anonymize high-dimensional data while maintaining a high level of utility, they do not clarify anonymized data safety or adequately analyze privacy risks. Therefore, in this study, we performed a multi-perspective analysis on the privacy risks of datasets anonymized with some anonymization methods using various safety metrics. In addition, we propose a new technique for evaluating privacy risk for each attribute of anonymized data. Experimental results showed that our method effectively analyzed privacy risks of high-dimensional anonymized data. Furthermore, our evaluation of the resistance to data re-identification using existing techniques showed that anonymization methods have their suitable attack types, and it is important to assess data safety using various metrics before publishing.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59cff0dae2ad7a718a0643df9cb538d7",
  "timestamp": "2025-05-15T02:20:16.996256"
}