{
  "id": 6597,
  "title": "Does Structural Capital Affect SDGs Risk-Related Disclosure Quality? An Empirical Investigation of Italian Large Listed Companies",
  "abstract": "In a context of widespread acceptance and implementation of the United Nations Sustainable Development Goals (SDGs), this paper discusses the possible relationship between intellectual capital (IC) and nonfinancial information (NFI), particularly related to SDGs and corporate social responsibility (CSR) in a stakeholder engagement perspective. Prior studies called for further investigation about nonfinancial risk disclosure and claimed that companies mandated to disclose risk-related information tend to focus mainly on financial risks. Therefore, given the growing attention of regulators to the content of mandatory companies' NFI brought to the Directive 2014/95/EU, this study intends to contribute to fill this literature gap by investigating the drivers of risk-related disclosure quality (RDQ) and to what extent it could be affected by the structural capital (SC), as one of the components of IC. The empirical analysis is based on a sample made of 51 Italian large undertakings and groups. The study uses content analysis to assess the RDQ from firms' corporate reports. Regression analysis is used to examine if there is an influence of SC toward RDQ, both considered as a single information package and with specific reference to environmental disclosure. Results reveal that a positive association exists between RDQ and SC. Moreover, it is providing some support for the positive correlation between SC and the firm's size. In this sense, the paper contributes to existing risk reporting literature as a pioneering study identifying an IC driver to determine the quality of risk and risk management information. For regulators, this study highlights how, in a context of mandatory disclosure, the quality of information could also depend on firm characteristics (SC). For practitioners, the paper helps in understanding the role of IC in order to increase the quality of the corporate risk reporting.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "59d7b9c2eb9e7e0a465c5ca092339c72",
  "timestamp": "2025-05-15T02:59:37.081779"
}