{
  "id": 4304,
  "title": "Social interactions and mutual fund portfolios: the role of alumni networks in China",
  "abstract": "Purpose This paper aims to investigate the influence of social interactions on mutual fund portfolios from the perspective of alumni network in China. Design/methodology/approach Based on a data set that consists of 162 actively managed equity funds in China during the time period of 2003-2014, this study employs multiple linear regression model to control for organization- and location-based interpersonal connections as well as other confounding factors and clarify the causality relationship between alumni networks of mutual fund managers and their portfolios. Findings After controlling for organization- and location-based interpersonal connections, we find that mutual fund managers who graduated from the same college/university have more similar stock holdings and are more likely to buy or sell the same stocks contemporaneously. As a result, alumni managers exhibit a higher correlation of fund returns. Moreover, the effect of alumni relationship on mutual fund investments becomes weaker when more managers are connected within the network. We also find that valuable information is shared among alumni managers: (1) the average returns for the alumni common holdings portfolios is significantly higher than those for non-alumni holdings portfolios and (2) a long-short strategy composed of stocks purchased minus sold by alumni managers yields positive and significant risk-adjusted returns. Practical implications The findings suggest that information dissemination among connected fund managers could be one of the driving forces for mutual fund herding behavior, and that a portfolio of funds whose managers are educationally connected could be highly exposed to certain stocks and risks. Originality/value This paper contributes to the growing finance literature addressing the influence of personal connections on information dissemination that specifically contributes to price formation. It corresponds more closely to Cohen et al. (2008), who investigate college alumni connections between fund managers and corporate board members. Since the authors simultaneously examine three potentially overlapped social networks, which are based on education, locality and fund family, the authors are able to disentangle their effects on fund managers' investment decisions. Moreover, the findings suggest that institutional investors make investment decisions based on share private information, and therefore, it also contributes to the literature on fund herding behaviors (Grinblatt et al., 1995; Wermers, 1999).",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a0bced7317bbed190475c3a7b5c0f2a",
  "timestamp": "2025-05-15T01:25:50.499985"
}