{
  "id": 577,
  "title": "Ancient DNA reveals phenological diversity of Coast Salish herring harvests over multiple centuries",
  "abstract": "Phenological diversity in food resources prolongs foraging opportunities for consumers and buffers them against environmental disturbances. Such diversity is particularly important in forage fish such as Pacific herring (Clupea pallasii), which are foundational to coastal food webs and fisheries. While the importance of phenological diversity is well-known from contemporary studies, the extent to which different populations contribute to fisheries over long time scales is mostly unknown. In this study, we investigated the relative contributions of genetically and phenologically distinct herring populations to Indigenous Peoples' food systems over multiple centuries, using ancient DNA extracted from archaeological herring bones. These bones were excavated from two Coast Salish archaeological sites (Burton Acres Shell Midden and Bay Street Shell Midden) in the Puget Sound region, USA. Using genetic stock identification from seven nuclear DNA markers, we showed that catches at the two sites in central Puget Sound were dominated by January-February and March-April spawners, which are the contemporary spawning groups in the vicinity of the sites. However, May spawners were detected in the older Burton Acres assemblage (dated to 910-685 cal BP), and a mixed stock analysis indicated that catches at this site consisted of multiple populations. These results suggest that Coast Salish ancestors used a portfolio of herring populations and benefited from the ecological resource wave created by different spawning groups of herring. This study of ancient DNA allowed us to glimpse into Indigenous traditional food and management systems, and it enabled us to investigate long-term patterns of biodiversity in an ecologically important forage fish species.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a0e61325aaf55111edb8f4748cc7919",
  "timestamp": "2025-05-15T00:37:38.178296"
}