{
  "id": 8448,
  "title": "The effects of economic deprivation on psychological well-being among the working population of Switzerland",
  "abstract": "Background: The association between poverty and mental health has been widely investigated. There is, however, limited evidence of mental health implications of working poverty, despite its representing a rapidly expanding segment of impoverished populations in many developed nations. In this study, we examined whether working poverty in Switzerland, a country with substantial recent growth among the working poor, was correlated with two dependent variables of interest: psychological health and unmet mental health need. Methods: This cross-sectional study used data drawn from the first 3 waves ( 1999 - 2001) of the Swiss Household Panel, a nationally representative sample of the permanent resident population of Switzerland. The study sample comprised 5453 subjects aged 20 - 59 years. We used Generalized Estimating Equation models to investigate the association between working poverty and psychological well-being; we applied logistic regression models to analyze the link between working poverty and unmet mental health need. Working poverty was represented by dummy variables indicating financial deficiency, restricted standard of living, or both conditions. Results: After controlling other factors, restricted standard of living was significantly ( p <.001) negatively correlated with psychological well-being; it was also associated with approximately 50% increased risk of unmet mental health need ( OR = 1.55; 95% CI 1.17 - 2.06). Conclusion: The findings of this study contribute to our understanding of the potential psychological impact of material deprivation on working Swiss citizens. Such knowledge may aid in the design of community intervention programs to help reduce the individual and societal burdens of poverty in Switzerland.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a1ffdab3a4e01eebfd1e44c2bb7ed33",
  "timestamp": "2025-05-15T03:18:51.680354"
}