{
  "id": 5326,
  "title": "The Impact of Non-financial factors on Prosperity of Slovak agriculture sector",
  "abstract": "Slovak agriculture sector passed during the last decade a period of substantial changes and dynamics, caused by the Common Agriculture Policy assessment in 2004, new political regulations and quotas, unstable market and climate conditions, or crisis influence in 2009. These events have undoubtedly influenced the overall financial and economic situation of Slovak agriculture producers, as well as their ability to lead prosperous businesses. Generally, the Slovak agriculture tends to be low profitable, unstable and risky sector. It can be subjected to several reasons and factors affecting the production, income, and welfare. In the previous studies several authors focused on identification of financial ratios that decide about successful performance of businesses, and determined their critical values. Moreover, there were constructed classification and prediction models of financial distress. The financial factors impact on the financial distress in the case of Slovak agriculture companies has been analysed in the scientific papers of Chrastinova (1998), Gurcik (2002), Bielikova et al. (2014), and others. However, only a few authors paid attention to the non-financial factors. Therefore, the sufficient evidence of their impact on agriculture companies ' prosperity is missing. There are factors in the agriculture that may not be influenced by the producers themselves, such as climate conditions and weather. However, we assume that number of decisions made by farmers can lead to more effective production, profitability and risk elimination. In the previous studies was investigated mainly the impact of legal form, organisational and size structure on the performance of farms (Lancaric et al., 2013; Ciaian et al., 2009; Kopta, 2013). Generally, the non-financial factors impact on different businesses was emphasised in the works of Cumby and Condor (2001), Khizer et al. (2011) and others. We decided to extend the previous studies and investigate, what are the key factors of prosperity, except of the financial results and ratios. The analysis will be applied on the 842 farms operating during each year of the period 2009-2012 in all regions of Slovakia. We will create sample of prosperous and unprosperous companies and analyses them according to their legal form, production orientation, size of utilized agriculture area UAA (LPIS) and number of owners and employees. With the use the linear discriminant analysis and decision trees we will try to find the non-financial factors, which determine the successful performance of farms in agriculture primary sector. The main objective of the paper is to examine and evaluate the non-financial factors ' impact on prosperity of Slovak agriculture companies.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a36525d428229638c8aa41becc34eda",
  "timestamp": "2025-05-15T02:46:44.873841"
}