{
  "id": 4126,
  "title": "Heart Failure Association of the European Society of Cardiology Quality of Care Centres Programme: design and accreditation document",
  "abstract": "Heart failure (HF) is the major contributor to cardiovascular morbidity and mortality. Given its rising prevalence, the costs of HF care can be expected to increase. Multidisciplinary management of HF can improve quality of care and survival. However, specialized HF programmes are not widely available in most European countries. These circumstances underlie the suggestion of the Heart Failure Association (HFA) of the European Society of Cardiology (ESC) for the development of quality of care centres (QCCs). These are defined as health care institutions that provide multidisciplinary HF management at all levels of care (primary, secondary and tertiary), are accredited by the HFA/ESC and are implemented into existing health care systems. Their major goals are to unify and improve the quality of HF care, and to promote collaboration in education and research activities. Three types of QCC are suggested: community QCCs (primary care facilities able to provide non-invasive assessment and optimal therapy); specialized QCCs (district hospitals with intensive care units, able to provide cardiac catheterization and device implantation services), and advanced QCCs (national reference centres able to deliver advanced and innovative HF care and research). QCC accreditation will require compliance with general and specific HFA/ESC accreditation standards. General requirements include confirmation of the centre's existence, commitment to QCC implementation, and collaboration with other QCCs. Specific requirements include validation of the centre's level of care, service portfolio, facilities and equipment, management, human resources, process measures, quality indicators and outcome measures. Audit and recertification at 4-6-year intervals are also required. The implementation of QCCs will evolve gradually, following a pilot phase in selected countries. The present document summarizes the definition, major goals, development, classification and crucial aspects of the accreditation process of the HFA/ESC QCC Programme.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a4953aa58c0c2a1523fc0b0d92fd39a",
  "timestamp": "2025-05-15T01:23:58.122825"
}