{
  "id": 8568,
  "title": "Spurring entrepreneurship with public venture capital in developing industries - evidence from Hungary",
  "abstract": "PurposeVenture capital (VC) is an essential element in healthy entrepreneurial environments; therefore, many countries in developing entrepreneurial economies support the industry via direct or indirect government interventions. The purpose of this study is to examine through the example of the Hungarian market, whether direct or hybrid state involvement has contributed more to the growth of the invested enterprises. The findings are relevant in the design of government VC schemes and in the contracts mitigating the moral hazards inherent in government funding. Design/methodology/approachThe basis of empirical research is a unique hand-collected database covering Hungarian government-backed VC (GVC) investments. Based on the financial data of investee firms, the authors investigate whether firms financed by hybrid VC involving market participants are able to outperform firms that receive pure public financing using panel regression. FindingsBased on Hungarian evidence, hybrid VC-backed firms generated lower growth and employment than their purely government-backed peers. Both schemes showed meagre innovation activity. The conclusion is that because of the conflict of private and economic policy objectives in hybrid financing, the exposure of hybrid risk capital to moral hazard is higher than that of pure public financing. Private interests in hybrid funds can only improve investment efficiency if they are structured along the lines of market-based independent financial intermediation and the contracts imitate the ones existing amongst limited and general partners in private schemes. Research limitations/implicationsThe research covers the data of Hungarian government-backed firms by tracking the full range of 86 investments made in the purely government scheme and 340 firms that received funding in the hybrid scheme. The research focuses on two government initiatives, and the results are influenced by the specific regulation of the programs; therefore, the results cannot be generalized for all government agendas; they are indicative in the designs of the agendas. Originality/valueThere is a limited number of empirical studies investigating the impact of VC in developing markets, especially in the Central and Eastern Europe region. This firm-level research on the impact of public VC can help improve the effectiveness of development policies. By analysing the entirety of investments of a VC program that is near to its completion, the authors provide new insight into the efficiency and prospects of GVC schemes in the region.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a5351a147cfc7fd6cee7e05cba289c6",
  "timestamp": "2025-05-15T03:20:22.147650"
}