{
  "id": 5670,
  "title": "Freight rate index forecasting with Prophet model based on multi-dimensional significant events",
  "abstract": "The Baltic Dry Index (BDI) is an essential index to measure international dry bulk shipping freight, which can reflect global economic changes to a certain extent. Accurate forecasting of BDI supports shipping market participants in grasping risks and making scientific decisions. Based on the Prophet model, this paper considers the impact of multi-dimensional significant events related to the shipping industry and conducts BDI forecasting research. Firstly, we simulate the most momentous events in the world in recent years, namely the 2008 Global Financial Crisis and the 2019 New Crown Epidemic, and utilize the Prophet model to decompose the BDI sequence into three parts: trend, seasonality, and momentous event shocks. Secondly, we extensively collect other multi-dimensional significant event uncertainty indexes to establish a significant event database. The Maximal Information Coefficient and Boruta methods were employed to extract the uncertainty index particularly correlated with BDI as an exogenous variable for forecasting. Then, we employ the K-Shape method to cluster exogenous variables and explore the combined sense of clustering. Finally, we utilize the Prophet model to forecast BDI in stages. It discusses the influence of exogenous variables and their cluster combinations on the forecasting effect individually and sequentially. Empirical results show that considering the two momentous events of the Financial Crisis and COVID-19 can remarkably improve the accuracy of BDI forecasting. In addition, the study of exogenous variable significance found that during the Financial Crisis, economic policy uncertainty in Europe and the Americas greatly impacted BDI forecasting. During COVID-19, global and developed economic policy uncertainty was noteworthy in the BDI forecasting. The comparative experimental results show the Prophet model has an exemplary forecasting result and strong robustness. It also performs excellently in model generalization and interpretability. This paper proposes a reliable and advanced algorithm for shipping freight rate index forecasting, which has noteworthy reference value for shipping market participants to make investment decisions and risk avoidance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a6289eff6b9f34b70256fa60d277dcb",
  "timestamp": "2025-05-15T02:50:21.155431"
}