{
  "id": 8697,
  "title": "Preferred Lung Cancer Screening Modalities in China: A Discrete Choice Experiment",
  "abstract": "Simple Summary Few results from public attitudes for lung cancer screening are available both in China and abroad. The aims of this study were to explore whether preferences were related to respondent characteristics and identify which kinds of respondents were more likely to opt out of any screening. Preferred screening modality in this study was inconsistent with current Chinese practice. Screening interval was the main determinant of preferred lung cancer screening modality in both the general respondents and in subgroups, this poses a considerable challenge to the implementation of a sustainable, regular screening programme. In addition, those with no endowment insurance were more likely to opt out; indicating that a promotion of financial support is needed to reduce inequalities of attendance of disadvantaged elderly. This study aimed to identify preferred lung cancer screening modalities in a Chinese population and predict uptake rates of different modalities. A discrete choice experiment questionnaire was administered to 392 Chinese individuals aged 50-74 years who were at high risk for lung cancer. Each choice set had two lung screening options and an option to opt-out, and respondents were asked to choose the most preferred one. Both mixed logit analysis and stepwise logistic analysis were conducted to explore whether preferences were related to respondent characteristics and identify which kinds of respondents were more likely to opt out of any screening. On mixed logit analysis, attributes that were predictive of choice at 1% level of statistical significance included the screening interval, screening venue, and out-of-pocket costs. The preferred screening modality seemed to be screening by low-dose computed tomography (LDCT) + blood test once a year in a general hospital at a cost of RMB 50; this could increase the uptake rate by 0.40 compared to the baseline setting. On stepwise logistic regression, those with no endowment insurance were more likely to opt out; those who were older and housewives/househusbands, and those with a health check habit and with commercial endowment insurance were less likely to opt out from a screening programme. There was considerable variance between real risk and self-perceived risk of lung cancer among respondents. Lung cancer screening uptake can be increased by offering various screening modalities, so as to help policymakers further design the screening modality.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a81bedc5b5e9762cef7246bc101b71a",
  "timestamp": "2025-05-15T03:21:24.712038"
}