{
  "id": 7913,
  "title": "A configurational investigation of smartphone use disorder among adolescents in three educational levels",
  "abstract": "Introduction: Smartphone use disorder in youth was associated with severe physical, psychological, and financial problems. Based on the ecological system theory of child development, this study examined a wide range of psychosocial characteristics in elementary-, middle-, and high-school adolescents with high scores on smart phone use disorder. Methodology: Existing research, which mainly adopted regression-based analytical techniques, found that gender, self-control, sensation seeking, loneliness, anxiety, perceived parent-adolescent relationship, and perceived parental monitoring are associated with smartphone use disorder. To complement traditional variable centered approaches, the current study adopted a person-centered approach, fuzzy-set Qualitative Comparative Analysis (fsQCA) procedures, to examine adolescents with smartphone use disorder. Results: The fsQCA procedure revealed four, nine, and thirteen distinct configurations that contributed to smartphone use disorder in adolescents for elementary school students, middle school students, and high school students respectively. A comparison across the three educational levels revealed four differences and two similarities. The results suggest that different groups of adolescents might be at risk for smartphone use disorder across the three educational levels. Conclusions: The fsQCA procedures generated solutions with satisfactory coverage and consistency. This demonstrates the promising value of fsQCA for researching smartphone use disorder and other behavior problems in adolescents. The results suggest that educators and mental health practitioners should consider educational level when helping adolescents with smartphone use disorder.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a823a76dd1d635c26f3545f737c79a8",
  "timestamp": "2025-05-15T03:13:30.630658"
}