{
  "id": 6062,
  "title": "Risk factors and health behaviors associated with loneliness among cancer survivors during the COVID-19 pandemic",
  "abstract": "Loneliness may exacerbate poor health outcomes particularly among cancer survivors during the COVID-19 pandemic. Little is known about the risk factors of loneliness among cancer survivors. We evaluated the risk factors of loneliness in the context of COVID-19 pandemic-related prevention behaviors and lifestyle/psychosocial factors among cancer survivors. Cancer survivors (n = 1471) seen at Huntsman Cancer Institute completed a survey between August-September 2020 evaluating health behaviors, medical care, and psychosocial factors including loneliness during COVID-19 pandemic. Participants were classified into two groups: 'lonely' (sometimes, usually, or always felt lonely in past month) and 'non-lonely' (never or rarely felt lonely in past month). 33% of cancer survivors reported feeling lonely in the past month. Multivariable logistic regression showed female sex, not living with a spouse/partner, poor health status, COVID-19 pandemic-associated lifestyle factors including increased alcohol consumption and marijuana/CBD oil use, and psychosocial stressors such as disruptions in daily life, less social interaction, and higher perceived stress and financial stress were associated with feeling lonely as compared to being non-lonely (all p < 0.05). A significant proportion of participants reported loneliness, which is a serious health risk among vulnerable populations, particularly cancer survivors. Modifiable risk factors such as unhealthy lifestyle behaviors and psychosocial stress were associated with loneliness. These results highlight the need to screen for unhealthy lifestyle factors and psychosocial stressors to identify cancer survivors at increased risk of loneliness and to develop effective management strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a90152e0ffe8253d10956d851d366ca",
  "timestamp": "2025-05-15T02:54:03.560001"
}