{
  "id": 7810,
  "title": "Predictors of hepatitis B vaccination completion among people who use drugs participating in a national program of targeted vaccination",
  "abstract": "Background: Targeted vaccination strategies are necessary to prevent people who use drugs (PWUD) becoming infected with hepatitis B virus (HBV). The aims of this study were to provide an overview of the activities for PWUD in a decentralised vaccination program in the Netherlands and to explore the determinants associated with completing a standard hepatitis B vaccination series. Methods: We used data for behavioural risk groups from the register of the national vaccination program. The data concerned PWUD who were immunised against hepatitis B in the Netherlands between 2002 and 2011. A standard series of three vaccinations (at 0, 1, and 6 months) was offered at inclusion and was continued if serological markers for past or chronic HBV infection were absent. Completion of a vaccination series (at least three vaccinations, irrespective of timing) was a dependent variable in our logistic regression analysis. Results: The program reached 18,054 PWUD. Of the 15,746 participants eligible for vaccination (i.e. they were neither carriers of hepatitis B nor immune to hepatitis B), 9089 (58%) completed a series of three hepatitis B vaccinations. Factors associated with a higher completion rate of a vaccination series (p < 0.01) were: starting vaccination in the earlier years of the program, older age of PWUD, intravenous drug use, vaccine administration by addiction care centres, and flexibility in location of vaccine delivery. Conclusion: Despite using a standard HBV vaccination schedule and no financial incentives, vaccination completion among PWUD was relatively high. Our results suggest that flexibility of vaccination location and administration of vaccines by healthcare workers with sustainable contact with PWUD could improve vaccination programs for this risk group. (C) 2018 Elsevier Ltd. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a925c63fca58411fa7865caac5211cf",
  "timestamp": "2025-05-15T03:12:11.720823"
}