{
  "id": 6060,
  "title": "Perceived effect of financial risk protection by the Urban-Rural Resident Basic Medical Insurance Scheme: a mixed-methods study of rural residents in China",
  "abstract": "Objectives It is to explore the perceived financial risk protection effect of the Urban-Rural Resident Basic Medical Insurance Scheme (URRBMI) and its influencing factors to provide evidence to further improve the URRBMI. Design It is a cross-sectional survey. Participants This mixed-methods study is conducted in five provinces in rural China. Through stratified cluster random sampling, 1681 rural residents participate in a cross-sectional questionnaire survey (1657 valid questionnaires are retrieved). Thirty rural residents participate in in-depth interviews. Primary and secondary outcome measures A multivariate logistic regression analysis is adopted to identify factors influencing respondents' perceptions. Semistructured interviews are used to identify the reasons why some respondents believed the URRBMI to be ineffective. Results Overall, 77.5% of respondents believe that the URRBMI is effective. Respondents, who are older, have a higher household income, prefer primary health facilities and provide a higher rating for critical illness compensation and maximum compensatory payouts. They are more likely to give the URRBMI a higher effectiveness rating than their counterparts. Qualitatively, participants who believe the URRBMI to be ineffective list the following reasons: low outpatient service coverage, insufficient or undersupplied drugs and services in the insurance list, problems in the arrangement of deductibles and maximum compensatory payouts, provider-induced behaviour and increased healthcare service price. Conclusions This exploration focuses on the reasons why rural residents think the scheme is invalid, which are vital for policy reform. Policies should focus on benefits design and coverage, the assumption of a supervisory role, avoiding financial risk stemming from critical illness and cross-sectoral actions to strengthen the primary healthcare system and comprehensive social security wealth.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a9230d599e6844769b7ea2e27898ac1",
  "timestamp": "2025-05-15T02:54:03.546991"
}