{
  "id": 4061,
  "title": "Corporate valuation around the world: The effects of governance, growth, and openness",
  "abstract": "The purpose of this paper is to provide a comprehensive analysis of corporate valuation around the world. Specifically, we (i) document and compare corporate valuation around the world, and (ii) identify the key factors that drive cross-country differences in valuation. In doing so, we utilize the country-level Tobin's q (CTQ), computed as the ratio of the aggregate market value to book value of all assets held by all public firms domiciled in a country, which amounts to the Tobin's q for the 'market portfolio' of the country. The key findings of the paper are: First, CTQ varies greatly across countries, ranging from 0.73 for Venezuela to 2.11 for Finland, with the international mean of 1.30 during our sample period 1999-2004. Despite the steady integration of the world economy in recent years, corporate valuation remains starkly different across countries. Second, apart from the effect of corporate governance, cross-country differences in corporate valuation are significantly driven by the growth options of countries represented by the R&D intensities, capital expenditures, and GDP growth. In addition, the degree of capital market openness has a significant, independent effect on valuation. Third, our regression analyses show that CTQ varies directly with shareholder rights, enforcement of insider trading laws, GDP growth, R&D intensity, and the degree of capital market openness. The key findings remain robust to the inclusion of inflation and industry effects. (c) 2006 Elsevier B.V. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5a9f6305ac2b62462dac71831ecb8ac3",
  "timestamp": "2025-05-15T01:23:27.328906"
}