{
  "id": 4261,
  "title": "Is any job better than no job at all? Studying the relations between employment types, unemployment and subjective health in Belgium",
  "abstract": "Background: This study focuses on the health impact of the labour market position, since recent research indicates that exposure to both unemployment and precarious employment causes serious harm to people's health and well-being. An overview of general and mental health associations of different labour market positions in Belgium is provided. A distinction is made between employment and unemployment and in addition between different types of jobs among the employed, taking into account the quality of employment. Given the fact that precarious labour market positions tend to coincide with a precarious social environment, the latter is taken into consideration by including the composition and material living conditions of the household and the presence of social support. Methods: Belgian data from the 1st Generations and Gender Survey are used. A Latent Class Cluster Analysis is performed to construct a typology of labour market positions that includes four different types of waged employment: standard jobs, instrumental jobs, precarious jobs and portfolio jobs, as well as self-employment and unemployment. Then, binary logistic regression analyses are performed in order to relate this typology to health, controlling for household situation and social support. Two health outcomes are included: self-perceived general health (good versus fair/bad) and self-rated mental health (good versus bad, based on 7 items from the Center for Epidemiologic Studies Depression Scale). Results: Two labour market positions are consistently related to poor general and mental health in Belgium: unemployment and the precarious job type. The rather small gap in general and mental health between both labour market positions emphasises the importance of employment quality for the health and well-being of individuals in waged employment. Controlling for the household level context and social support illustrates that part of the reported health associations can be explained by the precarious social environment of individuals in unfavourable labour market positions. Conclusions: The results from this study confirm that the labour market position and social environment of individuals are important health determinants in Belgium.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5aa5315d632851e7c09df9b2ff46b3bc",
  "timestamp": "2025-05-15T01:25:23.270061"
}