{
  "id": 4013,
  "title": "Risk priorities and their co-occurrences in smart city project implementation: Evidence from India's Smart Cities Mission (SCM)",
  "abstract": "With an increasing number of smart cities initiatives in developed as well as developing nations, smart cities are seen as a catalyst for improving the quality of life for city residents. However, current understanding of the risks that may hamper successful implementation of smart city projects remains limited due to inadequate data, especially in developing nations. The recent Smart Cities Mission launched in India provides a unique opportunity to examine the type of risks, their likelihood, and impacts on smart city project implementation by providing risk description data for area-based (small-scale) development and pan-city (large-scale) development projects in the submitted smart city proposals. We used topic modeling and semantic analysis for risk classification, followed by risk likelihood-impact analysis for priority evaluation, and the keyword co-occurrence network method for risk association analysis. The risk classification results identify eight risk categories for both the area-based and pan-city projects, including (a) Financial, (b) Partnership and Resources, (c) Social, (d) Technology, (e) Scheduling and Execution, (f) Institutional, (g) Environmental, and (h) Political. Further, results show risks identified for area-based and pan-city projects differ in terms of risk priority distribution and co-occurrence associations. As a result, different risk mitigation measures need to be adopted to manage smart city projects across scales. Finally, the paper discusses the similarities and differences in risks found in developed and developing nations, resulting in potential mitigation measures for smart city projects in developing nations.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5aa9b3076b4080a5dab26483aaffe8e1",
  "timestamp": "2025-05-15T02:32:27.421366"
}