{
  "id": 7895,
  "title": "Navigating grief in unprecedented times: risk factors in the wake of pandemic loss and end-of-life care",
  "abstract": "Coronavirus is an infectious disease that has left tens of millions of deaths around the world, and which has had social, economic, emotional, and psychological consequences. To mitigate the spread of the virus, several countries have adopted restrictive measures that impacted the way people experienced the end-of-life and the death of their loved one. This study aimed to identify the variables associated with prolonged grief symptoms in the context of both pandemic-related losses and the unique challenges related to end-of-life care. An anonymous online survey was disseminated widely through various channels including local press, social media, professional networks and hospitals. Socio-demographic information was collected, as well as information related to loss (cause of death, place of end-of-life care and death) and bereavement, and on the impact of the restrictions imposed by the pandemic. The participants were 163 bereaved who lost a loved one who received end-of-life care during the pandemic in Portugal. Most participants were female, married, professionally active and had lost their grandparents. A hierarchical multiple regression was performed to determine the factors associated with prolonged grief symptoms. The results showed that more prolonged grief symptoms were associated with less social support, worsening of the financial situation, greater psychological impact of restrictions on communicating with the deceased, and the deceas having received end-of-life care in a hospital. The early identification based on these factors of individuals at higher risk for more prolonged grief symptoms could allow for targeted interventions and support services.This study unveils crucial factors contributing to heightened grief amid pandemic-related losses and challenges in end-of-life care, which provide practical insights for healthcare practitioners. Highlight the importance of personalized interventions to fortify social connections, address financial challenges, and offer compassionate alternatives to hospital-centric care. Policymakers can leverage this information to optmise grief management during public health crises.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ab767ed468458a2f80afb79880a9610",
  "timestamp": "2025-05-15T03:13:04.951587"
}