{
  "id": 7975,
  "title": "Childhood impulsive behavior and problem gambling by adulthood: a 30-year prospective community-based study",
  "abstract": "Aims Problem gambling can create major financial, emotional and sometimes criminal problems for an individual. This study prospectively investigated the association between impulsive behavior at age 7 and the development of life-time problem gambling by adulthood. We also examined the specificity of any observed association between impulsive behaviors and problem gambling by conducting parallel analyses examining the link between respondents' shy/depressed behavior in childhood and later problem gambling. Design, setting and participants Cohort study of 958 offspring of mothers enrolled in the Collaborative Perinatal Project who participated in an adult follow-up study at a mean age of 39.2 years. Measurements Multivariable logistic regression models were fitted to determine associations between psychologist-rated impulsive and shy/depressed behaviors at age 7 and life-time self-reported gambling as measured by the South Oaks Gambling Screen administered during the adult follow-up study. Findings Children who exhibited impulsive behaviors at age 7, compared to their non-impulsive counterparts, were 3.09 (95% confidence interval: 1.40-6.82) times as likely to report problem gambling years later. In contrast, we did not find a significant association between childhood shy/depressed behavior and problem gambling by adulthood in adjusted analyses. Conclusions Impulsive behaviors at age 7 are a specific and significant risk factor for later problem gambling.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ad159f55b6c368997f8da7cd1cffc60",
  "timestamp": "2025-05-15T03:14:07.177427"
}