{
  "id": 829,
  "title": "Impact of COVID-19 and financial factors on first-year student retention: a comparative study of pre- and post-pandemic cohorts",
  "abstract": "This study examines factors influencing first-year student retention, with a particular focus on the impact of the COVID-19 pandemic. We employ logistic regression and machine learning algorithms to identify key predictors of retention and assess variations in retention probabilities across cohorts. The analysis is based on a dataset of 8,320 first-time freshmen at a public university in the central United States during the fall semesters of 2018 (pre-COVID-19) and 2020 (post-COVID-19). Results indicate that students enrolled in the post-COVID-19 period were less likely to persist into their second year. Higher tuition assistance-such as grants, tuition waivers, and scholarships-and greater family financial contributions positively influenced retention, particularly among the post-COVID-19 cohort. Federal and private loans were also positively associated with retention, reflecting student's financial commitments. However, those with higher financial need were less likely to persist, underscoring the challenges faced by financially vulnerable students. Machine learning models demonstrated strong predictive accuracy, with the Random Forest algorithm achieving the highest performance in effectively identifying students at risk of dropping out. These findings provide actionable insights for targeted institutional interventions. By analysing retention patterns across cohorts and financial factors, this study offers valuable recommendations for addressing financial disparities and enhancing student persistence during and beyond periods of crisis.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ae0e8ce3af6f8c8f579791651a910b2",
  "timestamp": "2025-05-15T01:55:41.553352"
}