{
  "id": 8212,
  "title": "Age, values, farming objectives, past management decisions, and future intentions in New Zealand agriculture",
  "abstract": "Governments such as New Zealand's seek to raise the value of agricultural exports while concurrently protecting the natural environment. Therefore, farmers are encouraged to increase production while reducing environmental impacts. In this paper, we analyse the relationship between age and farmer values, farming objectives, past management decisions, and future intentions, all of which may impact the environment. Using multivariate regression that controls for gender, education, industry, and region, we find that older farmers are more risk averse, less willing to experiment, less likely to be influenced by social expectations, and more focused on financial performance. Older farmers are less likely to adopt new technologies and to have concrete plans to convert land and to intensify existing land uses. Using an agro-environmental land use model to project changes in farmer demographics, we find that if farm succession and adoption rates follow our estimates, then the natural shift in farmer age and resulting preferences for implementing plans to manage nutrients and soils over time could lead to a reduction in New Zealand's annual total nitrogen, phosphorus, and soil loss by 7%, 9%, and 19%, respectively, between 2015 and 2075. We conclude by noting that encouraging younger individuals to become more active in the farming community is a positive step towards accelerating the adoption of management practices with environmental benefits, but caution that this strategy alone will not meet the full objectives of the country's recent freshwater reforms.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5af6ea717f63bf00960250407c6c7bae",
  "timestamp": "2025-05-15T03:16:17.477256"
}