{
  "id": 8716,
  "title": "Persistency of catastrophic out-of-pocket health expenditures: Measurement with evidence from three African countries - Malawi, Tanzania, and Uganda",
  "abstract": "Catastrophic out-of-pocket health expenditure (CHE) remain high in Sub-Saharan Africa and may not conform to the sporadic random pattern of acute illnesses that shapes insurance arrangements intended to avoid the risk of financial loss. The persistency of CHE remains a largely unexplored issue due to the lack of relevant methods and scarcity of panel data. This paper addresses the first shortcoming by presenting three different approaches to incorporating the timeframes into the analysis, considering dynamics between two periods, average over time and the recurrence of CHE incidence. Through the application of the complementary approaches, we identify (i) those at risk of persistent CHE in the short-term; (ii) those facing transient versus persistent CHE in the long-term; and (iii) those facing multiple CHE spells. The methods are applied to different definitions of CHE using panel data from three sub-Saharan countries: Malawi (3 waves: 2010, 2013, and 2016) with 4983 observations; Tanzania (3 waves: 2008, 2010, and 2012) with 8715 observations; and Uganda (5 waves: 2009, 2010, 2011, 2013, and 2015) with 6475 observations. All datasets are balanced panels. Additionally, we employ empirical strategies to identify the underlying factors contributing to these persistent and relatively high OOP. Across the three countries, we find that at least 27% of the people facing CHE in one period, because they spent more than 5% of their household budget on health out-of-pocket, will face it again in the next period. The lower-bound risk for those spending more than 10% of their household budget is 9% and for those spending more than 25% of their household capacity to pay is 13%. Between 11% and 45% of the population incurred CHE at least twice during the observation period when using the 5% budget definition of CHE. The double recurrence rate ranges between 7% and 13% when using the 25% capacity-to-pay definition and between 3% and 20% when using the 10% budgetshare definition. Between 22% and 32% of the population experienced chronic CHE at the 5% of the budgetshare definition (6%-10% at the 10% of the budgetshare definition of CHE; 2%-11% at 25% of capacity- to-pay). Our panel regression analysis consistently highlights the susceptibility of certain groups to face persistence CHE, notably those residing in rural areas, individuals with lower levels of education, the elderly, and those who have undergone hospitalizations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5af71be5ede63802e7e3992ad9b3b953",
  "timestamp": "2025-05-15T03:21:56.562479"
}