{
  "id": 7742,
  "title": "A Multilayer Network Perspective on Customer Segmentation Through Cashless Payment Data",
  "abstract": "Customer segmentation is a central problem in different business processes. In the last few years, it is also becoming important for banking and financial institutions given the ever-growing volume of cashless payments. When dealing with customer segmentation with transactional data, the clustering approach is widely used. In this work, we propose a different modeling approach for customer segmentation based on a graph-based representation. Specifically, we reformulate customer segmentation as a community detection problem on a similarity multi-layer network, where each layer depends on a specific cashless payment method. We introduce a vector-based representation of the cardholders' spending patterns, namely the purchase profile, to build the similarity multi-layer network. The profiles capture how customers allocate their spending capacity among merchant categories through different payment systems. From purchase profiles, we evaluate the similarity of the cardholders in terms of consumption allocation and we infer different similarity graphs based on credit and debit card payments. Different segmentation strategies based on multi-layer community detection methods have been evaluated on a large-scale dataset of credit and debit card transactions of a banking group. Since one of the main goals is verifying the feasibility of graph-based approaches for customer segmentation, we discuss the outcomes of the methods in terms of explainability of the resulting segments. Specifically, methods based on random walks, such as Infomap, return more stable and insightful results than modularity-based ones, in different settings. To sum up, we experiment with community detection algorithms to cope with the customer segmentation problem starting from a large set of credit and debit card transactions. The outcome of the solutions may support recently developed methods for bank risk assessment based on clients' behavior or targeted applications for cashless payment management.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5afb60a03554554ea1c8303d171bf8e1",
  "timestamp": "2025-05-15T03:11:38.549159"
}