{
  "id": 7925,
  "title": "Geographies of mortgage market segmentation: The case of Essex County, New Jersey",
  "abstract": "Since the late 1980s, mutually reinforcing trends in economic growth, public policy, and community activism have fostered a wave of residential mortgage lending to 'underserved markets' in US cities. Yet many of the changes in housing finance that supported sustainable home ownership also lured a new generation of subprime and predatory credit institutions specialising in high-cost, high-risk lending. For many urban and minority neighbourhoods, the old problems of exclusionary redlining are now accompanied by new dilemmas of exploitive greenlining. This paper analyses the market penetration of subprime lending institutions and the subsequent concentration of mortgage 'pre-foreclosures' in low- and moderate-income, African American neighbourhoods. Focusing on Newark, NJ, and its surrounding suburbs, Gary King's ecological inference technique and a series of logistic regression models are used to assess the role of borrower characteristics, institutional divisions, and neighbourhood context in the process of mortgage market segmentation. The evidence corroborates theories emphasising the dynamics of capital investment, financial services restructuring, and the economic incentives for racial-geographic targeting, and not the presumed credit deficiencies of urban and minority home owners. Unfortunately, the tidy empirical analysis offered here is overshadowed by the enormous societal experiment now underway across the US, as a wave of delinquencies, defaults and foreclosures undermines the belated minority home ownership gains achieved during the unprecedented boom of the 1990s.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b17aa8c60944176bbeff3b4301bd58e",
  "timestamp": "2025-05-15T03:13:30.657302"
}