{
  "id": 4210,
  "title": "Measures of Financial Hardship From Health Care Expenses Among Families With a Member With Atherosclerotic Cardiovascular Disease in the US",
  "abstract": "This cross-sectional study compares the financial burden of atherosclerotic cardiovascular disease among families of patients with objective or subjective financial hardship. Question Is there concordance between subjective and objective measures of financial burden in families of patients with atherosclerotic cardiovascular disease (ASCVD)? Findings In this cross-sectional study of 10 975 US families, 2 in 5 families of patients with ASCVD experienced health care-related financial hardship; a focus on objective or subjective measures alone would have captured only half the total financial burden and not identified those forgoing or deferring health care. Meaning The findings suggest that a comprehensive framework that evaluates both subjective and objective measures is needed to monitor financial consequences of health care in families of patients with ASCVD. Importance Patients with atherosclerotic cardiovascular disease (ASCVD) face substantial financial burden from health care costs as assessed by many disparate measures. However, evaluation of the concordance of existing measures and the prevalence of financial burden based on these measures is lacking. Objective To compare subjectively reported and objectively measured financial burden from health care in families of patients with ASCVD. Design, Setting, and Participants This cross-sectional study used data from the Medical Expenditure Panel Survey, a nationally representative survey of individuals and families in the US, and included all families with 1 or more members with ASCVD from 2014 to 2018. Analyses were conducted from October 2021 to April 2022. Main Outcomes and Measures Using accepted definitions, objective financial hardship represented annual out-of-pocket medical expenses exceeding 20% of annual postsubsistence income, and subjective financial hardship represented self-reported problems paying medical bills or paying them over time. Prevalence of financial hardship was identified based on individual definitions and their concordance was assessed. Factors associated with each type of financial hardship were examined using risk-adjusted survey logistic regression. Multivariable logistic regression was used to model the odds of subjective financial hardship vs objective financial hardship across subgroups. The association between measures of financial hardship and self-reported deferral of care was also assessed. Results Among 10 975 families of patients with ASCVD, representing 22.5 million families nationally (mean [SD] age of index individual, 66 [24] years; estimated 54% men]), 37% experienced either objective or subjective financial hardship. This group included 11% (95% CI, 10%-11%) with objective financial hardship, 21% (95% CI, 20%-22%) with subjective financial hardship, and 5% (95% CI, 5%-6%) with both objective and subjective financial hardship. Mean age was 70 (95% CI, 68-71) years vs 61 (95% CI, 60-62) years for index patients in families reporting objective financial hardship only vs subjective financial hardship only, with no difference in sex (50% [95% CI, 46%-54%] of men vs 49% [95% CI, 47%-52%] of women). In risk-adjusted analyses, among families of patients with ASCVD, patient age of 65 years or older was associated with lower odds of subjective financial hardship than objective financial hardship (odds ratio [OR], 0.39; 95% CI, 0.20-0.76), whereas higher income (OR, 6.08; 95% CI, 3.93-9.42 for an income of >100%-200% of the federal poverty level [FPL] vs <= 100% of the FPL and OR, 20.46; 95% CI, 11.45-36.56 for >200% of FPL vs <= 100% of FPL), public insurance (OR, 6.60; 95% CI, 4.20-10.37), and being uninsured (OR, 5.36; 95% CI, 2.61-10.98) were associated with higher odds of subjective financial hardship than objective financial hardship. Subjective financial hardship alone was associated with significantly higher adjusted odds of self-reporting deferred or forgone care compared with objective financial hardship alone (OR, 2.69; 95% CI, 1.79-4.06). Conclusions and Relevance In this cross-sectional study of US adults, 2 in 5 families of patients with ASCVD experienced health care-related financial hardship, but a focus on objective or subjective measures alone would have captured only half the burden and not identified those deferring health care. The findings suggest that a comprehensive framework that evaluates both objective and subjective measures is essential to monitor financial consequences of health care.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b2fd79c292f9cb74c808d62c86725a7",
  "timestamp": "2025-05-15T02:34:13.510758"
}