{
  "id": 4157,
  "title": "Risk and Protective Factors for Suicidal Ideation and Suicide Attempts Among Deployed Danish Soldiers From 1990 to 2009",
  "abstract": "Objective: The study was undertaken to identify risk and protective factors for suicidal ideation and suicide attempts among deployed Danish soldiers. Research on suicide among Danish veterans has only been conducted to a limited degree. Method: The method applied was a questionnaire survey administered to a population of 1,264 Danish soldiers deployed from 1990 to 2009. The data were analyzed using backward logistic regression modeling in SAS 9.2. Results: In the logistic regression analysis, the following were significant risk factors for suicidal ideation: drug abuse, a poor financial situation before deployment, a heavy workload and/or repatriation during deployment, and attending a poor athletic and recreation program after deployment. Significant protective factors against suicidal ideation were support from friends at home during deployment and appreciation by the general population after deployment. Significant risk factors for suicide attempts were an unhappy childhood and pointless tasks during deployment. No significant protective factors against suicide attempts were identified. Conclusion: On the basis of the results presented in this study, intervention against suicidal behavior would benefit from screening for certain childhood issues, drug abuse, and poor financial situation before deployment. During deployment, measures should be taken to minimize the amount of meaningless tasks and heavy workloads. At the same time, efficient ways of communicating with home should be ensured. After deployment, good athletic and recreation programs should be warranted for all military personnel-including repatriated soldiers. Finally, priority should be given to ensure public appreciation of what deployed soldiers accomplish.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b3feb58036953ef63b7e0662cc681ad",
  "timestamp": "2025-05-15T02:33:42.137877"
}