{
  "id": 9040,
  "title": "Comparison of oral anticoagulation use and adherence among Medicare beneficiaries enrolled in stand-alone prescription drug plans vs Medicare Advantage prescription drug plans",
  "abstract": "BACKGROUND: For atrial fibrillation (AF) patients, oral anticoagulants (OACs) can reduce the risk of stroke by 60%; however, nearly 50% of patients recommended to receive OACs do not receive therapy. Integrated insurers that cover pharmacy and medical benefits may be incentivized to improve OAC use and adherence because they benefit from offsets in medical costs associated with prevented strokes. OBJECTIVE: To compare OAC use and adherence between AF patients enrolled in Medicare stand-alone prescription drug plans (PDPs), which only cover pharmacy benefits, and those enrolled in Medicare Advantage prescription drug (MAPD) plans, which cover medical and pharmacy benefits. METHODS: This was a retrospective cohort study, conducted using 2014-2016 Medicare claims data from the Centers for Medicare & Medicaid Services and a large regional health plan in Pennsylvania. Primary outcomes included OAC use and OAC adherence. OAC use was measured as filling at least 1 prescription for an OAC after AF diagnosis. OAC adherence was defined as having greater than or equal to 80% of days covered with an OAC. We constructed conditional logistic regression models in propensity score-matched samples to test the association between enrollment in PDPs or MAPD plans and outcomes. RESULTS: There were 2,551 AF patients enrolled in PDPs and 4,502 in MAPD plans before propensity score matching. The propensity score-matched sample included 2,537 patients in each group. OAC use was higher among MAPD beneficiaries (74%-76%) compared with PDP beneficiaries (70%; P<0,001), and 41%-42% of MAPD beneficiaries were adherent to OACs, compared with 34% of PDP beneficiaries (P<0.001). In adjusted analyses among propensity score-matched samples, PDP enrollment was associated with lower odds of OAC use (OR=0.67. 95% CI =0.56-0.81) and adherence (OR=0.68. 95% CI =0.59-0.78) compared with MAPD enrollment. CONCLUSIONS: AF patients enrolled in MAPD plans were more likely to use and adhere to OACs compared with POP enrollees. These results may reflect the financial incentives of MAPD plans to improve guideline-recommended OAC use, since MAPD insurers bear the risk of pharmacy and medical costs and thus may benefit from cost savings associated with averted stroke events. As efforts to improve use and adherence of OACs in AF patients increase, focus should be given to how insurance benefit designs can affect medication use.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b45fbdaeda9ba2b268333cf335ae1ab",
  "timestamp": "2025-05-15T03:24:54.918747"
}