{
  "id": 5541,
  "title": "How Does Exchange Rate Policy Uncertainty Affect Corporate Performance: Evidence from China",
  "abstract": "This research investigates the role of China's exchange rate policy uncertainty in manufacturing corporate performance using the fixed effect model and quantile regression model. The findings indicate that an exchange rate policy fluctuation constrains better-performing corporates, but is adverse for those with inferior performance. Government subsidy appears to explain the positive impact, and the effect is enhanced or alleviated somehow by corporate governance, growth, and financial constraints. Exchange rate policy fluctuation also significantly pushes corporates to adjust and upgrade their business, which improves their performance accordingly. Additionally, positive shocks significantly stimulate corporate performance, while negative shocks including global financial crisis and COVID-19 epidemic hinder corporate development. Overall, the risk confrontation ability of Chinese manufacturing enterprises presents a positive upward trend. The China government should thus issue more positive exchange rate policies that could send positive signals to the market and increase the openness of its manufacturing industry. More corporate-friendly policies can be launched, such as adjusting the amount of subsidies for manufacturing enterprises in a timely manner and helping manufacturing enterprises, especially more mature ones, deal with exchange rate policy uncertainty risks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b687c6b94b7325b4ace51ab3c425aa6",
  "timestamp": "2025-05-15T02:48:51.344294"
}