{
  "id": 8059,
  "title": "Innovative pathways in capital markets: the fusion of behavioural finance and Fintech for strategic investor decision-making",
  "abstract": "PurposeThe capital markets' advancement with regards to investor behaviour in the Gulf Cooperation Council (GCC) region is the primary focus of this study which seeks to explore the amalgamation of behavioural finance and Fintech. The purpose of this study is to investigate the psychological aspects and its adoption of Fintech to understand the impact on capital market operations and investor behaviour in Saudi Arabia, Bahrain, United Arab Emirates, Kuwait, Qatar and Oman.Design/methodology/approachA quantitative approach was used, whereby a structured questionnaire was sent to collect information from a sample of 625 respondents which provided 625 completed questionnaires. These respondents consisted of investors, users of various Fintech services and finance professionals active in the capital markets of the GCC region. The survey instrument was divided into three parts: demographic information, elements of behavioural finance such as risk aversion, error rate in decision-making, frequency of trading and bias areas and dimensions of Fintech use like convenience, confidence and perceived value. The questions in the questionnaire were created based on an extensive literature review to meet the aims of this research. Relationships between the variables were assessed using several statistical techniques such as multiple linear regression, hypothesis testing and assumption testing which were all performed by Stata 16.FindingsThe analysis results revealed that the application of the behavioural finance integration model together with the adoption of financial technology yields great effects on investment choices in the capital markets within the GCC region. More specifically, the evidence suggests that the adoption of Fintech reduces the level of behavioural biases and increases the positive aspects of investor self-fulfilment with portfolio management, market participation and the general trust in the financial systems. Indeed, while the adoption of Fintech does ease some of the investment challenges, behavioural finance is equally important in managing expected investment results like diversification and returns. This research vividly shows the socio-cultural factors which impact how decision-making is done and how these multi-factors are expected to change with the adoption of changes in how Fintech strategies are used.Research limitations/implicationsThe implications of the results are pertinent for those investing, practitioners of finance, regulators and even the general public. In particular, regulators in the region of GCC must create and implement strategies and policies that foster the development of Fintech, while at the same time training and educating clients on behavioural finance. Financial corporations and individual investors are called to embrace behavioural as well as technological measures to the effective functioning of the capital markets. Furthermore, this research shows that there is a gap in the provision of Fintech services which take care of behavioural factors in decision-making so as to strengthen the decision-making processes for improved financial systems.Originality/valueThis study aims to fill a major deficiency in the current body of research examining the relationship between behavioural finance and Fintech in the GCC capital market. This study sheds light on how these two dimensions are interlinked with respect to their impact on investor behaviour and decision-making. This study identifies socio-cultural and technological factors specific to the GCC and offers recommendations that could enhance the efficiency and inclusivity of financial markets. This can be built on in future studies using the consideration of interplays with other variables like macroeconomics and technology to build the understanding of how capital markets work within the region.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b750dac32c6b5fc2bc69cd692704598",
  "timestamp": "2025-05-15T03:14:37.422443"
}