{
  "id": 3167,
  "title": "Do Energy and Banking CDS Sector Spreads Reflect Financial Risks and Economic Policy Uncertainty?A Time-Scale Decomposition Approach",
  "abstract": "The aim of this study is to investigate the dynamics of the co-movements of energy and banking sector credit default swaps (CDS) spreads with global financial and economic policy uncertainty and risk factors in the United States and Europe. We first employ the standard quantile regression approach to examine the co-movement dynamics under different credit market conditions. The empirical results show that the standard quantile regression fails to capture the co-movement between the U.S. and European CDS spreads and the economic policy uncertainty and risk factors for all quantiles. However, after decomposing the raw series at various scales of resolution, using the wavelet approach to capture the structure, we find that the financial and energy related CDS spreads co-move with the economic policy uncertainty and stock market risk in the intermediate and lower frequency domain. That is, there is a dependency in the intermediate and higher time scales or the intermediate and long investment horizons for both the United States and Europe. However, there are positive effects of the stock market risk index on the U.S. banking CDS spreads, which remain almost similar across quantiles, but the effects are asymmetric for the European banking spreads. The study also provides policy implications.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b83372f7d90ab0dab9f975ea73b6839",
  "timestamp": "2025-05-15T02:23:33.483899"
}