{
  "id": 9329,
  "title": "Association of Medication Adherence with Hospital Utilization and Costs Among Elderly with Diabetes Enrolled in a State Pharmaceutical Assistance Program",
  "abstract": "BACKGROUND: Medication adherence is crucial for the successful treatment among elderly patients with diabetes taking oral antidiabetic medications (OAMs). Cost of medications, lack of insurance coverage, and low income are major contributing factors towards medication nonadherence. State pharmaceutical assistance programs (SPAPs) provide medications at little or no cost to income-eligible patients and have potential to improve medication adherence among elderly patients. Despite this, limited research has focused on the association of medication adherence with health care utilization among elderly patients enrolled in SPAPs, and inclusion of health care costs as an outcome is even rarer. OBJECTIVE: To evaluate the relationship between adherence to OAMs and hospital utilization and costs among elderly patients with diabetes who were enrolled in a SPAP. METHODS: This retrospective observational study included elderly patients with diabetes enrolled in Pennsylvania's Pharmaceutical Assistance Contract for the Elderly (PACE) program in 2015. Medication adherence was estimated as the proportion of days covered (PDC; adherent: PDC >= 80%, nonadherent: PDC<80%). Hospital utilization and costs were estimated using hospital discharge records from the Pennsylvania Health Care Cost Containment Council. Multiple adjusted regression analyses were used to examine the association of medication adherence with hospital utilization (all-cause and diabetes-related number of inpatient hospital visits and length of stay [LOS]) and costs. RESULTS: Among 9,497 elderly PACE enrollees with diabetes, 81% were adherent, and 21% were hospitalized. Compared with adherent patients, patients who were nonadherent to OAMs had twice the odds of all-cause and diabetes-related hospitalization. Controlling for covariates, nonadherent patients had 27% more all-cause (95% CI =9%-36%) and 21% more diabetes-related (95% CI =5%-40%) hospital visits than adherent patients. Covariate-adjusted LOS for nonadherent patients was 24% longer than that of adherent patients for all-cause hospitalization (95% CI =1.171-1.311) and 12.7% longer for diabetes-related hospitalization (95% CI =1.036-1.227). Medication nonadherence was associated with significantly greater all-cause ($22,670 vs. $16,383; P<0.0001) and diabetes-related ($13,518 vs. $12,634; P=0.0003) hospitalization costs. CONCLUSIONS: Among SPAP-enrolled elderly patients, nonadherence to OAMs was significantly associated with increased risk of hospitalization, longer hospital stays, and greater hospitalization costs. Attention is needed to improve medication adherence among elderly receiving financial assistance to pay their prescriptions to reduce economic burden on the health care system. Copyright (C) 2020, Academy of Managed Care Pharmacy. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b84087faff0092f411a578a0a6062b6",
  "timestamp": "2025-05-15T03:27:53.327206"
}