{
  "id": 6691,
  "title": "Assessing oil price volatility co-movement with stock market volatility through quantile regression approach",
  "abstract": "In times of financial crisis as well as during the COVID-19 era, gold and crude oil are the two commodities that have the most influence on global stock markets and the real economy. But research has mostly focused on the effects of these commodities' prices on their own, and the volatility of these commodities' prices as a whole hasn't gotten much attention. This research paper evaluates the impacts of crude oil prices volatility on shares marketplaces. This research examines the impact of crude oil uncertainty on the overall market returns in several economic sectors (China, Japan, the USA, France, and Germany) between 2000 and 2020 using the importance of the crude oil prices volatility index by applying a Quantile-on-Quantile regression(Q-Q), including dynamic copula with Markov-Switching. The results depict that because the effect of the OVX changes crosswise every single quantile level of stock return, it is cumbersome to ascertain the changes within the adverse impacts under varied stock market circumstances. Equally, to derive a comprehensive understanding of the correlation between crude costs volatility and stock returns, we utilize twofold quantile regression and quantile-quantile regression methods. We interpret these different features' impacts by applying the quantile regression approximates. Our experiential findings show that crude costs uncertainty has lop-sided impacts on stock returns; more so, these disproportionate performances alternate based not merely on the level of shares returns nonetheless equally crude market circumstances. More so, greater values match a robust risk decrease. Further, we observed heterogenous hedging effectiveness among the varied United States stock sectors. The findings demonstrate that growing crude prices volatility obtains an adverse impact on stock returns when the dual crude costs volatility and stock returns are minimal. Nevertheless, when shares returns are greater plus crude prices, volatility is minimal; growing crude volatility increases stock returns.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b8c7c0ecbcc3befdd84fe5d92e75402",
  "timestamp": "2025-05-15T03:00:35.460660"
}