{
  "id": 9098,
  "title": "Students' Perspectives on Entrepreneurship and Its Intention in India",
  "abstract": "The present study was carried out with the objective of understanding the stated interest of agricultural students in entrepreneurship and to provide an accurate research report for decision-makers, for developing entrepreneurship in India. In the present investigation, a two-stage sampling procedure was employed. In the first stage, cluster sampling was used to select the state agricultural universities (SAUs) in India. In the second stage, simple random sampling was performed to select student respondents from each SAU. Data were collected from 1797 agricultural students (second stage units) from 17 SAUs out of 74 (first stage units) studying a bachelor's/master's degree program and analyzed to infer outcomes related to entrepreneurship. Variables such as basic information, job interest, motivational factors, hurdles to becoming an entrepreneur, awareness about government schemes, and essential hard and soft skills were measured. Data were analyzed using frequencies, chi-square test (X-2), rank-based quotient (RBQ), and binary logistic regression (BLR) analyses. The survey results revealed that entrepreneurship was given a lower preference by the majority; as a result, there was less motivation for students from family members. However, about 78% of students showed interest in becoming an entrepreneur. Significant areas of entrepreneurial interest for the observed students included, in order are digital agriculture < input production < marketing < farming < advisory services < dairying < financial services < poultry < developing eLearning material for farmers < and other jobs. This study demonstrates the need for Career Development Centers (CDCs), government support, and awareness and incentives regarding entrepreneurship through effective policy interventions, to protect entrepreneurs from the potential risk of business losses. This research outcome substantially contributes to the Sustainable Development Goal (SDG-4, quality education), through the soft skill development of the students, resulting in innovative agri-entrepreneurs. The present research suggested some policy implications to promote entrepreneurship more widely, which may also help other developing countries to frame potential regulations for agricultural education and entrepreneurial activities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b8ded11b7905d55ba5d0415719c0052",
  "timestamp": "2025-05-15T03:25:27.769721"
}