{
  "id": 3019,
  "title": "OPTIMIZATION OF COMMODITY STOCKS THE ENTERPRISE BY MEANS OF HML-FMR CLUSTERING",
  "abstract": "The article examines the process of formation inventory of the enterprise and determines the optimal volume of commodity resources for sale. A generalization of author's approaches to the formation and evaluation of inventories of the enterprise is carried out. The marketing-logistic approach was applied for the purpose of distribution groups of commodity resources due to the risk of non-fulfillment the order for the supply of goods of the enterprise. In order to ensure an effective process of commodity provision of the enterprises, the costs associated with the formation of inventories are determined. The formalized scheme of the formation commodity provision and the process of optimization inventory of the enterprise is offered. The analysis the structure of the company's inventory is carried out, the volume of goods turnover is defined, the stocks are grouped for various clustering characteristics. To conduct the study, statistical information was used on commodity resources of the enterprises, statistical methods (grouping, structure analysis, estimation of dynamic series), tools for assessing the efficiency of inventory use, HML-FMR clustering were used. The necessity of using XYZ and ABC analysis is indicated in order to obtain more reliable results and forecast values of the product support of the enterprise. Economic-mathematical modeling is applied and graphically shown the difference in the formation of commodity resources by various features of HML-FMR clustering. The calculations allow the enterprise to determine the optimal amount of commodity resources in accordance with the needs of consumers and their solvent demand, to plan financial resources for the formation of inventories, to develop assortment policy in accordance with demand for products and their implementation. The results of calculations the volume of merchandising of the enterprise, taking into account the HML-FMR clustering affect the formation of final financial performance of the enterprise - income and profits.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5b92cc57d74598d01f46d48d811474bf",
  "timestamp": "2025-05-15T02:21:52.152714"
}