{
  "id": 7939,
  "title": "A nexus between corporate governance and performance: evidence from the Indian insurance industry",
  "abstract": "Corporate governance in financial institutions has been a long-standing concern. However, in recent times, growing evidence of inadequate disclosures, an upsurge in fraud cases, and a rising volume of non-performing assets have prompted serious concerns about the robustness of the existing corporate governance structure in the Indian Insurance market. Hence, the current study investigates the linkage between corporate governance and performance, utilizing an unbalanced panel of 49 life and non-life insurers from 2014 to 2021. It employs a dynamic panel two-step system generalized method of moments approach to address potential endogeneity issues and applies quantile regression for robustness checks. The results reveal that corporate governance significantly improves insurers' performance, with board governance being the most influential dimension. Among individual attributes, independent directors, women directors, board committees, and audit and risk committee size play a quintessential role in determining performance. However, the effectiveness of governance mechanisms substantially varies across life and non-life insurers, highlighting the nuanced dynamics of the Indian insurance market. The findings legitimate a mixed theoretical perspective involving stewardship, resource dependency and agency theories. We believe the outcomes of this study would provide a roadmap to policymakers and regulators to amend or redesign governance norms tailored to the specific needs of insurers, eventually creating an environment that enhances Indian insurers' performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ba2e1e534ba9ed3c5003fb574a6bf62",
  "timestamp": "2025-05-15T03:13:30.685158"
}