{
  "id": 9336,
  "title": "Clinical factors affecting the outcome of arthrocentesis and hydraulic distension of the temporomandibular joint",
  "abstract": "Objective. Significant psychosocial distress and substantial cost are associated with the diagnosis and management of chronic temporomandibular joint (TMJ) pain conditions. Successful intervention based on identified risk factors has potential functional and financial benefits. Arthrocentesis and hydraulic distension of the TMJ has been described as an effective modality in the treatment of patients demonstrating clinical findings consistent with the diagnosis of disc displacement without reduction. The purpose of this study was to investigate whether clinical variables such as age, gender, time since pain onset (TSO), visual analog scale (VAS) pain level, and mandibular range of motion (ROM) may predict treatment outcomes of arthrocentesis and hydraulic distension of the TM]. Study design. The study comprised 64 consecutive patients presenting with TM] pain, who were diagnosed with a unilateral clinical TMJ disorder of TMJ pain associated with an internal derangement (ID) type III (disc displacement without reduction). TMJ pain level of function and mandibular range of motion were assessed initially and then compared with the respective 2-month follow-up findings after arthrocentesis and hydraulic distension. Outcome criteria of success included an absence of signs and symptoms characteristic of a diagnosis of ID type III. A multiple logistic regression analysis of pretreatment data was used to compute the odds ratio for variables of age, gender, TSO, VAS pain level, and ROM for successful outcomes in = 34) vs nonsuccessful (n = 30) outcomes. Results. At 2-months follow-up, clinical evaluation showed a significant reduction in TMJ pain during function (P <.001), a significant reduction in clinical diagnoses of TMJ disorders (P <.001), and a significant increase in mandibular range of motion (P <.001). For the outcome criteria of absence of ID type III, there was a significant difference between the clinical outcome groups for the variables of age (P=.029) and VAS pain level (P <.001). Significant increase in benefit of a successful outcome occurred with an age of :5 25 years (11.8 odds ratio; P=.044), a VAS pain level of > 75 mm (6.5 odds ratio; P=.026), and an ROM of < 25 mm (6.9 odds ratio; P=.029). Conclusion. Clinical variables predicted TMJ ID type III and pain patients who went on to show successful treatment outcomes of arthrocentesis and hydraulic distension. Predictive modeling may provide clinicians with the opportunity to identify at-benefit patients early and initiate specific treatments.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ba61cf311b94a22bbb326bb02b42036",
  "timestamp": "2025-05-15T03:27:53.349355"
}