{
  "id": 391,
  "title": "Index Tracking Via Learning to Predict Market Sensitivities",
  "abstract": "Index funds are substantially preferred by investors nowadays, and market sensitivities are instrumental in managing index funds. An index fund is a mutual fund aiming to track the returns of a pre-defined market index (e.g., the S&P 500). A basic strategy to manage an index fund is replicating the index's constituents and weights identically, which is, however, cost-ineffective and impractical. To address this issue, it is required to replicate the index partially with accurately predicted market sensitivities. Accordingly, we propose a novel partial-replication method via learning to predict market sensitivities. We first examine deep-learning models to predict market sensitivities in a supervised manner with our data-processing methods. Then, we propose a partial-index-tracking optimization model controlling the net predicted market sensitivities of the portfolios and index to be the same. These processes' efficacy is corroborated by our experiments on the Korea Composite Stock Price Index 200. Our experiments show a significant reduction of the prediction errors compared with historical estimations and competitive tracking errors of replicating the index utilizing fewer than half of the entire constituents. Therefore, we show that applying deep learning to predict market sensitivities is promising and that our portfolio construction methods are practically effective. Additionally, to our knowledge, this is the first study addressing market sensitivities focused on deep learning.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bb5f38907460f5c1360decc61824c68",
  "timestamp": "2025-05-15T00:35:17.585710"
}