{
  "id": 8701,
  "title": "The effects of pension on depressive symptoms in Chinese older adults: A moderated multiple mediator model",
  "abstract": "Objectives: This study investigates the impact of pension on depressive symptoms among Chinese older adults. Additional effort is made to test the mediating effect of multidimensional downward intergenerational support and the moderating effect of age on this relationship. Methods: A total of 1828 Chinese older community-dwellers who met our inclusion criteria are drawn from the 2018 China Health and Retirement Longitudinal Study. Multivariate regression modeling is applied to analyze the effect of pensions on depressive symptoms of older adults. Additionally, bootstrap method with resampling strategies is used to estimate the mediating effect of three dimensions of downward intergenerational support (instrumental, emotional, and financial support). Further, Johnson-Neyman technique is employed to analysis and visualize the moderating effect of age. Results: The findings reveal a significant inverse relationship between pension levels and depressive symptoms (B = -6.664, SE = 2.826, p < 0.05). The analysis shows that downward intergenerational emotional support (B = -0.195, Boot SE = 0.103, 95% Boot CI [-0.404, -0.003]) serves as a partial mediator in this relationship. Furthermore, the results highlight the moderating role of age in the linkage between pension and depressive symptoms (B = 0.065, SE = 0.039, p < 0.1). Discussion: This investigation is pioneering in simultaneously assessing the mediating role of multidimensional downward intergenerational support and the moderating effect of age in the context of pension and depressive symptoms. The study underscores the necessity of an interdisciplinary approach in devising comprehensive intervention strategies. These should encompass pension policy consultation, respite services, and other crucial elements aimed at mitigating the severity or reducing the risk of depressive symptoms among the older adults.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bb8afa2b653ebdacba30290bbc1de2e",
  "timestamp": "2025-05-15T03:21:24.723039"
}