{
  "id": 8109,
  "title": "Prospective association of the infant gut microbiome with social behaviors in the ECHO consortium",
  "abstract": "Background Identifying modifiable risk factors of autism spectrum disorders (ASDs) may inform interventions to reduce financial burden. The infant/toddler gut microbiome is one such feature that has been associated with social behaviors, but results vary between cohorts. We aimed to identify consistent overall and sex-specific associations between the early-life gut microbiome and autism-related behaviors.Methods Utilizing the Environmental influences on Children Health Outcomes (ECHO) consortium of United States (U.S.) pediatric cohorts, we gathered data on 304 participants with fecal metagenomic sequencing between 6-weeks to 2-years postpartum (481 samples). ASD-related social development was assessed with the Social Responsiveness Scale (SRS-2). Linear regression, PERMANOVA, and Microbiome Multivariable Association with Linear Models (MaAsLin2) were adjusted for sociodemographic factors. Stratified models estimated sex-specific effects.Results Genes encoding pathways for synthesis of short-chain fatty acids were associated with higher SRS-2 scores, indicative of ASDs. Fecal concentrations of butyrate were also positively associated with ASD-related SRS-2 scores, some of which may be explained by formula use.Limitations The distribution of age at outcome assessment differed in the cohorts included, potentially limiting comparability between cohorts. Stool sample collection methods also differed between cohorts. Our study population reflects the general U.S. population, and thus includes few participants who met the criteria for being at high risk of developing ASD.Conclusions Our study is among the first multicenter studies in the U.S. to describe prospective microbiome development from infancy in relation to neurodevelopment associated with ASDs. Our work contributes to clarifying which microbial features associate with subsequent diagnosis of neuropsychiatric outcomes. This will allow for future interventional research targeting the microbiome to change neurodevelopmental trajectories.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bbf1044048d75b367260baced80712b",
  "timestamp": "2025-05-15T03:15:09.456763"
}