{
  "id": 8346,
  "title": "Recent life events and adverse childhood experiences in predicting antenatal depression and anxiety: cross-sectional study",
  "abstract": "Background Antenatal depression and anxiety are associated with preterm labour, low birth weight, and postpartum depression, and can impact the emotional and mental development of the child. Both adverse childhood experiences and recent stressful events are linked to negative health outcomes. However, certain events may be more impactful than others.Objective This study aims to investigate the most important types of adverse childhood events and recent stressors that may help in identifying pregnant women in most need of psychological support.Methods This observational study examines data from the FamilieTrivsel trial, in which women between 6 and 10 weeks gestation were recruited by general practitioners. All participants were asked to complete questionnaires. Mental health was assessed with the Hospital Anxiety and Depression Score (HADS). Potential contributory risk factors were identified using the Recent Life Events Questionnaire and the Adverse Childhood Experiences questionnaire. The relative importance of the various types of events was analysed in a dominance analysis, and the direction of their association was determined by a multivariable linear regression analysis.Results Of specific recent life events, serious problems with a friend, divorce, racial harassment, unemployment, financial difficulties, and moving house had the strongest associations with poor mental health, along with childhood experience of mental illness in the household. Growing up with an experience of physical neglect and parental divorce were, paradoxically, associated with lower HADS scores.Conclusions Recent stressful life events have a stronger association with postnatal mental health than adverse childhood events, implying that it might be useful for clinicians providing routine antenatal care to gather information on recent stressors. The study explores the association of recent stressful events and adverse childhood experiences (ACEs) with the mental health of pregnant women. We found that recent stressful events, such as moving house, financial difficulties, and unemployment, are more strongly linked to depression and anxiety during pregnancy than experiences from childhood. Although women who had more ACEs were more likely to have had recent stressful events, the link was quite weak: only 5% of the variation in numbers of recent life experiences was explained by childhood adversity. Recent Stressful Events: Moving house, financial issues, and unemployment were significantly associated with higher anxiety and depression levels in pregnant women. Other impactful events included serious problems with friends, racial harassment, and divorce. Adverse Childhood Experiences: Growing up with mental illness in the household was negatively associated with mental health during pregnancy. We conclude that recent life stresses play a crucial role in the mental health of pregnant women. Identifying and providing support to women experiencing these stressors could potentially improve pregnancy outcomes and overall mental well-being. Our study underscores the importance of addressing current stressors in prenatal care to support the mental health of expectant mothers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bcda6da713f14a39904de7864533996",
  "timestamp": "2025-05-15T03:17:49.174216"
}