{
  "id": 3830,
  "title": "Capital structure decisions: research in Estonian non-financial companies",
  "abstract": "Purpose - To investigate the relations between company-specific financial factors and the capital structure decisions of Estonian non-financial companies and to examine behavioral differences between companies of different sizes. Design/methodology/approach - Totally 260 Estonian non-financial companies are divided into small-, medium- and large-companies, each sample being analysed by correlation-regression method in two aspects - impact of financial factors on static capital structure and capital structure dynamics. Companies' financial statements of 2002/2003 or 2003/2004 are used. Finally, capital structure adjustments in extreme boundaries are analyzed. Findings - Capital structure decisions among Estonian non-financial companies are driven by the pecking order theory, the evidences supporting optimal capital structure choices in long run remain weak. The robustness of the pecking order behavior significantly differs between smaller and bigger companies. Research limitations/implications - Limited number of companies surveyed due to hard manual work required to adjust financial accounts. Implication of findings is somewhat limited as the study covers a single country. Originality/value - The paper helps to identify financial drivers and to understand motivations behind capital structure decisions of emerging market companies and it supplements earlier studies. Quasi-equity debt distorts the observed capital structures. Capital structure is adjusted for operating leases and quasi-equity debt to identify true amount put at risk and its mix between owners and external lenders.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5beb4d67b8a19546b21e1d8219ec6085",
  "timestamp": "2025-05-15T02:30:28.683227"
}