{
  "id": 1441,
  "title": "Evaluation of market risk and resource allocation ability of green credit business by deep learning under internet of things",
  "abstract": "The research expects to evaluate the capital market risk and resource allocation ability of green credit business exploration based on neural network algorithm by deep learning in the context of the Internet of things, increase the funds flowing to green environmental protection industry, accelerate the development of real economy and stabilize China's market economy. On the basis of previous studies, the research takes the credit business in the capital market as the research object, and improves the ability of resource allocation by optimizing the financial transaction structure. On this basis, through comparative analysis, the grey system model is implemented. back propagation neural network model under deep learning is used to evaluate the capital market risk of green credit business exploration, and the data of different provinces in China from 2009 to 2019 are taken as an example to verify. The model is used to measure the relationship between green credit business and industrial structure. Additionally, it also analyzes the main factors affecting the efficiency of green credit. The results show that green credit mainly affects the industrial structure through enterprise capital and financing channels. China's overall green credit adjustment has had a significant upgrading effect on the industrial structure. The impact of green credit on industrial structure adjustment is different in the east, middle, and west regions. Optimizing the project capital structure, promoting seasonal financial transformation, setting up the function of innovation platform, and improving the internal governance structure of enterprises can improve financing efficiency and realize green and sustainable economic development in the future. The research results can provide a theoretical basis for the green development of China's financial market and the application of deep learning neural network algorithm under the background of Internet of things.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bed979d9d706f97d1acbf3d7ae5990d",
  "timestamp": "2025-05-15T02:03:00.705455"
}