{
  "id": 8020,
  "title": "Long-acting reversible contraceptive utilization after policy change increasing device reimbursement to wholesale acquisition cost in Louisiana",
  "abstract": "BACKGROUND: Unintended pregnancies, occurring in nearly 1 out of every 2 (45%) pregnancies in the United States, are associated with adverse health and social outcomes for the infant and the mother. The risk of unintended pregnancies is significantly reduced when women use long-acting reversible contraceptives, namely intrauterine devices and implants. Inadequate reimbursement for long-acting reversible contraceptive devices may be an access barrier to long-acting reversible contraceptive uptake. In 2014, the Louisiana Department of Health Bureau of Health Services Financing implemented a policy change that increased the Medicaid reimbursement rates for acquiring long-acting reversible contraceptive devices to the wholesale acquisition cost. OBJECTIVE: To examine the association of a Medicaid policy change that increased the long-acting reversible contraceptive device reimbursement rate to the wholesale acquisition cost (ie, price set by the manufacturers) on long-acting reversible contraceptive uptake among women at risk for unintended pregnancy. MATERIALS AND METHODS: This retrospective, repeated cross-sectional study used 2013-2015 Louisiana Medicaid claims data and contraceptive provision measures to assess associations between patient (age, race, urban/rural residence, postpartum status) and provider (urban/rural location, specialty) characteristics and long-acting reversible contraceptive uptake among contraceptive users (N = 193,623) using bivariate and logistic regression analyses. RESULTS: After long-acting reversible contraceptive reimbursement increased, there was a 2-fold likelihood increase in use in 2015 vs 2013 (odds ratio, 2.08; 95% confidence interval, 1.69-2.55). Long-acting reversible contraceptive uptake was more likely across all patient and provider subgroups in 2015 vs 2013 but notably among patients receiving contraceptive care from family planning clinics (odds ratio, 3.93; 95% confidence interval, 2.34-6.62). CONCLUSION: Removal of a provider-level financial barrier to long-acting reversible contraceptive provision was associated with increased long-acting reversible contraceptive uptake among women at risk for unintended pregnancy. Efforts to improve long-acting reversible contraceptive access should focus on equitable healthcare reimbursement for healthcare providers of reproductive-aged women.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5beef03da5b5ed1cfb4093da9512ede5",
  "timestamp": "2025-05-15T03:14:37.271044"
}