{
  "id": 7323,
  "title": "Effect of Critical Illness Insurance on Household Catastrophic Health Expenditure: The Latest Evidence from the National Health Service Survey in China",
  "abstract": "Background: China fully implemented the critical illness insurance (CII) program in 2016 to alleviate the economic burden of diseases and reduce catastrophic health expenditure (CHE). With an aging society, it is necessary to analyze the extent of CHE among Chinese households and explore the effect of CII and other associated factors on CHE. Methods: Data were derived from the Sixth National Health Service Survey (NHSS, 2018) in Jiangsu Province. The incidence and intensity of CHE were calculated with a sample of 3660 households in urban and rural areas in Jiangsu Province, China. Logistic regression and multiple linear regression models were used for estimating the effect of CII and related factors on CHE. Results: The proportion of households with no one insured by CII was 50.08% (1833). At each given threshold, from 20% to 60%, the incidence and intensity were higher in rural households than in urban ones. CII implementation reduced the incidence of CHE but increased the intensity of CHE. Meanwhile, the number of household members insured by CII did not affect CHE incidence but significantly decreased CHE intensity. Socioeconomic factors, such as marital status, education, employment, registered type of household head, household income and size, chronic disease status, and health service utilization, significantly affected household CHE. Conclusions: Policy effort should further focus on appropriate adjustments, such as dynamization of CII lists, medical cost control, increasing the CII coverage rate, and improving the reimbursement level to achieve the ultimate aim of using CII to protect Chinese households against financial risk caused by illness.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5bfc3c6d045340a87b1fe3e365fddd32",
  "timestamp": "2025-05-15T03:07:31.864960"
}