{
  "id": 568,
  "title": "RETRACTED: Design of Financial Management Model Using the Forward Neural Network Based on Particle Swarm Optimization Algorithm (Retracted Article)",
  "abstract": "The financial crisis of listed companies will bring huge losses to investors, so it is very important to establish a financial early warning model for investors and other stakeholders. The forward neural network model of particle swarm optimization is used to model and analyze the financial early warning of listed companies. In terms of data selection, earnings management indicators are substituted into the model for the common phenomenon of earnings management in listed companies. The results show that the accuracy of the model considering earnings management factors is improved from 65% to 70%. In the process of modeling, this paper uses the logistic regression model to further modify the model. The empirical results show that the accuracy of the model can be improved from 70% to 75%. When using the forward neural network model based on particle swarm optimization to make an empirical analysis of financial early warning of listed companies, adding quantitative indicators of earnings management can improve the accuracy of the model. In the demonstration, the correction of logistic regression model can also improve the accuracy of the particle swarm neural network financial early warning model. This greatly reduces the risk that companies with poor financial conditions will face bankruptcy and liquidation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c0534c4b8b24941b2cdd6d3061c0ead",
  "timestamp": "2025-05-15T01:52:49.382717"
}