{
  "id": 6631,
  "title": "Consumer Bankruptcy Prediction Using Balanced and Imbalanced Data",
  "abstract": "This paper examines the usefulness of logit regression in forecasting the consumer bankruptcy of households using an imbalanced dataset. The research on consumer bankruptcy prediction is of paramount importance as it aims to build statistical models that can identify consumers in a difficult financial situation that may lead to consumer bankruptcy. In the face of the current global pandemic crisis, the future of household finances is uncertain. The change of the macroeconomic and microeconomic situation of households requires searching for better and more precise methods. The research relies on four samples of households: two learning samples (imbalanced and balanced) and two testing samples (imbalanced and balanced) from the Survey of Consumer Finances (SCF) which was conducted in the United States. The results show that the predictive performance of the logit model based on a balanced sample is more effective compared to the one based on an imbalanced sample. Furthermore, mortgage debt to assets ratio, age, being married, having credit constraints, payday loans or payments more than 60 days past due in the last year appear to be predictors of consumer bankruptcy which increase the risk of becoming bankrupt. Moreover, both the ratio of credit card debt to overall debt and owning a house decrease the risk of going bankrupt.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c16dbbab94f7cb5d54a66d3809e3409",
  "timestamp": "2025-05-15T03:00:04.991660"
}