{
  "id": 8134,
  "title": "Text message intervention delivered from Australian general practices to improve breast cancer survivors' physical activity and cardiovascular risk factors: protocol for the EMPOWER-SMS-GP effectiveness implementation randomised controlled trial",
  "abstract": "Introduction Australian breast cancer survivors are at increased risk of cardiovascular disease and mortality, partly due to behavioural risk factors, including unhealthy diet and physical inactivity. Guidelines recommend health promotion delivered by general practitioners (GPs), but resources (ie, time and funding) are limited. Text message interventions sent from general practice to survivors may offer a low-resource solution but have not been evaluated. This randomised controlled trial (RCT) aims to evaluate the effectiveness and implementation of a text message intervention called EMPOWER-SMS-GP in Australian general practices.Methods and analysis Multi-centre single-blind hybrid I RCT (n=678; 1:1 allocation) comparing EMPOWER-SMS-GP (n=339) to usual care (n=339) at 6 months (postintervention), 12, 18 and 24 months (maintenance) and parallel mixed-methods process evaluation using the Reach, Effectiveness, Adoption, Implementation and Maintenance framework. Inclusion: adults (>= 18 years old) with early-stage breast cancer, completed active treatment <= 3 years ago, have a mobile phone and attended >= 1 GP appointment within 24 months. Primary outcome: between-group difference in mean physical activity (metabolic equivalent minutes/day) at 6 months, measured using an accelerometer. Secondary outcomes include self-reported physical activity, diet, quality of life, financial or psychological distress, fear of cancer recurrence, endocrine therapy adherence and body mass index. Statistical analyses (intention-to-treat) will include t-test (primary outcome) and linear and logistic mixed-effects regression models.Ethics and dissemination Approval received from the University of Sydney Human Research Ethics Committee (Number 2023/081). Trial results will be disseminated in peer-reviewed publications, presentations, lay summaries, videos and audio for scientific, government and public audiences.Trial registration number Australia and New Zealand Clinical Trial Registry (ACTRN12624000591550, 09/05/2024; U1111-1307-3454).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c329d68a7b326ae5de12edc832c5467",
  "timestamp": "2025-05-15T03:15:38.388755"
}