{
  "id": 5034,
  "title": "Firm financial performance in the wake of political turmoil; whether political connection is propitious?",
  "abstract": "PurposeThis study aims to investigate the effect of political turmoil on the firm financial performance, particularly in presence of politically affiliated board of directors.Design/methodology/approachThe study applied panel regression analyses on a data set of Pakistan's listed companies ranged over 14 years, spanning from 2007 to 2021. Political turmoil was first gauged through three determinants, i.e. political protest, government election and constitutional reform, and thereafter, economic uncertainty index was used as a proxy for political turmoil. For the purpose of political connection, the study used political affiliation of the board of directors.FindingsThe study finds that political turmoil has deleterious effect on the return on assets and Tobin's Q. The study further unveils that politically affiliated firms are relatively insulated from the volatility posed by the political uncertainty and exhibit significantly better financial outcomes.Practical implicationsFindings of the study suggest that appropriate composition of the board is imperative in offsetting the risk posed by the political turmoil. Hence, the results are useful for investors, policymakers and regulators to ensure financial soundness of firms in the wake of political turmoil.Originality/valueTo the best of the authors' knowledge, this is the first study that investigates the moderating impact of political connection on the performance of companies in presence of political turmoil.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c39149483be145a29788ee468243e1b",
  "timestamp": "2025-05-15T02:43:40.143906"
}