{
  "id": 8846,
  "title": "Dosimetric impact of target definition in brachytherapy for cervical cancer-Computed tomography and trans rectal ultrasound versus magnetic resonance imaging",
  "abstract": "Background and Purpose: Magnetic Resonance Imaging (MRI) based target definition in cervix brachytherapy is limited by its availability, logistics and financial implications, therefore, use of computed tomography (CT) and Trans Rectal UltraSonography (TRUS) has been explored. The current study evaluated the dosimetric impact of CT + TRUS based target volumes as compared to gold standard MRI. Methods and Materials: Images of patients (n = 21) who underwent TRUS followed by MRI and CT, were delineated with High-Risk Clinical Target Volume in CT (CTVHR-CT) and in MRI (CTVHR-MR). CTVHR-CT was drawn on CT images with TRUS assistance. For each patient, two treatment plans were made, on MRI and CT, followed by fusion and transfer of CTVHR-MR to the CT images, referred as CTVHR-MRonCT. The agreement between CTVHR-MRonCT and CTVHR-CT was evaluated for dosimetric parameters (D90, D98 and D50; Dose received by 90%, 98% and 50% of the volumes) using Bland-Altman plots, linear regression, and Pearson correlation. Results: No statistically significant systematic difference was found between MRI and CT. Mean difference (+/- 1.96 SD) of D90, D98 and D50 between CTVHR-MRonCT and CTVHR-CT was 2.0, 1.2 and 5.6 Gy respectively. The number of patients who have met the dose constraints of D90 > 85 Gy were 90% and 80% in MR and in CT respectively, others were in the borderline, with a minimum dose of 80 Gy. The mean +/- SD dose-difference between MR and CT plans for bladder was significant (5 +/- 13 Gy; p = 0.12) for D-0.1cm3, while others were statistically insignificant. Conclusion: CT + TRUS based delineation of CTVHR appear promising, provide useful information to optimally utilize for brachytherapy planning, however, MRI remains the gold standard.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c3a441ddb413a42d225669332e52da1",
  "timestamp": "2025-05-15T03:22:57.925556"
}