{
  "id": 5295,
  "title": "Gender differences in resources related to depressive symptoms during the early years of retirement: A Swedish population-based study",
  "abstract": "Objectives To examine levels of depressive symptoms during the early years of retirement in men and women and to investigate potential gender differences in associations with self-reported health, financial insecurity, social network and psychological resources. Methods Data was drawn from the first wave in the Health, Aging and Retirement Transitions in Sweden-study (HEARTS) including a total sample of 1148 retirees, aged 60 to 66. Level of depressive symptoms and associations with health, financial insecurity, social network and psychological resources were investigated in regression analyses in the total sample and in bivariate correlation analyses in the subgroup at risk of depression as defined by a cut-off >= 9 on the Center for Epidemiologic Studies Depression Scale (CES-D). Results Mean CES-D scores were similar in men and women in the entire sample. The CES-D identified 144 individuals at risk of depression (men 14%, women 11%, n.s.). Although the pattern of related resources was similar in men and women, a greater proportion of the variance was explained in the male group (51% vs 37%). Health, quality of social network, social support and competence satisfaction were all correlated with depressive symptoms in men in the high risk group, but no associations were seen in women. Conclusions Similar levels of depressive symptoms were observed in women and men in the retirement transition. However, the relevance of the selected resources may be greater in men. Research on the management of depressive symptoms in the transition between midlife and aging needs to take gender into consideration.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c4fd06bb9a981a67b3f9bca0f2a4c49",
  "timestamp": "2025-05-15T02:46:16.252946"
}