{
  "id": 2558,
  "title": "Integrated hedging and network planning for container shipping's bunker fuel management",
  "abstract": "Bunker fuel costs could account for 50-60 per cent of a ship's total operating cost in times of high fuel prices. The volatility of the bunker market over recent years has contributed to significant instability of cash flows for shipping lines. In this study, we consider two of the bunker fuel risk management measures employed by container shipping companies to reduce bunker fuel price risk - re-planning of network configuration and financial hedging of bunker fuel prices. The current industry practice is that the network planning and bunker hedging functions are carried out separately and sequentially. Specifically, the liner network is first planned to decide the ports of call, routes, fleet size, vessel types, and subsequently bunker hedging is performed based on the projected bunker fuel consumption and the forecast of bunker fuel price. This article shows the interdependencies between network planning and bunker hedging practices. By a numerical example using decision tree analysis, we illustrate the benefits of using an integrated planning approach that combines network planning and bunker hedging over the widely practiced sequential planning approach. We find that the integrated planning allows shipping lines to identify all available planning options and enables them to make decisions that could better meet the company's managerial priorities in terms of cost, transit time and risk.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c5673b8855b7e0a8058814a8b8ad263",
  "timestamp": "2025-05-15T02:16:32.726317"
}