{
  "id": 8891,
  "title": "Corporate social responsibility and forward default risk under firm and industry heterogeneity",
  "abstract": "Objective: This study aims to evaluate the impact of corporate social responsibility on forward default risk (FDR) under the setting of firm and industry heterogeneity. Research Design & Methods: This study evaluated the impact of corporate social responsibility (CSR) on FDR using the data of 497 companies from 2007-2021 in the S&P 500 index, taking into account firm and industry heterogeneity aspects. This study utilized instrumental variable regression using the generalized method of moments (IV-GMM) estimation technique which is robust for controlling the pertinent issue of endogeneity. Findings: This study found a negative relationship between CSR and FDR in the full sample. From the firm size aspect, this study found that CSR is more effective in mitigating FDR in large -cap firms than in mid -cap firms. Firm age heterogeneity exhibited a distinct behaviour, as young and middle-aged firms had a stronger impact on FDR management in comparison to old firms. Industry heterogeneity showed that industries with higher customer interaction have a higher impact on corporate social responsibility to control FDR. Industries with lower customer interaction have a lower impact on corporate social responsibility and FDR. Implications & Recommendations: We proposed some policy recommendations based on the findings in the context of firm and industry heterogeneity. Especially the management of mid -cap and young corporations should improve the CSR policy to enhance CSR performance which would lead to stabilized protection against FDR. Similarly, consumer -intensive industries should also focus on enhancing CSR initiatives to decrease FDR. Non -consumer -intensive industries should focus on enhancing CSR policy and at the same time pay particular attention to communicating CSR results to end consumers to reduce FDR. Contribution & Value Added: This study is the first to explore CSR's impact on financial parameters under heterogeneity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c5d40b1bebafdb4efea52975bdfe97c",
  "timestamp": "2025-05-15T03:23:27.841901"
}