{
  "id": 4941,
  "title": "Social position and geriatric syndromes among Swedish older people: a population-based study",
  "abstract": "Background Older people with a low social position are at higher risk of poor health outcomes compared to those with a higher social position. Whether lower social position also increases the risk of geriatric syndromes (GSs) remains to be determined. This study investigates the association of social position with GSs among older community-dwellers. Methods Three consecutive population-based health surveys in 2006, 2010 and 2014 among older community-dwellers (age 65-84 years) in Stockholm County were combined (n = 17,612) and linked with Swedish administrative registry information. Social position was assessed using registry information (i.e. education, country of origin and civil status) and by self-reports (i.e. type of housing and financial stress). GSs were assessed by self-reports of the following conditions: insomnia, urinary incontinence, functional decline, falls, depressive disorder, hearing or vision problems. Binomial logistic regression analyses were used to estimate the association between social position and GSs after adjusting for age, sex, health status, health behavior and social stress. Results The prevalence of GSs was 70.0%, but varied across GSs and ranged from 1.9% for depression to 39.1% for insomnia. Living in rented accommodation, being born outside the Nordic countries, being widowed or divorced were associated with GS presence. Financial stress was most strongly associated with GSs (adjusted odds ratio, 2.59; 95% CI, 2.13-3.15). Conclusion GSs are highly prevalent among older Swedish community-dwellers with wide variations across syndromes and strong association with all measures of social position, most strikingly that of experiencing financial stress.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c717e9413b2f6b78adf31d02fae041c",
  "timestamp": "2025-05-15T02:42:36.182475"
}