{
  "id": 4011,
  "title": "Two-step square wave testing: A 110-second method for diagnosing internal short circuit and two states of lithium-ion batteries",
  "abstract": "As batteries lose capacity over time, disposing of them presents substantial environmental and financial challenges. Regrouping retired batteries extends their life and reduces the need for new manufacturing costs. Regrouping necessitates evaluating performance indicators and identifying safety concerns, with prompt recognition of internal short circuits (ISC) helping lower the risk of thermal runaway and serious accidents. Current ISC detection techniques are time-consuming, generally requiring full charge-discharge cycles or extended relaxation periods for data collection. This study presents a quick diagnostic method that uses two consecutive unequal square waves over 110 s to simultaneously assess safety information and battery states. The duration and magnitude of each square wave are thoroughly discussed, where the first wave primarily identifies the two battery states, i.e., state of health (SOH) and state of charge (SOC), while the second wave with its associated impedance spectrum offers key insights for ISC detection. We employ machine learning techniques that draw on features from both waves: initial voltage and ohmic resistance from the first, and three low- frequency impedances from the second. This approach accurately classifies ISC severity levels with 93.83 % accuracy, while simultaneously predicting the SOH and SOC with root mean square errors of 2.22 % and 1.72 %, respectively.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c7b24efac97828c96a51e55b549707c",
  "timestamp": "2025-05-15T02:31:58.722508"
}