{
  "id": 324,
  "title": "A RS Model for Stock Market Forecasting and Portfolio Selection Allied with Weight Clustering and Grey System Theories",
  "abstract": "In this study, the weight clustering model which consists of GM(1,N) with K-means Clustering is combined with Grey Systems theory and Rough Set (RS) theory to create an automatic stock market forecasting and portfolio selection mechanism. In our proposed approach, financial data are collected every quarter and are inputted to an GM(1,1) predicting model to forecast the future trends of the collected data over the next quarter. Next, the forecasted data of financial statement is transformed into financial ratios using a GM(1,N) model and clustered by using a K-means clustering algorithm, and then supplied to a RS classified module which selects appropriate investment stocks by adopting a set of decision-making rules. Finally, a grey relational analysis technique is applied to specify an appropriate weighting of the selected stocks to maximize the portfolio's rate of return. The validity of our proposed approach is demonstrated to use the electronic stock data extracted from the financial database maintained by the Taiwan Economic Journal (TEJ). The portfolio's results derived by using our proposed weight clustering model are compared with those portfolio's results of a conventionally clustering method. It is found that our proposed method yielded a greater average annual rate of return (23.42%) on the selected stocks from 2004 to 2006 in Taiwan stock market.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c7f4f622b21547559b04fd72f4277aa",
  "timestamp": "2025-05-15T00:42:00.440851"
}