{
  "id": 7290,
  "title": "An Evaluation of the Well at Dell Health Management Program: Health Risk Change and Financial Return on Investment",
  "abstract": "Purpose. To investigate the effectiveness of the Well at Dell comprehensive health management program in delivering health care and productivity cost savings relative to program investment (i.e., return on investment). Design. A quasi-experimental design was used to quantify the financial impact of the program and nonexperimental pre-post design to evaluate change in health risks. Setting. Ongoing worksite health management program implemented across multiple US. locations. Subjects. Subjects were 24,651 employees with continuous medical enrollment in 2010-2011 who were eligible for 2011 health management programming. Intervention. Incentive-driven, outcomes-based multicomponent corporate health management program including health risk appraisal (HRA)/wellness, lifestyle management, and disease management coaching programs. Measures. Medical, pharmacy, and short-term disability pre/post expenditure trends adjusted for demographics, health status, and baseline costs. Self-reported health risks from repeat HRA completers. Analysis. Propensity score-weighted and multivariate regression-adjusted comparison of baseline to post trends in health care expenditures and productivity costs for program participants and nonparticipants (i.e., difference in difference) relative to programmatic investment. Results. The Well at Dell program achieved an overall return on investment of 2.48 in 2011. Most of the savings were realized from the HRA/wellness component of the program. Cost savings were supported with high participation and significant health risk improvement Conclusion. An incentive-driven, well-managed comprehensive corporate health management program can continue to achieve significant health improvement while promoting health care and productivity cost savings in an employee population.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c953f0051080f7e81d01091e1178b0b",
  "timestamp": "2025-05-15T03:07:02.638830"
}