{
  "id": 35,
  "title": "Prediction of Supply Chain Financial Credit Risk Based on PCA-GA-SVM Model",
  "abstract": "Supply Chain Finance (SCF) is a new type of financing business carried out by commercial banks on the basis of supply chain management, which effectively promotes the healthy development of the supply chain. As the most typical mode of SCF, accounts receivable financing mode can use the part of accounts receivable occupying working capital for financing, which is widely used. In order to effectively manage the credit risk in the Supply Chain Finance and maintain the healthy operation of the supply chain, this paper proposes a supply chain financial credit risk prediction model based on PCA-GA-SVM. First, principal component analysis (PCA) is used to reduce the dimension of the original index system, and then genetic algorithm (GA) is used to optimize the parameters of support vector machine (SVM). Finally, the principal components selected by PCA are input into the GA-SVM model for training, and the final prediction model is established. The running results show that the prediction performance of PCA-GA-SVM model is better than that of SVM and GA-SVM models. It has a good generalization ability, which can be used as a reference for commercial banks to improve the credit risk management ability of Supply Chain Finance and is conducive to the sustainable development of supply chain finance business.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5c9c589c19425d55908cc4ff2f1f56ac",
  "timestamp": "2025-05-15T01:46:03.844034"
}