{
  "id": 1978,
  "title": "A machine-learning digital-twin for rapid large-scale solar-thermal energy system design",
  "abstract": "In many industrialized regions of the world, large-scale photovoltaic systems now contribute a significant part to the energy portfolio during daylight operation. However, as energy demands peak shortly before sunset and persist for several hours afterwards, the integration of solar-thermal systems is extremely advantageous as a green bridge energy source. Accordingly, this work develops a digital-twin model to track and optimize the flow of incoming solar power through a complex solar -thermal storage system, consisting of a large array of adaptable mirrors, an optical-receiver and a power distribution system for customers to extract energy. Specifically, the solar power flow is rapidly computed with a reduced order model of Maxwell's equations, based on a high-frequency decomposition of the irradiance into multiple rays that experience mirror reflections, losses and ultimately receiver absorption and customer delivery. The method allows for rapid testing (in microseconds) of the performance of large numbers of mirror-receiver layout configurations in design space, over extremely long time periods, such as weeks, months and years, using a genetic-based machine-learning digital-twin framework, which integrates submodels for: & BULL; optics and tracking of the Fresnel multi-mirror system, & BULL; thermal absorption of the optical energy by the receiver and & BULL; optimal operating temperatures balancing radiative losses with heat storage. The overall machine-learning digital-twin optimizes the configuration layout to balance meeting customer demands and operational efficiency. Numerical examples are provided to illustrate the approach. Finally, a deep-learning algorithm is developed and applied to the create an Artificial Neural-Net representation, which allows for even further simulation speedup. & COPY; 2023 Published by Elsevier B.V.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ca0ebd06c4707c02a52a38ceabbcbaa",
  "timestamp": "2025-05-15T01:01:41.636990"
}