{
  "id": 7542,
  "title": "Video lottery terminal access and gambling among high school students in Montreal",
  "abstract": "Background: Gambling is a risky behaviour that involves uncertain financial outcomes, can be addictive, and has been associated with strongly adverse social and public health outcomes. We wanted to assess whether socio-economic and gambling-related-opportunity environments of neighbourhoods affected the uptake of video lottery terminal (VLT) gambling among Montreal youth. Methods: Spatial and statistical analyses were conducted to examine geographical patterns of neighbourhood socio-economic conditions, VLT sites (n=407), and high school locations (n=305) within the Montreal Census Metropolitan Area (CMA). VLT concentration within high school neighbourhoods was measured to examine how the number of VLT opportunities varies according to socio-economic status of the school neighbourhood. A student survey was analyzed using logistic regression analysis to explore the role of individual (student) characteristics and environmental (neighbourhood) characteristics in predicting the VLT gambling behaviours reported among a sample (n=1206) of high school students. Results: Video lottery gambling opportunities are more prevalent near schools located in socio-economically deprived neighbourhoods compared with schools located in more affluent neighbourhoods. The principal individual risk factors for VLT gambling were shown to be male sex, peer VLT-use, substance use, as well as the after-school routines of youth. Interpretation: The spatial distribution of VLTs reflects local geographies of socioeconomic disadvantage and may have a pronounced impact on students attending schools in lower income neighbourhoods, especially those with individual risk factors. Efforts to reduce gambling-related public health costs may want to take into account the sociospatial distribution of gambling opportunities, particularly in the local environments that youth frequent.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5cb9acaf716365791328868c8d635cb4",
  "timestamp": "2025-05-15T03:09:36.921633"
}