{
  "id": 4052,
  "title": "Servitization and firm productivity premium across the product value chain: evidence from Russian manufacturing firms",
  "abstract": "PurposeThis paper aims to discuss the firm productivity premium for servitized firms. It discusses servitization across the product value chain and estimates the effects of the range and extent of servitization on productivity premium in manufacturing firms.Design/methodology/approachThis paper develops a conceptual framework and tests the hypotheses on the effects of servitization on productivity premium using linear regression models with a sample of 20,837 Russian manufacturing firms gathered from the Ruslana Bureau van Dijk database and the Russian customs service.FindingsServitized firms exhibit higher total factor productivity and labor productivity. The labor productivity premium increases with the number of services offered. However, the impact of services on productivity varies along the product value chain: postmanufacturing and postsales services enhance productivity premium, while manufacturing and back-office services diminish them. The effect of establishment services remains ambiguous.Practical implicationsThis paper offers an analytical framework for firms to assess their servitization strategies. These strategies should be gradual, focused on enhancing firm efficiency rather than being an end goal. Firms should initiate the process by introducing services at the postproduction and postsales stages of the product creation chain to achieve productivity premium.Originality/valueThe paper extends the evidence on firm-level productivity drivers and contributes to the servitization theory. A servitization strategy should be portfolio-based, considering both the potential gains and losses in productivity resulting from the implementation of specific services.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5cc3982ef00968f3f51861a88e3c1a5a",
  "timestamp": "2025-05-15T01:23:27.299410"
}