{
  "id": 7497,
  "title": "Risk of Unplanned Hospital Encounters in Patients Treated With Radiotherapy for Head and Neck Squamous Cell Carcinoma",
  "abstract": "Context. Radiotherapy is highly effective for treating squamous cell carcinoma of the head and neck but is often associated with significant toxicities and severe morbidity. Unplanned emergency department (ED) visits and hospitalizations are common during treatment and come with a substantial financial and health burden as well as the potential for impaired long-term outcomes due to treatment disruption. Objectives. The objective of this study was to identify patient, disease, and treatment characteristics that were associated with ED encounters and admissions. Methods. A cohort of 462 patients with cancer of the head and neck treated with radiotherapy at UT Southwestern between 2010 and 2015 was retrospectively analyzed. The risks of ED visits, admissions, multiple admissions, and extended admissions were determined. Risk factors for an unplanned hospital encounter were analyzed using univariate and multivariate logistic regression. Results. Overall, 36% of patients had an unplanned hospital encounter during the treatment window. Patients with advanced disease, those with high comorbidity score, and those treated with concurrent chemotherapy were more likely to have unplanned admissions/ED visits. Social factors such as marital status, smoking status, and registration in the public hospital system were also strongly associated with admissions and multiple encounters. Conclusion. The high rate of admissions and ED visits emphasizes the importance of anticipating and managing toxicities during treatment. Social factors have a strong association with unplanned encounters and may present opportunities for targeted interventions to reduce admissions for patients at highest risk. (C) 2018 Published by Elsevier Inc. on behalf of American Academy of Hospice and Palliative Medicine.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ccb846a4d599bd0859ae782f2455a3f",
  "timestamp": "2025-05-15T03:09:07.328121"
}