{
  "id": 9057,
  "title": "Effect of the COVID-19 Lockdown on Mobile Payments forMaternal Health:Regression Discontinuity Analysis",
  "abstract": "Background: The COVID-19 pandemic resulted in the unprecedented popularity of digital financial services for contactlesspayments and government cash transfer programs to mitigate the economic effects of the pandemic. The effect of the pandemicon the use of digital financial services for health in low- and middle-income countries, however, is poorly understood. Objective: This study aimed to assess the effect of the first COVID-19 lockdown on the use of a mobile maternal health wallet,with a particular focus on delineating the age-dependent differential effects, and draw conclusions on the effect of lockdownmeasures on the use of digital health services.Methods: We analyzed 819,840 person-days of health wallet use data from 3416 women who used health care at 25 publicsector primary care facilities and 4 hospitals in Antananarivo, Madagascar, between January 1 and August 27, 2020. We collecteddata on savings, payments, and voucher use at the point of care. To estimate the effects of the first COVID-19 lockdown inMadagascar, we used regression discontinuity analysis around the starting day of the first COVID-19 lockdown on March 23,2020. We determined the bandwidth using a data-driven method for unbiased bandwidth selection and used modified Poissonregression for binary variables to estimate risk ratios as lockdown effect sizes. Results: We recorded 3719 saving events, 1572 payment events, and 3144 use events of electronic vouchers. The first COVID-19lockdown in Madagascar reduced mobile money savings by 58.5% (P<.001), payments by 45.8% (P<.001), and voucher use by49.6% (P<.001). Voucher use recovered to the extrapolated prelockdown counterfactual after 214 days, while savings andpayments did not cross the extrapolated prelockdown counterfactual. The recovery duration after the lockdown differed by agegroup. Women aged >30 years recovered substantially faster, returning to prelockdown rates after 34, 226, and 77 days for savings,payments, and voucher use, respectively. Younger women aged <25 years did not return to baseline values. The results remainedrobust in sensitivity analyses using +/- 20 days of the optimal bandwidth. Conclusions: The COVID-19 lockdown greatly reduced the use of mobile money in the health sector, affecting savings,payments, and voucher use. Savings were the most significantly reduced, implying that the lockdown affected women's expectationsof future health care use. Declines in payments and voucher use indicated decreased actual health care use caused by the lockdown.These effects are crucial since many maternal and child health care services cannot be delayed, as the potential benefits will belost or diminished. To mitigate the adverse impacts of lockdowns on maternal health service use, digital health services could be everaged to provide access to telemedicine and enhance user communication with clear information on available health careaccess options and adherence to safety protocols",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ccd0b04e00713bad26c50dbf02bc124",
  "timestamp": "2025-05-15T03:24:55.018732"
}