{
  "id": 8038,
  "title": "Stressful life events and alcohol consumption in pregnant women: A cross-sectional survey",
  "abstract": "Background: Psychological stress in pregnancy has been related to different adaptations (physical, emotional and social) of the woman's life during this period. Although maternal stress is a common occurrence in pregnancy, studies indicate that the high levels of stressful life events are a predisposing factor to alcohol consumption in pregnant women. Though postnatal maternal emotional distress has been extensively investigated, little is known about the association between stressful life events and maternal risk behaviors during pregnancy. Objectives: The purpose of this study is to verify the association between stressful life events and alcohol consumption in pregnant women. Design and participants: This is a cross-sectional survey using a convenience sample of 449 women in the third trimester of pregnancy. The participants were recruited in a public maternity hospital in the city located in the state of Sao Paulo, Brazil. Methods: A semi-structured interview was used to assess alcohol use and stressful life events of the respondent's life. The semi-structured interview included the following instruments: a socio-demographic questionnaire, inventory for the evaluation of the stressful life events (Interview for Recent life events - IRLE), the questionnaire Tolerance, Annoyed, Cut-down, Eye-Opener (T-ACE) for the use of alcohol, the International Classification of Diseases (ICD-10) criteria for alcohol-related disorders, and the evaluation of consumption before and during each gestational trimester. Results: Pregnant women diagnosed with alcohol abuse and alcohol dependence according to ICD-10 and with risk consumption, according to T-ACE screening, had a higher occurrence of stressful life events than the group without this diagnosis (p < 0.001). The following stressful life events were more frequent among women with alcohol problems: Major financial difficulties, Loss or theft of objects, Serious argument with non-resident/close family member, Serious argument with family members, and Marital separation with the latter about eight times more common in this group. Conclusion: The results suggest an association between stressful life events and dependence or risk consumption of alcohol in pregnant women. The evaluation of stressful life events by the nursing team can help pregnant women to identify or strengthen healthy coping styles in the face of stress, thus intervene, and avoid alcohol consumption during pregnancy. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5cce9f10f0a6b982f2f6064dff378b50",
  "timestamp": "2025-05-15T03:14:37.353110"
}