{
  "id": 4041,
  "title": "Quantifying the risk of price fluctuations based on weighted Granger causality networks of consumer price indices: evidence from G7 countries",
  "abstract": "The consumer price index (CPI) is the weighted average of a basket of subcategories (CPI classes) and is the most widely adopted indicator in analyzing the risk of inflation or deflation. However, CPI classes contain more risk information. The CPI classes and the transmission of price fluctuations among them form a price index system. By using the CPI classes of the G7 countries, we explored the evolution of the fluctuation-transmission relationships among CPI classes and constructed weighted Granger causality networks (WGCNs) for each country. We measured the price fluctuation risk of the price index system in the G7 countries by using system risk entropy and revealed the structure of the systems from four perspectives: out-degree, clustering coefficient, correlation degree between CPI classes and the survival ratio of the Granger causality. We found the following trends. (1) The system risk entropy changed over time. After the 2008 financial crisis, the price fluctuation risk in the price index system increased. (2) The identified CPI classes with large out-degrees are vital in monitoring the fluctuations of commodities prices. (3) The stability of the Granger causality among CPI classes decreased as the time span increased, and the structure of most WGCNs was completely different after 2 years.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5cf8a27b701a77e0f8636bcabd473773",
  "timestamp": "2025-05-15T02:32:27.568607"
}