{
  "id": 8712,
  "title": "Influences on eating: a qualitative study of adolescents in a periurban area in Lima, Peru",
  "abstract": "Background: Peruvian adolescents are at high nutritional risk, facing issues such as overweight and obesity, anemia, and pregnancy during a period of development. Research seeking to understand contextual factors that influence eating habits to inform the development of public health interventions is lacking in this population. This study aimed to understand socio-cultural influences on eating among adolescents in periurban Lima, Peru using qualitative methods. Methods: Semi-structured interviews and pile sort activities were conducted with 14 adolescents 15-17 years. The interview was designed to elicit information on influences on eating habits at four levels: individual (intrapersonal), social environmental (interpersonal), physical environmental (community settings), and macrosystem (societal). The pile sort activity required adolescents to place cards with food images into groups and then to describe the characteristics of the foods placed in each group. Content analysis was used to identify predominant themes of influencing factors in interviews. Multidimensional scaling and hierarchical clustering analysis was completed with pile sort data. Results: Individual influences on behavior included lack of financial resources to purchase food and concerns about body image. Nutrition-related knowledge also played a role; participants noted the importance of foods such as beans for anemia prevention. At the social environmental level, parents promoted healthy eating by providing advice on food selection and home-cooked meals. The physical environment also influenced intake, with foods available in schools being predominantly low-nutrient energy-dense. Macrosystem influences were evident, as adolescents used the Internet for nutrition information, which they viewed as credible. Conclusions: To address nutrition-related issues such as obesity and iron-deficiency anemia in Peruvian adolescents, further research is warranted to elucidate the roles of certain factors shaping behavior, particularly that of family, cited numerous times as having a positive influence. Addressing nutrition-related issues such as obesity and iron-deficiency anemia in this population requires consideration of the effect of social and environmental factors in the context of adolescent lifestyles on behavior. Nutrition education messages for adolescents should consider the cultural perceptions and importance of particular foods, taking into account the diverse factors that influence eating behaviors.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5cfc09695f3077ddf437ca7d7be871e8",
  "timestamp": "2025-05-15T03:21:24.753757"
}