{
  "id": 6813,
  "title": "Cost-related delay in filling prescriptions and health care ratings among medicare advantage recipients",
  "abstract": "Despite higher health care needs, older adults often have limited and fixed income. Approximately a quarter of them report not filling or delaying prescription medications due to cost (cost-related prescription delay, CRPD). To ascertain the association between CRPD and satisfaction with health care, secondary analysis of the 2012 Consumer Assessment of Healthcare Providers and Systems (CAHPS) Medicare Advantage Survey was performed. Regression models quantified the association between CRPD and rating of personal doctor, specialist, and overall health care. Models were adjusted for demographic, health-related, and socioeconomic characteristics. 274,996 Medicare Advantage enrollees were mailed the CAHPS survey, of which 101,910 (36.8%) returned a survey that had responses to all the items we analyzed. CRPD was assessed by self-report of delay in filling prescriptions due to cost. Health care ratings were on a 0-10 scale. A score <= 5 was considered a poor rating of care. In unadjusted models, CRPD more than doubled the relative risk (RR) for poor ratings of personal doctor (RR 2.34), specialist (RR 2.14), and overall health care (RR 2.40). Adjusting for demographics and health status slightly reduced the RRs to 1.9, but adjusting for low-income subsidy and lack of insurance for medications did not make a difference. CRPD is independently associated with poor ratings of medical care, regardless of health, financial or insurance status. Providers might reduce patients' financial stress and improve patient satisfaction by explicitly discussing prescription cost and incorporating patient priorities when recommending treatments.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d0ffd9b3c17b532aa6be03fa9da4e7d",
  "timestamp": "2025-05-15T03:02:07.395014"
}