{
  "id": 4971,
  "title": "How does fintech affect the revenue and risk of commercial banks? Evidence from China",
  "abstract": "Financial technology (fintech) has driven a profound transformation in the finance industry, and the application of various new technologies in the financial sector has brought about changes in the operating environment faced by commercial banks. To assess the impact of fintech on commercial banks, we selected Chinese commercial banks as sample data, calculated the fintech application index at the individual bank level using text mining methods and principal component analysis, and conducted empirical tests using fixed-effect panel regression models. Our results indicate that the application of fintech can effectively increase a bank's revenue. In terms of risk, using binned groups analysis we found that the development of fintech has a nonlinear, roughly L-shaped relationship with the risk of commercial banks. Further, we also considered the characteristics of the Chinese banking industry for further analysis of the impact of bank-type heterogeneity and to control for sample differences. In addition, we enhanced the robustness of the empirical results using substitution variables, instrumental variable methods and propensity score matching. In conclusion,starting from a new perspective on fintech, using the Chinese banking industry as an example, we offer suggestions for developing the fintech capabilities of banks in developing countries.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d16c84aa07325626886fc38e64ed7d2",
  "timestamp": "2025-05-15T02:43:06.692456"
}