{
  "id": 5422,
  "title": "Political Management, Research and Development, and Advertising Capital in the Pharmaceutical Industry: A Good Prognosis?",
  "abstract": "Regulatory oversight that affects the firm's product-market environment continues to increase. Political management capital (PMC) describes firm expenditure committed to address the political and regulatory context. Neoinstitutional theory casts PMC as an institutionally expected normative response investors use when evaluating firm performance. Although limited evidence has suggested that firms benefit from PMC, the authors demonstrate its effects across financial outcomes including firm value, systematic risk, and idiosyncratic risk. Likewise, they examine how PMC interacts with a firm's product market through research-and-development (R&D) capital and advertising capital. Regression analysis of an unbalanced data set of 212 firms in the pharmaceutical and medical device industry, tracked from 2003 to 2014, reveals that while PMC improves investor expectations through firm value and systematic risk, it increases idiosyncratic risk. The authors find that PMC plays both substitutive and complementary roles with R&D such that increasing levels of both PMC and R&D weakens main effects. Political management capital has limited, but substitutive, effects with advertising likely because there is less regulatory oversight on advertising versus R&D in this industry. The authors explore these asymmetric effects, provide implications for neoinstitutional theory, and offer managerial insights.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d1bad8077e5e903d6caeace9f9204bb",
  "timestamp": "2025-05-15T02:47:42.884498"
}