{
  "id": 7160,
  "title": "Impact of Healthcare Non-Take-Up on Adherence to Long-Term Positive Airway Pressure Therapy",
  "abstract": "Background: The effectiveness of positive airway pressure therapies (PAP) is contingent on treatment adherence. We hypothesized that forgoing healthcare may be a determinant of adherence to PAP therapy. Research Question: The objectives were: (i) to assess the impact of forgoing healthcare on adherence to PAP in patients with Chronic Respiratory Failure (CRF) and patients with Obstructive Sleep Apnea Syndrome (OSAS); (ii) to compare forgoing healthcare patterns in these two chronic conditions. Study design and methods: Prospective cohort of patients with OSAS or CRF, treated with PAP therapies at home for at least 12 months. At inclusion, patients were asked to fill-in questionnaires investigating (i) healthcare forgone, (ii) deprivation (EPICES score), (iii) socio-professional and familial status. Characteristics at inclusion were extracted from medical records. PAP adherence was collected from the device's built-in time counters. Multivariable logistic regression models were used to assess the associations between healthcare forgone and the risk of being non-adherent to CPAP treatment. Results: Among 298 patients included (294 analyzed); 33.7% reported forgoing healthcare. Deprivation (EPICES score > 30) was independently associated with the risk of non-adherence (OR = 3.57, 95%CI [1.12; 11.37]). Forgoing healthcare had an additional effect on the risk of non-adherence among deprived patients (OR = 7.74, 95%CI [2.59; 23.12]). OSAS patients mainly forwent healthcare for financial reasons (49% vs. 12.5% in CRF group), whereas CRF patients forwent healthcare due to lack of mobility (25%, vs. 5.9 % in OSAS group). Interpretation: Forgoing healthcare contributes to the risk of PAP non-adherence particularly among deprived patients. Measures tailored to tackle forgoing healthcare may improve the overall quality of care in PAP therapies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d2a1628bba71ef0992e727d5f1805f1",
  "timestamp": "2025-05-15T03:05:32.127128"
}