{
  "id": 9109,
  "title": "Factors affecting community participation in drone-based larviciding using Bacillus thuringiensis var. israelensis (Bti) for bio-control of malaria vectors in Rwanda",
  "abstract": "BackgroundMalaria remains a significant health issue in Rwanda. Primary malaria prevention methods include insecticide-treated nets and indoor residual spraying as core interventions. Mosquito repellents, larval source management (LSM), and housing improvement are recommended as supplemental vector control methods. A 2020-2021 study in rice field habitats of peri-urban of Kigali City successfully evaluated the entomological and epidemiological impacts of drone-based larviciding using Bacillus thuringiensis var. israelensis (Bti).MethodsThe present study employed a concurrent mixed-methods design to assess community knowledge, perception, acceptance, and willingness to participate in drone-based larviciding for malaria control in Kigali City. A total of 248 respondents participated in the quantitative survey interviews while five focus group discussions (FGDs), each comprising 10-12 participants, were conducted. Quantitative data were analysed using SPSS and R software, with logistic regression applied to identify factors influencing community participation. Qualitative data were manually coded and analysed thematically to complement the quantitative findings.ResultsParticipants showed widespread knowledge of malaria transmission and prevention, with high awareness of the importance of larviciding. A strong support of 96.4% expressed willingness to accept drone-based larviciding, including financial and free labour support. Factors influencing willingness to participate include occupation in rice and vegetable farming and mining (95% CI - 3.053 to - 0.169, p = 0.029), mosquito exposure (95% CI - 5.706 to - 1.293, p = 0.004). Participants highlighted drone-based larviciding role in reducing mosquitoes and malaria risk and recommended it's scaling up as a core component of integrated vector management (IVM).ConclusionsThis study highlights strong community awareness and acceptance of drone-based larviciding, with its effectiveness in reducing mosquito abundance and malaria risks, along with the safety of Bti and drones. The findings advocate integrating drone-based larviciding into national malaria control strategies by enhancing community education, building local expertise, and adopting innovative financing mechanisms for scalability and sustainability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d2c0d576d609c2dc334020c9f8d449f",
  "timestamp": "2025-05-15T03:25:27.805442"
}