{
  "id": 6744,
  "title": "Incidence of Clostridioides difficile infection (CDI) related to antibiotic prescribing by GP surgeries in Wales",
  "abstract": "Background: Clostridioides difficile infection (CDI) is a healthcare-acquired infection (HAI) causing significant morbidity and mortality. Welsh CDI rates are high in comparison with those in England and Scotland. Objectives: This retrospective ecological study used aggregated disease surveillance data to understand the impact of total and high-risk Welsh GP antibiotic prescribing on total and stratified inpatient/non-inpatient CDI incidence. Methods: All cases of confirmed CDI, during the financial years 2014-15 to 2017-18, were Linked to aggregated rates of antibiotic prescribing in their GP surgery and classified as 'inpatient', 'non-inpatient' or 'unknown' by Public Health Wales. Multivariable negative-binomial regression models, comparing CDI incidence with antibiotic prescribing rates, were adjusted for potential confounders: location; age; social deprivation; comorbidities (estimated from prevalence of key health indicators) and proton pump inhibitor (PPI) prescription rates. Results: There were 4613 confirmed CDI cases, with an incidence (95% CI) of 1.44 (1.40-1.48) per 1000 registered patients. Unadjusted analysis showed that an increased risk of total CDI incidence was associated with higher total antibiotic prescribing [relative risk (RR) (95% CI) =1.338 (1.170-1.529) per 1000 items per 1000 specific therapeutic group age-sex related GP prescribing units (STAR-PU)] and that high-risk antibiotic classes were positively associated with total CDI incidence. Location, age >= 65 years and diabetes were associated with increased risk of CDI. After adjusting for confounders, prescribing of clindamycin showed a positive association with total CDI incidence [RR (95% CI) =1.079 (1.001-1.162) Log items per 1000 registered patients]. Conclusions: An increased risk of CDI is demonstrated at a primary care practice population Level, reflecting their antibiotic prescribing rates, particularly clindamycin, and population demographics.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d2f6970dabf0a53f4f19b09a1f5fd34",
  "timestamp": "2025-05-15T03:01:03.627190"
}