{
  "id": 4069,
  "title": "Field Study of the Management of the IT Services Catalog in Public Organizations in the Manabi Province, Ecuador",
  "abstract": "The catalog of Information Technology (IT) services is a structure where the IT services are identified and classified in a specific organization; this catalog is the basis for the IT services portfolio to be properly managed during its useful life. According to recent related works that were investigated, there exist a problem with many organizations avoiding the construction of the IT Service Catalog because of the complexity that this activity represents or the lack of proven proposals for this purpose. The objective of this study is to determine the status of IT Service Catalog management in the public sector, analyzed from the perspective of the IT user. Therefore, the methodology used includes a field study applied to 100 IT users in 20 public organizations in the state of Manabi, Republic of Ecuador, within the IT department or area. This study identifies important aspects such as: a) the level of knowledge of users about the services provided by the IT department or area, b) the means that users use to access IT services, c) the level of user participation in the identification of services, classification of services, conformation of the technical catalog, conformation of the catalog for the user and withdrawal of services, d) the rating that users give to the process carried out by the IT department. In conclusion it is emphasized that the delivery of services is not done using a structured SC, also the level of knowledge of IT users on the IT Service Catalog is relatively low, and due to this their participation is very limited in the construction and management of the IT Service Catalog.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d32c62b6f0f76582b94c6208dac23a1",
  "timestamp": "2025-05-15T01:23:27.353753"
}