{
  "id": 8980,
  "title": "Bovine cysticercosis epidemiology and the economic impact of the triceps brachii incision in a South African export abattoir",
  "abstract": "Taenia saginata is a zoonotic tapeworm of humans with bovines as its intermediate host (bovine cysticercosis). Traditional meat inspection is the main measure to identify the larval stage in carcasses and prevent human infection, but has a notoriously low sensitivity, especially in low prevalence settings. The legislation in multiple African countries mandates an incision in both triceps brachii muscles to detect the parasite as part of the normal post-mortem inspection, but this has an economic cost and is not universally mandated in other countries. The primary aim of this study was to investigate the epidemiology of bovine cysticercosis at an export abattoir in South Africa and determine the validity and cost of the triceps incision. Risk factors were investigated, and the effect of additional heart incisions on the current inspection. Four incisions were made into the heart in addition to the normal post-mortem inspection in 3353 carcasses. The proportion of positive animals with and without the cardiac and triceps incisions were compared using McNemar's chi-square tests, while risk factors were assessed using binary logistic regression. The economic impact of the triceps incision was estimated using a stochastic economic cost model. Thirty-three positive carcasses were identified for an apparent prevalence of 0.98 % (95 % CI, 0.69-1.36 %), while the true prevalence was estimated at 6.6 % (95 %CI, 4.3-8.8 %). All cysts were confirmed as T. saginata on histopathology with 70 % (95 %CI, 53-83 %) located in the heart. The additional cardiac incisions resulted in the detection of significantly more cases compared to the normal inspection method prevalence of 0.72 % (95 %CI, 0.47-1.05 %; P < 0.001). The apparent prevalence of T. saginata when omitting the triceps incision was not significantly lower compared to the prevalence when included in the inspection (P = 0.480). External feedlots (OR= 4.17, 95 %CI: 2.04-8.54, P < 0.001) and older animals (OR=3.90, 95 %CI: 1.17-13.03, P = 0.027) were associated with a positive detection. The current median annual financial cost to the food business operator from the triceps incision was estimated at $30387 (95 %CI: $0-$130696), with the proportion of deboned meat exported identified as the most important factor affecting cost (Spearman's rho=0.853). The identification of risk factors could aid in the development of a more effective risk-based inspection system. The current inspection should be modified to increase exposure of the heart and remove the triceps incisions. The latter should especially be considered given the minimal contribution to cysticercosis detection, the unsupported requirement for its inclusion specifically in Africa, and its economic impact, especially as beef exports increase.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d3ff101115b60b230d6214ff71ed553",
  "timestamp": "2025-05-15T03:24:26.298830"
}