{
  "id": 863,
  "title": "Zero End-Digit Preference in Blood Pressure and Implications for Cardiovascular Disease Risk Prediction-A Study in New Zealand",
  "abstract": "Background/Objectives: Blood pressure (BP) readings are often rounded to the nearest zero end-digit. Guidelines permit rounding to the closest 2 mmHg. This paper investigated the effect of rounding systolic blood pressure (SBP) values on the prediction of cardiovascular disease (CVD) risk among the New Zealand population. A total of 427,299 individuals received opportunistic cardiovascular disease risk assessments at primary care facilities in New Zealand. Method: A total of 292,122 SBP readings possessed a non-zero terminal digit. These were rounded to the nearest zero end-digit. A survival model estimating a 5-year CVD risk was applied to both datasets, i.e., with and without rounding. Hazard ratios and misclassification rates were analysed to emphasise the notable differences. Financial impact was assessed by examining healthcare expenditures. Results: In total, 32% of SBP values exhibited a terminal digit of zero, and 2.85% and 4.24% of men were misclassified as moderate and high risk, respectively, while approximately 3.21% of women were misclassified into the same risk categories. Likewise, 1.19% and 0.47% of men, as well as 0.62% and 0.20% of women, were misclassified into the low and moderate risk categories, respectively. Conclusions: Precisely measuring SBP is crucial in accurately assessing CVD risk and managing healthcare resources effectively.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d5765a247c2d129201f2edf38273a94",
  "timestamp": "2025-05-15T01:43:20.732591"
}