{
  "id": 7424,
  "title": "The prevalence of elder abuse and neglect in rural areas: a systematic review and meta-analysis",
  "abstract": "Key summary pointsAim To estimate the pooled prevalence of elder abuse and neglect in rural areas. Findings In this work, the pooled prevalence of elder abuse and neglect in rural areas was 33%. For the prevalence estimates of abuse and neglect subtypes, neglect was the highest, followed by psychological abuse, financial, physical and sexual abuse. Message In the context of global aging, there is an urgent need for high quality studies based on agreed definition of elder abuse and neglect in order to protect the potential high risk populations. Purpose Many epidemiological studies have reported that elder abuse and neglect were prevalent in rural areas. However, none of them has synthesized the literature in this field. Therefore, we aimed to estimate the overall prevalence of elder abuse and neglect in rural areas through a systematic review and meta-analysis. Methods PubMed, EMBASE, Web of Science, and Cochrane Library were systematically searched to identify eligible articles, with no language restrictions. Statistical analyses were conducted using Review Manager software (version 5.3). Meta-analyses and sensitivity analysis were performed using a random-effects model. All results were reported as the pooled prevalence of elder and neglect with their 95% confidence intervals (CIs). The quality of the included studies was evaluated by strengthening the reporting of observational studies in epidemiology (STROBE) checklist. Potential publication bias was assessed by the funnel plot. Results 13 cross-sectional studies involving 10,313 participants were eligible. The prevalence of elder abuse and neglect ranged from 4.5 to 61.7% across the rural areas, and pooled prevalence estimate was 33% (95% CI 23-43). The prevalence of physical abuse was estimated at 7% (95% CI 5-9), financial abuse at 5% (95% CI 4-7), psychological/emotional abuse at 17% (95% CI 11-23), and neglect at 26% (95% CI 17-35). There was significant heterogeneity among the included studies. Stratified analyses revealed that sampling design was part of the heterogeneity source. WHO regions, gender, countries' income classification, and study quality could not explain the potential reasons for heterogeneity. Conclusions The pooled prevalence of elder abuse and neglect was relatively high in rural areas. Early and targeted screening and prevention are needed. There is an urgent need for high quality studies using agreed definition of elder abuse and neglect to protect the potential high risk populations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d6a4ae8d7e9fbccb0c0a4c769804949",
  "timestamp": "2025-05-15T03:08:37.775720"
}