{
  "id": 4505,
  "title": "Economic abuse between intimate partners in Australia: prevalence, health status, disability and financial stress",
  "abstract": "Objective: Economic abuse is a form of domestic violence that has a significant impact on the health and financial wellbeing of victims, but is understudied. This study determined the lifetime prevalence of economic abuse in Australia by age and gender, and the associated risk factors. Methods: The 2012 ABS Personal Safety Survey was used, involving a cross-sectional population survey of 17,050 randomly selected adults using face-to-face interviews. The survey-weighted prevalence of economic abuse was calculated and analysed by age and gender. Logistic regression was used to adjust odds ratios for possible confounding between variables. Results: The lifetime prevalence of economic abuse in the whole sample was 11.5%. Women in all age groups were more likely to experience economic abuse (15.7%) compared to men (7.1%). Disability, health and financial stress status were significant markers of economic abuse. Conclusions: For women, financial stress and disability were important markers of economic abuse. However, prevalence rates were influenced by the measures used and victims' awareness of the abuse, which presents a challenge for screening and monitoring. Implications for public health: Social, health and financial services need to be aware of and screen for the warning signs of this largely hidden form of domestic violence.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d70a877761d515533de6a10da9c1618",
  "timestamp": "2025-05-15T02:37:47.583655"
}