{
  "id": 9289,
  "title": "Physician perspectives regarding pneumococcal conjugate vaccine",
  "abstract": "Objectives. Pneumococcal conjugate vaccine (PCV) was first licensed for routine administration to young children in February 2000. The objective of this study was to assess physician perspectives about the use of PCV, to ascertain which children were being given the vaccine soon after licensure, and to determine how the addition of PCV to the schedule of recommended childhood vaccines may affect the timing of other vaccinations. Methods. A 30-item survey containing questions about the use of PCV was sent to all pediatricians and family physicians who provide primary care to young children in Monroe County (Rochester, NY) and Davidson County (Nashville, TN) in October 2000. As many as 3 subsequent mailings were sent to nonresponders. Descriptive and chi(2) statistical analyses and logistic regression were used to evaluate the responses. Results. Response rates were 82% in Rochester and 78% in Nashville. Eighty-two percent of responding physicians, including 92% of pediatricians and 55% of family physicians, indicated that they were giving PCV to their patients at the time of the survey. Sixty percent noted that an initial lack of insurance reimbursement for the cost of the vaccine caused them to delay introducing PCV. Fifty-one percent delayed initially offering the vaccine to any of their patients because the Vaccines for Children (VFC) program did not begin to offer PCV until several months later. The vast majority routinely vaccinated healthy children who are younger than 2 years as well as older children who had defined chronic medical conditions that put them at high risk of invasive pneumococcal disease. Fewer than 15% were recalling patients for PCV, with most recall efforts focused on patients who had chronic medical conditions. When discussing PCV with parents, 78% of physicians primarily emphasized the vaccine's potential to decrease the risk of sepsis and/or meningitis, whereas smaller percentages primarily emphasized the vaccine's potential to decrease the risk of pneumonia or ear infections. Approximately 20% of physicians who gave PCV delayed other vaccinations (primarily varicella vaccine, hepatitis B vaccine, or polio vaccine) because of concern about administering 4 or more vaccines simultaneously. Similarly, 40% of physicians indicated that they considered PCV to be more important than varicella vaccine or hepatitis B vaccine, whereas 26% percent considered PCV to be more important than polio vaccine. Conclusions. PCV has been widely accepted by physicians in both Rochester and Nashville. However, many physicians delayed introducing the vaccine for reasons that were ultimately related to financial considerations. For privately insured patients, delays were related to when coverage for PCV was added to benefit packages. For patients who receive publicly purchased vaccine via the VFC program, delays were related to availability of the vaccine through the VFC program. In addition, after the introduction of PCV, some physicians began delaying the administration of other vaccines because of the need to give multiple vaccinations simultaneously. Although lack of insurance or VFC coverage and concerns about multiple simultaneous injections may somewhat delay the initial use of newly recommended vaccines, physicians rapidly begin to provide new vaccines that they believe to be beneficial once those vaccines are incorporated into existing payment mechanisms.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d76344388a940b5f75de428be70665c",
  "timestamp": "2025-05-15T03:27:24.998007"
}