{
  "id": 8809,
  "title": "The Impact of Healthcare-Associated Methicillin-Resistant Staphylococcus Aureus Infections on Post-Discharge Healthcare Costs and Utilization",
  "abstract": "OBJECTIVE. Healthcare-associated methicillin-resistant Staphylococcus aureus (MRSA) infections are a major cause of morbidity, mortality, and cost among hospitalized patients. Little is known about their impact on post-discharge resource utilization. The purpose of this study was to estimate post-discharge healthcare costs and utilization attributable to positive MRSA cultures during a hospitalization. METHODS. Our study cohort consisted of patients with an inpatient admission lasting longer than 48 hours within the US Department of Veterans Affairs (VA) system between October 1, 2007, and November 30, 2010. Of these patients, we identified those with a positive MRSA culture from microbiology reports in the VA electronic medical record. We used propensity score matching and multivariable regression models to assess the impact of positive culture on post-discharge outpatient, inpatient, and pharmacy costs and utilization in the 365 days following discharge. RESULTS. Our full cohort included 369,743 inpatients, of whom, 3,599 (1.0%) had positive MRSA cultures. Our final analysis sample included 3,592 matched patients with and without positive cultures. We found that, in the 12 months following hospital discharge, having a positive culture resulted in increases in post-discharge pharmacy costs ($776, P<.0001) and inpatient costs ($12,167, P<.0001). Likewise, having a positive culture increased the risk of a readmission (odds ratio [OR] = 1.396, P<.0001), the number of prescriptions (incidence rate ratio [IRR], 1.138; P<.0001) and the number of inpatient days (IRR, 1.204; P<. 0001,) but decreased the number of subsequent outpatient encounters (IRR, 0.941; P<.008). CONCLUSIONS. The results of this study indicate that MRSA infections are associated with higher levels of post-discharge healthcare cost and utilization. These findings indicate that financial benefits resulting from infection prevention efforts may extend beyond the initial hospital stay.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d7ad31d6f51e120c55c3fe09f536a85",
  "timestamp": "2025-05-15T03:22:26.128579"
}