{
  "id": 3517,
  "title": "Navigating volatility spillover amidst investor extreme fear in stablecoin and financial markets",
  "abstract": "Investor sentiment has the potential to serve as a predictive factor for cryptocurrency assets, yet its impact on volatility spillover across markets remains uncertain. This research investigates the influence of investor sentiment classification on the volatility spillover from stablecoins to conventional financial markets. Empirical findings reveal the role of stablecoins as net volatility receivers from financial assets during extreme fear sentiment conditions, suggesting that stablecoins may function as a potential safe-haven when investors experience significant fear, offering insights to investors and portfolio managers regarding the potential use of stablecoins as a risk mitigation tool within an investment portfolio. IMPACT STATEMENT Stablecoins play a pivotal role in stabilizing financial markets, particularly during periods of extreme fear and volatility. Using advanced modeling, the analysis uncovers how stablecoins act as critical safe-haven assets, absorbing shocks from both cryptocurrency and traditional markets. This ability to cushion volatility provides investors with a powerful tool for risk mitigation, especially in times of market turbulence. The findings not only highlight stablecoins' growing relevance in portfolio management but also offer key insights for policymakers looking to enhance the resilience of financial systems. By bridging the gap between digital and conventional assets, stablecoins are shown to be vital in maintaining liquidity and market stability, making them essential instruments for navigating both speculative and traditional investment landscapes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d935ef7ae141bd88c88e0aee3f02473",
  "timestamp": "2025-05-15T02:27:19.060823"
}