{
  "id": 9213,
  "title": "Clinical Characteristics in 53 Patients with Cat Scratch Optic Neuropathy",
  "abstract": "Objective: To describe the clinical manifestations and to identify risk factors associated with visual outcome in a large cohort of patients with cat scratch optic neuropathy (CSON). Design: Multicenter, retrospective chart review. Participants: Fifty-three patients (62 eyes) with serologically positive CSON from 5 academic neuro-ophthalmology services evaluated over an 11-year period. Methods: Institutional review board/ethics committee approval was obtained. Data from medical record charts were collected to detail the clinical manifestations and to analyze visual outcome metrics. Generalized estimating equations and logistic regression analysis were used in the statistical analysis. Six patients (9 eyes) were excluded from visual outcome statistical analysis because of a lack of follow-up. Main Outcome Measures: Demographic information, symptoms at presentation, clinical characteristics, length of follow-up, treatment used, and visual acuity (at presentation and final follow-up). Results: Mean patient age was 27.8 years (range, 8-65 years). Mean follow-up time was 170.8 days (range, 1-1482 days). Simultaneous bilateral involvement occurred in 9 (17%) of 53 patients. Visual acuity on presentation ranged from 20/20 to counting fingers (mean, 20/160). Sixty-eight percent of eyes retained a visual acuity of 20/40 or better at final follow-up (defined as favorable visual outcome). Sixty-seven percent of patients endorsed a history of cat or kitten scratch. Neuroretinitis (macular star) developed in 28 eyes (45%). Only 5 patients had significant visual complications (branch retinal artery occlusion, macular hole, and corneal decompensation). Neither patient age nor any other factor except good initial visual acuity and absence of systemic symptoms was associated with a favorable visual outcome. There was no association between visual acuity at final follow-up and systemic antibiotic or steroid use. Conclusions: Patients with CSON have a good overall visual prognosis. Good visual acuity at presentation was associated with a favorable visual outcome. The absence of a macular star does not exclude the possibility of CSON. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:183-187 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d96839d06f1b06fbeeaf411ca9c15db",
  "timestamp": "2025-05-15T03:26:54.459494"
}