{
  "id": 6331,
  "title": "C-Reactive Protein and CFH, ARMS2/HTRA1 Gene Variants Are Independently Associated with Risk of Macular Degeneration",
  "abstract": "Purpose: Genetic variants CFH and ARMS2/HTRA1 gene regions as well as high-sensitivity C-reactive protein (CRP) levels are related to age-related macular degeneration (AMD). We evaluated their independent and combined effects on risk of AMD, as well as their interactions. Design: Case-control study. Participants: Subjects with AMD (n = 244) or no or minimal maculopathy (n = 209) in the Age Related Eye Disease Ancillary Study. Methods: Risk factors, genotypes, and biomarkers were assessed by questionnaire, direct measurement, and analyses of blood specimens. The independent and joint effects of serum CRP and CFH (rs1061170) and ARMS2/HTRA1 (rs10490924) genotypes were assessed using logistic regression analyses, adjusting for age, gender, education, smoking, body mass index, and vitamin/mineral supplementation. Main Outcome Measures: We defined AMD as large drusen, geographic atrophy, or neovascular disease. Results: Higher CRP levels were associated with a higher risk of AMD, controlling for genotype and demographic and behavioral risk factors, with odds ratio 2.6 for levels of 3.0 mg/L and above versus below 1.0 mg/L (95% confidence interval, 1.01-6.7). Single nucleotide polymorphisms (SNPs) in both genes were also independently associated with risk of AMD, controlling for the level of CRP and other factors. Presence of both highest level of CRP together with risk genotypes for both SNPs, conferred the highest risk of AMD (OR 5.4, 95% CI 1.4-21.1). Conclusions: High-sensitivity CRP and polymorphisms in the CFH and ARMS2/HTRA1 genes are independently associated with risk of AMD. Higher CRP level tends to confer a higher risk of AMD within most genotype groups. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2010; 117: 1560-1566 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5d9d94a4b11da69c9ce45e2fa7020fa0",
  "timestamp": "2025-05-15T02:57:07.685265"
}