{
  "id": 8088,
  "title": "Strategies to increase influenza vaccination rates: outcomes of a nationwide cross-sectional survey of UK general practice",
  "abstract": "Objective: To identify practice strategies associated with higher flu vaccination rates in primary care. Design: Logistic regression analysis of data from a cross-sectional online questionnaire. Setting: 795 general practices across England. Participants: 569 practice managers, 335 nursing staff and 107 general practitioners. Primary outcome measures: Flu vaccination rates achieved by each practice in different groups of at-risk patients. Results: 7 independent factors associated with higher vaccine uptake were identified. Having a lead staff member for planning the flu campaign and producing a written report of practice performance predicted an 8% higher vaccination rate for at-risk patients aged <65 years (OR 1.37, 95% CI 1.10 to 1.71). These strategies, plus sending a personal invitation to all eligible patients and only stopping vaccination when Quality and Outcomes Framework targets are reached, predicted a 7% higher vaccination rate (OR 1.45, 95% CI 1.10 to 1.92) in patients aged >= 65 years. Using a lead member of staff for identifying eligible patients, with either a modified manufacturer's or in-house search programme for interrogating the practice IT system, independently predicted a 4% higher vaccination rate in patients aged >= 65 years (OR 1.22, 95% CI 1.06 to 1.41/OR 1.20, 95% CI 1.03 to 1.40). The provision of flu vaccine by midwives was associated with a 4% higher vaccination rate in pregnant women (OR 1.19, 95% CI 1.02 to 1.40). Conclusions: Clear leadership, effective communication about performance and methods used to identify and contact eligible patients were independently associated with significantly higher rates of flu vaccination. Financial targets appear to incentivise practices to work harder to maximise seasonal influenza vaccine uptake. The strategies identified here could help primary care providers to substantially increase their seasonal flu vaccination rates towards or even above the Chief Medical Officer's targets.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5daf8e13f43eb2156db1897197853780",
  "timestamp": "2025-05-15T03:15:09.357331"
}