{
  "id": 8993,
  "title": "Burden of schizophrenia in recently diagnosed patients: healthcare utilisation and cost perspective",
  "abstract": "Inpatient care to manage relapse of patients with schizophrenia contributes greatly to the overall financial burden of treatment. The present study explores to what extent this is influenced by duration of illness. Medical and pharmaceutical claims data for patients diagnosed with schizophrenia (ICD-9 295.xx) were obtained from the PharMetrics Integrated Database, a large, regionally representative US insurance claims database, for the period 1998-2007. Recently diagnosed (n = 970) and chronic patients (n = 2996) were distinguished based on ICD-9 295.xx classification, age and claims history relative to the first year (recently diagnosed) and the third year onwards (chronic) after the first index schizophrenia event. The medical resource use and costs during the year following the index schizophrenia event differed significantly between cohorts. A higher proportion of recently diagnosed patients were hospitalised compared with chronic patients (22.3% vs 12.4%; p < 0.0001), spending a greater mean number of days in hospital (5.1 days vs 3.0 days; p = 0.0065) as well as making more frequent use of emergency room (ER) resources during this time. The mean annual healthcare costs of recently diagnosed patients were also greater ($20,654 vs $15,489; p < 0.0001) with inpatient costs making up a higher proportion of total costs (62.9%) compared with chronic patients (38.5%). There is a considerably higher overall economic burden in the year following their first schizophrenia event in the treatment of recently diagnosed schizophrenia patients compared with chronic patients. Since hospitalisations and ER visits are the most significant components contributing to this finding, efforts that focus on measures to reduce the risk of relapse, particularly amongst recently diagnosed patients, such as improved adherence programs, may lead to better clinical and economic outcomes in the management of schizophrenia. Only commercially insured patients and direct medical costs were included, therefore, results may underestimate the economic burden of schizophrenia.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5db0a1a3f578961024ae8becd5be1c0a",
  "timestamp": "2025-05-15T03:24:26.380597"
}