{
  "id": 5007,
  "title": "A novel production profile classification system for incoming calves that predicts feedlot growth performance",
  "abstract": "Context Mitigating financial risk in the feedlot environment is an ongoing occurrence, and good production is a key risk mitigator. However, production protocols are based on historic averages because of the inability to predict growth potential of incoming calves. Production profiling of individual incoming feeder calves could address these limitations. Aims The aim of this study was to establish criteria for optimal sorting of incoming feeder calves into various cattle groups in a feedlot that maximises feedlot profit. Methods South African feeder calves (n = 436) were classified into four production-profile (PP) categories according to a predetermined set of phenotypic traits: PP 3 (n = 72) representing feeder calves with the poorest feedlot growth potential, PP 2- (n = 191) with below-average potential, PP 2+ (n = 139) with above-average potential and PP 1 (n = 34) with above-average feedlot growth potential. After combining the data of PP 2- and PP 2+ into PP 2, mixed modelling of economically important feedlot growth traits (average daily gain (ADG), carcass ADG, and carcass exit weight) was performed to evaluate the effect of PP classification (PP 1 and PP 3), while adjusting for potential confounding effects such as starting weight (entry weight) and gender. Key results Carcass weights for calves with a PP classification of 3 and 1 were 15.54 kg less (P < 0.000), and 11.34 kg more (P = 0.007) respectively, than those with a PP classification of 2 (261.27 kg, 95% CI 257.94-264.57), after adjusting for entry weight, calf gender and the random effect of the feeding pen. Similar to carcass weight, calves with a PP 3 classification were outperformed by other classifications in all the measured traits (P < 0.05). Conclusions This is the first report demonstrating the ability of subjective production-profile classification to predict growth performance of individual feeder calves. Implications The opportunity of the PP classification system lies in value-based procurement of incoming feeder calves based on their growth potential at the start of the feeding period, and then to use technology to improve and finalise the current subjective PP classification system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5dbbc8058be80428be0a7bd1774af708",
  "timestamp": "2025-05-15T02:43:06.873912"
}