{
  "id": 6051,
  "title": "Telebehavioral Health for Caregivers of Children With Behavioral Health Needs to Address Caregiver Strain: Cohort Study",
  "abstract": "Background: Behavioral health conditions among children have worsened over the past decade. Caregivers for children with behavioral health conditions are at risk for two types of caregiver strain: (1) an objective strain, that results directly from the child's condition and (2) subjective strain, that arises from the caregiver's feelings regarding these events. Objective: This study aimed to evaluate the impact of a technology-enabled pediatric and family behavioral health service on caregivers' strain among a commercially insured population. We also explore the common symptom clusters of caregiver strain to better understand the caregiver presentation to inform future care planning. Methods: We examined changes in caregiver strain using the Caregiver Strain Questionnaire-Short Form 7 over the course of their child's web-based behavioral health care between 2021 and 2023 using a pre-post study design. Common caregiver strain symptom clusters were identified using Ward hierarchical agglomerative clustering. Results: The majority of children were White 60.8% (1002/1647), female 53.6% (882/1647), and aged between 5 and 9 years (33.7%, 555/1647). Families fall broadly into 4 groups based on what drives caregiver strain the most, namely those experiencing (1) disrupted family relationships and time interruption, (2) missed work, (3) worried about their child's future and feeling tired and sad, and (4) financial strain. Caregiver strain, which was associated with the child's disease severity (P<.001), decreased significantly in all therapeutic groups. Conclusions: Web-based family-oriented behavioral health care can improve caregiver strain and reduce family and time disruptions, missed work, and financial strain. Sources of caregiver strain vary and may be overlooked when relying on the conventional scoring of the Caregiver Strain Questionnaire-Short Form 7.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5dbef38df2996b52a898ecbd82b4f4ef",
  "timestamp": "2025-05-15T02:54:03.506466"
}