{
  "id": 8147,
  "title": "Sentinel Lymph Node in Endometrial Hyperplasia: State of the Art and Future Perspectives",
  "abstract": "Background/Objectives: Endometrial hyperplasia is a uterine pathology characterized by the abnormal proliferation of endometrial glands, resulting in an increased gland-to-stroma ratio. Complex atypical hyperplasia represents the primary precursor to endometrial cancer. Given the high risk of progression to endometrial adenocarcinoma, the accurate diagnosis and classification of endometrial hyperplasia are crucial. Since the treatment for atypical endometrial hyperplasia is the same as that for early-stage endometrial cancer (i.e., total hysterectomy and bilateral salpingo-oophorectomy), researchers have questioned whether sentinel lymph node mapping could also have a prognostic role in atypical endometrial hyperplasia. Methods: A literature search was conducted in PubMed and Scopus from 2014 to 2025. Of the 65 papers found, 31 relevant articles were selected based on inclusion criteria, focusing on sentinel lymph node staging in patients with atypical endometrial hyperplasia. This review aims to assess whether sentinel lymph node mapping can be routinely used for prognostic and therapeutic purposes in clinical practice. Results: Sentinel lymph node biopsy represents a promising diagnostic technique for patients with atypical endometrial hyperplasia, reducing the need for invasive procedures and postoperative risks. However, its application requires advanced surgical skills and access to specific technologies, raising ethical and financial concerns, while future studies could improve patient selection and the reliability of the procedure through technological innovations. Conclusions: Sentinel lymph node biopsy is a safe and effective method for staging early-stage endometrial cancer and atypical hyperplasia, with low metastasis rates, but future research should focus on identifying patients who would benefit most from this procedure, considering its costs and required expertise.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5dcec1c5b9c8dc6a41c20d598d5eb2bd",
  "timestamp": "2025-05-15T03:15:38.434766"
}