{
  "id": 2143,
  "title": "Forecasting realized volatility using deep learning quantile function",
  "abstract": "The accurate prediction of realized volatility is an essential component of effective investment strategies. Existing studies have often focused on modeling selective features of intraday return series, overlooking the comprehensive information embedded within them due to challenges such as microstructure noise and the complexity of handling numerous data points. To address these limitations, this paper proposes a novel deep learning quantile function (DLQF) framework that directly leverages intraday return series to forecast realized volatility. The proposed model integrates a Bi-LSTM network to capture the long memory of realized volatility and a quantile function implemented as a deep neural network to extract rich information from intraday returns. A loss function based on Lp distance measures is defined to estimate the probabilistic distribution of intraday returns, enabling both intraday return prediction and realized volatility estimation. Empirical results demonstrate that DLQF outperforms traditional benchmarks across major ETFs, including SPY, DIA, and QQQ, which represent the S&P 500, Dow Jones Industrial Average, and Nasdaq 100, respectively. This model offers significant potential for applications in portfolio optimization, option pricing, and risk management.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5dd8f6e215a8716653307dd1b8cc27aa",
  "timestamp": "2025-05-15T01:03:36.610551"
}