{
  "id": 7822,
  "title": "Cost of Pediatric Trauma: A Comparison of Non-Accidental and Accidental Trauma in Pediatric Patients",
  "abstract": "Background: Nonaccidental trauma (NAT) affects >100,000 children in the United States every year and is associated with significant mortality and morbidity. Little is known about the financial burden of NAT, particularly in comparison to accidental trauma (AT). We sought to compare hospital charges and outcomes between children presenting with NAT and AT.Methods: Pediatric (<16 y) trauma hospitalizations from 2006 to 2018 were identified using the Healthcare Cost and Utilization Project (HCUP) National Inpatient Sample (NIS) and Kid's Inpatient Sample (KID) databases. Hospitalizations were identified as NAT or AT based on ICD codes. Discharge weights were used to obtain national estimates and stan-dardize them across the different sampling structures. Outcomes (hospital charges, length of stay (LOS), and mortality) were compared, and multivariate regression analyses were used to assess independent predictors of hospital charges and mortality.Results: Fifty-eight Thousand Two Hundred Seventy-five pediatric hospitalizations were included with 17,954 (0.3%) categorized as NAT. Children with NAT were younger, more female, less likely to identify as White, and more under public insurance than those with AT. Hospital charges were significantly higher in patients with NAT ($27,100 versus $19,900, P < 0.0001). Mortality (4.9% versus 0.0%, P < 0.0001) and LOS (3.2 d versus 1.5 d, P < 0.0001) were significantly higher among patients with NAT. Multivariable regression analyses identified NAT as a predictor of higher hospital charges, mortality, and LOS.Conclusions: Nonaccidental trauma in pediatric patients is associated with significantly higher hospital charges, mortality, and LOS than accidental trauma. Ongoing research focused on the relative impact of known risk factors and resource utilization is needed.(c) 2022 Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5dfe78ff90eaa7f4a1b6eb5d6805ced0",
  "timestamp": "2025-05-15T03:12:36.401982"
}