{
  "id": 7215,
  "title": "Cooperation for innovation: Evidences From Southern Europe Countries",
  "abstract": "Innovation is nowadays an important source of competitiveness for several firms, however only some firms recognize the importance of cooperation to innovation. Recently, in the course of depressive economic cycle, firms from countries of Southern Europe faced enormous difficulties in world market. Cooperation to innovation could promote incentives and welfare effects, minimizing transaction costs and exploiting complementary know-how between partner firms. This paper studies the cooperation for innovation, in countries of Southern Europe (Portugal, Spain, Greece and Italy), analysing how R&D, incoming spillovers, public support, appropriability of innovation, financial constraints to innovation, firm size and sector can contribute to cooperative behaviour of firms. The literature review evidence that cooperation could include, sharing R&D cost and risk, the reduction of duplication spillover internalisation and introduce others benefits. This paper use Community Innovation Survey (CIS 4) micro-data for the four countries of southern Europe and apply a logistic regression in order to study cooperative behaviour for innovation. We believe that the results about these countries provide important clues concerning different arrangements of cooperation between firms and highlight some innovation patterns between studied countries.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e01e500e3c7902ae5dd1322cdab76cb",
  "timestamp": "2025-05-15T03:06:35.238439"
}