{
  "id": 3734,
  "title": "Loan loss provision models in Brazilian banks",
  "abstract": "Purpose - This paper investigates which loan loss provision (LLP) model [International Accounting Standards39 (IAS39) based on incurred losses and Brazilian Central Bank Generally Accepted Accounting Principles (GAAP) based on a mixed model] presents higher quality in terms of predictability, and which model is less susceptible to earnings management practices using LLP. Design/methodology/approach - To test the difference between the explanatory power of the mixed model and incurred loss model in explaining the LLP, this paper runs a two-stage fixed-effect panel regression model to evaluate the association between LLP of each model and variables representatives of non-discretionary aspects related to the quality of the loan portfolio, business cycles and qualitative evidence indicated in each GAAP. Then, this paper tests the relationship between the errors generated in each regression and the discretion of bank managers and banks' characteristics. Findings - This paper finds that the mixed model results in higher R2 demonstrating that the number produced under this regime is more related to observable variables than the number produced under the incurred losses model. Further, this paper finds no evidence that there is a difference in earnings management between the two standards and this paper does not find that banks manage earnings through regulatory capital. Nevertheless, this paper finds that earnings management is higher in private than in listed banks. Originality/value - This paper takes advantage of the unique feature of the Brazilian Central Bank regulation to investigate the impact of two different accounting standards on LLP in a perfect setting.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e14139bdbd05f50cc672d01cf973b44",
  "timestamp": "2025-05-15T01:20:03.632895"
}