{
  "id": 6959,
  "title": "Comparative Safety of Smoking Cessation Pharmacotherapies During a Government-Sponsored Reimbursement Program",
  "abstract": "Introduction: The British Columbia Ministry of Health launched a Smoking Cessation Program on September 30, 2011, providing financial coverage for smoking cessation pharmacotherapies. Although pharmacotherapies have been shown to have a moderate short-term benefit as a quitting aid, substantial cardiovascular and neuropsychiatric safety concerns have been identified in adverse-reporting databases, leading to prescription label warnings by Health Canada and the U.S. Food and Drug Administration. However, recent studies indicate these warnings may be without merit. This study examined the comparative safety of medications commonly used to aid smoking cessation. Aims and Methods: Population-based retrospective cohort study using B.C. administrative data to assess the relative safety between varenicline, bupropion, and nicotine replacement therapies (NRTs). The primary outcome was a composite of cardiovascular hospitalizations. Secondary outcomes included mortality, a composite of neuropsychiatric hospitalizations, and individual components of the primary outcome. Statistical analysis used propensity score-adjusted log-binomial regression models. A sensitivity analysis excluded patients with a history of cardiovascular disease. Results: The study included 116 442 participants. Compared with NRT, varenicline was associated with a 10% 1-year relative risk decrease of cardiovascular hospitalization (adjusted risk ratio [RR] = 0.90, 95% confidence interval (CI): 0.82 to 1.00), a 20% 1-year relative risk decrease of neuropsychiatric hospitalization (RR: 0.80, CI: 0.7 to 0.89), and a 19% 1-year relative risk decrease of mortality (RR: 0.81, CI: 0.71 to 0.93). We found no significant association between NRT and bupropion for cardiovascular hospitalizations, neuropsychiatric hospitalizations, or mortality. Conclusions: Compared with NRT, varenicline is associated with fewer serious adverse events and bupropion the same number of serious adverse events.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e17ba2a14da8411b531c96da34e6df8",
  "timestamp": "2025-05-15T03:03:13.552811"
}