{
  "id": 8330,
  "title": "Cost-effectiveness of primary abdominal wall hernia repair in a 364-bed provincial hospital of Spain",
  "abstract": "Primary abdominal hernia is a prevalent condition that weighs heavily on human and financial health-care resources (e.g., 1.12% of the total budget of our hospital in 2008). Tension-free hernioplasty is the standard repair procedure, but the anesthetic technique varies, including local anesthesia with sedation (Lsed), regional (Reg), and general (Gen) anesthesia. As the cost-outcome relation of different anesthetic options has never been examined in our health district, we proposed to identify the most cost-effective anesthetic technique out of three options for primary abdominal hernia repair in terms of clinical outcome and health-care economics in this retrospective review. The study sample of 400 patients with primary abdominal hernia in 2008 underwent tension-free hernioplasty using one of three anesthetic techniques: 74 Lsed, 283 Reg, and 43 Gen. The comparability of outcomes was ensured by dividing the sample into homogeneous groups according to the American Society of Anesthesiologists Physical Status classification (ASA 1 and 2) and adjusting for technical complexity, risk factors, and anatomic location. The clinical outcome of hernioplasty with Lsed was significantly better in terms of shorter hospital stay, lower early- and intermediate-term complication rate, and shorter time to recovery after discharge. The short-term recurrence rate did not differ between groups. The mean cost per hernioplasty procedure was a,not sign3,270.37 (Lsed), a,not sign4,740.37 (Reg), and a,not sign7,318.44 (Gen). The cost-effectiveness and incremental cost per patient showed the advantage of hernioplasty with Lsed versus Reg (a,not sign794.59) and Lsed versus Gen (a,not sign704.01), respectively.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e1d80ba890f88830b6b038ac9e0c7f5",
  "timestamp": "2025-05-15T03:17:49.115445"
}