{
  "id": 3510,
  "title": "The role of financial literacy in consumer financial fraud exposure (via email) and victimisation: evidence from Spain",
  "abstract": "PurposeThe ongoing evolution of the Internet and the subsequent digitalisation of financial services, along with the ever-increasing innovation of financial products, have rendered consumers more vulnerable to a wider range of fraud in the banking sector and, particularly, to consumer financial fraud (CFF). This paper aims to analyse the factors that may contribute to CFF exposure and victimisation among Spaniards, with a special focus on financial literacy.Design/methodology/approachThis paper provides a comprehensive overview of leading publications on the topic, followed by empirical analyses using regression models with a sample of 6,207 Spanish individuals drawn from the Survey of Financial Competences.FindingsObjective and subjective financial knowledge are positively correlated with CFF exposure via email but do not protect against CFF victimisation. Similarly, financial knowledge overconfidence is positively related to the former but fails to constitute a driver of the latter. Financial inclusion, measured by the number of financial products held, not only increases the risk of this exposure but also contributes to its subsequent victimisation.Originality/valueTo the best of the authors' knowledge, no previous paper has analysed the relationship between CFF and financial literacy by differentiating two types of vulnerabilities to fraud (exposure and victimisation) while considering different constructs of financial literacy. Dissecting these two domains may explain why the same financial literacy construct can have different effects at both stages of financial fraud and, furthermore, how different financial literacy constructs may affect the same stage of financial fraud.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e30e9f424606aa558f7a5ddff05765e",
  "timestamp": "2025-05-15T02:26:48.607438"
}