{
  "id": 445,
  "title": "Research on the decision-making system of venture capital investment based on Support Vector Machine (ID: 6-126)",
  "abstract": "The accurate evaluation of a venture capital investment project is the basis and key to the success of it. In this paper, the theories and methods of Support Vector Machine (SVM) are applied to the venture capital investment decisions, and an evaluation index system is constructed. This index system is a comprehensive system which is composed of five subsystems including seventeen indexes, that is entrepreneurs and management teams (the indexes included are entrepreneurship, reactibility, innovation ability, management ability, and marketing skill); technology and products (the indexes included are market prospective of technology, technology advancement level, product difference, and product imitation); market (the. indexed included are market capacity, growth ability of market, and market competitiveness); risk (the indexes included are technology risk, market risk, and financial risk); environment (the indexes included are maturity and stability of relative laws and policies, industry prospective) and etc. The decision-making system of a venture capital investment based on SVM is also built in this paper, which not only can simulate experts to make a comprehensive evaluation on venture projects, but also can diminish subjective influence in the process of evaluation, so as to offer a scientific method of venture capital investment decision-making.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e3f409ac4bdac30bf7176da9a1a6d1f",
  "timestamp": "2025-05-15T01:50:52.674102"
}