{
  "id": 722,
  "title": "The global epidemiology of hypertension",
  "abstract": "Hypertension is the leading global cause of cardiovascular disease and premature mortality. In this Review, the authors describe the prevalence, awareness, treatment and control of hypertension worldwide, as well as risk factors for hypertension and the financial burden of this disease. Hypertension is the leading cause of cardiovascular disease and premature death worldwide. Owing to the widespread use of antihypertensive medications, global mean blood pressure (BP) has remained constant or has decreased slightly over the past four decades. By contrast, the prevalence of hypertension has increased, especially in low- and middle-income countries (LMICs). Estimates suggest that 31.1% of adults (1.39 billion) worldwide had hypertension in 2010. The prevalence of hypertension among adults was higher in LMICs (31.5%, 1.04 billion people) than in high-income countries (28.5%, 349 million people). Variations in the levels of risk factors for hypertension, such as high sodium intake, low potassium intake, obesity, alcohol consumption, physical inactivity and unhealthy diet, may explain some of the regional heterogeneity in hypertension prevalence. Despite the increasing prevalence, the proportions of hypertension awareness, treatment and BP control are low, particularly in LMICs, and few comprehensive assessments of the economic impact of hypertension exist. Future studies are warranted to test implementation strategies for hypertension prevention and control, especially in low-income populations, and to accurately assess the prevalence and financial burden of hypertension worldwide.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e41ec95d32ef3d1c24273b6664e0c37",
  "timestamp": "2025-05-15T01:42:05.345847"
}