{
  "id": 8149,
  "title": "Seismic Risk Assessment and Preliminary Intervention Cost-Benefit Analysis for the Building Stock of Istanbul",
  "abstract": "Past destructive earthquakes in highly seismic areas of the world have shown that the failure of earthquake-prone buildings endangers the lives of the inhabitants and may cause enormous financial losses. Management of the seismic risks through effective mitigation efforts requires the identification of risky buildings in our cities. However, this is a challenging task, since the building stock is generally too huge to be investigated by using detailed seismic assessment methods provided by current technical documents. On the other hand, available quick assessment methods such as street surveys may lead to remarkably erroneous estimations, particularly if the building stock is composed of substandard buildings constructed without proper engineering service and inspection. Thus, reliable rapid assessment methodologies are required for seismic risk identification and classification of buildings in big cities. In the scope of a recent campaign launched by the Istanbul Metropolitan Municipality (IMM), PERA2019 rapid assessment methodology has been employed on more than 20000 buildings from 33 different districts of Istanbul. In this study, firstly, the preliminary results obtained for those buildings by considering a Scenario-Based Earthquake case are summarized. Then, a preliminary cost-benefit analysis considering the pre-earthquake and post-earthquake intervention costs (such as retrofitting, reconstruction and structural and non-structural damage repairs) together with the secondary costs (such as interruptions on the use of damaged buildings) have been performed and discussed. The obtained results indicate that a synchronized effort orchestrating rapid assessment methodologies and intervention strategies may provide feasible and effective solutions for reduction of seismic risks in big cities like Istanbul.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e5089419764d88351e4e32a0eddbdd7",
  "timestamp": "2025-05-15T03:15:38.444293"
}