{
  "id": 7854,
  "title": "Towards Universal Health Coverage: An Evaluation of Rwanda Mutuelles in Its First Eight Years",
  "abstract": "Background: Mutuelles is a community-based health insurance program, established since 1999 by the Government of Rwanda as a key component of the national health strategy on providing universal health care. The objective of the study was to evaluate the impact of Mutuelles on achieving universal coverage of medical services and financial risk protection in its first eight years of implementation. Methods and Findings: We conducted a quantitative impact evaluation of Mutuelles between 2000 and 2008 using nationally-representative surveys. At the national and provincial levels, we traced the evolution of Mutuelles coverage and its impact on child and maternal care coverage from 2000 to 2008, as well as household catastrophic health payments from 2000 to 2006. At the individual level, we investigated the impact of Mutuelles' coverage on enrollees' medical care utilization using logistic regression. We focused on three target populations: the general population, under-five children, and women with delivery. At the household level, we used logistic regression to study the relationship between Mutuelles coverage and the probability of incurring catastrophic health spending. The main limitation was that due to insufficient data, we are not able to study the impact of Mutuelles on health outcomes, such as child and maternal mortalities, directly. The findings show that Mutuelles improved medical care utilization and protected households from catastrophic health spending. Among Mutuelles enrollees, those in the poorest expenditure quintile had a significantly lower rate of utilization and higher rate of catastrophic health spending. The findings are robust to various estimation methods and datasets. Conclusions: Rwanda's experience suggests that community-based health insurance schemes can be effective tools for achieving universal health coverage even in the poorest settings. We suggest a future study on how eliminating Mutuelles copayments for the poorest will improve their healthcare utilization, lower their catastrophic health spending, and affect the finances of health care providers.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e527ef27ff6b318e7009b688606652d",
  "timestamp": "2025-05-15T03:12:36.545568"
}