{
  "id": 3701,
  "title": "Does intellectual capital reduce the probability of default?",
  "abstract": "PurposeThis study aims to examine the impact of intellectual capital (IC) on default risk in Indian companies listed on the National Stock Exchange.Design/methodology/approachThis study applies panel data regression analysis to derive a relationship between IC and default risk for the sample period 2013-2022. The value-added intellectual coefficient (VAIC) of Pulic (2000) has been applied to measure IC performance, and default risk is estimated using the revised Z-score model of Altman (2000).FindingsThe results revealed a positive association between Z-score and VAIC. It implies that a higher value of VAIC improves financial stability and leads to a lower likelihood of default. The findings further suggest that new default forecasting models can be experimented with IC indicators for better default prediction.Practical implicationsThe findings can have implications for investors and banks. This paper provides evidence of IC performance in improving the financial solvency of firms. Investors and financial institutions should invest their resources in a healthy firm that effectively manages and invests in their IC. It will eventually award investors and creditors high returns through efficient value-creation processes.Originality/valueThis study provides evidence of IC performance in improving the financial solvency of Indian high-defaulting firms, which lacks sufficient evidence in this domain of research. Numerous studies exist examining the relationship between firm performance and IC value, but this area is inadequately focused and underresearched. This study, therefore, fills the research gap from an Indian perspective.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e663d412f953edeba68c5998f2784a2",
  "timestamp": "2025-05-15T02:29:00.205107"
}