{
  "id": 508,
  "title": "Resolving a portfolio optimization problem with investment timing through using the analytic hierarchy process, support vector regression and a genetic algorithm",
  "abstract": "In the field of financial investment, investing in stocks is relatively easy compared to other investment commodities, since making a profit through buying a stock at a low price and selling it at a higher price is intuitive. However, it is really challenging work for an investor to choose stocks which might be profitable, to determine the capital allocations for these selected stocks or even to time the transactions for stocks. In this study, the analytic hierarchy process (AHP), support vector regression (SVR), and genetic algorithm (GA) are employed to design a three-stage portfolio optimization approach for sequentially solving the portfolio selection, portfolio optimization, and transaction timing Stocks in the semiconductor and iron and steel subsectors in Taiwan are used to illustrate the procedures for applying the present approach. Based on the investment results from 26 May 2017 to 25 Aug. 2017, the annualized returns on investment are 15.36% and 6.15% for the stock markets of the semiconductor and iron and steel sub-sections, respectively. Both returns are superior to the one-year certificate of deposit of about 1% in Taiwan. Hence, we are confident that the proposed approach can fit the real-world stock market, and thus serve as a valuable, functional tool for an investor.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e7866ae6cf4a4d9e2f840ea90a0b077",
  "timestamp": "2025-05-15T00:44:20.961542"
}