{
  "id": 1391,
  "title": "Realized hedge ratio properties, performance and implications for risk management: evidence from the Spanish IBEX 35 spot and futures markets",
  "abstract": "This paper analyzes the properties and performance of daily realized futures hedge ratios. Using five-minute data from the Spanish IBEX 35 equity spot and futures market, realized variances, covariances and hedge ratios are constructed. The realized variances and covariances exhibit long memory dependency that is consistent with extant research on other markets, while the realized hedge ratios do not exhibit this property To measure performance, we compared a hedged portfolio based on the realized hedge ratio with hedged portfolios constructed using a constant regression-based hedge ratio, a time-varying rolling regression hedge ratio and a time-varying bivariate generalized autoregressive conditional heteroscedasticity (GARCH) hedge ratio. Our results suggest that, solely in terms of minimizing portfolio variance, the static regression, rolling regression and GARCH-based methods perform better; ie, they yield smaller portfolio variances; however, this often comes at the expense of negative mean values. In contrast, if performance measurement takes into account both mean and variance by using the Sharpe ratio, then the portfolio based on the realized hedge ratio is almost unanimously favored. Furthermore, as the realized hedge ratio is simple in construction and does not involve estimating a large number of parameters, this method could be of interest to the finance industry, although its volatile nature may limit its usefulness.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e8bea8eca5eb416ffe23aa3c6962acf",
  "timestamp": "2025-05-15T00:55:28.410609"
}