{
  "id": 6386,
  "title": "Predicting prolonged non-suicidal self-injury behaviour and suicidal ideations in adolescence - the role of personal and environmental factors",
  "abstract": "Suicide is one of the leading causes of death among adolescents and repetitional suicidal ideations (SI) and non-suicidal self-injury (NSSI) often precede it. In order to improve recognition of youth who are at high risk of suicide, current study aims to identify which individual variables (personality, self-concept and adverse childhood experiences - ACE) predict prolonged NSSI and SI from middle to late adolescence. A 3-year longitudinal study was conducted with 1101 Croatian adolescents (aged 15-17). 181 students (72.4% females) reported either NSSI or SI or both in T1 and were included in all waves of the study. Analyses are focused on differentiation between adolescents who continue with NSSI/SI and those who stop with it in a 3-year period. Results showed that adolescents with prolonged NSSI/SI had more ACE, especially domestic violence, worse family financial status, higher neuroticism and lower results on self-concept variables. The prediction model of classification of those who have prolonged NSSI or SI was better for SI than NSSI, with predictors explaining 31% of variation in SI. Adolescents who experienced more ACE and report more neuroticism have a higher chance of prolonged SI, while youth who perceive better family financial status and have better relationships with parents have a greater chance to stop with it. For NSSI only neuroticism was a significant predictor. Considering significant variables which could predict prolonged NSSI and/or SI, data presented in this paper have both scientific and practical contribution in understanding, treating and preventing adolescents' mental health problems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5e8dcde7a70d59dc4f58644c18ca93b9",
  "timestamp": "2025-05-15T02:57:38.751201"
}