{
  "id": 7164,
  "title": "The influence of housing on sexual and reproductive health status and service utilization among Filipina migrant domestic workers in Macao (SAR), China: A population survey",
  "abstract": "Objective: Sexual and reproductive health (SRH) and service utilization among female migrant domestic workers are under-studied. No studies to date have investigated the unique health vulnerabilities that affect female foreign domestic workers. The objective of this study was to investigate how stay-in and stay-out living conditions in domestic work may differentially affect SRH status, service utilization, and sexual risk behavior among female migrant domestic workers in Macao (SAR), China. Methods: Data were analyzed from a cross-sectional survey conducted between November 2016 and August 2017 among 1368 female Filipina migrant domestic workers living and working in Macao. Participants were recruited through respondent-driven sampling. Bivariable and multivariable logistic regression analyses were used to assess relationships between living context and outcomes of interest. Results: Domestic workers' living context (i.e. stay-in versus stay-out) was significantly related to sexual risk behavior patterns and SRH status and service utilization. Compared to stay-out workers, stay-in workers had reduced odds of sexual risk behaviors but were also more likely to report that their sexual partners were likely to have concurrent sexual partners. In addition, stay-in workers had significantly decreased odds of having visited an OBGYN in Macao in the past year. Conclusions: This research is the first to evaluate the impact of stay-in and stay-out conditions within a foreign domestic worker population. This study further provides novel evidence of contextual factors (e.g. financial, employment, living conditions) that contribute to inequalities in SRH status and service utilization among Filipina migrant domestic workers. Results indicate that living context is significantly correlated with sexual risk behaviors, SRH status, and service utilization among domestic workers in Macao, highlighting the need to more effectively tailor specific interventions to meet female domestic workers' needs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5eb5eab77fe75c26dfdc7a54c4df0d00",
  "timestamp": "2025-05-15T03:06:01.082401"
}