{
  "id": 402,
  "title": "A data-driven strategy to forecast next-day electricity usage and peak electricity demand of a building portfolio using cluster analysis, Cubist regression models and Particle Swarm Optimization",
  "abstract": "This study presents a new strategy using cluster analysis, Cubist regression models and Particle Swarm Optimization to forecast next-day total electricity usage and peak electricity demand of a building portfolio. Cluster analysis with a combined dissimilarity measure was first used to group daily electricity usage profiles of the building portfolio. The clustering result was then considered in the training of the Cubist-based forecasting models in order to improve the forecasting accuracy. A Particle Swarm Optimization algorithm was used to determine the optimal parameters in the cluster analysis to further improve the forecasting accuracy. The performance of this strategy was evaluated using the electricity usage data of 40 university buildings. The results showed that the difference between the measured and predicted daily total electricity usage was 4.7% in terms of the coefficient of variation of the root-mean-squared error (CV(RMSE)) and 3.3% in terms of mean absolute percentage error (MAPE) and the difference between the measured and predicted daily peak load was 6.0% in CV(RMSE) and 5.3% in MAPE. The proposed strategy can effectively improve the accuracy of the forecasting result by up to 18.1% and 12.2% when compared to the strategy which did not consider the clustering result of the daily electricity usage profiles in the forecasting models and the strategy which considered the clustering result obtained using a single dissimilarity measure. Compared to the mean level of the nine strategies that used different regression methods, the proposed strategy can improve the forecasting accuracy by up to 42.2%. The results of this study can be further used to assist in the development of building optimal control and operation strategies (c) 2020 Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ece582eeef0e9517d04a810e57684bc",
  "timestamp": "2025-05-15T00:43:10.499299"
}