{
  "id": 8950,
  "title": "Association between primary caregiver type and mortality among Chinese older adults with disability: a prospective cohort study",
  "abstract": "BackgroundSocio-demographic transitions have dramatically changed the traditional family care settings in China, caused unmet care needs among older adults. However, whether different primary caregiver types have different influences on disabled older adults' health outcomes remain poorly understood. We aimed to examine the association between the type of primary caregiver (e.g., spouse and children) and death among community-dwelling Chinese older adults disabled in activities of daily living.MethodsWe used data from Chinese Longitudinal Healthy Longevity Survey. The analytic sample comprised 4278 eligible adults aged >= 80years. We classified primary caregiver type into five categories: spouse, son/daughter-in-law, daughter/son-in-law, grandchildren, and domestic helper. We used Cox regression model to examine the association between primary caregiver type and all-cause mortality. Covariates included age, sex, residence, years of education, co-residence status, financial independence, whether living with children, number of ADL disability, number of chronic conditions, and self-reported health, cognitive impairment, and caregiving quality.ResultsMarried older adults whose primary caregivers were son/daughter-in-law had a 38% higher hazard of death than those who had spouse as the primary caregiver. Married men who received care primarily from son/daughter-in-law or daughter/son-in-law had a 64 and 68% higher hazard of death, respectively, than those whose primary caregiver was spouse. The association between primary caregiver type and mortality among widowed older adults differed between urban and rural areas. Urban residents who had domestic helpers as the primary caregiver had an 16% lower hazard of death, while those living in rural areas had a 50% higher hazard of death, than those having son/daughter-in-law as the primary caregiver.ConclusionsThe quality of care of the primary caregiver may be a risk factor for mortality of disabled older adults in China. Interventions are necessary for reducing unmet needs and managing care burden.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ed8c4a8ba56d2bb5f1b75c584856498",
  "timestamp": "2025-05-15T03:23:56.132340"
}