{
  "id": 375,
  "title": "Development of Model to Predict Natural Disaster-Induced Financial Losses for Construction Projects Using Deep Learning Techniques",
  "abstract": "This study goals to develop a model for predicting financial loss at construction sites using a deep learning algorithm to reduce and prevent the risk of financial loss at construction sites. Lately, as the construction of high-rise buildings and complex buildings increases and the scale of construction sites surges, the severity and frequency of accidents occurring at construction sites are swelling, and financial losses are also snowballing. Singularly, as natural disasters rise and construction projects in urban areas increase, the risk of financial loss for construction sites is mounting. Thus, a financial loss prediction model is desired to mitigate and manage the risk of such financial loss for maintainable and effective construction project management. This study reflects the financial loss incurred at the actual construction sites by collecting claim payout data from a major South Korean insurance company. A deep learning algorithm was presented in order to develop an objective and scientific prediction model. The results and framework of this study provide critical guidance on financial loss management necessary for sustainable and successful construction project management and can be used as a reference for various other construction project management studies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ed9fa5eaf2102cd14ece3bd6bdca96c",
  "timestamp": "2025-05-15T01:37:32.437827"
}