{
  "id": 9235,
  "title": "Elder Abuse as a Risk Factor for Hospitalization in Older Persons",
  "abstract": "Importance: Elder abuse is associated with increased mortality risk. However, the relationship between elder abuse and health care services utilization remains unclear. Objective: To examine the relationship between overall elder abuse and specific subtypes of elder abuse and rate of hospitalization in a community-dwelling population of older adults. Design: Prospective population-based study. Setting: Chicago Health and Aging Project. Participants: Of the 6674 community-dwelling older adults who participated in the Chicago Health and Aging Project, 106 were identified by social services agencies for elder abuse. Main Outcomes and Measures: The primary predictor was elder abuse (reported and confirmed) reported to social services agency. The outcome of interest was the annual rate of hospitalization obtained from the Centers for Medicare and Medicaid Services. Poisson regression models were used to assess these longitudinal relationships. Results: The unadjusted mean annual rate of hospitalization was 0.62 (95% CI, 0.59-0.66) for those without elder abuse and 1.97 (95% CI, 1.33-2.61) for those with reported elder abuse. After adjusting for sociodemographic and socioeconomic variables, medical comorbidities, cognitive and physical function, and psychosocial well-being, reported elder abuse had higher rates of hospitalization (rate ratio [RR], 2.00 [95% CI, 1.45-2.75]). Psychological abuse (RR, 2.22 [95% CI, 1.44-3.43]), financial exploitation (RR, 1.75 [95% CI, 1.06-2.90]), caregiver neglect (RR, 2.43 [95% CI, 1.60-3.69]), and 2 or more types of elder abuse (RR, 2.59 [95% CI, 1.82-3.66]) were associated with increased rates of hospitalization, after considering the same potential confounders. Results from interaction term analyses suggested that the association between elder abuse and hospitalization did not differ across the levels of medical comorbidities, cognitive and functional impairment, or psychosocial distress. Conclusions and Relevance: Elder abuse was associated with increased rates of hospitalization in this community population. Future research is needed to explore the causal mechanisms between elder abuse and hospitalization. As we enter the era of health care reform, an improved understanding of factors that increase rates of hospitalization could also have significant implications for social and health policy as well as clinical care of the vulnerable patients.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5eebf747ddb87f81964e03fd4a5c796a",
  "timestamp": "2025-05-15T03:26:54.558564"
}