{
  "id": 4120,
  "title": "Bank intermediation efficiency and liquidity risk in Egypt: a two-stage non-parametric analyses",
  "abstract": "This is a pioneering study that undertakes a comparative analysis assessing the annual intermediation efficiency of public versus private banks in Egypt. Moreover, liquidity risk is a major threat facing banks in their efforts to sustain financial stability. Thus, this study is the first to model the determinants of liquidity risk in public and private banks in Egypt while examining the impact of banks' intermediation efficiencies on their liquidity risk levels. The study employs advanced nonparametric econometric approaches on a sample of Egyptian public and private banks from 2014 to 2022. The data envelopment analysis is used in estimating banks' intermediation efficiency scores, while the quantile regression analysis is applied to examine the impact of bank intermediation efficiency on liquidity risk under different liquidity risk quantiles. The findings indicate that public banks show consistent superiority in terms of their financial intermediation efficiency levels compared to private banks. Moreover, the paper findings demonstrate the negative significant relationship between bank intermediation efficiency and liquidity risk while highlighting the higher significant positive impact of intermediation efficiency on reducing the liquidity risk of banks that are characterized by undertaking high liquidity risk levels. Furthermore, contrary to general assumptions, this study's findings demonstrate that the significance of micro- and macro-level determinants of a bank's liquidity risk is dependent on its prevailing liquidity risk level. Hence, the positive impact of equity capital, asset concentration, size, and growth in gross domestic product and the negative effect of asset quality on bank liquidity risk vary under banks' different liquidity risk quantiles.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ef0a08debc688472a4ea31674568b17",
  "timestamp": "2025-05-15T02:33:42.003774"
}