{
  "id": 4016,
  "title": "A rational approach to identify and cluster intangible assets A relational perspective of the strategic capital",
  "abstract": "Purpose - This study is intended to work out a bottleneck in the comprehension of the relational nexus which links the set of key strategic resources (SRs) of a company, represented by the uncertain recognition and the ambiguous clustering of their intangible components. The purpose of this paper is to provide a candidate solution for a rational appraisal of the inventory of the knowledge-based resources held by a company, which synergically form its Intellectual Capital (IC). Design/methodology/approach - This goal is achieved by the means of a qualitative/quantitative approach composed of sequential phases, intended to: atomize the value domain of the firm into its basic building blocks; gauge their mutual interactions and impacts; re-aggregate those involved entities accordingly; cluster them into a collection of identified and validated Intangible Assets (IAs). Never giving any direct judgment on the IAs themselves (whose extension can be fuzzy or unknown). But on the impacts between the value drivers they are built on. Findings - The proposed procedure, step-by-step illustrated by means of a numerical simulation, out of the amorphous mass of the SRs, returns an analytic picture of its composing elements keeping track of their intertwined connections and mutual influence. Consequently, allowing the comprehension of the actual framing and of the relational positioning and magnitude of such entities. Practical implications - This risk-mitigated rational identification of IAs allows the analyst to target a proper evaluation technique on them. And the management of the company to mindfully allocate/leverage on them to improve business performance and strategy alignment. The implementation returns some analytic tools which render a diagnostic snapshot of the composing elements of the IC, increasing the awareness of such entities and allowing internal/external benchmarking. Originality/value - The suggested methodologymitigates the risk of discretionality in the definition of the perimeter of each target-entity, by avoiding any direct biased judgment on them. So that each asset gets unambiguously identified within a network-logic and the interlinked portfolio of knowledge-based resources can be assessed and managed in an rational and traceable way.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f0704a9a41200c3fd9f19a6c287b09c",
  "timestamp": "2025-05-15T01:23:07.344705"
}