{
  "id": 4227,
  "title": "Diagnosis Related Groups in reconstructive plastic surgery of malignant head and neck skin tumours",
  "abstract": "Background Diagnosis Related Groups (DRGs) were introduced in Germany as a medico-economic classification system 13 years ago. In this analysis, we looked into the compensation for reconstructive plastic surgery after the excision of malignant head and neck skin tumours by DRGs. Material and methods Four main diagnoses (malignant melanoma, basal cell carcinoma, squamous cell carcinoma, carcinoma in situ) at a maximum of 6 different locations in the head and neck were combined with the following procedures: excision and primary wound closure, excision with temporary soft tissue coverage, split-thickness or full-thickness skin grafting, local, free or regional pedicle flaps, distant flaps as well as combined procedures for coverage. Results We defined 10 different DRGs based on 5750 combinations of diagnoses and procedures. DRG J22Z (revenue: EUR 2817) predominated for large temporary soft tissue coverage and skin grafting techniques. In 2017, local flaps were devaluated and now lead to DRG J11D (revenue: EUR 1903) in most cases. In this context, an aggregation of cases by a two-stage approach (stage 1: excision, stage 2: reconstruction) is particularly important. Malignant tumours of the lips are inconsistently represented by DRGs with a lack of definite rules. The highly rated main group DRG J08 (including DRGs J08A, J08B and J08C) can be achieved almost invariably by addition of specific single procedures. Conclusion The current representation of reconstructive surgery for malignant skin tumours by DRGs is associated with potential disincentive effects, which may have an impact on patient care. In search of a diversified portfolio, the main group DRG J08 should be considered in addition to the common practice of coding. The authors of this study think that this may be a possibility to compensate for the actual devaluation and to achieve resource-related reimbursement in high-cost cases. However, incorrect and inflationary use should be avoided due to the lack of long-term orientation caused by dilution of the DRGs.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f0d449b44d3be9b5a1e92246b11295a",
  "timestamp": "2025-05-15T01:24:51.509737"
}