{
  "id": 3772,
  "title": "Environmental Accounting Disclosures and Financial Performance: Evidence from the Banking Sector",
  "abstract": "This study aims to investigate the impact of environmental accounting disclosures on the financial performance of banks listed on Borsa Istanbul (BIST). In this study, sustainability and integrated reports for 2019-2023 are analyzed, and environmental accounting disclosures are classified into two categories as operational and financial activities. Using the Environmental Accounting Reporting Score, the relationship with financial performance indicators such as return on assets, return on equity, earnings per share, and profit margin is analyzed using the seemingly unrelated regression (SUR) method. The results show that environmental accounting disclosures do not have a direct and statistically significant effect on financial performance. However, control variables such as bank size, debt-to-asset ratio, and loan-to-asset ratio are found to have a positive effect on financial performance. In particular, larger banks tend to have higher profitability and earnings per share, while higher non-interest expenses have a negative impact on profitability. The study shows that the direct contribution of environmental accounting practices to financial performance is limited, but that banks' operational and financial structures are greater determinants of performance. These findings highlight the need for improvements in areas such as standardization of sustainability reporting, stakeholder awareness, and environmental risk management for policy makers and banks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f2d000696e981f0e8244bd88d3e5844",
  "timestamp": "2025-05-15T02:29:59.126170"
}