{
  "id": 7114,
  "title": "Citizen scientists' engagement in flood risk-related data collection: a case study in Bui River Basin, Vietnam",
  "abstract": "Time constraints, financial limitations, and inadequate tools restrict the flood data collection in undeveloped countries, especially in the Asian and African regions. Engaging citizens in data collection and contribution has the potential to overcome these challenges. This research demonstrates the applicability of citizen science for gathering flood risk-related data on residential flooding, land use information, and flood damage to paddy fields for the Bui River Basin in Vietnam. Locals living in or around flood-affected areas participated in data collection campaigns as citizen scientists using self-investigation or investigation with a data collection app, a web form, and paper forms. We developed a community-based rainfall monitoring network in the study area using low-cost rain gauges to draw locals' attention to the citizen science program. Fifty-nine participants contributed 594 completed questionnaires and measurements for four investigated subjects in the first year of implementation. Five citizen scientists were active participants and contributed more than 50 completed questionnaires or measurements, while nearly 50% of citizen scientists participated only one time. We compared the flood risk-related data obtained from citizen scientists with other independent data sources and found that the agreement between the two datasets on flooding points, land use classification, and the flood damage rate to paddy fields was acceptable (overall agreement above 73%). Rainfall monitoring activities encouraged the participants to proactively update data on flood events and land use situations during the data collection campaign. The study's outcomes demonstrate that citizen science can help to fill the gap in flood data in data-scarce areas.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f2d8fe5319443ea662b60250b8f4457",
  "timestamp": "2025-05-15T03:05:31.996399"
}