{
  "id": 9366,
  "title": "Early Acceptability of a Mobile App for Contact Tracing During the COVID-19 Pandemic in France: National Web-Based Survey",
  "abstract": "Background: Several countries have implemented mobile apps in an attempt to trace close contacts of patients with COVID-19 and, in turn, reduce the spread of SARS-CoV-2. However, the effectiveness of this approach depends on the adherence of a large segment of the population. Objective: The aims of this study were to evaluate the acceptability of a COVID-19 contact tracing mobile app among the French population and to investigate the barriers to its use. Methods: The Health Literacy Survey 2019 questioned 1003 people in France during the COVID-19 pandemic on the basis of quota sampling. The survey collected sociodemographic characteristics and health literacy data, as well as information on participants' communication with caregivers, trust in institutions, and COVID-19 knowledge and preventive behaviors. The acceptability of a mobile app for contact tracing was measured by a single question, the responses to which were grouped into three modalities: app-supporting, app-willing, and app-reluctant. Multinomial logistic regression analysis was performed to identify the factors associated with the acceptability of a mobile app during the COVID-19 pandemic. Results: Only 19.2% (193/1003) of all participants were app-supporting, whereas half of them (504/1003, 50.3%) were reluctant. The factors associated with willingness or support toward the contact tracing app included lower financial deprivation (app-willing: adjusted odds ratio [aOR] 0.8, 95% CI 0.69-0.93; app-supporting: aOR 0.7, 95% CI 0.58-0.84) and higher perceived usefulness of using a mobile app to send completed health questionnaires to doctors (app-willing: aOR 2.3, 95% CI 1.70-3.26; app-supporting: aOR 3.1, 95% CI 2.04-4.82). Furthermore, the likelihood of supporting the mobile app increased with age over 60 years (aOR 1.9, 95% CI 1.13-3.22), trust in political representatives (aOR 2.7, 95% CI 1.72-4.23), feeling concerned about the pandemic situation (aOR 2.2, 95% CI 1.47-3.32), and knowledge about the transmission of COVID-19 (aOR 2.0, 95% CI 1.39-2.96). Conclusions: The most socioeconomically precarious people, who are at a higher risk of SARS-CoV-2 infection, are also the most reluctant to using a contact tracing mobile app. Therefore, optimal adherence can only be effective with a targeted discourse on public health benefits to adopt such an app, which should be combined with a reduction in inequalities by acting on structural determinants.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f2f33274da69d4a4191bb32ce4cf410",
  "timestamp": "2025-05-15T03:28:17.506809"
}