{
  "id": 2689,
  "title": "Is your company competent, interpersonal or community focused? The effect of values and brand portfolio on company reputation",
  "abstract": "PurposeThe purpose of this study is twofold: first, to determine if pharmaceutical companies can be grouped based on their espoused values, and second, to examine the relationship between these values and company reputation.Design/methodology/approachA descriptive study design is used with two separate analyses: cluster analysis for grouping the companies; and descriptive data analysis for determining cluster differences.FindingsThe findings suggest that there are three value clusters: competent, community and interpersonal, with the community group showing the highest relative reputation, and the interpersonal cluster as the lowest. Brand portfolio composition appears to positively contribute to reputation. The effect of portfolio specialization is based on a company's closeness to its therapeutic community, which may be influenced by the outward characteristics of its values.Research limitations/implicationsFuture research should examine the longitudinal effects of values on reputation combined with case studies.Practical implicationsRegardless of cluster classification, all firms should develop strong ties with their therapeutic communities using both personal and digital/omnichannel strategies.Social implicationsA company's values are becoming an important consideration for all customers and stakeholders.Originality/valueTo the best of the authors' knowledge, this study is the first to systematically examine the activities of leading pharmaceutical firms to link a specific value cluster to company reputation.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f4766c8b4c18c8a50c60779efd511f1",
  "timestamp": "2025-05-15T01:09:14.995229"
}