{
  "id": 2147,
  "title": "An integrated multi-criteria decision-making and multi-objective optimization model for socially responsible portfolio selection",
  "abstract": "The influence of socially responsible investment (SRI) has caused much attention from both institutional and individual investors in capital markets. SRI considers the corporate social responsibility (CSR) criteria of firms is becoming an emerging topic in economics and management. The aim of this paper is to develop a hybrid SRI portfolio selection model with multi-criteria decision making (MCDM) and multi-objective optimization problem (MOOP) techniques. First, a multi-dimensional evaluation criteria system containing fundamental financial indicators, CSR criteria, and stock market factors, is put forward for SRI to make the decision results more comprehensive and applicable. Second, a multi-stage MCDM decision mechanism including the affinity propagation clustering (APC) algorithm, the best-worst method (BWM), and the MULTIMOORA (Multi-Objective Optimization on the basis of a Ratio Analysis plus the full MULTIplicative form) is implemented. The APC algorithm is used for the reduction of financial indicators. The BWM is applied to determine the financial and CSR criteria weights. The MULTIMOORA method is integrated to derive the financial and CSR performance of the firms. Third, a multi-objective SRI portfolio selection model adding financial, CSR, and stock market performance is constructed, which serves as an extension of the classical mean-variance model. The compromise solution is utilized when solving the MOOP. Finally, a case study related to the medical stock investment is examined to recommend the optimal portfolio allocation for investors. Sensitivity and comparative analyses are performed to demonstrate the robustness, effectiveness, and superiority of the proposed methodology.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f4afc15a9750a0c662e649229531462",
  "timestamp": "2025-05-15T01:03:36.616050"
}