{
  "id": 4837,
  "title": "THE MEANING AND ROLE OF THE BANKABLE FEASIBILITY STUDY (BFS) AS A BASIS FOR JORC MINING PROJECTS' FEASIBILITY ASSESSMENT AND PROFITABILITY EVALUATION",
  "abstract": "International financial institutions require uniform standards for geological exploration reports, classification of mineral reserves as well as profitability assessments of mining projects. Such standardization is motivated by the necessity to compare the economic value of mineral deposits (treated as part of a mining company's assets) using uniform rules. The need for such standardization also exists in Poland. Presently, the Australian JORC Code is the most often used standard for mineral reserve identification and assessment. Mining projects are very complex and risky, therefore it is necessary to prepare a special report called a bankable feasibility study (BFS) in the pre-investment stage to ensure the selection of the optimal plan for mineral deposit development. The role of the BFS is to optimize investor decisions and to select a plan characterized by minimal risk, taking into account the knowledge about technical and financial feasibility of the mining project. During the comprehensive profitability analysis of mining projects, it is necessary to consider the following aspects: mining, geological, technical, economical, marketing, legal, environmental as well as social and administrative. Comprehensive analysis in the concept stage minimalizes the risk in the development stage (mine construction). Growing activity by international investors in Poland in the area of geological exploration and mining project development is tied to introducing the corporate governance and know-how, including the use of the JORC code.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f57a55c9099462250ec80ebbf83601a",
  "timestamp": "2025-05-15T02:41:32.744758"
}