{
  "id": 4489,
  "title": "Financial technology and banking market discipline in Indonesia banking",
  "abstract": "PurposeThis study aims to assess the effectiveness of the banking market discipline in relation to the development of Financial Technology (FinTech) startups.Design/methodology/approachUsing panel data collected from 144 banks in Indonesia from 2004 to 2018, this study's regression models were estimated using fixed effects with robust standard errors.FindingsThis study finds that FinTech startups disturb bank deposits. Meanwhile, market discipline exists in Indonesian banks, as indicated by depositors' behavior with higher credit and liquidity risks. However, market discipline does not exist for bank insolvency risk, which is indicated by a significant and positive relationship with the dependent variable. Therefore, the higher the number of FinTech startups, the more effective the market discipline. Empirical findings also revealed that the joint impact between FinTech startups and bank risk is also important in explaining the difference in the effectiveness of banking market discipline.Practical implicationsThis study has policy implications for banks in mitigating risk associated with market discipline and instability of financial intermediation.Originality/valueThis study offers a significant contribution to the empirical literature because it specifically explores the effectiveness of the banking market discipline by focusing on the joint impact of FinTech startups and bank risk on deposits. Furthermore, this study contributes to providing empirical evidence that links between FinTech startups and bank risk affect depositor behavior at government-owned, private, large and small, as well as nonmobile and mobile adoption banks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f59b722fc52f751a49163f89256aae7",
  "timestamp": "2025-05-15T02:37:47.523831"
}