{
  "id": 5605,
  "title": "Exploring the underlying relationship among risks in BOT transportation projects in developing countries: the case of Vietnam",
  "abstract": "Purpose Despite the fact that extensive studies on public-private partnerships have focused on risk identification and classification, research still lacks concentration on studying the latent structure of risks in build operate transfer (BOT) transportation projects, especially in developing countries. The research was carried out in Vietnam and this paper aims to explore the underlying relationships among risks in the context of BOT transportation projects. Design/methodology/approach A questionnaire survey was conducted to investigate the perception of stakeholders regarding the probability of occurrence and the severity of the impact of risks related to BOT transportation projects. Factor analysis was performed based on a total of 40 risks. Findings Seven risk groups were formed as a result of factor analysis, namely, projects' viability and political-regulatory risks, macroeconomic risks, projects' feasibility study and market risks, financial risks, organization/coordination and force majeure risks, tolling, contractual, approvals risks and media and land expropriation risks. Originality/value The research contributes to the current body of knowledge by providing deep insight into the structure of risks in BOT transportation projects in Vietnam through exploring the underlying relationships among risks, to form a latent risk structure from practical viewpoints. The findings are beneficial for involved stakeholders and policymakers to set up and propose suitable management strategies and related policies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f89b1205c5f15cdc76146675dd90efe",
  "timestamp": "2025-05-15T02:49:21.761421"
}