{
  "id": 1461,
  "title": "The Use of Machine Learning Combined with Data Mining Technology in Financial Risk Prevention",
  "abstract": "In order to improve the ability of enterprises to deal with financial risks, reduce labor costs, reduce financial losses, increase investors' trust in enterprise finance, and establish a comprehensive enterprise financial risk evaluation index system, the deep learning technology and data mining method under the artificial intelligence environment are applied to the financial risk analysis of listed companies. Under this background, an analysis method of financial risk prevention based on interactive mining is put forward. Around the various financial risks faced by listed companies, a special risk analysis model is established to analyze the key factors. Through the empirical analysis of 21 listed companies, rules with high trust are found, and the financial crisis of listed companies is forewarned in time. The results show that the financial risk evaluation index system of four dimensions of solvency, operation ability, profitability, growth ability and cash flow ability can affect the financial risk of enterprises. Compared with the traditional data mining algorithm, the algorithm of financial risk index evaluation model constructed in this exploration has the best performance, and the average detection accuracy is 90.27%. The accuracy of the model can be improved by 30%. The results show that the weight of each variable is good, and all of them pass the consistency test. The evaluation effect is high, and the relative error is 1.55%, which proves the rationality and accuracy of the model. The financial risk prevention model based on deep learning and data mining technology can provide a theoretical basis for the research of enterprise financial risk prevention.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f8c1ab8d1d8946138380d435b3a03ed",
  "timestamp": "2025-05-15T02:03:00.825838"
}