{
  "id": 6667,
  "title": "Prevalence and risk factors of osteoporotic fracture among the elderly population in China: a multicenter cross-sectional study",
  "abstract": "Purpose Prevalence of osteoporotic fracture (OPF) is increasing with ageing, resulting in a significant financial burden for healthcare. However, research on the nationwide epidemiological data of OPF in Chinese elderly is still scarce. The aim of this study was to investigate the prevalence and risk factors of OPF in Chinese population aged 60 years or order. Methods A cross-sectional survey was conducted in an elderly Chinese population in five centres. Questionnaire investigation and imaging examination were taken in all participants to identify OPF prevalence and risk factors. Diagnosis of OPF was determined based on imaging of vertebral fractures or history of fall-related fractures. We then used multivariate logistic regression model to analyze the associations between the potential risk factors and OPF. Results The overall prevalence of OPF in population aged 60 years or older was 24.7% (1,071/4,331), showing an increasing trend with age (P < 0.001). The prevalence of OPF was geographically distinct (P < 0.001), but similar between men and women (P > 0.05). Up to 96.8% of OPFs consisted of vertebral fractures, especially involving T11, T12, and L1 segments. Advanced age (>= 80), vision loss, severe hearing loss, multiple exercise forms, chronic kidney disease, osteoarthritis, and trauma-related vertebral fractures were significantly associated with risk factors, while education level and vitamin D supplementation were associated with protective factors of OPF. Conclusion High prevalence of OPF is a serious threat to bone health among elderly people in China. There is an urgent need for effective strategies to diagnose, prevent, and treat OPF in elderly adults.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f94d7453debaa619086ab0cb2cd878d",
  "timestamp": "2025-05-15T03:00:35.322898"
}