{
  "id": 7617,
  "title": "Predictors of endoscopic colorectal cancer screening over time in 11 states",
  "abstract": "Objectives We study a cohort of Medicare-insured men and women aged 65+ in the year 2000, who lived in 11 states covered by Surveillance, Epidemiology, and End Results (SEER) cancer registries, to better understand various predictors of endoscopic colorectal cancer (CRC) screening. Methods We use multilevel probit regression on two cross-sectional periods (2000-2002, 2003-2005) and include people diagnosed with breast cancer, CRC, or inflammatory bowel disease (IBD) and a reference sample without cancer. Results Men are not universally more likely to be screened than women, and African Americans, Native Americans, and Hispanics are not universally less likely to be screened than whites. Disparities decrease over time, suggesting that whites were first to take advantage of an expansion in Medicare benefits to cover endoscopic screening for CRC. Higher-risk persons had much higher utilization, while older persons and beneficiaries receiving financial assistance for Part B coverage had lower utilization and the gap widened over time. Conclusions Screening for CRC in our Medicare-insured sample was less than optimal, and reasons varied considerably across states. Negative managed care spillovers were observed, demonstrating that policy interventions to improve screening rates should reflect local market conditions as well as population diversity.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5f9888b0f0cc51543dced0911b35a7ef",
  "timestamp": "2025-05-15T03:10:32.977734"
}