{
  "id": 5535,
  "title": "Prevalence and Correlates of Emotional, Physical, Sexual, and Financial Abuse and Potential Neglect in the United States: The National Elder Mistreatment Study",
  "abstract": "Objectives. We estimated prevalence and assessed correlates of emotional, physical, sexual, and financial mistreatment and potential neglect (defined as an identified need for assistance that no one was actively addressing) of adults aged 60 years or older in a randomly selected national sample. Methods. We compiled a representative sample by random digit dialing across geographic strata. We used computer-assisted telephone interviewing to standardize collection of demographic, risk factor, and mistreatment data. We subjected prevalence estimates and mistreatment correlates to logistic regression. Results. We analyzed data from 5777 respondents. One-year prevalence was 4.6% for emotional abuse, 1.6% for physical abuse, 0.6% for sexual abuse, 5.1% for potential neglect, and 5.2% for current financial abuse by a family member. One in 10 respondents reported emotional, physical, or sexual mistreatment or potential neglect in the past year. The most consistent correlates of mistreatment across abuse types were low social support and previous traumatic event exposure. Conclusions. Our data showed that abuse of the elderly is prevalent. Addressing low social support with preventive interventions could have significant public health implications. (Am J Public Health. 2010;100:292-297. doi:10.2105/AJPH.2009.163089)",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5fc5bf219800b465d8af5ffdb7a14b3b",
  "timestamp": "2025-05-15T02:48:51.323153"
}