{
  "id": 4627,
  "title": "Female perspectives on housing quality and household characteristics, perceptions and challenges: Evidence from Australia",
  "abstract": "In many societies, perceptions regarding housing and ownership rights is that it is mostly consigned to males rather than females. Housing is gendered around physical aspects, as a financial asset, and even in housing data to be a male preserve - excluding females and their perceptions. This important paper addresses this limitation in the literature by examining the views and perceptions of female participants in the Australian Housing Conditions dataset. More specifically this paper examines the significance of household structure, housing quality and characteristics of Australian woman and how it affects their financial strain. As a further dimension this paper also examines differences in women's housing experience by age as older Australian women (above 65 years) have a higher likelihood to revert to substandard housing conditions and homelessness than younger Australian women (under 65 years). Logistic regression analysis shows a higher tendency towards financial strain in women under 65 years, those with either poor physical or mental health and those who were single or lone parents. These finding propose that women under 65 are at greater risk to experience household financial strain and poorer housing security. The paper argues that these results present challenges for Australian housing policy through increasing housing affordability. The analysis suggests that an increase in the availability of affordable housing will ease the financial strain and improve the mental health of Australian women. Moreover, an increase in the flexibility of housing arrangements may prove to be beneficial in providing additional housing solutions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5fe0e52b33a3dd9750bab545688ed9e9",
  "timestamp": "2025-05-15T02:39:26.946261"
}