{
  "id": 8429,
  "title": "Intellectual capital and institutional governance as capital structure determinants in the tourism sector",
  "abstract": "Purpose This study investigates the capital structure determinants of the Middle East tourism sector by examining intellectual capital (IC) efficiency and institutional governance along with firm-specific and macroeconomic variables. This research also identifies the determinants of capital structure for tourism companies in the Gulf Cooperation Council (GCC) and non-GCC countries. Design/methodology/approach Data were collected from 45 listed tourism companies of nine Middle Eastern countries over five years from 2014 to 2018. The data were analysed using ordinary least squares (OLS) regression and checked for robustness using the generalised methods of moment (GMM) estimation. Findings Overall, the results indicate that tourism companies rely more on short-term debt (STD) than long-term debt (LTD), thus decreasing liquidity and increasing financial risk. Furthermore, tourism companies in non-GCC countries have higher IC efficiency compared to those in GCC countries. The aggregate institutional index is much higher for GCC countries compared to non-GCC countries. The OLS estimations suggest IC efficiency and institutional governance index provide inconclusive evidence as a determinant of capital structure proxy. High capital employed efficiency (CEE) is associated with more leverage for tourism firms. Theoretically, the results support pecking order and trade-off theories due to the relationships between firm-specific indicators and debt. Originality/value This study closes the gap in the capital structure debate by providing valuable insights into IC efficiency and institutional governance. These two factors serve as capital structure determinants in the Middle East and the GCC and non-GCC regions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5feaaef670728e957ffb355c4268447f",
  "timestamp": "2025-05-15T03:18:51.567313"
}