{
  "id": 2164,
  "title": "Financial Distress and Audit Report Lags: An Empirical Study in Korea",
  "abstract": "This study examines the association between a firm's financial distress and audit report lags. Through this analysis, we intend to reveal whether auditors consider the clients' financial distress when performing external audits. This study employs 2,786 firm year observations from 2011 to 2018. The sample of this study consists of companies listed on the Korea Composite Stock Price Index (KOSPI) and the Korea Securities Dealers Automated Quotation (KOSDAQ). We perform OLS regression analysis to test our hypothesis. The OLS regression analysis is conducted through the SAS and STATA programs. We find that there is a significant and positive association between financial distress and audit report lags. The audit report lags increase as the likelihood of clients' financial distress increases. The results indicate that audits take different amounts of audit effort when auditors consider financial distress as a business risk when they conduct audits. In other words, we provide evidence that auditors increase the amount of audit effort when the likelihood of clients' financial distress is high. In the absence of studies on how external auditors respond to audited firms' financial distress, this study analyzes whether external auditors change their audit efforts by assessing the audited firms' financial distress. Second, the empirical result that external auditors actually follow the guidelines related to business risk and financial distress specified in the Korean Auditing Standards supports the effectiveness of the business risk-related regulations specified in the Korean Auditing Standards",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "5ffff285808b91845ccd9d624ac2479d",
  "timestamp": "2025-05-15T02:12:17.343403"
}