{
  "id": 2043,
  "title": "Financial engineering as a Tool for Regional Credit Risk Management of Groups of Industrial Enterprises (clusters) in Order to Ensure Global Competitiveness",
  "abstract": "The purpose of this article is to consider the possibilities of managing a regional debt market. Companies in the region and credit organizations have lower financial entropy compared to market entities in the central region, which determines the effectiveness of clustering. Due to the ongoing structural changes in the global and national economies, the factors determining profitability and risks are changing. Monetary policy motivates the consolidation processes of the meso level, since clustering facilitates management and increases the competitiveness of national business. Clustering in Russia eliminates the problem of the shortage of sources of investment. Clustering helps to expand the flow of internal lending, ensuring stability and adequacy of reinvestments in the real sector of the economy.One tool for assessing and modeling future risk and return is financial engineering. When analyzing the need for credit, regional industrial clusters should be able to choose among sources and conditions of financing. A good option would be a structural product, the price of which should be based on the yield of the respective bonds and which should be traded in an exchange cup of corporate and municipal bonds. Clusterization of organizations and inclusion of bond taxonomy clusters in instruments for regulating clusters will expand the boundaries of money management models of organizations and improve risk management. The proposed approach allows solving current problem situations in the field of lending, which affect the investment demand of companies.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6006b2ef5a4cbfd839e8fce1ee07c39f",
  "timestamp": "2025-05-15T02:10:25.796841"
}