{
  "id": 4199,
  "title": "Firm-specific competencies determining technological innovation: a survey in Greece",
  "abstract": "This paper investigates the 'importance' and 'awareness' of firm-specific competencies as determinants of technological innovation in the context of a European newly industrialised country. A literature-based portfolio model was developed including 17 established innovation-determining factors, related to the firm's technical, market, human resource and organisational competencies. The 'importance' of those factors as determinants of innovation in the Greek industry was tested with a survey of 105 manufacturing firms. Using correlation and regression analyses the author classified the competencies into 'major importance', 'moderate importance' and 'unimportant' ones. 'Major importance' determinants of innovation included the intensity of R&D, strength in marketing, proportion of university graduates and engineers in the staff, proportion of staff with managerial responsibility, proportion of professional staff with previous experience in another company and incentives offered to the employees to contribute to innovation. The 'awareness' of the important competencies differentiating Greek innovative companies was tested by comparing the above 'objective' results with the perceptions of the responding managers. The perceptual analysis confirmed the importance of the statistically-driven variables at the aggregated level. At the level of the individual variables, a number of inconsistencies were identified. The managers overestimated the importance of international work experience of professional staff and of training and underestimated the importance of the potential contribution of shop-floor employees. Relating the results to the Greek institutional context, the study's general finding was that the important determinants of innovation were scarce in the Greek business environment. The highly innovative companies were the ones to overcome country-specific innovation barriers, such as negligible industrial R&D, general weakness in marketing, outdated educational system, limited labour mobility and cultural problems with involving shop-floor employees in the innovation process.",
  "year": 2002,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6006ec821f67943d6e8011f304a6dceb",
  "timestamp": "2025-05-15T01:24:51.412702"
}