{
  "id": 8671,
  "title": "Social stigma associated with cancer in the Newfoundland and Labrador population: an exploratory study",
  "abstract": "Background: Among all Canadians, residents of the province of Newfoundland and Labrador (NL) have the highest risk of developing and dying of cancer. Effects of cancer-associated stigma and discrimination can contribute to the negative consequences of cancer and unnecessarily burden individuals diagnosed with cancer. In this study, we aimed to examine stigma and discrimination-related experiences of individuals diagnosed with cancer and predictors of experiencing stigma in NL. Methods: This was a cross-sectional and self-administered online survey study. The survey instrument included both open-ended and closed-ended items, and data were collected between June 2019 and February 2020. Descriptive statistics, thematic analyses, and regression techniques were used for data analysis. Results: A total of 325 respondents participated in this study. Self-perceived stigmatization and discrimination were reported by 24% and 14% of the participants, respectively. The most common sources contributing to these experiences were friends, insurance and financial companies, and workplace relations. Issues related to insurance, social relations, and workplace opportunities were among the most common reported impacts of cancer. A large portion of the participants had not experienced stigma and discrimination or experienced anything but positive support from others. Several factors associated with experiencing stigma were also identified, such as age, disease stage, ethnicity, and socioeconomic status. Misconceptions related to cancer, issues with insurance companies, and change of life after cancer were the top themes identified by thematic analysis. Conclusions: This study identified a rich overview of cancer-associated lived experiences in the NL population. Educational campaigns on cancer, integration of stigma-related support in cancer care, and stronger antidiscriminatory legislations and practices should be encouraged in NL.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60104dc997916da4e8b948418543f722",
  "timestamp": "2025-05-15T03:21:24.628999"
}