{
  "id": 7945,
  "title": "Prevalence and correlates of influenza vaccination among kidney transplant patients",
  "abstract": "Context-Immunosuppressive regimens increase kidney transplant patients' risk of contracting life-threatening influenza. However.. little information exists about the prevalence and correlates of influenza vaccinations in this population. Objective-To determine the prevalence and explore correlates of influenza vaccination in kidney transplant recipients. Design, Sample, and Setting-This cross-sectional study used data from the Supporting Medication Adherence in Renal Transplantation study. The convenience sample consisted of 356 adult kidney transplant recipients (58.1% male; mean age, 52.9 [SD 13.53] years) recruited from 2 Swiss transplant outpatient clinics. Influenza vaccination status was assessed by self-report (yes/no). Main Outcome Measure-Known correlates of vaccination in chronically ill patients (older age, cohabitation, higher education, higher socioeconomic status, financial stability, more comorbid diseases, nonsmoking status, and clinical site where care is received) were entered into a multiple logistic regression model. Results-Of the 356 patients, only 83 (23.3%) reported having been vaccinated against influenza in the previous year. Positive vaccination status was significantly related to older age (odds ratio, 1.04; 95% confidence interval, 1.02-1.06). Conclusion-Despite national and international guidelines recommending influenza vaccination in kidney transplant recipients, the prevalence of influenza vaccination in this sample was low. This study's results suggest that transplant centers need to implement policies to maximize influenza vaccination of their patients. (Progress in Transplantation. 2009;19:312-317)",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6014f5622204075e4bc117f4d6c98577",
  "timestamp": "2025-05-15T03:13:30.700178"
}