{
  "id": 8107,
  "title": "Sequential Cross-Validated Bandwidth Selection Under Dependence and Anscombe-Type Extensions to Random Time Horizons",
  "abstract": "To detect changes in the mean of a time series, one may use previsible detection procedures based on nonparametric kernel prediction smoothers that cover various classic detection statistics as special cases. Bandwidth selection, particularly in a data-adaptive way, is a serious issue and not well studied for detection problems. To ensure data adaptation, we select the bandwidth by cross-validation but in a sequential way leading to a functional estimation approach. This article provides the asymptotic theory for the method under fairly weak assumptions on the dependence structure of the error terms, which cover, for example, GARCH(p, q) processes, by establishing (sequential) functional central limit theorems for the cross-validation objective function and the associated bandwidth selector. It turns out that the proof can be based in a neat way on Kurtz and Protter's (1996) results on the weak convergence of Ito integrals and a diagonal argument. Our gradual change-point model covers multiple change-points in that it allows for a nonlinear regression function after the first change-point possibly with further jumps and Lipschitz continuity between those discontinuities. In applications, the time horizon where monitoring stops latest is often determined by a random experiment; for example, a first-exit stopping time applied to a cumulated cost process or a risk measure, possibly stochastically dependent on the monitored time series. Thus, we also study that case and establish related limit theorems in the spirit of Anscombe's (1952) result. This is achieved by embedding the stopped processes into a sequence of processes, which allows us to handle the randomly determined time horizon as a random change of time problem. The result has various applications including statistical parameter estimation and monitoring financial investment strategies with risk-controlled early termination, which are briefly discussed.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6015afef0d8a527f0f91fb9837e6970e",
  "timestamp": "2025-05-15T03:15:09.444442"
}