{
  "id": 9407,
  "title": "Prevalence of and Risk Factors for Genito-Pelvic Pain/Penetration Disorder: A Population-Based Study of Iranian Women",
  "abstract": "Introduction: To date, few studies have investigated the prevalence of sexual pain in the context of the new diagnostic concept of genito-pelvic pain/penetration disorder (GPPPD). Aim: To evaluate the prevalence of GPPPD and its associated factors. Methods: This was a population-based, cross-sectional study of 590 healthy married women age 18-70 years conducted between May and October 2017 in Tehran, Iran. Main Outcome Measures: Research tools included demographic characteristics checklist, factors affecting GPPPD, sexual distress and self-reporting of pain during intercourse, 2 standard questionnaires on depression (Patient Health Questionnaire 9) and Binik's guideline for the diagnosis of GPPPD. Results: 196 women (33%) reported pain or fear in answer to self-report questions. Administration of Binik's guideline yielded a GPPPD prevalence of 16% (n = 94 women); however, this number decreased to 62 women (10.5%) when sexual distress was taken into account; thus, the final prevalence of GPPPD was considered to be 10.5%. However, if the threshold in Binik's guideline was lowered to also include those reporting somewhat pain in addition to the group reporting moderate and quite a bit or always, then the prevalence of GPPPD increased to 25.8%. The results of backward logistic regression identified a strong aversion to looking at or touching the genitalia (odd ratio [OR] = 4.3), low sexual satisfaction (OR = 3.1), and severe depression (OR = 6.6) as independent risk factors for a diagnosis of GPPPD and secure financial status (OR = 0.3) and a high level of marital satisfaction (OR = 0.2) as protective factors against a diagnosis of GPPPD. Clinical Implications: Reliable diagnosis of GPPPD is crucial. Application of validated tools may mitigate the overestimation of GPPPD prevalence. Simultaneously, clinicians' judgment is essential in assessing a reasonable threshold and preventing underestimation that leads to the exclusion of women suffering from pain. Strengths & Limitations: The present study is one of the few evaluating the prevalence of GPPPD according to the Diagnostic and Statistical Manual of Mental Disorders, 5th Edition (DSM-5) definition and Binik's guideline. The study also aims to point out some new perspectives on merging the 2 concepts of vaginismus and dyspareunia. Study limitations include the evaluation of factors affecting GPPPD based on self-reporting and possible recall bias. Conclusion: Further research is needed to determine the appropriate threshold for a diagnosis of GPPPD. We suggest that a woman with mild to moderate pain or fear of vaginal penetration is under sexual distress and cannot be neglected. In addition, problems may arise following the DSM-5 merging of the 2 disorders of vaginismus and dyspareunia, owing to the significant prevalence and distress of lifelong vaginismus in some cultures. Copyright (C) 2019, International Society for Sexual Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60198bb48234748489ea429c763959af",
  "timestamp": "2025-05-15T03:28:17.668073"
}