{
  "id": 5632,
  "title": "Impact of ownership structure and ownership concentration on credit risk of Chinese commercial banks",
  "abstract": "Purpose The purpose of this paper is to examine the effects of bank ownership structure and ownership concentration on credit risk. Design/methodology/approach Using panel data on a sample of 88 Chinese commercial banks, with 826 observations over a period of 2003-2018, this study has applied system generalised method of moments regression to examine the impact of bank ownership structure and ownership concentration on credit risk. This study has used two measures of credit risk, which are non-performing loan ratio (NPLR) and loan loss provision ratio (LLPR). Findings The results show that ownership type (both government and private ownership) exerts a positive and significant impact on credit risk. Measuring ownership concentration using Herfindahl-Hirchmann Index, the results indicate that concentration of ownership in the hands of government has a negative and significant effect on credit risk, whereas private ownership concentration positively impacts credit risk. Overall, the findings suggest that concentration of ownership in government hands reduces risk; however, private ownership concentration exacerbates credit risks. The results are invariant to both measures of credit risk, before and after the financial crisis. Practical implications - The findings provide useful insight to guide policy decisions in Chinese banks' lending policies and bank ownership. Originality/value Using two ex post measures of credit risk, NPLR and LLPR, and one ownership concentration measure, HHI, this study deepens our understanding on the effectiveness of Chinese banks' corporate governance reforms on managing credit risks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "602c133177464672b596b14345b24ee9",
  "timestamp": "2025-05-15T02:49:50.298204"
}