{
  "id": 4931,
  "title": "Environment, social and governance (ESG) performance and CDS spreads: the role of country sustainability",
  "abstract": "Purpose Based on a sample of 1,872 firm-year observations for 573 global firms over the period 2013-2016, this study aims to provide empirical evidence on how environmental, social and governance (ESG) performance affects corporate creditworthiness as measured by credit default swap (CDS) spreads.Design/methodology/approach The authors use a regression model that accounts for country, industry and time-fixed effects as well as the instrumental-based Generalized Method of Moments (GMM) approach to dynamic panel modeling.Findings This study finds that improvements in ESG performance, especially in its governance pillar, reduce credit risk. Further, the authors uncover evidence suggesting the complementarity between ESG performance and country-level sustainability. The results indicate a stronger risk-mitigating impact of ESG performance in countries with higher sustainability scores.Practical implications In terms of practical implications, the findings suggest that corporations should strengthen governance frameworks and procedures to reduce credit risk, prior to embarking on environmental and social objectives. Further, the finding that country sustainability is an important determinant of CDS spreads suggests that country-level sustainability initiatives would not only help to preserve natural capital and promote social capital but also be beneficial to businesses and financial stability.Originality/value The study adds to the literature on the effects of ESG performance on credit risk by (1) utilizing a measure of ESG performance that considers the financial materiality of ESG issues across different industries; (2) utilizing a market-based measure of credit risk and CDS spreads; (3) examining the relative importance of ESG components to credit risk, rather than just the aggregate measure; and (4) assessing the influence of country sustainability on the relationship between ESG and credit risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "602c70ed141d1236d30ceb8d1709d6ec",
  "timestamp": "2025-05-15T02:42:36.146471"
}