{
  "id": 4334,
  "title": "Fewer Than One in 20 Current Academic Orthopaedic Surgeons Have Obtained National Institutes of Health Funding",
  "abstract": "BackgroundNational Institutes of Health (NIH) funding is a key driver of orthopaedic research, but it has become increasingly difficult to obtain in recent years. An understanding of the types of grants that are commonly funded, how productive they are, and the factors associated with obtaining funding may help orthopaedic surgeons better understand how to earn grants.Questions/purposesIn this study, we sought to determine (1) the proportion of current academic orthopaedic surgeons who have obtained NIH grant funding, (2) the productivity of these grants by calculating grant productivity metrics, and (3) the factors (such as gender, subspecialty, and additional degrees) that are associated with obtaining grant funding.MethodsCurrent academic orthopaedic surgeons at the top 140 NIH-funded institutions were identified via faculty webpages; 3829 surgeons were identified. Demographic information including gender (men constituted 88% of the group [3364 of 3829]), academic rank (full professors constituted 22% [856 of 3829]), additional degrees (those with MD-PhD degrees constituted 3% [121 of 3829]), leadership positions, and orthopaedic subspecialty was collected. Funding histories from 1985 through 2021 were collected using the NIH Research Portfolio Online Reporting Tools Expenditures and Results. Grant type, funding, publications, and citations of each article were collected. A previously used grant impact metric (total citations per USD 0.1 million) was calculated to assess grant productivity. Multivariable binomial logistic regression was used to evaluate factors associated with obtaining funding.ResultsFour percent (150 of 3829) of academic orthopaedic surgeons obtained USD 338.3 million in funding across 301 grants, resulting in 2887 publications over the entire study period. The R01 was the most commonly awarded grant in terms of the total number awarded, at 36% (108 of 301), as well as by funding, publications, and citations, although other grant types including T32, F32, R03, R13, and R21 had higher mean grant impact metrics. There was no difference between men and women in the by-gender percentage of academic orthopaedic surgeons who obtained funding (4% [135 of 3229] versus 3% [15 of 450]; odds ratio 0.9 [95% confidence interval 0.5 to 1.7]; p = 0.80). A department having a single funded PhD researcher may be associated with surgeon-scientists obtaining grant funding, but with the numbers available, we could not demonstrate this was the case (OR 1.4 [95% CI 0.9 to 2.2]; p = 0.12).ConclusionFewer than one in 20 academic orthopaedic surgeons have received NIH funding. R01s are the most commonly awarded grant, although others demonstrate increased productivity metrics. Future studies should investigate the role of co-principal investigators on productivity and the role of different funding sources.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60360836fbd3abdafa19dcf1c89e6626",
  "timestamp": "2025-05-15T01:25:50.611966"
}