{
  "id": 6857,
  "title": "Unveiling the drivers of green loan disclosures: a study of financial and governance determinants",
  "abstract": "Purpose- This study aims to investigate the factors influencing Indian banks' choice of green loan disclosure practices. The study analyzes the effect of financial and governance variables to understand the sustainable reporting (through green lending) behavior of Indian banks. Design/methodology/approach- The data on green loan disclosure has been hand-collected from the annual reports using a content analysis approach. Using the data of 26 banks for 12 years (2012-2023), the study uses the panel regression method to control for cross-sectional heterogeneity and generalized methods of the moment to address potential endogeneity issues. Findings- The empirical results depict that larger banks with sufficient risk capital and a strong corporate governance framework demonstrate greater disclosure of green loans. However, growth opportunities and higher market value impedes the reporting of green lending. Research limitations/implications- The findings of the study will enhance the extant literature on sustainability disclosure by integrating the financial sector companies in the context of an emerging economy. However, future research may include nonbanking finance companies as well. Social implications- Banks use societal deposits to invest in productive avenues, and therefore, it is paramount to understand their social and environmental consciousness while evaluating a financing proposal. This research provides a thorough understanding of the sustainable reporting of banks through the lens of green lending. Originality/value- This research provides unique evidence on the bank-specific determinants of green loan disclosure in an emerging economy context as against the extant literature which primarily focused on sustainable reporting of nonfinancial companies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60416d368e77800bc460a7434dfa095a",
  "timestamp": "2025-05-15T03:02:07.581945"
}