{
  "id": 7864,
  "title": "Birth and early parenting during the COVID-19 pandemic: A cross-sectional study in the Austrian and German population",
  "abstract": "Background: During the COVID-19 pandemic, new mothers and their babies represent a particularly vulnerable group. This study investigates the effects of the pandemic on the pregnancy and childbirth experience, as well as on postnatal stress and depression levels. Methods: An online survey was completed by 1964 Austrian and German mothers who gave birth during the COVID-19 pandemic. The survey included the Pregnancy Distress Questionnaire (PDQ), the Childbirth Experience Questionnaire (CEQ), the Edinburgh Postnatal Depression Score (EPDS), the Perceived Stress Score (PSS), and additional pregnancy- and pandemic-related questions. We conducted multilinear regression models in order to investigate which factors predict childbirth experience, stress and depression scores. Findings: There was a high prevalence of depression symptoms (42%), though the mean EPDS score was 8 center dot 71 (SD = 5 center dot 70), below the cut-off for depression of 10. The prevalence of high stress scores was 9%, and the mean PSS score was 17 center dot 7 (SD = 6 center dot 64), which indicates moderate perceived stress. The pandemic reduced the time spent with grandparents, as well as the help received by the mother from relatives and friends. Not receiving help was associated with higher stress and depression scores. In the multilinear regression models, the most important predictor for a negative childbirth experience was a high-risk pregnancy, while the strongest predictors for high stress and depression levels were low social support and negatively perceived pandemic repercussions on financial, social or health aspects of family life. Interpretation: The results suggest that the pandemic had an impact on maternal mental health. While the perceived consequences due to the pandemic negatively affected the postnatal depression and stress levels, perceived social support acted as a protective factor.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6046c3f492403bd4f22419cd57603e11",
  "timestamp": "2025-05-15T03:13:04.854701"
}