{
  "id": 4044,
  "title": "Does Demographics affect Mutual Fund Investors' Perception ? An Empirical study",
  "abstract": "India is going to become the strongest economy in the world and major stimulus is related with broad spectrum of Capital Market. Indian capital market is growing enormously and so Mutual fund Industry which is witnessing this shift in the area of financial market. Mutual funds are innovative vehicle of investment. It is a financial instrument for diversified portfolio investment. Innovative scheme where investors pools their money in a diversified way according to their interests and objective. Its a theory related to Behavioral finance. Corpus is then managed by an Asset management company which collects money from the investors and invests into a number of securities and bonds depending upon the financial objective of the Scheme which is agreed upon the investor and Mutual Fund company. Mutual fund Company earns return in the form of capital appreciation in the form of dividends.AMC generated returns which is passed back to the investors by appreciating their capital and increasing NAV's. This research paper is a sincere attempt to know the impact of demographic factors on the perception of mutual Fund Investors and this has been empirically proved with the help of statistical test like chi square and annova that all these demographic factors does influence investors' attitude and his behavior. Overall impact has been analysed with the help of regression analysis that revealed that (demographics) age, income,gender,occupation and marital status does effect investors perception on the whole.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6054d525b18b55e3030839f3bf51b1a0",
  "timestamp": "2025-05-15T01:23:27.268102"
}