{
  "id": 2023,
  "title": "Short-term Portfolio Optimization using Doubly Regularized Exponential Growth Rate",
  "abstract": "In the realm of short-term portfolio optimization, the integration of machine learning with exponential growth rate techniques is gaining prominence. This paper introduces a novel approach for short-term portfolio optimization, termed Short-term Portfolio Optimization using Doubly Regularized EGR (SPODR), to address the challenges posed by limited data availability. SPODR utilizes radial basis functions for the effective identification of market trends, enabling improved stock market forecasts. The approach uniquely combines l(1) and l(2)-regularization, adhering to empirical financial principles, to strike a balance between risk and return in short-term portfolios. A key aspect of SPODR is addressing the complexity of its ElasticNet-like objective, which poses a challenge for traditional methods due to its online learning nature. To overcome this, we have developed an algorithm based on the log barrier interior-point method. This algorithm is adept at efficiently optimizing portfolio allocation, taking into account the specific constraints inherent in our approach. Extensive comparative experiments across five benchmark datasets demonstrate that SPODR significantly outperforms existing short-term portfolio optimization models. It achieves a right balance between return and risk. Furthermore, SPODR showcases efficient computational speed, enhancing its applicability in real-world financial settings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6077a0c7695fb160d35125cc179e988c",
  "timestamp": "2025-05-15T02:10:25.667940"
}