{
  "id": 6807,
  "title": "Costs of postoperative morbidity following paediatric cardiac surgery: observational study",
  "abstract": "Objective Early mortality rates for paediatric cardiac surgery have fallen due to advancements in care. Alternative indicators of care quality are needed. Postoperative morbidities are of particular interest. However, while health impacts have been reported, associated costs are unknown. Our objective was to calculate the costs of postoperative morbidities following paediatric cardiac surgery. Design Two methods of data collection were integrated into the main study: (1) case-matched cohort study of children with and without predetermined morbidities; (2) incidence rates of morbidity, measured prospectively. Setting Five specialist paediatric cardiac surgery centres, accounting for half of UK patients. Patients Cohort study included 666 children (340 with morbidities). Incidence rates were measured in 3090 consecutive procedures. Methods Risk-adjusted regression modelling to determine marginal effects of morbidities on per-patient costs. Calculation of costs for hospital providers according to incidence rates. Extrapolation using mandatory audit data to report annual financial burden for the health service. Outcome measures Impact of postoperative morbidities on per-patient costs, hospital costs and UK health service costs. Results Seven of the 10 morbidity categories resulted in significant costs, with mean (95% CI) additional costs ranging from 7483 pound (3- pound 17 pound 289) to 66 pound 784 (40 pound 609-103 pound 539) per patient. On average all morbidities combined increased hospital costs by 22.3%. Total burden to the UK health service exceeded 21 pound million each year. Conclusion Postoperative morbidities are associated with a significant financial burden. Our findings could aid clinical teams and hospital providers to account for costs and contextualise quality improvement initiatives.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "608b99da8193c54eb68ea281a9d823ba",
  "timestamp": "2025-05-15T03:01:31.484754"
}