{
  "id": 5855,
  "title": "Is 'more' better? Testing the assumption that larger local governments are more sustainable",
  "abstract": "It is commonly assumed that bigger local governments will be more financially sustainable. Indeed, public policymakers are often prompted to make boundary change decisions according to idealised structures that they assume will lead to stronger local governments. In addition, many local government regulators urge councillors to work for growth in order to become sustainable. However, the assumption that size is associated with financial sustainability has seldom been put to robust empirical test. In this work, we first explore the theoretical considerations relevant to the supposed association between size and sustainability. Following this, we employ a comprehensive 5-year panel of data to test the association. The evidence we derive stands in stark contrast to the assumptions of many policy architects. We conclude our work with an enumeration of the surprising implications that our results point to with respect to future public policy prescriptions.Points for practitioners Theoretical considerations are ambiguous with respect to the assumption that larger local governments might be more financially sustainable. A regression of a 5-year panel of data demonstrates that larger local governments are indeed less financially sustainable. Our results suggest the need for a radical re-appraisal of policies surrounding amalgamation, de-amalgamation, and which local governments are most at risk of financial failure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "608c9f2bd728b2e95ceff289887c7d7a",
  "timestamp": "2025-05-15T02:51:58.711555"
}