{
  "id": 9271,
  "title": "Risk Factors for Glaucoma Diagnosis and Surgical Intervention following Pediatric Cataract Surgery in the IRIS® Registry",
  "abstract": "Purpose: To compare demographic and clinical factors associated with glaucoma following cataract surgery (GFCS) and glaucoma surgery rates between infants, toddlers, and older children using a large, ophthalmic registry. Design: Retrospective cohort study. Participants: Patients in the IRIS (R) Registry (Intelligent Research in Sight) who underwent cataract surgery at < 17 years old and between January 1, 2013 and December 31, 2020. Methods: Glaucoma diagnosis and procedural codes were extracted from the electronic health records of practices participating in the IRIS Registry. Children with glaucoma diagnosis or surgery before cataract removal were excluded. The Kaplan-Meier estimator was used to determine the cumulative probability of GFCS diagnosis and glaucoma surgery after cataract surgery. Multivariable Cox regression was used to identify factors associated with GFCS and glaucoma surgery. Main Outcome Measures: Cumulative probability of glaucoma diagnosis and surgical intervention within 5 years after cataract surgery. Results: The study included 6658 children (median age, 10.0 years; 46.2% female). The 5-year cumulative probability of GFCS was 7.1% (95% confidence interval [CI], 6.1%-8.1%) and glaucoma surgery was 2.6% (95% CI, 1.9%-3.2%). The 5-year cumulative probability of GFCS for children aged < 1 year was 22.3% (95% CI, 15.7%-28.4%). Risk factors for GFCS included aphakia (hazard ratio [HR], 2.63; 95% CI, 1.96-3.57), unilateral cataract (HR, 1.48; 95% CI, 1.12-1.96), and Black race (HR, 1.61; 95% CI, 1.12-2.32). The most common surgery was glaucoma drainage device insertion (32.6%), followed by angle surgery (23.3%), cyclophotocoagulation (15.1%), and trabeculectomy (5.8%). Conclusions: Glaucoma following cataract surgery diagnosis in children in the IRIS Registry was associated with young age, aphakia, unilateral cataract, and Black race. Glaucoma drainage device surgery was the preferred surgical treatment, consistent with the World Glaucoma Association 2013 consensus recommendations for GFCS management. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Glaucoma 2024;7:131-138 (c) 2023 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60937a264e9c41d7ea7791ec36bd212f",
  "timestamp": "2025-05-15T03:27:24.935072"
}