{
  "id": 8772,
  "title": "Associations of Education and Income with Secondhand Smoke Exposure Among Non-smoking Pregnant Women in Japan: The Tohoku Medical Megabank Project Birth and Three-Generation Cohort Study",
  "abstract": "ObjectivesThere is accumulating evidence that lower socioeconomic groups are more exposed to secondhand smoke (SHS) than higher ones in the general population. The objective of the study was to examine the associations of education and income with SHS exposure among non-smoking pregnant women in Japan.MethodsWe analyzed data from 11,615 non-smoking pregnant women in Japan who participated in the Tohoku Medical Megabank Project Birth and Three-Generation Cohort Study from 2013 to 2017. SHS exposure was defined as indoor exposure to someone else's cigarette smoke >= 1 day/week during pregnancy. Multiple logistic regression analyses were conducted to examine whether pregnant women's educational attainment or equivalent household income was associated with SHS exposure, adjusting for covariates. Stratified analyses by work status were also conducted.ResultsThe prevalence of SHS exposure during pregnancy was 32.6%; 27.6% among non-working women and 35.8% among working women. Lower educational attainment was associated with an increased risk of SHS exposure; the odds ratio of high school education or lower compared with university education or higher was 1.87 (95% confidence interval, 1.66-2.10). Lower equivalent household income was associated with an increased risk of SHS exposure; the odds ratio of the lowest compared with the highest level of income was 1.53 (95% confidence interval, 1.35-1.74). These associations did not differ between non-working women and working women.Conclusions for PracticeAssociations of education and income with SHS exposure imply that educational interventions and financial incentives are needed for pregnant women and their household smokers. SignificanceWhat is already known on this subject? Secondhand smoke exposure during pregnancy has negative consequences for pregnancy and infant outcome. Education and income have been suggested to be associated with secondhand smoke exposure during pregnancy.What this study adds? We found that about one-third of pregnant women were exposed to secondhand smoke in Japan. Pregnant women with lower educational attainment and/or lower equivalent household income had significantly higher risks of secondhand smoke exposure than pregnant women with higher education and/or income.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60a8c25bc90ff6cc89d1ee5520b6bdb8",
  "timestamp": "2025-05-15T03:22:25.988694"
}