{
  "id": 332,
  "title": "Determinants of efficient water use and conservation in the Colombian manufacturing industry using machine learning",
  "abstract": "Water is a fundamental aspect of achieving sustainable industries, and it is essential for firms to make efficient use of it. However, not all companies have sustainable water management practices in place. In this study, we aim to answer the research question: What factors influenced the efficient use and saving of water in the Colombian manufacturing industry in 2020? We used data from the Annual Manufacturing Survey and the Industrial Environmental Survey conducted by DANE to investigate this question. Our study grouped the variables into four categories: Environmental commitment, Risk mitigation, Innovation, and Location. We used two supervised learning machine-learning algorithms-decision tree and logit regression with LASSO regularization-to analyze the data. The results underscore those investments in wastewater treatment, total water consumption, and commitments to air and climate protection emerge as pivotal drivers for embracing sustainable practices. Moreover, the geographical location of companies significantly influences the likelihood of implementing water conservation initiatives. To enhance efficient water use and conservation in the Colombian manufacturing sector, several targeted public policies are recommended. These include offering fiscal and financial incentives to encourage investments in advanced wastewater treatment and reuse technologies. Additionally, advocating for specialized training and environmental education programs tailored for corporate personnel is crucial. Moreover, establishing initiatives for environmental certification and eco-labeling within the corporate sector can significantly promote sustainable water practices. Lastly, enforcing more stringent environmental regulations and standards, especially for industries like Textile, Metallurgy, and Manufacturing of rubber and plastic products, is essential to ensure responsible water management across the sector.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60abb733d258a040ca7ba9d438e1ff4d",
  "timestamp": "2025-05-15T01:49:41.013816"
}