{
  "id": 4473,
  "title": "Corporate foreign exchange speculation and integrated risk management",
  "abstract": "Purpose - The purpose of this paper is to investigate how non-finance departmental involvement in the management of exchange rate risks impacts the extent of foreign exchange speculation in non-financial firms. Design/methodology/approach - Non-financial firms in a small open economy (Denmark) are surveyed to investigate the extent of foreign exchange speculation and how it is related to the degree of nonfinance departmental involvement in the management of exchange rate risks. The authors employ binary and ordered probit regression analysis. Findings - A positive link is found between the extent to which departments other than the finance department are involved in the management of exchange rate risks; and second, the extent to which the firm is likely to speculate-whether in the form of selective hedging or active speculation - on the foreign exchange market. Practical implications - The findings indicate that the trend towards a more integrated risk management approach in which the finance department is not the only department responsible for risk management may have the (unforeseen) consequence that foreign exchange speculation increases. Originality/value - The paper's findings are important because the link between the extent of foreign exchange speculation and a more integrated risk management approach has not been addressed previously.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60b330b34c70f1289bbe5e4d644f873f",
  "timestamp": "2025-05-15T02:37:47.491926"
}