{
  "id": 8528,
  "title": "Oil price shocks and emerging stock markets revisited",
  "abstract": "Purpose The study aims to understand the role of different streams of oil shocks (demand, supply and risk shocks) on the oil-importing and exporting countries' stock returns. The study also examines the impact of crude oil shocks across the economic regimes and market states. Besides, the role of the Global Financial Crisis (GFC) of 2008 in shaping the oil-stock relationship is also investigated. Design/methodology/approach The authors revisit the impact of oil shocks on emerging equity markets by using the novel shock decomposition algorithm proposed by Ready (2018). The authors consider 24 emerging equity markets for the period spanning over July 15, 2002, to June 18, 2018, and bifurcate them based on oil dependence. The authors use rolling and dynamic conditional correlation analysis to understand the time-varying co-movements between oil prices and stock returns. The regime and state-specific dependence of stock returns on the structural oil shocks are captured by the Markov regime switching and quantile regression models. Findings The authors find that the demand shocks are positively associated with stock markets, whereas the supply shocks are negatively related, except in some of the oil-exporting countries. The risk-based shocks also appear to have a negative association with stocks. The authors do not find evidence of strong regime dependence and the direction of relationship across the high and low regimes is somewhat stable. Further, the authors observe an intense oil-stock relationship in the bearish market conditions. Besides, the authors also report evidences of changes in oil-stock relationship onset the GFC. Originality/value This is among the first studies to use the oil shock decomposition algorithm of Ready (2018) in the context of emerging equity markets. Additionally, oil shocks' role on the stock market movements across the regimes and market states is studied comprehensively. Thus, the nature of oil shock and the extent to which the emerging markets are exposed is observed in this study.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60b6b811a7d3542d6cc2a0bda3d299ca",
  "timestamp": "2025-05-15T03:19:52.059914"
}