{
  "id": 6360,
  "title": "Implications of Payment for Acute Myocardial Infarctions as a 90-Day Bundled Single Episode of Care: A Cost of Illness Analysis",
  "abstract": "Objectives Evaluate the cost of illness associated with the 90-day period following acute myocardial infarction (AMI) and the implication of care pathway (percutaneous coronary intervention [PCI] vs medical management [MM]), in order to assess the potential financial risk incurred by providers for AMI as an episode of care. Perspective Reimbursement payment systems for acute care episodes are shifting from 30-day to 90-day bundled payment models. Since follow-up care and readmissions beyond the early days/weeks post-AMI are common, financial risk may be transferred to providers. Setting AMI hospitalization Centers for Medicare & Medicaid Services (CMS) standard analytical files between 10/1/2015 and 9/30/2016 were reviewed. Methods Included patients were Medicare beneficiaries with a primary diagnosis of AMI subsequently treated with either PCI or MM. Payments were standardized to remove geographic variation and separated into reimbursements for services during the hospitalization and from discharge to 90 days post-discharge. Results were stratified by Medicare Severity Diagnosis Related Groups (MS-DRGs) individually and grouped between patients treated with MM and PCI. Risk-adjusted likelihood of utilization of post-acute nursing care and all-cause readmission was assessed by logistic regression. Results A total of 96,546 patients were included in the analysis. The highest total mean payment (US$32,714) was for MS-DRG 248 (PCI with non-drug-eluting stent with major complication or comorbidity). Total payments were similar between MM and PCI patients, but MM patients incurred the majority of costs in the post-acute period after discharge, with the converse true for PCI patients. MM without catheterization was associated with a twofold increase in risk of requiring post-acute nursing care and 90-day readmission versus PCI (odds ratio [95% confidence interval]: 2.01 [1.92-2.11] and 2.17 [2.08-2.27]). Smaller hospital size, diabetes, peripheral arterial disease, prior AMI, and multivessel disease were predictors of higher healthcare utilization. Conclusions MS-DRGs associated with the lowest reimbursements (and presumably, lowest costs of inpatient care) incur the highest post-discharge expenditures. As the CMS Bundled Payment for Care Improvement and similar programs are implemented, there will be a need to account for heterogeneous post-discharge care costs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60b8e5bc3bb18fd2612d3875267ea94f",
  "timestamp": "2025-05-15T02:57:07.801985"
}