{
  "id": 2049,
  "title": "Examining the Validity of the Financial Exploitation Vulnerability Scale",
  "abstract": "Lichtenberg, Campbell, Hall, and Gross used a contextual framework for financial decision-making to create and provide evidence for a new scale to assess risk for financial exploitation, the Financial Exploitation Vulnerability Scale (FEVS). This study examined the criterion validity of self-reported memory complaints and living alone on FEVS risk scores. Participants were the first 258 individuals reporting as 60 years or older and who completed the FEVS on the website between December 2020 and February 2021. Correlations, multiple regression, analysis of variance, and chi-square analyses were conducted to compare groups based on risk scores. FEVS risk scores were significantly correlated with years of education, self-reported memory complaints, and living alone; 18% of unique variance was accounted for by these measures in a regression analysis. The ANOVA indicated that while there was an interaction effect for memory complaints by living alone, the majority of variance accounted for was attributed to the self-reported memory complaints measure. Older adults with memory complaints are in need of perceived financial vulnerability assessment. The Financial Exploitation Vulnerability Scale is a valuable self-report tool that clinical gerontologists can use in their intake assessments and follow-ups.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60c510d87036963fddd8e07cfb67162c",
  "timestamp": "2025-05-15T02:10:25.820107"
}