{
  "id": 2636,
  "title": "The forward premium puzzle and the sovereign default risk",
  "abstract": "Carry-trade strategies which consist of buying forward high-yield currencies tend to yield positive excess returns when global financial markets are booming, whereas they generate losses during crises. Firstly, we show that the sovereign default risk, which is taken on by investing in high-yield currencies, may increase the magnitude of the gains during the boom periods and the losses during crises. We empirically test for this hypothesis on a sample of 18 emerging currencies over the period from June 2005 to September 2010, the default risk being proxied by the sovereign credit default swap spread. Relying on smooth transition regression (STR) models, we show that default risk contributes to the carry-trade gains during booms, and worsens the losses during busts. Secondly, we turn to the Fama regression linking the exchange-rate depreciation to the interest-rate differential. We propose a nonlinear estimation of this equation, explaining the puzzling evolution of its coefficient by the change in the market volatility along the financial cycle. Then, we introduce the default risk into this equation and show that the forward bias, usually evidenced by a coefficient smaller than unity in this regression, is somewhat alleviated, as the default risk is significant to explain the exchange-rate change. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60e7e72b48c8eccf96fd09fc12501573",
  "timestamp": "2025-05-15T02:17:32.167715"
}