{
  "id": 8286,
  "title": "Using epidemiological data to identify needs for child-rearing support among Chinese parents: a cross-sectional survey of parents of children aged 6 to 35 months in 15 Chinese cities",
  "abstract": "Background The quality of the family environment-in particular, the kind of parenting children receive in their early years-plays a critical role in influencing children's growth and development. To facilitate the development and delivery of appropriate parenting and family interventions for Chinese parents, this study explores the prevalence of the difficulties that may arise in the course of child-rearing, the associated sociodemographic factors and parents' help-seeking behavior. Methods A cross-sectional self-reporting survey was conducted with a sample of 2229 parents of children between 6 and 35 months of age. Using a stratified random-digit design, parents from 15 Chinese cities were surveyed to determine their child-rearing difficulties, support-seeking behavior and their preferences for service delivery. The sociodemographic factors that influenced major child-rearing difficulties were analyzed using bivariate and logistic analyses. Results The majority (87.5%) of Chinese parents of children aged 6-35 months reported experiencing child-rearing difficulties. Nearly one third (31.5%) of parents reported experiencing major difficulties. Feeding and sleep problems were most often reported. Regression analysis revealed that major child-rearing difficulties most often involved male children (OR = 1.35, 95% CI 1.11-1.64), single-child households (OR = 1.38, 95% CI 1.07-1.77), and households with financial problems (OR = 1.40, 95% CI 1.06-1.85). Just over one third of parents (33.44%) sought professional support, while 21.37% had attended a parenting course in the past year. Prefer ways of sourcing parental support included professional online platform (69.24%), self-help books (43.70%), face-to-face consultation (24.99%), and attending lectures (36.57%). Conclusions Child-rearing difficulties are common among parents of children between 6 and 35 months of age in Chinese cities. The family with boys, single-child, financial problems, and father not joining in child-rearing may face the high risk to major child-rearing difficulties. The national initiative to provide more guidance and support for child-rearing difficulties is worthwhile, as is the development of online parenting programs.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60ea6b6420790cbcdfa1f6df9aca3ed7",
  "timestamp": "2025-05-15T03:17:21.536827"
}