{
  "id": 8424,
  "title": "How Agricultural Farmers Respond to Risks during the COVID-19 Pandemic: An Exploration through the Dual Social Capitals Approach",
  "abstract": "The degree of risk to which agricultural farmers are exposed during the COVID-19 pandemic and how they tackle those difficulties is a critical topic. Although the topic has been paid considerable attention by worldwide scholars, this study intends to compensate for it via conducting a ground-breaking analysis based on sample survey data. Integrating theoretical perspectives of individual- and collective-level social capitals rooted in sociology, and using NPRM (Nested Poisson Regression Model) to analyze a sample survey data collected in rural China in August 2020, we generated the following findings. (1) The overall risks and damages to agricultural production and management are relatively minimal. Thus, farmers are highly confident in conquering the pandemic and recovering their business. (2) Compared with micro- and macro-level influencing factors, social capital at both levels could greatly help agricultural farmers obtain informal and formal supporting resources (such as encouragement and financial supports), thus helping them to cope with the pandemic shock. (3) Specifically, the acquisition of informal supporting resources is mainly affected by the size of farmers' ordinary networks (Spring Festival Visiting Network) and the frequency of public activities held in a village; gaining access to formal supporting resources is also influenced by the frequency of public activities, but the state of farmers' personal connections with official departments plays a crucial role in determining the amount of such resources can be obtained. According to these empirical findings, suggestions on how to suppress the negative effects and lift the positive effects of dual social capitals in the process of responding to risks are proposed.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60f9df1b22c597508a92924644a303ef",
  "timestamp": "2025-05-15T03:18:51.546999"
}