{
  "id": 5562,
  "title": "Coresident Households and IPV Risk: An Analysis of Prevalence and Correlates",
  "abstract": "PurposeRates of coresident households have risen within recent decades. However, the implications of an adult family member's presence within the home for exposure to intimate partner violence (IPV) remains underexplored. While familial support can operate as a protective mechanism against IPV, past qualitative research suggests that distinctive stressors and conflict can emerge within coresident households.MethodsThis study leverages several waves of observations from the Future of Families and Child Wellbeing Study (n = 11,895). We apply descriptive and logistic regression analyses to compare instances of IPV among women within coresident and non-coresident homes. Models additionally assess whether variation between groups is attributable to relationship characteristics or sociodemographic attributes.ResultsWe find no evidence that coresident homes provide a buffer against incidences of IPV; in contrast, women within coresident homes have a 4% higher probability of experiencing IPV, relative to non-coresiding peers. This heightened risk of IPV, however, is fully accounted for once controlling for the relatively more vulnerable socioeconomic profiles of coresiders.ConclusionsOur findings point to the need for IPV resource providers to recognize that IPV can occur within any household structure, even with other adults living in the home. These findings further highlight the salient role of financial insecurity as a risk factor for IPV. Culturally responsive IPV services should seek to recognize distinctive norms and conflict that operate within multigenerational homes, as well as the financial stressors that correlate with both IPV and coresidence.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60fe1348b5030f309162070e35f6d11f",
  "timestamp": "2025-05-15T02:48:51.423605"
}