{
  "id": 8156,
  "title": "Initiation of Adjuvant Endocrine Therapy in Black and White Women With Breast Cancer",
  "abstract": "Adjuvant endocrine therapy (AET) is recommended for women diagnosed with hormone receptor (HR) positive breast cancer. AET reduces breast cancer recurrence and morality. Black women have high rates of breast cancer morality and recent reports suggest that black women with HR positive disease have higher breast cancer mortality than white women with HR positive disease. Thus, initiation of AET may be particularly important for black women with HR positive breast cancer. Information about the impact of race on initiation of AET is limited and has been inconsistent. This study focused on 270 black (n = 150) and white (n = 120) women with HR positive breast cancer. We found that the initiation of chemotherapy was related to a combination of woman's age and race rather than just her race alone. Black women (<= 50 years old) had the lowest rate of AET initiaiton 59.7%. The proportional representation of Black and White women in our study may have aided our ability to examine differences within subgroups rather than just between Blacks and Whites which highlights the need for diverse study samples. Background: Adjuvant endocrine therapy reduces risk of recurrence and mortality in women with hormone receptor epositive breast cancer, yet many women never initiate it. We examined the influence of race, sociocultural factors, and process-of-care factors on initiation of adjuvant endocrine therapy in a racially diverse sample. Patients and Methods: Eligible women were originally recruited for the Narrowing the Gaps in Adjuvant Therapy Study (2006-2011). Sociocultural and process-of-care factors were collected via telephone surveys before adjuvant therapy. Clinical factors were abstracted from charts. Penalized LASSO (least absolute shrinkage and selection operator) logistic regression model was used to identify variables associated with initiation. Results: Of the 270 women, 55.6% were black and the rest were white. Most women (74.8%) initiated therapy. A significant interaction (P = .008) was found between race and age. Black women aged <= 50 years had the lowest initiation (59.7%) compared to black women > 50 years (87.1%), white women <= 50 years (73.7%), or white women > 50 years (72.0%). Multivariate analysis found that younger black women exhibited a marginally higher risk of noninitiation compared to older black women. Additionally, ratings of financial access, presence of comorbidities, and levels of communication were all associatedwith endocrine therapy initiation. Conclusion: Black women <= 50 years of age and women with financial constraints may be important subgroups for interventions. Patienteprovider communication appears to be an important leverage point to foster therapy uptake. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "60feb7aad1a95fed573275c7d0f11fed",
  "timestamp": "2025-05-15T03:15:38.476580"
}