{
  "id": 4156,
  "title": "The Evolving Landscape of the American Board of Endodontics Certification Process: What it Means for the Future of the Specialty",
  "abstract": "Introduction: The American Board of Endodontics certification is an evolving process to ensure the continuing existence of the specialty of endodontics. Recent examination changes have resulted in greater numbers of Diplomates. To fully understand the implications of such changes and evaluate current Diplomates' views of the examination process, a specific set of questions was developed focusing on beliefs and perceptions, age relationships, test components, and hypotheticals for potential changes. An analysis of the examination process has never been reported in the literature, and, as such, the survey was designed to provide the endodontic community with critical information on the past, current, and potentially future examination process. Methods: A Web-based survey consisting of 25 questions was e-mailed to 1522 Diplomates. Results: A total of 736 Diplomates responded to the survey for a response rate of 48.4%. Descriptive statistics and regression analysis (p < .05) were used to explore relationships in the data. Conclusions: A lack of perceived importance of being board certified was a major barrier. Respondents opposed de-emphasizing literature, offering the oral examination in a videoconferencing virtual format, eliminating mandatory recalls, and entirely removing 1 component of the examination to increase the numbers of Diplomates. Respondents supported reviewing the case history portfolio examination on a rolling basis. Respondents disagreed that molar cases alone demonstrated clinical competency. Older Diplomates felt the strongest that the meaning of being a Diplomate has been diluted by the changes in the certification process. The authors believe the American Association of Endodontists, program directors, and the College of Diplomates must continually emphasize the importance and value of board certification as the process continues to evolve.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6104a919dbe455c1eda32649a6fb670b",
  "timestamp": "2025-05-15T01:24:25.342131"
}