{
  "id": 7261,
  "title": "Description of the Moderate Brain Injured Patient and Predictors of Discharge to Rehabilitation",
  "abstract": "Objective: To describe patients with moderate traumatic brain injury (TBI) treated and discharged at levels I and II trauma centers in the United States; and to describe the predictors of discharge to rehabilitation after acute care. Design: Retrospective, cross-sectional, descriptive study. Setting: Trauma centers. Participants: Patients with moderate TBI (N=2087; age range, 18-64y) as reported in the 2010 National Sample Project. Interventions: None. Main Outcome Measure: Discharge destination (rehabilitation vs home with no services). Results: Multivariate logistic regression models revealed that demographic, clinical, and financial characteristics influenced the likelihood of being discharged to rehabilitation. Increased age, increased severity, Medicare use, longer length of stay, and trauma center locations in the Midwest and Northeast all increased the likelihood of discharge to rehabilitation. Conclusions: The decision to discharge a person with moderate TBI from acute care to rehabilitation appears to be based on factors other than just clinical need. These findings should be considered in creating more equitable access to postacute rehabilitation services for patients with moderate TBI because they risk long-term physical and cognitive problems and have the potential for productive lives with treatment. (C) 2015 by the American Congress of Rehabilitation Medicine",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "610d6e0b7faa880728b675f0cb7c1769",
  "timestamp": "2025-05-15T03:06:35.454673"
}