{
  "id": 1286,
  "title": "Foundations and trends in option pricing models: a 45 years global examination based on bibliometric analysis",
  "abstract": "PurposeThe purpose of this study is to analyse and compile the literature on various option pricing models (OPM) or methodologies. The report highlights the gaps in the existing literature review and builds recommendations for potential scholars interested in the subject area.Design/methodology/approachIn this study, the researchers used a systematic literature review procedure to collect data from Scopus. Bibliometric and structured network analyses were used to examine the bibliometric properties of 864 research documents.FindingsAs per the findings of the study, publication in the field has been increasing at a rate of 6% on average. This study also includes a list of the most influential and productive researchers, frequently used keywords and primary publications in this subject area. In particular, Thematic map and Sankey's diagram for conceptual structure and for intellectual structure co-citation analysis and bibliographic coupling were used.Research limitations/implicationsBased on the conclusion presented in this paper, there are several potential implications for research, practice and society.Practical implicationsThis study provides useful insights for future research in the area of OPM in financial derivatives. Researchers can focus on impactful authors, significant work and productive countries and identify potential collaborators. The study also highlights the commonly used OPMs and emerging themes like machine learning and deep neural network models, which can inform practitioners about new developments in the field and guide the development of new models to address existing limitations.Social implicationsThe accurate pricing of financial derivatives has significant implications for society, as it can impact the stability of financial markets and the wider economy. The findings of this study, which identify the most commonly used OPMs and emerging themes, can help improve the accuracy of pricing and risk management in the financial derivatives sector, which can ultimately benefit society as a whole.Originality/valueIt is possibly the initial effort to consolidate the literature on calibration on option price by evaluating and analysing alternative OPM applied by researchers to guide future research in the right direction.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61250fe442c44a091bc7036268ce1976",
  "timestamp": "2025-05-15T02:01:11.854269"
}