{
  "id": 1960,
  "title": "The Classification of Sharia Assets and Performance of Financial Portfolio",
  "abstract": "The paper investigates the Shariah compliant and conventional portfolios in financial settings of Pakistan during the period 2009-2019 by using Markowitz Minimum-Variance (MMV) framework. Using daily excess returns, we first investigate the impact of Shariah screening criteria on stock returns then we evaluate the overall risk of Shariah compliant and conventional portfolios. The results reveal negative impact of Shariah screening criteria on stock returns' cross-section. Further, unconstrained portfolio investment strategy outperforms faith-based investing. Finally, the findings of the study suggest that induction guidelines employed in PSX for companies to be listed in Shariah compliant index needs to be reviewed to practically attain the objectives of Islamic moral economy such as avoiding Gharar (uncertainty) and Maysir (speculation). More importantly formulate a criterion that truly reflects Islamic principles of investing. In addition, more could also be done to educate investors about Shariah compliant stocks and enhance the projection of Shariah compliant index. Secondly, our study also indicates that investors that prefer faith-based investing should be aware of the costs of faith investment in PSX. Investors can encounter additional costs while investing in Shariah compliant stocks. Moreover, these additional costs are driven high risk and low performance of faith portfolios.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "612a619a27096290a8d60155efe2cde5",
  "timestamp": "2025-05-15T01:01:41.603421"
}