{
  "id": 4364,
  "title": "Risk measurement in Bitcoin market by fusing LSTM with the joint-regression-combined forecasting model",
  "abstract": "Purpose The purpose of the paper is to better measure the risks and volatility of the Bitcoin market by using the proposed novel risk measurement model. Design/methodology/approach The joint regression analysis of value at risk (VaR) and expected shortfall (ES) can effectively overcome the non-elicitability problem of ES to better measure the risks and volatility of financial markets. And because of the incomparable advantages of the long- and short-term memory (LSTM) model in processing non-linear time series, the paper embeds LSTM into the joint regression combined forecasting framework of VaR and ES, constructs a joint regression combined forecasting model based on LSTM for jointly measuring VaR and ES, i.e. the LSTM-joint-combined (LSTM-J-C) model, and uses it to investigate the risks of the Bitcoin market. Findings Empirical results show that the proposed LSTM-J-C model can improve forecasting performance of VaR and ES in the Bitcoin market more effectively compared with the historical simulation, the GARCH model and the joint regression combined forecasting model. Social implications The proposed LSTM-J-C model can provide theoretical support and practical guidance to cryptocurrency market investors, policy makers and regulatory agencies for measuring and controlling cryptocurrency market risks. Originality/value A novel risk measurement model, namely LSTM-J-C model, is proposed to jointly estimate VaR and ES of Bitcoin. On the other hand, the proposed LSTM-J-C model provides risk managers more accurate forecasts of volatility in the Bitcoin market.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "612cd5b2fab2935ae9e266a98065d934",
  "timestamp": "2025-05-15T02:36:38.369953"
}