{
  "id": 5382,
  "title": "The Context of Economic Insecurity and Its Relation to Violence and Risk Factors for HIV Among Female Sex Workers in Andhra Pradesh, India",
  "abstract": "Objective. We examined the context of economic insecurity and debt among female sex workers (FSWs), how this context varies among FSWs, and its association with experiences of violence and sexual risk factors for human immunodeficiency virus (HIV). Methods. We recruited FSWs aged >= 18 years (n=673) through respondent-driven sampling for a survey on HIV risk in this region. Using logistic regression models (adjusted for partner status, education, financial support, and literacy), we assessed the relation between debt and sexual and physical victimization as well as sexual risk. We also conducted qualitative interviews with a subsample of the survey participants and examined these for related themes. Results. In adjusted logistic regression models, FSWs who reported debt were more likely to report the following: recent physical violence (adjusted odds ratio [AOR] = 2.4, 95% confidence interval [CI] 1.5, 3.9), unprotected sex with occasional clients in the past week (AOR=2.3, 95% CI 1.2, 4.3), anal sex with clients in the past 30 days (AOR=2.0, 95% CI 1.1, 3.9), and at least one sexually transmitted infection symptom in the past six months (AOR=1.6, 95% CI 1.1, 2.4). FSWs with debt were more likely to report current husbands or other male partners, and less likely to report condom use with these partners, further increasing their sexual risk. Qualitative data elaborated on these findings. Conclusion. Findings indicate the violence- and HIV-related vulnerability of FSWs who report debt and further highlight how male partners may contribute to the debt and economic insecurity of FSWs.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "612f04e9c1a7df3d2c85b3b3ac49826f",
  "timestamp": "2025-05-15T02:47:13.948084"
}