{
  "id": 8445,
  "title": "Characteristics associated with optimistic or pessimistic perception about the probability of contracting COVID-19: A cross-sectional study of Japanese older adults",
  "abstract": "Introduction: Excessive optimistic perception about the probability of acquiring coronavirus disease (COVID-19) may hinder people from exercising preventive measures, whereas excessive pessimistic perception can induce psychological problems. Not much focus has been paid to this topic, and prior studies are only online surveys. We determined the characteristics of older adults with optimistic and pessimistic perceptions of the probability of contracting COVID-19. Methods: We used data from the Japan Gerontological Evaluation Study (JAGES), including 18,045 participants aged >= 65 years (mean age: 75.7 years) who were physically and cognitively independent. Self-reported questionnaires were sent to 11 municipalities between November 2020 and February 2021. Multinomial logistic regression was used for data analysis. Results: The characteristics of 1,596 (8.8%) participants with optimistic perception and 1,276 (7.1%) with pessimistic perception were compared with that of others (80.4%) with moderate perception. Optimism about infection probability was positively associated with older age; better perceived financial conditions but negatively associated with higher education level; trust in TV news programs, TV information programs, and government-issued newsletters; depressive symptoms; and higher levels of reciprocity. Pessimism was negatively associated with higher levels of social cohesion. In contrast, it was positively associated with engagement in paid work; trust in TV news programs, the Internet, and information from medical staff; and depressive symptoms. Conclusion: Optimistic and pessimistic perceptions about the probability of acquiring infection correlated differently with various characteristics. Thus, risk communication during a pandemic should be tailored based on specific individual characteristics.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6135ce396ba151fb26b607d96cdff3de",
  "timestamp": "2025-05-15T03:18:51.655526"
}