{
  "id": 4369,
  "title": "PORTFOLIO DIVERSIFICATION STRATEGY VIA TAIL-DEPENDENCE CLUSTERING AND ARMA-GARCH VINE COPULA APPROACH",
  "abstract": "This study proposes a diversified portfolio construction method based on the tail dependence between the financial assets and adopting both market prior information and the exports' subject views. In this paper, tail-dependence clustering was applied to divide candidate assets into different groups according to their tail dependence during the crisis period and the ARMA-GARCH vine copula-opinion pooling approach was applied to select the minimum Conditional Value-at-Risk portfolio according to the clustering results. The daily closed prices of the components of DAX 20 from 3 January 2006 to 20 December 2014 were studied to illustrate the methodology. The results reveal that more than 90% of 450 possible portfolios are modelled by D-vine structure and Student's t-copula dominates almost all the cases for pair copula selection. As Student's t-copula captures the symmetric tail dependence, the 450 possible portfolios do not show stronger lower tail dependence than upper tail dependence. This study contributes by combining cluster analysis with portfolios selection. It uses vine copula to capture the dependence structure among assets. Finally, it offers a flexible method to describe market and offers a strategy to construct diversified portfolios by adding the investors' information into portfolio selection procedure at the 1-day forecast horizon.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6136e311a8f182f67dcfd1c2254bb16f",
  "timestamp": "2025-05-15T02:36:38.377452"
}