{
  "id": 404,
  "title": "Multi-verse metaheuristic and deep learning approach for portfolio selection with higher moments",
  "abstract": "The market has become very volatile these days in the presence of a war-like situation with a lot of political turmoil and the rapid occurrence of natural disasters the world over. It is difficult to predict the economic condition of the country and hence the company's financial position. This paper proposes a novel approach that integrates clustering techniques, deep learning, and a metaheuristic algorithm to enhance the process of asset selection and allocation. First, S&P BSE 500 index companies have been clustered into ten groups by using the Expectation Maximization (EM) clustering technique based on 11 fundamental characteristics of the companies. The Prowess financial database has been used to collect the required data. For diversification of the portfolio across clusters and sectors, the best-performing companies are chosen based on Sharpe Ratio. Advanced analytical tools like machine learning and deep learning have been employed to increase the accuracy and precision of estimating the returns on the stocks of the selected companies. The expected return on stocks of these selected companies has been estimated with the help of Neural Basis Expansion Analysis for Interpretable Time Series (N-BEATS), a deep learning neural network-based forecasting technique. A portfolio multi-objective optimization model has been formulated by considering entropy and higher moments like skewness and kurtosis in the objective function. A metaheuristic algorithm named multi-verse is used to solve the optimization model, and hence the selection of the assets with their proportion of investment in the portfolio has been suggested under different scenarios.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61413ce82549aaf57e197d76bd756d1a",
  "timestamp": "2025-05-15T00:43:10.503798"
}