{
  "id": 3264,
  "title": "Value and quality investing strategy in Indian stock market",
  "abstract": "Purpose - The objective of the study is to shed light on the notion of quality investing in the Indian stock market. The study also attempts to combine the value and quality metrics to test their ability to generate a higher risk-adjusted return. Design/methodology/approach - The paper employs asset pricing models to examine the excess risk-adjusted returns and panel regression model (random estimates) to determine the price of quality in the cross-section of Bombay Stock Exchange (BSE) listed stocks from 2003 to 2020. Findings - The results indicate that the quality-only strategy failed to produce substantial risk-adjusted returns in the Indian stock market. The returns to long/short hedging strategy quality-minus-junk (QMJ) are significantly positive with the majority of the returns attributable to the short leg of the stock portfolio. The findings further discovered that the explanatory effect of quality on prices is limited. In particular, a strategy that combines value and quality investing generated positive and significant alphas as well as a higher Sharpe ratio. Practical implications - The study provides investors and portfolio managers with valuable insights for navigating undervalued high-quality equities in the Indian stock market. Originality/value - This is the first research of its kind to examine the performance of quality (Q score indicator) combined with value investing in the Indian stock market. As majority of research have concentrated on developed economies, this study offers out-of-sample evidence to validate the strategy's success in an emerging market.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61441a7d8466802db0412d5ed439f78d",
  "timestamp": "2025-05-15T01:15:26.122276"
}