{
  "id": 3038,
  "title": "Customer-Firm Interactions and the Path to Profitability: A Chain-of-Effects Model",
  "abstract": "This study investigates a chain of effects to understand the causal path from customer informational inquiries (CIIs) and firm-initiated contacts (FICs) to customer profitability. Drawing on social exchange theory, our framework identifies a set of attitudinal (perceived relationship investment and relationship quality), behavioral (customer cross-buy and service usage), and financial (customer profitability) consequences of CIIs and FICs and also explores the extent to which customer-perceived financial risk and customer involvement shape attitudinal reactions to CIIs and FICs. Using longitudinal data for a sample of 1,990 customers measured in four different periods, the framework is tested in financial services by applying seemingly unrelated regression techniques. Our results reveal that FICs and CIIs are a particularly valuable tool for strengthening the relationship with customers with a low level of involvement but high perception of financial services risk. For highly involved customers, FICs and CIIs are not very effective; CIIs can even backfire if the customer also perceives the risk to be low. Our results highlight the importance of market segmentation for marketers to more effectively manage when and to whom they should target marketing activities (FICs) and steer CIIs.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61477cb23dfa32841bddaa146ba6159b",
  "timestamp": "2025-05-15T02:21:52.219054"
}