{
  "id": 7246,
  "title": "Post-Operative Infections: Trends in Distribution, Risk Factors, and Clinical and Economic Burdens",
  "abstract": "Background: Post-operative infection (POI) is a serious complication in all surgical disciplines and can derail a patient's treatment and recovery course. In this analysis, we examine national trends, risk factors, and costs associated with POI. Methods: Using the Nationwide Inpatient Sample (NIS) for the years available for data analysis at the time of this study (2003-2010), we performed a cross-sectional study of adult (>= 18 years) inpatients with POI and designated Clinical Classification Software (CCS) procedural class codes for the operations performed. A comparison group was selected randomly from patients with the same CCS codes who underwent the same procedures but did not experience POI. As the NIS represents 20% of U.S. hospital admissions, excess cost and stay were calculated on the basis of the average difference between cost and duration of stay for POI cases and the cost and duration of stay for the comparison group, then extrapolated to estimate the national burden for the remaining 80% of stays nationwide. Results: Sample admissions included 139,652 cases of POI and 941,670 comparison subjects. The POIs were most common in procedures involving the digestive tract (46.5%), cardiovascular system (16.3%), or musculoskeletal system (11.2%). Older age, male gender, high Charlson Comorbidity Index Score (CCIS), and teaching, urban, or large hospitals were independent risk factors for POI in the multivariable model (p<0.05). A POI was associated with a higher risk of death (odds ratio 2.93; 95% confidence interval 2.82-3.04, p<0.001). Nationally, we estimate that POI resulted in an annual average of 1.04 million days of excess hospital stay and $2.72 billion excess cost. Conclusions: Identification of independent risk factors suggests areas for quality improvement initiatives. Post-operative infection carries substantial clinical and financial burdens in the United States, and further analysis of the associated costs is needed to identify areas for intervention to reduce this burden.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "614779ee9565623ce8ae5de92b521df5",
  "timestamp": "2025-05-15T03:06:35.413819"
}