{
  "id": 7299,
  "title": "Prevalence and Predictors of Patient-Reported Long-term Mental and Physical Health After Donation in the Adult-to-Adult Living-Donor Liver Transplantation Cohort Study",
  "abstract": "Background. Prospective and longitudinal studies have examined liver donors' medical outcomes beyond the first 1 to 2 years postdonation. There is no analogous longitudinal evidence on long-term psychosocial outcomes, including patient-reported clinically significant mental health problems and perceptions of physical well-being. We examined prevalence, descriptive characteristics, and predictors of diagnosable mental health conditions and self-reported physical health problems, including fatigue and pain, in the long-term years after liver donation. Methods. Donors from 9 centers who initially completed telephone interviews at 3 to 10 years postdonation (mean, 5.8 years; SD, 1.9) were reinterviewed annually for 2 years using validated measures. Outcomes were examined descriptively. Repeated-measures regression analyses evaluated potential predictors and correlates of outcomes. Results. Of 517 donors initially interviewed (66% of those eligible), 424 (82%) were reassessed at least once. Prevalence rates of major depression and clinically significant pain were similar to general population norms; average fatigue levels were better than norms. All prevalence rates showed little temporal change. Anxiety and alcohol use disorder rates exceeded normative rates at 1 or more assessments. Longer postdonation hospitalization, female sex, higher body mass index, concerns about donation-related health effects, and burdensome donation-related financial costs were associated with increased risk for most outcomes (P's < 0.05). Men were at higher risk for alcohol use disorder (P < 0.001). Conclusions. Anxiety and alcohol use disorders were more common than would be expected; they may warrant increased research attention and clinical surveillance. Surveillance for long-term problems in the areas assessed may be optimized by targeting donors at higher risk based on identified predictors and correlates.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "616304b6d21ea78e6c011dd29a2afc26",
  "timestamp": "2025-05-15T03:07:02.687506"
}