{
  "id": 2839,
  "title": "Association of Proton Pump Inhibitor/Histamine-2 Blocker Use and Ocular Toxoplasmosis Findings from a Large US National Database",
  "abstract": "Objective: To test the hypothesis that the use of proton pump inhibitors (PPIs) is associated with an increased risk of being diagnosed with toxoplasmic retinochoroiditis.Design: Retrospective, matched case-control study using data from 2000 to 2020.Participants: Patients with ocular toxoplasmosis and controls were matched 5:1 for age, sex, and race, with the eligibility date +/- 3 months from the index date of exposed match. Patients aged < 18 years with congenital toxoplasmosis, having < 2 years in the insurance plan before the index date, and without > 1 visit to an eyecare provider before the index date were excluded from the study.Methods: Patients with ocular toxoplasmosis were identified using the International Classification of Diseases, Ninth Revision and International Classification of Diseases, Tenth Revision codes, and PPI use or diseases highly associated with PPIs were identified using national drug codes from an administrative medical claims database.Main Outcome Measures: The primary outcome was defined as having a prescription for a PPI or histamine-2 (H2) blocker. Multivariable logistic regression analyses were performed, controlling for demographic and systemic health variables. Results: A total of 4069 cases and 19 177 controls met the eligibility criteria. Of the 4069 patients with ocular toxoplasmosis, 989 (24.3%) were on PPI/H2 blockers compared with 3763 of 19 177 (19.2%) controls. The adjusted logistic regression model demonstrated 1.28 greater odds of PPI/H2 blocker use in cases of ocular toxoplasmosis than matched controls (95% confidence interval, 1.17-1.40; P < 0.001).Conclusions: Proton pump inhibitor/H2 blocker exposure was associated with an increased risk of being diagnosed with ocular toxoplasmosis, corroborating findings from a prior case series.Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology Retina 2023;7:261-265 (c) 2022 by the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "616c49c8c68ee060835034ce87c8fead",
  "timestamp": "2025-05-15T02:19:46.659825"
}