{
  "id": 2237,
  "title": "The development and evolution of mean-variance efficient portfolios in the US and Japan: 30 years after the Markowitz and Ziemba applications",
  "abstract": "In 1993, John Mulvey co-edited a Special Issue, entitled Financial Engineering, in the Annals of Operations Research. In that issue, Guerard, Takano, and Yamane (1993) reported mean-variance efficient portfolios for the Japanese and U.S. equity markets and showed that the use of a regression-weighted composite model of earnings, book value, cash flow, sales, and their relative variables and forecasted earnings, outperformed their respective equity benchmarks by approximately 400 basis points annually. William T. (Bill) Ziemba was the referee of the Guerard et al. (1993) paper. Markowitz and Xu (1994) tested the composite model strategy and found that its excess returns were statistically significant from a variety of models tested, and the composite model strategy was not the result of data mining. Thirty years after the issue, we report factor backtesting results and robust regression modeling in creating optimized US and Japanese portfolio results for the 2000-2022 period, a combination of methods and the latest commercially available multi-factor models for portfolio selection. Recent publications by Markowitz, Guerard, and Xu report additional support for the absence of data mining. Furthermore, the weighted latent root regression modeling is still relevant. Our results suggest that stock selection models can be effectively employed to deliver excess returns. The authors believe that financial anomalies exist, persist, and most likely will exist and can be profitably exploited.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "616c1097da187419ae9d01124d87e44d",
  "timestamp": "2025-05-15T01:04:27.511016"
}