{
  "id": 1418,
  "title": "RETRACTED: A Method of Enterprise Financial Risk Analysis and Early Warning Based on Decision Tree Model (Retracted Article)",
  "abstract": "At present, the domestic and foreign financial crisis early-warning model research will provide only prediction accuracy as the only standard of success for early-warning model, ignoring an important problem, namely, will the financial crisis early-warning model for normal business, compared with the normal enterprise, forecast the financial crisis? This paper reviews the research situation at home and abroad from the perspective of the definition of the enterprise financial crisis, the form of expression, and so on. From the theoretical level, the relationship between the cause of the financial crisis and the change of financial indicators is established by explaining the early-warning theory, early-warning theory of financial crisis, and cost-sensitive learning theory, and the framework of early warning modeling of financial crisis based on decision tree is put forward. The decision tree model is constructed on several training subsets as the base learner so that the decision tree base learner can learn the characteristics of the healthy sample and crisis sample roughly equally. Taking the bond issuing enterprises of manufacturing industry as samples, the empirical comparison shows that the financial warning model based on decision tree integration is more accurate, which indicates that the model can improve the correct identification rate of financial crisis enterprises under the premise of higher overall warning accuracy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6174f3f4b6e4ddf6121238f12c5a6f20",
  "timestamp": "2025-05-15T02:03:00.609603"
}