{
  "id": 964,
  "title": "GUIDANCE ON IN LINE INSPECTION FIRST RUN SUCCESS",
  "abstract": "First run success is a key performance measure used in the BP Global In Line Inspection (ILI) Contract [1]. This drives effectiveness and efficiency in the processes supporting ILI and it is a key commercial performance indicator for ILI Suppliers. Although run success rates are often referred to across the industry there has been little standardisation in the terminology, or the factors that lead to a successful run. Three definitions have been established for run success: Technical; Commercial and Operational. Each has a place although it is Operational run success that drives improvements between operators and suppliers. The introduction of a performance measure for first run success increases the focus on getting things right the first time. The financial cost of ILI run failure has probably been underestimated by the industry; although it is estimated that it could be as high as 30% of total contracted costs for ILI. For some projects the costs associated with a failed run can be far greater than the original project costs (e.g. additional vessel support costs for deployment or recovery during offshore operations). A failed run can also result in a delayed inspection and an associated increased risk as well as potentially compromising compliance with regulatory requirements. The consequences of run failure vary in severity and can be presented in a pyramid similar to the typical representation of safety statistics. A stuck tool requiring intervention or a pipeline failure, as a result of an incorrect inspection report, would be at the top of the pyramid. The lower tiers would capture technical failures and the effectiveness of cleaning. Understanding the consequence of failures can help drive performance improvements across the industry. As part of the BP continuous improvement process, ILI Suppliers and internal stakeholders were brought together for a facilitated workshop to understand the factors affecting first run success rates. The workshop identified a number of common themes which were consistent across all of the Suppliers addressing; both operational issues and tool performance. A Guidance Note was then developed with the ILI Suppliers to drive improvements in first run success rates. This was shared with the Pipeline Operators Forum (POE) in October 2011 and has been further developed as a POF Guidance Document. A separate guidance note has been developed to address recommended practices for collecting and verifying field data. Successful ILI requires good communication between all parties. As the industry starts to inspect more difficult and challenging lines it will be important to improve ILI run success rates. Across the industry we probably know how to do it, but doing it consistently is the challenge. The development of industry Guidance Notes represent a small step towards achieving this objective. As ILI operations improve the focus will increasingly turn to the reliability of tools. There is much that can be learnt from other industry sectors, such as the motor or aviation industry, on improving reliability of components and systems. This will require an increased use of preventative maintenance practices. There is also a need to create a common basis for reporting reliability of inspection tools and for this to be taken into account when operators make their selection of ILI tools. The Global ILI Contract has brought an increased focus to the performance of the overall inspection process which is driving improvements in first run success rates. It has facilitated the development of guidelines on best practice and is starting to set standards for reliability. The high level of cooperation between suppliers and operators to drive improvements in this area is a measure of the importance of first run success rates to all parts of our industry. Achieving ILI first run success requires both the operator and ILI supplier to work together. Whilst each has a key part to play effective communication from an early stage is essential.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "618116690498aa693019e93f74417057",
  "timestamp": "2025-05-15T01:44:35.599537"
}