{
  "id": 4562,
  "title": "Assessing Financial Stability in Turbulent Times: A Study of Generalized Autoregressive Conditional Heteroskedasticity-Type Value-at-Risk Model Performance in Thailand's Transportation Sector during COVID-19",
  "abstract": "The Value-at-Risk (VaR) metric serves as a pivotal tool for quantifying market risk, offering an estimation of potential investment losses. Predominantly employed within financial sectors, it aids in adhering to regulatory mandates and in devising capital reserve strategies. Nonetheless, the predictive precision of VaR models frequently faces scrutiny, particularly during crises and heightened uncertainty phases. Phenomena like volatility clustering impinge on the accuracy of these models. To mitigate such constraints, conditional volatility models are integrated to augment the robustness and adaptability of VaR approaches. This study critically evaluates the efficacy of GARCH-type VaR models within the transportation sector amidst the Thai stock market's volatility during the COVID-19 pandemic. The dataset encompasses daily price fluctuations in the Transportation Sector index (TRANS), the Service Industry index (SERVICE), and 17 pertinent stocks within the Stock Exchange of Thailand, spanning from 28 December 2018 to 28 December 2023, thereby encapsulating the pandemic era. The employed GARCH-type VaR models include GARCH (1,1) VaR, ARMA (1,1)-GARCH (1,1) VaR, GARCH (1,1)-M VaR, IGARCH (1,1) VaR, EWMA VaR, and csGARCH (1,1) VaR. These are juxtaposed with more traditional, less computationally intensive models like the Historical Simulation VaR and Delta Normal VaR. The backtesting methodologies encompass Kupiec's POF test, the Independence Test, and Christoffersen's Interval Forecast test. Intriguingly, the findings reveal that the Historical Simulation VaR model surpasses GARCH-type VaR models in failure rate accuracy. Within the GARCH-type category, the EWMA VaR model exhibited superior failure rate accuracy. The csGARCH (1,1) VaR and EWMA VaR models emerged as notably robust. These findings bear significant implications for managerial decision-making in financial risk management.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6181ac89e7b6d0a1cc724dd88344e836",
  "timestamp": "2025-05-15T02:38:20.523119"
}