{
  "id": 3316,
  "title": "Mapping borrowers' and lenders' interactions according to their dark financial profiles",
  "abstract": "In this interdisciplinary, conceptual article with implications in marketing financial products and services, we study real estate and capital markets characterized by a predatory paradigm and economic agents' dark financial profiles (DFPs). These are estimated by three orthogonal components-disconnection, irrationality, and deceit. We identify the best interactional patterns of borrower-lender profiles, ones that expectedly minimize the risk of default. We resort to discretized, predator-prey Lotka-Volterra equations where lenders act as predators and borrowers as prey, incorporating market trends and learning effects. To mathematically operationalize our framework, we use combinatorics with high, medium, and low levels of the three components of DFPs. We find 27 salient lender-borrower interactional scenarios and observe three different patterns: explosive, conducive, and implosive. Our theoretical findings indicate that equal (ir)rationality (in financial terms) between lenders and borrowers is a necessary but insufficient condition to maintain harmonious, long-term relationships. We use eutectic theory to map the agents' profiles by introducing another variable: Expected return [E(Rp)] versus risk [sigma], using the Capital Asset Pricing Model (CAPM) as a base. We find six market segments: the inactive predators and prey, the loose, the greedy, the vulnerable, and the stable. We identify the optimal combination of borrowers-lenders interaction under risk, given market trends and learning effects. We propose a path for future research that would see the application of analytical tools such as factor analysis, k-means clustering algorithm, chi 2 and non-parametric Kruskal-Wallis and Dunn's multiple comparison tests to verify differences among the hypothesized segments.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "618232f5d0c551be65135c27498093d8",
  "timestamp": "2025-05-15T02:25:13.618466"
}