{
  "id": 7579,
  "title": "Food Insecurity Among Australian University Students Is Higher and More Severe Across an Extended Period of High Inflation: A Repeated Cross-Sectional Study 2022-2024",
  "abstract": "Introduction: Increasing financial pressures, resulting from a period of high inflation in 2022 and sustained into 2024, may have exacerbated food insecurity among Australian university students. This study aimed to determine the change in prevalence and severity of food insecurity among Australian university students between 2022 and 2024. Methods: Repeated cross-sectional, online surveys measured food insecurity using the United States Department of Agriculture Household Food Security Survey Module six-item short form (USDA HFSSM) in addition to six demographic and education characteristics. Students were categorised as being food secure or being marginally, moderately, or severely food insecure. Using a binary variable (food secure vs. food insecure), multivariate logistic regression identified students at higher risk of food insecurity. Independent proportions and logistic regression, adjusting for relevant predictors of food insecurity, measured change in the prevalence of food insecurity between 2022 and 2024. Results: In 2022 (n = 1249 students) and 2024 (n = 1603), younger, on campus, and international students experienced significantly higher odds of food insecurity. Marginal and moderate food insecurity were unchanged between 2022 and 2024. Severe food insecurity increased from 17% in 2022 to 29% in 2024 (95% CI -0.07, -0.13, p < 0.001), contributing to an overall significant increase in total food insecurity from 42% to 53% (Adjusted Odds Ratio: 1.6; 95% CI: 1.3, 1.8; p < 0.001). Conclusion: This study has identified a high prevalence and worsening severity of food insecurity among Australian university students during a period of high and sustained inflation. So What? There is a need for immediate action, including health promotion initiatives and policies to uphold Australian university students' right to food.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61a091dfb160d18bddfeb5790ab0c77f",
  "timestamp": "2025-05-15T03:10:05.537003"
}