{
  "id": 3807,
  "title": "Economic Research on Multiple Linear Regression in Fruit Market inspection and Management",
  "abstract": "Based on the hypothesis test of multiple regression models, this paper discusses three different implementation methods of permutation tests and analyzes their manifestations and application effects in regularization models. The two implementation methods are used for the first time to discover the Markov edge of the regularization model, which expands the application range of the replacement test method. The fruit market uses an e-commerce platform to connect farmers, leading enterprises, financial institutions, and logistics companies. Using information technology as a means, it uses the network to implement online transactions, online financing, online pledges, and online management to achieve information. New flow of finance, capital flow and logistics. Based on the theory of information asymmetry, system theory, and synergy theory, it is found that there is a linkage effect between the online supply of fresh agricultural products and the risk system. Various interest systems have affected the risks of online supply of fresh agricultural products by affecting the risks of financing companies, e-commerce platform risks, financial institution risks and other risks. The quantitative ridge regression model can well solve the shortcomings that MRLM-P cannot be applied to collinear data sets; on low-dimensional data sets, there is a classic regularization model of Markov edge discovery performance similar to MRLM-P; permutation The two newly-implemented implementation methods are slightly inferior to the previous implementation methods; Markov edge theory can effectively perform dimensional reduction operation on the spectral information matrix, and both correction models can well reflect the spectral information of the detection object. Dependence. information on platform financing companies, and assume regulatory responsibilities in the transaction process. Financial institutions should also carefully select cooperative e-commerce platforms and determine the appropriate financing rate based on the results of risk prediction, so as to effectively reduce the risk of online supply is of great significance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61a3d00ec6c6d533c612257b0bebef5c",
  "timestamp": "2025-05-15T02:29:59.239152"
}