{
  "id": 5653,
  "title": "Climate-smart agriculture reduces capital-based livelihoods vulnerability: evidence from Latin America",
  "abstract": "Introduction Climate change poses a significant threat to rural livelihoods in low- and middle-income countries. Enhancing the sustainability of these livelihoods is crucial for ensuring food security and nutrition at both global and regional levels. This study investigates the role of Climate Smart Agriculture (CSA) practices in improving rural livelihoods in Latin America, specifically through the Climate Smart Village (CSV) approach.Methods Our analysis involved a dataset of 267 households, comprising both adopters and non-adopters of CSA practices in CSVs across Guatemala, Honduras, and Colombia. We employed multiple correspondence analysis (MCA), Gower's metric, agglomerative clustering, partitioning around medoids (PAM), and cluster validation. Our aim was to understand how CSA practices, which include the use of agroclimatic information, soil and water management practices, and risk diversification strategies, contribute to enhancing livelihoods. We examined this in the context of the five capitals (social, natural, physical, financial, and human) of the Sustainable Livelihoods Framework (SLF).Results Our findings indicate that CSA farmers exhibit lower capital-based vulnerability compared to non-CSA farmers. This is particularly evident in the areas of social capital, as well as human and natural capital for certain CSA adopters. However, the similar performance in financial and physical capital between CSA and non-CSA farmers suggests the need for additional strategies to reduce vulnerability in these areas. We examined this through the Sustainable Livelihoods Framework (SLF), which includes five capitals: social, natural, physical, financial and human.Conclusion These findings offer a valuable framework for policy and decision-making processes, helping to identify which capitals and dimensions of livelihood vulnerability should be prioritized in different contexts to achieve climate resilience and sustainable development. The study advocates for continued research efforts, incorporating expanded indicators, such as gender indicators within social and human capital definitions, for a more comprehensive assessment of CSA's impact. The application of SLF for analyzing CSA's contribution to rural livelihoods represents a novel approach in Latin American studies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61a3b463a2bc8f1ce0aa016d61716398",
  "timestamp": "2025-05-15T02:49:50.384335"
}