{
  "id": 3957,
  "title": "Implementing new practices: An empirical study of organizational learning in hospital intensive care units",
  "abstract": "This paper contributes to research on organizational learning by investigating specific learning activities undertaken by improvement project teams in hospital intensive care units and proposing an integrative model to explain implementation success. Organizational learning is important in this context because medical knowledge changes constantly and hospital care units must learn new practices if they are to provide high-quality care. To develop a model of factors affecting improvement project teams driving essential organizational learning in health care, we draw from three streams of related research-best-practice transfer (BPT), team learning (TL), and process change (PC). To test the model's hypotheses, we collected data from 23 neonatal intensive care units seeking to implement new or improved practices. We first analyzed the frequency of specific learning activities reported by improvement project participants and discovered two distinct factors: learn-what (activities that identify current best practices) and learn-how (activities that operationalize practices in a given setting). Next, ordinary least squares (OLS) regression analyses supported three of our four hypotheses. Specifically, a high level of supporting evidence for a unit's portfolio of improvement projects was associated with implementation success. Learn-how was positively associated with implementation success, but learn-what was not. Psychological safety was associated with learn-how, which was found to mediate between psychological safety and implementation success.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61aa7a51ed1baee555273836b09a7fb3",
  "timestamp": "2025-05-15T01:22:39.327571"
}