{
  "id": 6656,
  "title": "A person-centred approach to COVID-19 pandemic-related stressors",
  "abstract": "Introduction: The COVID-19 pandemic and resultant containment effects has had a detrimental effect on individuals' social, occupational and financial circumstances. Taking a person-centred approach to inquiry and data analysis, we sought to identify classes (or segments) of employees with distinct configurations of responses across several pandemic-related stressors. We also investigated purported risk and resilience factors of membership in these classes. Methods: We analyzed data from 4277 employees who completed a pulse survey in August 2020, using latent class analysis to identify classes of employees with unique patterns of responses across six pandemic-related stressors. We also conducted a multi-nomial logistic regression analysis to explore the associations between several risk and resilience factors (e.g. age, gender, perceived organizational support) and class membership, and we compared the emergent classes' levels of self-reported mental health. Results: The data revealed four unique classes of employees: adapting, conflicted, insecure and stressed (30%, 35%, 21% and 14% of the sample, respectively). All of the risk and resilience factors were associated with being in the adapting class versus the other classes. The adapting employees also showed the most positive self-reported mental health relative to their counterparts. Conclusion: By identifying classes of employees with distinct configurations of pandemic-related stressors, as well as differential risk factors and levels of self-reported mental health, the present study offers a starting point for informing work-related interventions with the goal of helping employees most vulnerable to pandemic-related stressors effectively cope with these stressors.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61ac6c7cb08a4c367e96c9a388b35374",
  "timestamp": "2025-05-15T03:00:05.077000"
}