{
  "id": 8771,
  "title": "Do farmers' risk perception, adaptation strategies, and their determinants benefit towards climate change? Implications for agriculture sector of Punjab, Pakistan",
  "abstract": "Due to global and regional climatic dynamics for a couple of decades, agricultural productivity, rural livelihood, and food security have been badly affected in Pakistan. This study was conducted in Punjab, Pakistan, to explore the farmers' understanding of the impacts of climate change, adaptation strategies, determinants, and benefits on agriculture using data from 1080 respondents. Perceived risks by the farmers in the rice-wheat cropping system and the cotton-wheat cropping system were weed infestation, seed rate augmented, low-quality seeds, infestation of crop diseases and pests, change of cropping pattern, increase of input use, decrease of cropping intensity and productivity, decreasing soil fertility, increasing irrigation frequency, and increase of harvesting time. To alleviate the adverse influences of climate change, the adaptation strategies used by farmers were management of crop and variety, soil and irrigation water, diversification of agriculture production systems and livelihood sources, management of fertilizer and farm operations time, spatial adaptation, access to risk reduction measures and financial assets, adoption of new technologies, institutional support, and indigenous knowledge. Moreover, the results of Binary Logistic Regression indicate that adaptation strategies are affected by different factors like age, education, household family size, off-farm income, remittances, credit access, information on climatic and natural hazards, information on weather forecasting, land acreage, the experience of growing crops and rearing of livestock, tenancy status, tube well ownership, livestock inventory, access to market information, agricultural extension services, and distance from agricultural input/output market. There is a significant difference between adapters and nonadapters. The risk management system may be created to protect crops against failures caused by extreme weather events. There is a need to develop crop varieties that are both high yielding and resistant to climate change. Moreover, cropping patterns should be revised to combat the effects of climate change. To enhance farmers' standard of living, it is necessary to provide adequate extension services and a more significant number of investment facilities. These measures will assist farmers in maintaining their standard of living and food security over the long term to adapt to the effects of climate change based on various cropping zones.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61b66ba1c107ba6e3862e95fdc33870c",
  "timestamp": "2025-05-15T03:22:25.985697"
}