{
  "id": 5327,
  "title": "Farm risks, livelihood asset allocation, and adaptation practices in response to climate change: A cross-country analysis",
  "abstract": "This study aims to understand the impact of farmers' risk attitude on livelihood assets and their livelihood adaptation strategies to cope with climatic changes. An interview-based survey with farmers is conducted in China and Pakistan, using probit regression models to analyze the data. The results confirm that Pakistani growers' natural and policy risks, whereas technology and information risks in China, are the main livelihood risks to farm production. Farmers' natural, physical, social, and human assets in China and Pakistan's financial, physical, and social assets can protect their livelihoods from farm risks. Pakistan's physical, social, and economic assets and China's physical, human, and social assets show contradictory effects. Although farmers in China adopted agrotechnical support, off-farm production, crop variety adjustment, and agricultural engineering, Pakistan's growers adopted agricultural finance, fertilizer/water management, and adjustment of crop varieties to deal with risks. In addition, social, natural, human, and physical assets revealed significant and positive impacts on Pakistani growers; physical and financial assets positively affect Chinese farmers' attitudes. Despite Chinese growers' human, social, and natural assets, Pakistani farmers' financial and natural assets show comparatively weak effects to adapt and deal with climatic risks. Furthermore, this study recommends agricultural policy measures to cope with climate awareness and adaptive attitudes, and potential practices can be introduced in both studied areas.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61bc75404002850e4a84b6bbd80fc161",
  "timestamp": "2025-05-15T02:46:44.875327"
}