{
  "id": 9108,
  "title": "Endovascular Repair with Chimney Technique for Juxtarenal Aortic Aneurysm: A Single Center Experience",
  "abstract": "Objective: Chimney endovascular aneurysm repair (Ch-EVAR) is a cheap and immediately available method for treatment of juxtarenal aortic aneurysms (JRAAs). The aim of this study was to report experiences and results with balloon expandable stent (BES) for Ch-EVAR. Methods: From January 2008 to June 2013 (mean time, 26 13 months), 42 patients who underwent Ch-EVAR were retrospectively reviewed. All patients were thought to be at high risk for open surgery and were unsuitable (because of financial issues and fear of delays) for fenestrated endovascular aneurysm repair (FEVAR). Results: 42 patients (35 males; mean age 71 +/- 7 years) underwent chimney procedures for 56 renal arteries with 70 BESs (59 hippocampus and 11 genesis). Median follow up was 26 months (range 6-64 months). Primary technical success was 100%. Thirty day mortality was 0%. Completion angiography showed that eight cases (19%) had a type I endoleak. The 6 month follow up CT scans demonstrated three cases with complete regression of endoleak, two cases without aneurysmal growth, and three cases with an increase in aneurysmal diameter of less than 10 mm. Three patients had contrast induced nephropathy (CIN) after Ch-EVAR, two of whom had acute renal failure (ARF) and continue to require hemodialysis. Two deaths occurred during follow up, both unrelated to the aorta: one with a hemispheric stroke at 6 months and one with respiratory failure at 12 months. Therefore, the overall follow up mortality was 5%. Occlusion of one chimney stent occurred 3 months after the procedure, meaning renal artery patency rate was 98%. The aneurysm diameter reduced from 74 +/- 9 mm to 64 +/- 10 mm during follow up (p < .05). Conclusion: Ch-EVAR can be used to treat JRAAs with suitable anatomical conditions. However, complications of type I endoleak were not uncommon, and, therefore, further studies are required to prove its efficiency for JRAAs. (C) 2014 Published by Elsevier Ltd on behalf of European Society for Vascular Surgery.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61c01cd9def30426d42479ef1a2b1fd3",
  "timestamp": "2025-05-15T03:25:27.802920"
}