{
  "id": 5857,
  "title": "Reimbursement cuts and changes in urologist use of androgen deprivation therapy for prostate cancer",
  "abstract": "Background: We examined the impact of urologist academic affiliation on use of androgen deprivation therapy (ADT) for prostate cancer before and after major reimbursement cuts for ADT in hopes of better understanding the influence of financial incentives on its use. In particular, we hypothesized that if financial incentive was the predominant factor driving use, we should see a narrowing in the previously documented gap of ADT use between non-academic and academic urologists following the reimbursement cuts. Methods: With the Surveillance, Epidemiology and End-Results (SEER)-Medicare linked database we examined use of ADT for potentially inappropriate indications (primary therapy of localized, lower risk tumors) among patients of 2214 urologists over the period 2000-2002 and 2004-2007, representing eras before and after reimbursement cuts. Multi-level logistic regression models were used to estimate the likelihood of ADT use adjusted for patient, tumor and urologist characteristics (academic affiliation, board certification, years in practice and patient panel size). Results: Overall, ADT use peaked in 2002 at 46.6% of patients, but dropped dramatically in 2005, with a slow continued decrease through 2007 to 31.1%. A similar pattern was evident within most strata of urologist characteristics, including academic affiliation. In the multilevel model, patients of non-academic urologists had a 30% higher odds of receiving ADT than those of academic urologists in both the eras before and after the reimbursement cuts. Conclusion: A similar proportionate drop in use of ADT among both academic and non-academic urologists following reimbursement cuts suggests that factors other than financial incentives may have played a role.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61c230b256653a527492bab8b5f9c5fb",
  "timestamp": "2025-05-15T02:51:58.714729"
}