{
  "id": 2975,
  "title": "Development of a Health Research Portfolio Based on Priority Topics for Peruvian Social Health Insurance (ESSALUD) in 2023-2025: A Collaborative Approach to Addressing Institutional and Public Health Challenges",
  "abstract": "Background/Objectives: Addressing health research priorities in public institutions is crucial for efficient resource allocation and policy impact. This study aims to describe the development of Peru's Social Health Insurance (ESSALUD) 2023-2025 research portfolio, which aligns with institutional priorities and focuses on improving decision-making for population health. Methods: The Health Research Directorate (DIS) of ESSALUD led a structured three-phase process, engaging multidisciplinary teams and utilizing a group model-building approach to generate research ideas. Twelve working groups were established, corresponding to ESSALUD's prioritized health topics, to identify key institutional challenges and propose research ideas. Results: A total of 338 research ideas were generated from 217 identified problems. These ideas were classified using the UK Health Research Classification System (HRCS) and scored based on nine dimensions to prioritize execution. Research ideas primarily focused on health services (57.7%) and disease management (16.9%). High-priority topics included cancer, mental health, malnutrition, and antimicrobial resistance. As a result of this implementation, ESSALUD resources were positively concentrated in the HRCS research activities 'Health and social care services research' (51.85%) and 'Etiology' (44.44%) for the period 2023-2025. Conclusions: The development of ESSALUD's research portfolio identified key areas such as health services, health economics, and prevention, essential for evidence-based decisions and sustainability. Multidisciplinary participation ensured solutions aligned with real needs, promoting equity and continuous improvement in Peru's health system.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61d6d351c43549cb94a0dd0d65ef02f3",
  "timestamp": "2025-05-15T01:12:09.215778"
}