{
  "id": 8647,
  "title": "Prevalence and Associated Factors of Psychological Distress Among Single Fathers in Japan",
  "abstract": "Background: In Japan, ten percent of single-parent households are led by fathers. Taking care of children as a single father is very stressful and could put a strain on their health. It is very important to prevent and identify psychological distress among fathers for both their own health and to avoid negative impacts on children. This study aims to determine the prevalence of and factors associated with psychological distress among single fathers and understand how it is different from partnered fathers. Methods: We used data from the Comprehensive Survey of Living Conditions 2016. Psychological distress, assessed using the K6 scale, was analyzed among 868 single and 43,880 partnered fathers. Logistic regression analysis was performed to assess the risk factors for psychological distress, such as employment type, sleep hours, and smoking and drinking habits. Results: Single fathers had a higher proportion (8.5%) of psychological distress compared to partnered fathers (5.0%). A larger percentage of single fathers had a lower educational level and were more likely to be non-regular workers, self-employed, or unemployed than partnered fathers. Among single fathers, the crude and adjusted odds ratio for employment type and sleep hours were significantly associated with psychological distress. Conclusion: As single parents who are self-employed or directors are likely to have significantly reduced psychological distress than those with regular jobs, measures are needed to improve the work-family balance for non-self-employed fathers. There is a need to provide greater financial assistance and other social welfare support to single parents to ensure their and their children's good health.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61e08f2b7751a9295125110c0041c8c8",
  "timestamp": "2025-05-15T03:20:55.977303"
}