{
  "id": 2055,
  "title": "Multi-objective Graph Neural Network Explanatory Model with Local and Global Information Preservation",
  "abstract": "Graph Neural Network (GNN) has demonstrated significant application potential in fields such as bioinformatics, social network analysis, and financial risk management. However, explainability issues have limited their widespread adoption. Although numerous explanatory models have been developed, as the range of application scenarios expands, there is still an increasing need for diverse explanations. However, current explanatory models struggle to meet the varying requirements of different scenarios. They are often tailored for specific objectives, compromising their adaptability to diverse explanatory needs. Additionally, current models commonly use instance-level explanations that mainly analyze single graph samples for structural features, leading to a focus on local information and neglect of broader global patterns and trends. To address these issues, this paper proposes the Multi-Objective Graph Neural Network Explanatory model (MOE). MOE utilizes a Pareto frontier-based strategy for exploratory subgraphs to harmonize and support multiple explanatory objectives. Additionally, MOE integrates both local and global information from the original data into each explanation, enhancing the explanatory depth. Empirical studies demonstrate that MOE excels in various datasets and explanatory tasks, significantly advancing GNN explainability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "61e67c5ed80fd3a771e17202e16ba251",
  "timestamp": "2025-05-15T02:10:25.838663"
}