{
  "id": 7868,
  "title": "Are Orically Underserved Areas really underserved? Role of a governmentsupport program in the context of changing landscape of maternal service utilization in South Korea: A sequential mixed method approach",
  "abstract": "Objectives The Korean government has been providing financial support to open and operate the maternal hospital in Obstetrically Underserved Areas (OUAs) since 2011. Our study aims to assess the effectiveness of the government-support program for OUAs and to suggest future directions for it. Methods We performed sequential-mixed method approach. Descriptive analyses and multi-level logistic regression were performed based on the 2015 Korean National Health Insurance claim data. Data for the qualitative analysis were obtained from in-depth interviews with health providers and mothers in OUAs. Results Descriptive analyses indicated that the share of babies born in the hospitals located in the area among total babies ever born from mothers residing in the area (Delivery concentration Index: DCI) was lower in government-supported OUAs than other areas. Qualitative analyses revealed that physical distance is no longer a barrier in current OUAs. Mothers travel to neighboring big cities to seek elective preferences only available at specialized maternal hospitals rather than true medical need. Increasing one-child families changed the mother's perception of pregnancy and childbirth, making them willing to pay for more expensive services. Concern about an emergency for mothers or infants, especially of high-risk mothers was also an important factor to make mothers avoid local government-supported hospitals. Adjusted multi-level logistic regression indicated that DCIs of government-supported OUAs were higher than the ones of their counterpart areas. Conclusion Our results suggest that current OUAs do not reflect reality. Identification of true OUAs where physical distance is a real barrier to the use of obstetric service and focused investment on them is necessary. In addition, more sophisticated performance indicator other than DCI needs to be developed.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62003373a8e86e9c7bac8d7d5ebc9626",
  "timestamp": "2025-05-15T03:13:04.870052"
}