{
  "id": 7057,
  "title": "Life-space mobility in older persons with cognitive impairment after discharge from geriatric rehabilitation",
  "abstract": "Objectives: To describe life-space mobility and identify its determinants in older persons with cognitive impairment after discharge from geriatric rehabilitation. Methods: A cross-sectional study in older community-dwelling persons with mild to moderate cognitive impairment (Mini-Mental State Examination, MMSE: 17-26) following geriatric rehabilitation was conducted. Life-space mobility (LSM) was evaluated by the Life-Space Assessment in Persons with Cognitive Impairment (LSA-CI). Bivariate analyses and multivariate regression analyses were used to investigate associations between LSM and physical, cognitive, psychosocial, environmental, financial and demographic characteristics, and physical activity behavior. Results: LSM in 118 older, multimorbid participants (age: 82.3 +/- 6.0 years) with cognitive impairment (MMSE score: 23.3 +/- 2.4 points) was substantially limited, depending on availability of personal support and equipment. More than 30% of participants were confined to the neighborhood and half of all patients could not leave the bedroom without equipment or assistance. Motor performance, social activities, physical activity, and gender were identified as independent determinants of LSM and explained 42.4% (adjusted R-2) of the LSA-CI variance in the regression model. Conclusion: The study documents the highly restricted LSM in older persons with CI following geriatric rehabilitation. The identified modifiable determinants of LSM show potential for future interventions to increase LSM in such a vulnerable population at high risk for restrictions in LSM by targeting motor performance, social activities, and physical activity. A gender-specific approach may help to address more advanced restrictions in women.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "620b634a46100dec2005a37b972abf23",
  "timestamp": "2025-05-15T03:04:23.052977"
}