{
  "id": 6559,
  "title": "Analyzing Factors Enabling Prostate Cancer Screening Behaviors Among African American Males in the South Region Using the Andersen's Behavioral Model of Healthcare Services Utilization",
  "abstract": "Prostate cancer is the second leading cause of cancer death among men in the United States, and African American men especially represent a high risk population for prostate cancer. Although the overall prostate cancer incidence rates have been declining since 1992, the average annual prostate cancer incidence rates among African American men were still higher than any other racial groups, and the mortality rates were 2.1 times higher than that of Caucasian men. This study examined what factors including cultural mistrust were related with the prostate cancer screening behaviors among African American males in the South East region. Out of 496 prostate educational seminar attendees, 304 volunteers completed the survey about the behaviors of prostate cancer, cultural mistrust for health providers and general health beliefs and health behaviors. Using Anderson's Behavioral Model of Health Services Use, hierarchical multivariate logistic regression analysis was conducted to identify which predisposing, enabling, and need factors could predict prostate cancer screening behaviors and whether there was any interaction effects among these predictors. Findings revealed that annual household income and annual health check-up were significantly related with the prostate cancer screening behaviors while the effect of health insurance was diminished among older African American males. Overall, results highlight the importance of financial resources as a determinant of prostate cancer screening behaviors among African American males implying the need of substantial support to overcome the obstacles from financial adversity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "621299d6a4ff6e4d3e4596c0ff74e96d",
  "timestamp": "2025-05-15T02:59:07.627034"
}