{
  "id": 358,
  "title": "Portfolio management under capital market frictions: a grey clustering approach",
  "abstract": "International portfolio management is influenced by the existence of frictions, factors or events that interfere with trade, which are linked in financial literature to market-specific factors, such as available information, restrictions, investor protection, or market liquidity. Given the wide variety of factors that can be included in these categories, scientific studies typically focus on a reduced number of indicators at a time in order to offer an in depth analysis of their impact. We offer a consolidated view of the perspectives observed in financial literature by proposing a novel index for market frictions that includes all these four components and rank fifteen post-communist East European capital markets based on their index values. We then constructed various scenarios by assuming different levels of importance for the criteria used in index construction. By employing grey clustering analysis, we cluster these capital markets into three categories-strongly recommended, recommended with some reserve, and not recommended-based on the importance given by the decision maker to these factors. The results show that some of the studied markets are in the same cluster, irrespective of the chosen scenario. The only market always included in the strongly recommended category is Hungary, indicating that it is a good investment option for international participants. Bulgaria and Slovakia are always regarded as recommended with reserve markets, whereas the Republic of Moldova is part of the not recommended category. The other markets show a degree of variability that can be explained by different investor perspectives. This study contributes to the existing literature by combining the advantages of grey clustering and portfolio analysis. Investors can use this approach during the decision-making process related to their investments.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62150004104506d81104a4ce8cb75ff6",
  "timestamp": "2025-05-15T00:42:32.487589"
}