{
  "id": 8681,
  "title": "Predicting tax avoidance by means of social network analytics",
  "abstract": "This study predicts tax avoidance by means of social network analytics. We extend previous literature by being the first to build a predictive model including a larger variation of network features. We construct a network of firms connected through shared board membership. Then, we apply three analytical techniques, logistic regression, decision trees, and random forests; to create five models using either firm characteristics, network characteristics or different combinations of both. A random forest including firm characteristics, network characteristics of firms and network characteristics of board members provides the best performance with a minimal increase of 7 pp in AUC. Hence, including network effects significantly improves the predictive ability of tax avoidance models, implying that board members exhibit specific knowledge which can carry over across firms. We find that having board members with no connections to low-tax companies lowers the likelihood of being a low-tax firm. Similarly, the higher the average tax rate of the companies a board member is connected to, the lower the chance of being low-tax. On the other hand, being connected to more low-tax firms increases the probability of being low-tax. Consistent with prior literature on firm-specific variables, PP&E has a positive influence on the probability of being low-tax, while EBITDA has a negative effect. Our results are informative for companies as to the director expertise they want to attract in their boards. Additionally, financial analysts and regulatory agencies can use our insights to predict which firms are likely to be low-tax and potentially at risk. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62233338d1c8cabfa2af9a51a5e3c9ff",
  "timestamp": "2025-05-15T03:21:24.655922"
}