{
  "id": 6201,
  "title": "Investigating Maternal Stress, Depression, and Breastfeeding: A Pregnancy Risk Assessment Monitoring System (2016-2019) Analysis",
  "abstract": "Breastfeeding is invaluable for postpartum physical healing and mental wellbeing, but psychosocial stress and depression impede such recovery processes. To inform future interventions and policies, associations between breastfeeding, maternal stress, and depression were examined. Data from the Pregnancy Risk Assessment Monitoring System (PRAMS) were analyzed (2016-2019). Logistic regression models were used to calculate adjusted odds ratios with 95% confidence intervals. Of the total sample (n = 95,820), approximately 88% of participants attempted breastfeeding. Our findings indicate that participants who experienced any form of stress had a slightly higher likelihood of breastfeeding compared to those without stress. Specifically, partner-related and financial-related stressors were significantly associated with increased odds of breastfeeding. However, no significant associations were observed trauma-related or emotional-related stressors and breastfeeding. Additionally, no significant association was found between depression at different stages (preconception, prenatal, and postpartum) and breastfeeding. A significant interaction effect was noted between having experienced any of the 13 stressors and Black race/ethnicity on breastfeeding odds. Similarly, significant interaction effects were observed between partner-related, trauma, financial, or emotional stressors and Black race/ethnicity. These findings emphasize the importance of considering various factors when promoting breastfeeding in diverse populations, and screening for psychosocial stress during postpartum visits. Our study recommends tailoring breastfeeding interventions to address the needs of Black mothers which could significantly improve maternal health and breastfeeding outcomes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6238dee14bb6092b9687bf2d8463446f",
  "timestamp": "2025-05-15T02:55:44.630133"
}