{
  "id": 540,
  "title": "Short-term solutions to biodiversity conservation in portfolio construction: Forward-looking disclosure and classification-based metrics biodiversity conservation in portfolio construction",
  "abstract": "Demand is increasing among investors to create portfolios that encourage positive outcomes for biological diversity. The evolution of investment strategies for transitions to zero carbon over the last two decades provides insights that will assist in shaping strategies for biodiversity-positive investments. Many emerging approaches to capture company impact and dependence on biodiversity focus on nature-related threats to an organisation by assessing ecosystem integrity. Other approaches focus on minimising an organisation's contribution to risks of species extinction by using data sets such as the IUCN's Red List of Threatened Species. However, while these approaches are useful for assessing threats to and from biodiversity for individual companies, to be effective for investment portfolio construction, metrics need to be comparable across companies in an investment universe. Many of the threat assessments that could link corporate activities to impacts are incomplete and omit critical information. If the investment community focuses on biodiversity without sufficient forethought, there is a risk of entrenching metrics with significant flaws. In this paper, we suggest that interim approaches are needed to support investors in understanding the approaches being taken by potential investee companies. To that end, we present and discuss a disclosure-based Biodiversity Management Quality and a classification-based Biodiversity Revenues metric for biodiversity-related investing.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6247e5424fe13e0f98ba73d2046d731b",
  "timestamp": "2025-05-15T00:45:01.241481"
}