{
  "id": 3845,
  "title": "Alternatives to incorporate uncertainty and risk attitude in multicriteria evaluation of forest plans",
  "abstract": "This article studies alternative possibilities to incorporate uncertainty and risk attitude into multicriteria forest planning calculations. The interest is in studying the uncertainties involved in forest owner's subjective preferences, but the presented approach could be applied also more generally with measurement and modeling errors concerning forest inventory and forecasting, for example. The models applied are based on ratio scale pairwise comparisons of decision elements and their statistical regression analysis, which enables versatile possibilities to incorporate the uncertainty into decisionmaking. In traditional statistical inference, uncertainty is not used directly as a decision criterion that would be required to include risk attitude. However, the statistical approach can be used, for example, to derive pairwise winning probabilities for forest plans beating each other and rank probabilities for forest plans for attaining a given rank. Several types of indices can be derived from these probabilities enabling the incorporation of risk attitude, but a more promising approach was to reduce the decisionmaking problem to contain mean and SD of the utility distributions for each forest plan and provide them as decision support to the forest owner. The approach is based on classical mean-variance utility in portfolio theory. Also, weighted average of certain percentiles of the utility distributions or weighted average of rank probabilities have their advantages.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6274f426844815c4fcdace383361dbb8",
  "timestamp": "2025-05-15T01:21:41.250650"
}