{
  "id": 5421,
  "title": "Comparison of Multifactor Asset Pricing Models in the South African Stock Market [2000-2016]",
  "abstract": "The quest for parsimonious models has been a key objective in asset pricing. However, there appears to be no consensus on the most successful asset pricing strategy in the literature, especially for the South African Market. Using financial statements from January 2000 to December 2015, this article explores how market anomalies affect the performance of securities in the Johannesburg Stock Exchange's (JSE's) resources, industrial, and finance sectors. We investigated the efficacy of several asset pricing models and their capacity to account for market anomalies in the JSE's resources, industrial, and financial sectors, as well as the applicability of the Fama and French five-factor model. The study used multiple regression techniques and applied stationarity and cointegration methods to ensure robust results. Results also suggest that when the FF5FM is implemented, there is statistical significance at the 10% level for the CMA in the resources sector as the value factor disappears. The FF5FM results in the industrial sector show a significance level of 5% in the SMB. The financial sector seems to have the majority of the style-based risk factors as the SMB is positively significant at a 5% level, the HML is significant at a 1% level, and the CMA is negatively significant at a 10% level of significance. The results suggest that the Carhart Four Factor model is the best to use in all market conditions. Results also show that value becomes redundant in a bullish market, but the opposite holds in a bearish market for a model with operating profitably and investing factors. These findings highlight the necessity for investors to determine which investment risk elements produce abnormal returns in both bearish and bullish market circumstances before investing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "627dcf87c4fa1483fffd648f545bf1bd",
  "timestamp": "2025-05-15T02:47:42.883500"
}