{
  "id": 2287,
  "title": "Association of insurance status with financial toxicity and outcome disparities after penetrating trauma and assault",
  "abstract": "Background: Financial toxicity, or the impact out-of-pocket medical expenses have on the quality of life, has not been widely enumerated in the trauma literature. We characterized the relationship between insurance status and the risk of financial toxicity after trauma and associated risk factors.Methods: Adults admitted for gunshot wounds, other penetrating injuries, or blunt assault were iden-tified from the 2015 to 2019 National Inpatient Sample. The outcome of interest was a risk of financial toxicity with separate regression models for uninsured and insured populations.Results: Of an estimated 775,665 patients, 21.2% were at risk of financial toxicity. Patients at risk of financial toxicity were younger, more commonly male, less commonly White, and had a lower Elixhauser Index (Table 1). A higher proportion of uninsured patients were at risk of financial toxicity (40.8% vs 17.7%, P < .001) than insured patients. Whereas the proportion of uninsured patients at risk of financial toxicity significantly increased from 2015 to 2019, it was unchanged in insured patients. After adjust-ment, non-income demographic and clinical factors were not associated with the risk of financial toxicity amongst the insured. Conversely, the Black or Hispanic race, gunshot wounds, and any in-hospital complications were some factors associated with increased risk of financial toxicity in uninsured patients.Conclusion: An increasingly larger proportion of uninsured patients are at risk of financial toxicity after trauma. The risk of financial toxicity among the uninsured was more complex than in the insured and associated with race, gunshot wounds, and complications. Increasing insurance access and the adoption of trauma-informed care practices should be used to address financial toxicity in this population.(c) 2023 Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6283574cd08c0d4a2448224d46f6a425",
  "timestamp": "2025-05-15T02:13:31.823113"
}