{
  "id": 5716,
  "title": "Financial strain across 25 years and women's bladder health: a life course perspective",
  "abstract": "BACKGROUND: A small number of cross-sectional studies have found that financial insecurity-a social determinant of health-is associated with lower urinary tract symptoms.OBJECTIVE: This study aimed to examine (1) whether women in the Coronary Artery Risk Development in Young Adult Study with higher levels of financial strain, assessed at 7 time points across 25 years beginning in 1985-1986, were more likely to report lower urinary tract symptoms and impact after the 2010-2011 financial strain assessment and (2) whether healthcare access and comorbidities mediated potential associations.STUDY DESIGN: This prospective cohort study recruited Black and White participants aged 18 to 30 years at baseline (1985-1986) from the populations of 4 US cities. The analytical sample was composed of women with complete data for analyses involving financial strain trajectories across 7 assessments (n=841) and mediation tests of data collected at 4 assessments (n=886). The outcome variable was previously developed through a cluster analysis of urinary incontinence severity, urinary incontinence impact, other lower urinary tract symptoms severity, and their impact in 2012-2013, which yielded 4 lower urinary tract symptoms and impact cluster categories: women with no symptom or very mild symptoms and no impact vs women with mild, moderate, or severe symptoms and impact. Financial strain was defined as finding it very hard, hard, or somewhat hard (vs not very hard) to pay for the very basics, such as food, heating, and medical care. Using proportional odds logistic regression, cluster categories were regressed on the financial strain trajectory group, adjusting for age, race, education, and parity. For mediation analyses, separate financial strain variables (difficulty paying for the very basics, such as food and heating, and difficulty paying for medical care) were created by combining 1995-1996 and 2000-2001 values. Two healthcare access variables (difficulty receiving care and underutilization of care) and a single comorbidity index (smoking, physical inactivity, body mass index, hypertension, diabetes mellitus, and depressive symptoms) were created by combining 2005-2006 and 2010-2011 values. Regression analyses and structural equation modeling were used to test whether healthcare access and comorbidities mediated associations between financial strain and lower urinary tract symptoms and impact cluster categories.RESULTS: In comparison to women who were consistently not financially strained, women who were consistently strained (odds ratio, 2.10; 95% confidence interval, 1.13-3.91), shifted into being strained (odds ratio, 2.00; 95% confidence interval, 1.29-3.10), or experienced >1 shift in strain (odds ratio, 1.99; 95% confidence interval, 1.46-2.71) had roughly twice the odds of reporting greater lower urinary tract symptoms and impact. Underutilization of healthcare and comorbidities mediated the association between difficulty paying for medical care and lower urinary tract symptoms and impact. In the structural equation model, difficulty paying for medical care and underutilization of care were associated (b=.31; P<.01), as was underutilization of care and greater lower urinary tract symptoms and impact (b=.09; P<.01). Moreover, difficulty paying for medical care and the comorbidity index were associated (b=.34; P<.01), as was the comorbidity index and greater lower urinary tract symptoms and impact (b=.24; P<.01). Collectively, these mediation pathways eliminated a direct association between difficulty paying for medical care and lower urinary tract symptoms and impact.CONCLUSION: Underutilization of healthcare and comorbidities explained an association between financial strain (difficulty paying for medical care) and lower urinary tract symptoms and impact. Research is needed to confirm the findings and examine other mechanisms that may further explain the association. Accumulated evidence may inform future policies and practices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62901f37148b9a476db38c8227cf322d",
  "timestamp": "2025-05-15T02:50:53.845213"
}