{
  "id": 724,
  "title": "Investment Portfolio Allocation and Insurance Solvency: New Evidence from Insurance Groups in the Era of Solvency II",
  "abstract": "This study examines the effect of the investment portfolio structure on insurers' solvency, as measured by the Solvency Capital Requirement ratio. An empirical sample of 88 EU-based insurance groups was analyzed to provide robust evidence of the portfolio's impact on the Solvency Capital Requirement ratio from 2016 to 2022. Linear regression and supervised machine learning models, particularly extra trees regression, were used to predict the solvency ratios, with the latter outperforming the former. The investigation was supplemented with panel data analysis. Firm-specific factors, including, unit-linked and index-linked liabilities, firm size, investments in property, collective undertakings, bonds and equities, and the ratio of government bonds to corporate bonds and country-specific factors, such as life and non-life market concentration, domestic bond market development, private debt development, household spending, banking concentration, non-performing loans, and CO2 emissions, were found to have an important effect on insurers' solvency ratios. The novelty of this research lies in the investigation of the connection of solvency ratios with variables that prior studies have not yet explored, such as portfolio asset allocation, the life and non-life insurance market concentration, and unit-linked and index-linked products, via the employment of a battery of traditional and machine enhanced methods. Furthermore, it identifies the relation of solvency ratios with bond market development and investments in collective undertakings. Finally, it addresses the substantial solvency risks posed by the high banking sector concentration to insurers under Solvency II.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6292e977b0da488a64b2751ccaaf23cb",
  "timestamp": "2025-05-15T00:47:18.595925"
}