{
  "id": 2548,
  "title": "Association of uninsured status and rurality with risk of financial toxicity after pediatric trauma",
  "abstract": "Background: Pediatric traumatic injury is associated with long-term morbidity as well as substantial economic burden. Prior work has labeled the catastrophic out-of-pocket medical expenses borne by patients as financial toxicity. We hypothesized uninsured rural patients to be vulnerable to exorbitant costs and thus at greatest risk of financial toxicity. Methods: Pediatric patients (<18 years) experiencing traumatic injury were identified in the 2016-2019 National Inpatient Sample. Patients were considered to be at risk of financial toxicity if their hospitalization cost exceeded 40% of post-subsistence income. Individual family income was computed using a gamma distribution probability density function with parameters derived from publicly available US Census Bureau data, in accordance with prior work. A multivariable logistic regression was developed to assess factors associated with risk of financial toxicity. Results: Of an estimated 225,265 children identified for study, 34,395 (15.3%) were Rural. Rural patients were more likely to experience risk of financial toxicity (29.1 vs 22.2%, P < .001) compared to Urban patients. After adjustment, rurality (reference: urban status; adjusted odds ratio 1.45, 95% confidence interval 1.36-1.55) and uninsured status (reference: private; adjusted odds ratio 1.85, 95% confidence interval 1.67-2.05) remained linked to increased odds of risk of financial toxicity. Specifically among those with private insurance, Rural patients experienced markedly higher predicted risk of financial toxicity, relative to Urban. Conclusion: Our findings suggest a complex interplay between rural status and insurance type in the prediction of risk of financial toxicity after pediatric trauma. To target policy interventions, future studies should characterize the patients and communities at greatest risk of financial devastation among rural pediatric trauma patients. (c) 2024 The Author(s). Published by Elsevier Inc. This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by-nc/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62aea37484e2589674248911ce00f498",
  "timestamp": "2025-05-15T02:16:32.712067"
}