{
  "id": 2995,
  "title": "Analysis of Risk Factors, Morbidity, and Cost Associated with Respiratory Complications following Abdominal Wall Reconstruction",
  "abstract": "Background: Ventral hernia remains a continued and expensive problem for general and reconstructive surgeons, alike. The aim of this study was to assess perioperative factors and cost associated with postoperative respiratory morbidity in abdominal wall reconstruction. Methods: A retrospective review of abdominal wall reconstruction patients operated on between 2007 and 2012 was performed. Analysis of perioperative factors associated with postoperative respiratory morbidity was performed using hospital-defined International Classification of Diseases, Ninth Revision codes. Bivariate and multivariate logistic regression analyses were used to assess independent predictors of postoperative respiratory morbidity, and linear regression was used to determine the financial impact. Results: One hundred thirty-four consecutive abdominal wall reconstructions performed by a single surgeon over a 5-year period were included. Respiratory complications occurred in 15.7 percent of patients (n = 21); 5.2 percent required reintubation (n = 7) and 5.2 percent failed to wean from ventilatory support postoperatively (n = 7). Patients experiencing respiratory morbidity stayed on average 16.2 days longer (p < 0.0001) and represented the only three patients in the study experiencing mortality (p = 0.003). Regression analysis demonstrated that intraoperative blood transfusions (p = 0.008), highest peak intraoperative airway pressure (p = 0.017), fascial closure (p = 0.013), and American Society of Anesthesiologists physical status (p = 0.019) were all associated with postoperative respiratory morbidity. Linear regression analysis demonstrated that respiratory complications added a cost of $60,933 per patient (p < 0.001). Conclusions: Postoperative respiratory morbidity following abdominal wall reconstruction is a common occurrence linked to identifiable perioperative risk factors and associated with significant mortality and a tremendous cost burden. These findings underscore the importance of preoperative risk stratification and patient selection to optimize outcome and contain cost.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62b4147b19c4c4b275a567b5c245f94b",
  "timestamp": "2025-05-15T02:21:19.275234"
}