{
  "id": 8161,
  "title": "Progression to Type 2 Diabetes and Its Effect on Health Care Costs in Low-Income and Insured Patients with Prediabetes: A Retrospective Study Using Medicaid Claims Data",
  "abstract": "BACKGROUND: Prediabetes is a high-risk factor for progression to diabetes. Without lifestyle changes, such as weight loss and moderate physical activity, 15%-30% of people with prediabetes are projected to develop type 2 diabetes within 5 years. Progression to diabetes increases the financial burden significantly for patients and health care systems. Populations with low socioeconomic status are associated with a higher risk of diabetes. However, knowledge is limited about the effect of transition to diabetes on future costs incurred in low-income populations. OBJECTIVES: To (a) describe the characteristics of low-income and insured patients with prediabetes and (b) examine the effect of progression to type 2 diabetes on health care utilization and costs. METHODS: This study used South Carolina Medicaid claims data (20092014) to identify patients (aged years) with newly diagnosed prediabetes. All patients were enrolled in Medicaid continuously for at least 1 year before and after the diagnosis of prediabetes and were followed for at least 1 year and up to 6 years. The time to progression to type 2 diabetes was measured by a Kaplan Meier curve, and risk factors associated with onset of type 2 diabetes were identified by Cox regression. Generalized linear models were applied to assess the effect of progression to type 2 diabetes on total health care costs during the first 3-year period. RESULTS: A total of 7,650 patients with prediabetes met the study criteria. During the follow-up period, 30.3% of the study population developed type 2 diabetes within 3 years. Older age, African-American race, fee-for-service plan, comorbid hypertension, obesity, and dyslipidemia were associated with higher risk for onset of type 2 diabetes. Compared with patients who did not progress to type 2 diabetes, the progression to type 2 diabetes increased total health care costs by 22.1% (P<0.001), 39.1% (P<0.001), and 47.6% (P<0.001) during the first 3 years after adjusting for demographic and comorbid conditions. CONCLUSIONS: Age, race, type of Medicaid plan, and diabetes-related comorbidities were associated with risk for progression of prediabetes. Progression to type 2 diabetes significantly increased total health care costs in the first 3 years. Early detection and intervention to prevent or delay onset of type 2 diabetes are needed to control health care utilization and costs. Copyright (C) 2017, Academy of Managed Care Pharmacy. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62b8545aebd0cd18c9a2ae997c122119",
  "timestamp": "2025-05-15T03:15:38.492104"
}