{
  "id": 1494,
  "title": "Risk identification of listed companies violation by integrating knowledge graph and multi-source risk factors",
  "abstract": "The regulatory compliance supervision of listed enterprises is of great significance for ensuring the stable operation of financial markets. However, existing graph propagation algorithms used to identify corporate violations are limited by their inherent randomness. At the same time, current methods consider a relatively narrow range of risk dimensions, making it difficult to accurately distinguish the different characteristics of enterprises. To this end, this paper designs a Propagation of Violation Risks for Listed Enterprises (PVR-LE) algorithm, which reduces the risk of false propagation through a risk weight decay mechanism and dynamic updating of risk propagation patterns. Furthermore, a Multi-source Risk Fusion Neural Network (MRFNN) for corporate violation prediction tasks is proposed, which fuses the liquidity risk characteristics between enterprises, clustering characteristics, and the enterprise's risk characteristics to endow the violating enterprise nodes with more distinctive and characteristic vector features, thereby identifying whether there are violations in the company. At the same time, a generative adversarial network is used to generate samples of violating enterprises to solve the problem of class imbalance. Experiments are conducted on areal dataset constructed from information on Chinese listed companies, and this method improves the accuracy, recall, the weighted harmonic mean of precision and recall(F1-score), and geometric mean(G-mean) metrics by 2.12%, 3.19%, 2.14%, and 2.79%, respectively, compared to the best performance of existing models. The experimental results show that the proposed method effectively improves the accuracy of identifying corporate violations and helps promote the development of intelligent regulatory work for listed enterprises.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62bf50e056c543543c78d0af431b7cde",
  "timestamp": "2025-05-15T02:03:39.812159"
}