{
  "id": 6434,
  "title": "Assessment of Baseline Ultrawidefield Fluorescein Angiographic Quantitative Leakage Parameters with Ultrawidefield Fundus Features and Clinical Parameters in Diabetic Retinopathy in Protocol AA",
  "abstract": "Purpose: Evaluate quantitative leakage parameters on ultrawidefield fluorescein angiography (UWF-FA) images and explore their association with Diabetic Retinopathy Severity Scale (DRSS), predominantly peripheral lesions (PPLs), visual acuity, and clinical characteristics. Design: A post hoc analysis of baseline UWF-FA images in the DRCR Retina Network observational study Protocol AA. Participants: A total of 575 eyes from 384 adults across 38 sites in the United States and Canada with gradable UWF-FA. Methods: A machine learning-enhanced feature extraction platform provided initial leakage segmentation of UWF-FA images sequentially reviewed and corrected by 2 certified readers for segmentation accuracy. Ultrawidefield fluorescein angiography leakage was measured in 5 retinal zones: panretinal (entire retina), central macular (3-disc diameter fovea-centered circle), posterior pole (6-disc diameter fovea-centered circle), peripheral (outside 6-disc diameter circle), and widefield far peripheral (outside 9-disc diameter circle); associations with clinical factors were evaluated with marginal beta regression models. Main Outcome Measures: Ultrawidefield fluorescein angiography leakage index, calculated as the area with leakage divided by the analyzable retinal area. Results: The mean quantitative leakage index was 3.5% for panretinal, 6.6% for macular, 4.8% for posterior pole, 3.3% for peripheral, and 2.8% for widefield far peripheral retinal zones. Panretinal leakage was associated with DRSS (mean 2.2% for no to mild nonproliferative diabetic retinopathy [NPDR], 3.4% for moderate NPDR, 4.2% for moderately severe NPDR, 4.8% for severe NPDR, and 5.1% for proliferative diabetic retinopathy; P < 0.001), hemoglobin A1C (HbA1c) (3.2% for HbA1c < 8% vs. 3.8% for HbA1c > 8%; P = 0.01 for continuous HbA1c), visual acuity (3.3% for 20/25 or better vs. 4.7% for 20/32 or worse; continuous P < 0.001), and UWF-FAPPL types of intraretinal microvascular abnormality (4.3% vs. 3.3%; P = 0.005) or new vessels elsewhere (5.7% vs. 3.4%; P = 0.003). Diabetic retinopathy severity was also statistically significant for leakage within all retinal zones (P < 0.001); eyes with noncentral diabetic macular edema (DME) versus no DME had higher mean leakage in the central macular (11.2% vs. 5.9%; P = 0.005) and posterior pole regions (9.2% vs. 4.2%; P = 0.002). Conclusions: Quantitative UWF-FA leakage analysis identified associations between leakage and DRSS, visual acuity, and presence of DME. In the future, quantitative UWF-FA leakage parameters may be explored as potential biomarkers for disease progression risk. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Retina 2025;9:243-252 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62c1e7202b16b2dfbe9671259accd8be",
  "timestamp": "2025-05-15T02:58:05.675235"
}