{
  "id": 7439,
  "title": "An Improved Kernel Extreme Learning Machine for Bankruptcy Prediction",
  "abstract": "In this study, a novel parameter tuning strategy for a kernel extreme learning machine (KELM) is constructed using an improved particle swarm optimization method based on differential evolution (EPSO). First, the proposed EPSO is used to obtain the global optimum by introducing the differential evolution mutation strategy. Then, the EPSO is used to construct an effective and stable KELM model for bankruptcy prediction. The resultant EPSO-KELM model is compared to two other competitive KELM methods based on traditional particle swarm optimization and the genetic algorithm via a 10-fold cross validation analysis. The experimental results indicate that the proposed method achieved superior results compared to the other two methods when applied to two financial datasets. When applied to the Polish bankruptcy dataset, the EPSO-KELM achieved a classification accuracy (ACC) of 83.95%, an area under the receiver operating characteristic curve (AUC) of 0.8443, and Type I error and Type II error of 13.15% and 16.61%, respectively. In addition, the proposed method achieved an ACC of 87.10%, AUC of 0.8716, and Type I error and Type II error of 15.53% and 10.13%, respectively, when applied to the Australian dataset. Therefore, the proposed EPSO-KELM model could be effectively used as an early risk warning system for bankruptcy predication.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62c22bfbbfc91ffa420c279b57d3cbde",
  "timestamp": "2025-05-15T03:08:37.858416"
}