{
  "id": 9326,
  "title": "Disparities in Amblyopia Treatment Outcomes The Impact of Sociodemographic Factors, Treatment Compliance, and Age of Diagnosis",
  "abstract": "Purpose: To identify clinical and sociodemographic factors associated with disparities in amblyopia treatment outcomes. Design: Retrospective chart review. Participants: Children < 8 years of age diagnosed and treated for unilateral refractive or strabismic amblyopia at our institution from 2012 to 2022. Methods: Children with amblyopia were categorized by outcome: resolved amblyopia (< 0.2 logarithm of the minimum angle of resolution [logMAR] interocular difference [IOD] in visual acuity [VA] or no fixation preference in nonverbal patients) or persistent amblyopia. Demographic and clinical data were recorded from the medical record. Zip codes were used to calculate Childhood Opportunity Index (COI) scores, estimated annual household income, and distance to hospital. Main Outcome Measures: Sociodemographic and clinical factors were compared between children with resolved and persistent amblyopia. Factors significant at P < 0.10 on univariate analysis were included in a multivariable regression model. Results: A total of 168 patients met inclusion criteria, and 131 patients (78%) had resolved amblyopia. Demographic factors associated with resolution of amblyopia were younger age at diagnosis (3.3 +/- 1.7 years vs. 4.5 +/- 1.9 years; P = 0.0009), English as the primary language (79.4% vs. 62.2%; P = 0.04), higher estimated annual income ($83 315.93 +/- $29 276.64 vs. $71 623.00 +/- $26 842.56; P = 0.03), higher COI scores (50.9 +/- 27.3 vs. 40.0 +/- 26.4; P = 0.03), and living farther from our institution (28.6 +/- 37.6 miles vs. 14.9 +/- 12.7 miles; P = 0.003). Patients with resolved amblyopia also had higher rates of treatment compliance (83.2% +/- 25.0% vs. 75.6% +/- 24.4%; P = 0.009) and shorter delays in follow-up (40.1 +/- 76.8 days vs. 61.1 +/- 90.4 days; P = 0.02). Amblyopia persistence was borderline associated with governmental insurance and higher presenting IOD in VA (both P = 0.06). On multivariate analysis, only younger age at amblyopia diagnosis (P = 0.0010) remained significantly associated with amblyopia resolution. Conclusions: Our findings suggest that disparities in amblyopia outcomes are related to differences in age at diagnosis. Interventions to lower the age at which amblyopia is diagnosed, such as programs to improve vision screening rates and access to pediatric eye care in at-risk groups, may directly address inequities in rates of amblyopia resolution. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2025;132:335-342 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62c476131517c133225fdce12597b2ed",
  "timestamp": "2025-05-15T03:27:53.324208"
}