{
  "id": 7343,
  "title": "Trends in mortality outcomes of hospital-admitted injury in Victoria, Australia 2001-2021",
  "abstract": "Due to advancements in trauma treatment methods, it is expected that survivability of hospital-admitted injuries gradually improves over time. However, measurement of trends in all-cause injury survivability is complicated by changes in case mix, demographics and hospital admission policy. The aim of this study is to determine trends in hospital-admitted injury survivability in Victoria, Australia, taking case-mix and patient demographics into account, and to explore the potential impact of changes in hospital admission practices. Injury admission records (ICD-10-AM codes S00-T75 and T79) between 1 July 2001 and 30 June 2021 were extracted from the Victorian Admitted Episodes Dataset. ICD-based Injury Severity Score (ICISS) calculated from Survival Risk Ratios for Victoria was used as an injury severity measure. Death-in-hospital was modelled as a function of financial year, adjusting for age group, sex and ICISS, as well as admission type and length of stay. There were 19,064 in-hospital deaths recorded in 2,362,991 injury-related hospital admissions in 2001/02-2020/21. Rates of in-hospital death decreased from 1.00% (866/86,998) in 2001/02 to 0.72% (1115/154,009) in 2020/21. ICISS was a good predictor of in-hospital death with an area-under-the-curve of 0.91. In-hospital death was associated with financial year (Odds Ratio 0.950 [95%CI 0.947, 0.952]), in logistic regression modelling adjusted for ICISS, age and sex. In stratified modelling, decreasing injury death trends were observed in each of the top 10 injury diagnoses (together constituting > 50% of cases). Admission type and length of stay were added to the model: these did not alter the effect of year on in-hospital death. In conclusion, a 28% reduction in rates of in-hospital deaths in Victoria was observed over the 20-year study period, in spite of aging of the injured population. This amounts to 1222 additional lives saved in 2020/21 alone. Survival Risk Ratios therefore change markedly over time. A better understanding of the drivers of positive change will help to further reduce the injury burden in Victoria.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62c6757edbe9bcd701956ce63fd656d1",
  "timestamp": "2025-05-15T03:07:31.900762"
}