{
  "id": 4875,
  "title": "Long COVID and financial outcomes: evidence from four longitudinal population surveys",
  "abstract": "Background Long-term sequelae of COVID-19 (long COVID) include muscle weakness, fatigue, breathing difficulties and sleep disturbance over weeks or months. Using UK longitudinal data, we assessed the relationship between long COVID and financial disruption. Methods We estimated associations between long COVID (derived using self-reported length of COVID-19 symptoms) and measures of financial disruption (subjective financial well-being, new benefit claims, changes in household income) by analysing data from four longitudinal population studies, gathered during the first year of the pandemic. We employed modified Poisson regression in a pooled analysis of the four cohorts adjusting for a range of potential confounders, including pre-pandemic (pre-long COVID) factors. Results Among the 20 112 observations across four population surveys, 13% reported having COVID-19 with symptoms that impeded their ability to function normally-10.7% had such symptoms for <4 weeks (acute COVID-19), 1.2% had such symptoms for 4-12 weeks (ongoing symptomatic COVID-19) and 0.6% had such symptoms for >12 weeks (post-COVID-19 syndrome). We found that post-COVID-19 syndrome was associated with worse subjective financial well-being (adjusted relative risk ratios (aRRRs)=1.57, 95% CI=1.25, 1.96) and new benefit claims (aRRR=1.79, CI=1.27, 2.53). Associations were broadly similar across sexes and education levels. These results were not meaningfully altered when scaled to represent the population by age. Conclusions Long COVID was associated with financial disruption in the UK. If our findings reflect causal effects, extending employment protection and financial support to people with long COVID may be warranted.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62c9c2136a86c7c7e21ea121f5e23026",
  "timestamp": "2025-05-15T02:42:04.840259"
}