{
  "id": 593,
  "title": "MRRFGNN: Multi-relation reconstruction and fusion graph neural network for stock crash prediction",
  "abstract": "Stock crash risk often propagates through various interconnected relationships between firms, amplifying its impact across financial markets. Few studies predicted the crash risk of one firm in terms of its relevant firms. A common strategy is to adopt graph neural networks (GNNs) with some predefined firm relations. However, many relations remain undetected or evolve over time. Restricting to several predefined relations inevitably makes noise and thus misleads stock crash predictions. In addition, these relationships are not independent during the process of propagating information and interacting with each other. This study proposes the multi-relation reconstruction and fusion graph neural network (MRRFGNN) to predict stock crash risk by capturing complex relations among listed companies. First, the model employs self-supervised learning and contrastive learning to reconstruct and infer implicit relationships between companies. Second, the model incorporates a relation self-attention mechanism to integrate various types of relationships, enabling a more nuanced understanding of the multiple spillover effects. Empirical evidence from a series of experiments demonstrates the superiority of the proposed method, which achieves the best performance with improvements of at least 2.14% in area under the curve (AUC) and 2.64% in Matthews correlation coefficient (MCC), highlighting its potential for practical application in financial markets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62d0b0164243d5cfdb512e070f9b5e6b",
  "timestamp": "2025-05-15T01:52:49.497565"
}