{
  "id": 4684,
  "title": "Managing patronization portfolio for liquidity risk management in Islamic banks",
  "abstract": "PurposeThe purpose of this study is to explore how changes in customer deposits influence the banking profits. The banking sector's growth-promoting role is supported by its ability to perform the essential function of financial intermediation. However, Islamic banks go the extra mile by balancing the wealth of the rich and the poor and distributing risk more evenly. The effective operation of the services industry, including Islamic banks, depends on the active participation of their customers. Customers' deposits in their accounts with Islamic banks are a crucial funding source. In actuality, two distinct sorts of demanding customers exist. Their expectations of the services provided by Islamic banks are different.Design/methodology/approachPanel quantile regression is applied using the collected data from Islamic banks' audited financial statements for the time period from 2001 to 2021.FindingsThis study is expected to provide the breakdown of shares of current and saving deposits for Islamic banks, which supports managing liquidity risk. This breakdown will help the policymakers lay down a framework for managing the share of current and saving deposits in their favor.Research limitations/implicationsThe study aims to empirically evaluate whether changes in the current and saving account patronization have a role in the liquidity risk. And determine how banks need to manage their deposit structure to manage liquidity.Originality/valuePrevious studies have been nose-dive in providing country-level comparisons of different types of deposits in the context of liquidity risk management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62d3013d82393fff7e3340a51555d579",
  "timestamp": "2025-05-15T02:39:57.512573"
}