{
  "id": 8312,
  "title": "Relationship between Sponsorship and Failure Rate of Dental Implants: A Systematic Approach",
  "abstract": "Background: The number of dental implant treatments increases annually. Dental implants are manufactured by competing companies. Systematic reviews and meta-analysis have shown a clear association between pharmaceutical industry funding of clinical trials and pro-industry results. So far, the impact of industry sponsorship on the outcomes and conclusions of dental implant clinical trials has never been explored. The aim of the present study was to examine financial sponsorship of dental implant trials, and to evaluate whether research funding sources may affect the annual failure rate. Methods and Findings: A systematic approach was used to identify systematic reviews published between January 1993 and December 2008 that specifically deal with the length of survival of dental implants. Primary articles were extracted from these reviews. The failure rate of the dental implants included in the trials was calculated. Data on publication year, Impact Factor, prosthetic design, periodontal status reporting, number of dental implants included in the trials, methodological quality of the studies, presence of a statistical advisor, and financial sponsorship were extracted by two independent reviewers (kappa = 0.90; CI95% [0.77-1.00]). Univariate quasi-Poisson regression models and multivariate analysis were used to identify variables that were significantly associated with failure rates. Five systematic reviews were identified from which 41 analyzable trials were extracted. The mean annual failure rate estimate was 1.09%.(CI95% [0.84-1.42]). The funding source was not reported in 63% of the trials (26/41). Sixty-six percent of the trials were considered as having a risk of bias (27/41). Given study age, both industry associated (OR = 0.21; CI95% [0.12-0.38]) and unknown funding source trials (OR = 0.33; (CI95% [0.21-0.51]) had a lower annual failure rates compared with non-industry associated trials. A conflict of interest statement was disclosed in 2 trials. Conclusions: When controlling for other factors, the probability of annual failure for industry associated trials is significantly lower compared with non-industry associated trials. This bias may have significant implications on tooth extraction decision making, research on tooth preservation, and governmental health care policies.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62e073abd84526660cc1ac71ee679df9",
  "timestamp": "2025-05-15T03:17:21.607596"
}