{
  "id": 5103,
  "title": "Sovereign credit ratings, relative risk ratings and private capital flows: evidence from emerging and frontier markets",
  "abstract": "Purpose - Relative risk ratings measure the degree by which a country's sovereign rating is better or worse than other countries (Basu et al., 2013). However, the literature on the impacts of sovereign ratings on capital flows has not covered the role of relative risk ratings. This paper aims to examine the effect of relative risk ratings on private capital flows to emerging and frontier market economies is filled. In the analysis, the effect of relative risk ratings to that of absolute sovereign ratings in influencing private capital flows are compared. Design/methodology/approach - This paper examines the influence of sovereign credit ratings and relative risk ratings on private capital flows to 26 emerging and frontier market economies using quarterly data for a 20-year period between 1998 and 2017. A dynamic panel regression model is used to estimate the relationship between ratings and capital flows after controlling for other factors that can influence capital flows such as growth and interest rate differentials and global risk conditions. Findings - The analysis finds that while absolute sovereign credit ratings were an important determinant of net capital inflows prior to the global financial crisis in 2008, the influence of relative risk ratings increased in the post-crisis period. The post-crisis effect of relative ratings appears to be driven mostly by portfolio flows. The main results are robust to an alternate measure of capital flows (gross capital flows instead of net capital flows), to the use of fixed gross domestic product weights in calculating relative risk ratings and to the potential endogeneity of absolute and relative ratings. Originality/value - This study advances the literature on being the first attempt to understand the impact of relative risk ratings on capital flows and also comparing the impact of absolute sovereign ratings and relative risk ratings on capital flows in the pre- and post-global financial crisis periods. The findings imply that emerging and frontier markets need to pay greater attention to their relative economic performance and not just their sovereign ratings.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62e38ba4457cc427dae5f18a0f046073",
  "timestamp": "2025-05-15T02:44:11.091839"
}