{
  "id": 513,
  "title": "A Framework for Market State Prediction with Ontological Asset Selection: A Multimodal Approach",
  "abstract": "In this study, we introduce a detailed framework for predicting market conditions and selecting stocks by integrating machine learning techniques with ontological financial analysis. The process starts with ontology-based stock selection, categorizing companies using fundamental financial indicators such as liquidity, profitability, debt ratios, and growth metrics. For instance, firms showcasing favorable debt-to-equity ratios along with robust revenue growth are identified as high-performing entities. This classification facilitates targeted analyses of market dynamics. To predict market states-categorizing them into bull, bear, or neutral phases-the framework utilizes a Non-Stationary Markov Chain (NMC), BERT, to assess sentiment in financial news articles and Long Short-Term Memory (LSTM) networks to identify temporal patterns. Key inputs like the Sentiment Index (SI) and Illiquidity Index (ILLIQ) play essential roles in dynamically influencing regime predictions within the NMC model; these inputs are supplemented by variables including GARCH volatility and VIX to enhance predictive precision further still. Empirical findings demonstrate that our approach achieves an impressive 97.20% accuracy rate for classifying market states, significantly surpassing traditional methods like Naive Bayes, Logistic Regression, KNN, Decision Tree, ANN, Random Forest, and XGBoost. The state-predicted strategy leverages this framework to dynamically adjust portfolio positions based on projected market conditions. It prioritizes growth-oriented assets during bull markets, defensive assets in bear markets, and maintains balanced portfolios in neutral states. Comparative testing showed that this approach achieved an average cumulative return of 13.67%, outperforming the Buy and Hold method's return of 8.62%. Specifically, for the S&P 500 index, returns were recorded at 6.36% compared with just a 1.08% gain from Buy and Hold strategies alone. These results underscore the robustness of our framework and its potential advantages for improving decision-making within quantitative trading environments as well as asset selection processes.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62f5e2242abab5654be5acef2f2cca7b",
  "timestamp": "2025-05-15T00:44:21.007782"
}