{
  "id": 3302,
  "title": "Financial Incentives and Accountability for Integrated Medical Care in Department of Veterans Affairs Mental Health Programs",
  "abstract": "Objective: This study assessed the extent to which mental health leaders perceive their programs as being primarily accountable for monitoring general medical conditions among patients with serious mental illness, and it assessed associations with modifiable health system factors. Methods: As part of the Department of Veterans Affairs (VA) 2007 national Mental Health Program Survey, 108 mental health program directors were queried regarding program characteristics. Perceived accountability was defined as whether their providers, as opposed to external general medical providers, were primarily responsible for specific clinical tasks related to serious mental illness treatment or high-risk behaviors. Multivariable logistic regression was used to determine whether financial incentives or other system factors were associated with accountability. Results: Thirty-six percent of programs reported primary accountability for monitoring diabetes and cardiovascular risk after prescription of second-generation antipsychotics, 10% for hepatitis C screening, and 17% for obesity screening and weight management. In addition, 18% and 27% of program leaders, respectively, received financial bonuses for high performance for screening for risk of diabetes and cardiovascular disease and for alcohol misuse. Financial bonuses for diabetes and cardiovascular screening were associated with primary accountability for such screening (odds ratio = 5.01, p < .05). Co-location of general medical providers was associated with greater accountability for high-risk behavior screening or treatment. Conclusions: Financial incentives to improve quality performance may promote accountability in monitoring diabetes and cardiovascular risk assessment within mental health programs. Integrated care strategies (co-location) might be needed to promote management of high-risk behaviors among patients with serious mental illness. (Psychiatric Services 61: 38-44, 2010)",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62fa82020295f8d2f0e4ce7877a3f75b",
  "timestamp": "2025-05-15T02:24:39.737938"
}