{
  "id": 1622,
  "title": "An Approach for Multi-Item Product Sales Forecasting Based on Advancing the BCG Matrix with Matrix-Clustering and Time Modeling Techniques",
  "abstract": "Customized production has greatly diversified product categories, which has altered product life cycles and added complexity to business management. This paper introduces a matrix-clustering technique that integrates k-means clustering with the BCG Matrix, enhanced by time modeling, to offer a comprehensive framework for multi-item product sales forecasting. The approach builds upon existing BCG Matrix outcomes, re-clustering high-selling products more precisely and redefining their relationship with other product lines more objectively. This method addresses the challenge of forecasting situations with limited historical data, providing more accurate sales predictions. Using Taiwan's sales data, an empirical study on integrated circuit tray products demonstrated the effectiveness of the matrix clustering technique. The results showed improved data utilization, increasing from 35.93% with the original BCG analysis to 52.43% with the combined matrix-clustering and time modeling methods. This study contributes to academic research by presenting a portfolio analysis approach rooted in matrix clustering, which systematically enhances traditional BCG Matrix methods. The proposed framework is adaptable to the unique traits of different portfolios, offering businesses workflows that are efficient, reliable, sustainable, and scalable.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62fdd096fdb505b58daa57dda5b5c6aa",
  "timestamp": "2025-05-15T00:57:46.883402"
}