{
  "id": 6284,
  "title": "Racial disparity and regional variance in healthcare utilization among patients with lung cancer in US hospitals during 2016-2019",
  "abstract": "BackgroundLung cancer health disparities are related to various patient factors. This study describes regional differences in healthcare utilization and racial characteristics to identify high-risk areas. This study aimed to identify regions and races at greater risk for lung cancer health disparities based on differences in healthcare utilization, measured here by hospital charges and length of stay.MethodsThe National Inpatient Sample of the United States was used to identify patients with lung cancer (n = 92,159, weighted n = 460,795) from 2016 to 2019. We examined the characteristics of the patient sample and the association between the racial and regional variables and healthcare utilization, measured by hospital charges and length of stay. The multivariate sample weighted linear regression model estimated how racial and regional variables are associated with healthcare utilization.ResultsOut of 460,795 patients, 76.4% were white, and 40.2% were from the South. The number of lung cancer patients during the study periods was stable. However, hospital charges were somewhat increased, and the length of stay was decreased during the study period. Sample weighted linear regression results showed that Hispanic & Asian patients were associated with 21.1% and 12.3% higher hospital charges than White patients. Compared with the Northeast, Midwest and South were associated with lower hospital charges, however, the West was associated with higher hospital charges.ConclusionMinority groups and regions are at an increased risk for health inequalities because of differences in healthcare utilization. Further differences in utilization by insurance type may exacerbate the situation for some patients with lung cancer. Hospital managers and policymakers working with these patient populations in identified areas should strive to address these disparities through special prevention programs and targeted financial assistance.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "62ff9a2261fe5e0cb47b66a1eddde551",
  "timestamp": "2025-05-15T02:56:37.335594"
}