{
  "id": 6098,
  "title": "STRUCTURED, SYSTEMATIC THREAT BASED APPROACH TO EVALUATE AND IMPROVE DATA QUALITY TO FACILITATE DIGITAL TRANSFORMATION",
  "abstract": "Pipeline operators are rapidly and increasingly moving towards digital transformation in order to harvest efficiencies and achieve higher levels of reliability and safety. Fueled by advances in technology such as cloud computing and machine learning, data is considered a key asset, and pipeline operations are increasingly driven by information and analytics. However, successfully achieving a digital transformation toward reliable and high-quality data requires mature processes for obtaining, managing, evaluating, and continuously improving data quality. During a review of pipeline risk assessment results, a pipeline operator (Operator) found that risk results for a particular pipeline were driven by the mainline coating type being listed as un-coated. However, further review of the records showed that the pipeline, in fact, was coated. One of the Operator's foundational principles is 'data as an asset'. Thus, the Operator understands the critical impact of such data inconsistencies across many potential receptors, from financial impacts to public safety. Additionally, mature processes enhance confidence in prioritizing the right work. Data quality is essential for the use of historical data, interoperability across various data systems, and generation of useful analytics. The data quality process maturity (Process maturity) evaluation aims to assess all processes, capabilities, and governance required for ensuring high data quality. As a result, the Operator decided to rigorously evaluate their data quality and the maturity of data quality processes. The data quality assessment involved creating a comprehensive list of data elements required to assess a particular threat, prioritizing data elements, and documenting data storage by the source system. The data quality was then evaluated using Key Performance Indicators (KPIs), establishing a baseline. An organization's Process maturity varies from level one (Initial) to level five (Optimized). The Process maturity of the Operator was assessed on five evaluation areas: Governance, Organization & People, Data Standards, Requirements & Metrics, Process Efficiency, Technology & Tools. Results of the evaluation led to the identification of actionable gaps. The process, as developed, leverages guidance provided in ISO (8000-8) [3] for data quality assessment and DNVGL-RP-0497 [4] for Process maturity evaluation. This paper presents a step-by-step approach developed for and successfully employed by the Operator as applied to pipeline integrity threats.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "630ca3bbaf76e4b543c4e7b3edd6b037",
  "timestamp": "2025-05-15T02:54:38.882020"
}