{
  "id": 406,
  "title": "Determinants of Cookstoves and Fuel Choice Among Rural Households in India",
  "abstract": "Roughly 2.8 billion people depend on solid fuels for cooking needs, resulting in a tremendous burden of disease from exposure to household air pollution. Despite decades of effort to promote cleaner cooking technologies, displacement of polluting technologies has progressed slowly. This paper describes results of a randomized controlled trial in which eight communities in two regions of rural India were presented with a range of cooking choices including improved solid fuel stoves and clean cooking options like liquefied petroleum gas (LPG) and induction stoves. Using survey data and logistic and multinomial regression, we identify factors associated with two outcomes: (1) pre-intervention ownership of non-solid fuel technologies and (2) household preferences for clean fuels from the range of cooking options offered. The analysis allows us to examine the influence of education, wealth, gender empowerment, stove pricing, and stove exchanges, among other variables. The majority of participants across all communities selected the cleanest options, LPG and induction, irrespective of price, but there is some variation in preferences. Wealth and higher caste stand out as significant predictors of pre-intervention ownership and non-solid fuel cooking options as well as preference for cleaner technologies offered through the intervention. The experimental treatments also influence preferences in some communities. When given the opportunity to exchange, communities in one region are more likely to choose solid fuel stoves (P<0.05). Giving free stoves had mixed results; households in one region are more likely to select clean options (P<0.05), but households in the other region prefer solid fuels (P<0.10).",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6325b3af6b1e28ca145ceeb454dcde5d",
  "timestamp": "2025-05-15T01:31:50.640517"
}