{
  "id": 8679,
  "title": "The Impact of Foreign Capital on the Level of ERM Implementation in Czech SMEs",
  "abstract": "The COVID-19 pandemic has had a devastating impact on many small and medium-sized businesses around the world. Enterprise risk management (ERM) is a conceptual framework that encompasses the systematic and comprehensive identification, analysis, and management of risks in an enterprise. In the post-communist countries of Central Europe, the level of ERM is still relatively low, especially in small and medium-sized enterprises (SMEs). This study fills a gap in the existing knowledge on ERM by shedding light on the influence of foreign capital on the level of ERM implementation in Czech SMEs. The aim of the study is to assess the influence of the share of foreign capital in Czech SMEs on the level of ERM implementation. A validated self-report of 296 non-financial SMEs in the Czech Republic was analyzed using latent class analysis (LCA) and multiple linear regression. The results of the study contribute to the literature by enriching the empirical analysis of ERM in emerging markets. The originality of the results lies in the identification of three distinct groups of firms according to the combination of implemented ERM elements-no ERM, best practice ERM, and pretended ERM-and the finding that the share of foreign capital, age, and firm size influence the level of ERM implementation. In particular, the positive influence of foreign capital in younger companies makes it possible to overcome the barrier of traditionalist thinking of old-school Czech managers influenced by the period of economic transition in post-communist countries. The paper builds on the existing evidence with new empirical conclusions and argues for a greater inflow of foreign direct investment into emerging markets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6328983fcbf0a60b1898e4f8da158d70",
  "timestamp": "2025-05-15T03:21:24.649923"
}