{
  "id": 6574,
  "title": "Occupational female breast and reproductive cancer mortality in British Columbia, Canada, 1950-94",
  "abstract": "Background It has been postulated that recent increases in female breast and reproductive cancers may be, in part, attributable to occupational exposures. Aim We aimed to identify occupational associations with female breast and reproductive cancer mortality among women living in British Columbia (BC), Canada. Methods Case-control methods were used to calculate mortality odds ratios for occupation and cause of death information obtained from the provincial death registry. Cases included women 20 years of age or older who died from breast or reproductive cancer between 1950 and 1994 and resident in BC, Canada. Controls were randomly selected from non-cancer deaths, matched according to age at death and year of death. In a subsequent, stratified analysis, we also identified changes over time to breast and reproductive cancer mortality among each worker group. Results There was excess mortality from breast and ovarian cancer among teachers, nurses, secretaries, librarians, retail sales clerks and religious workers. An elevated risk of breast cancer mortality was also found among professionals employed as owners, managers and government officials, financial saleswomen, scientists, physicians, medical and dental technicians and accountants. Secretaries, telephone operators and musicians were at increased risk of death from endometrial cancer. Cervical cancer mortality was not significantly increased for any occupational classification. Conclusions Our study was aimed primarily at hypothesis generation. More systematic reviews, including cancer registry studies, will prove useful for confirming the relationships we have observed, including a possible increase in the risk of breast and ovarian cancer mortality among women employed in professional occupations.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "632d4338a00f6339f41ae944dbd0650b",
  "timestamp": "2025-05-15T02:59:36.900148"
}