{
  "id": 1406,
  "title": "Psychometric validation and use of a novel diabetes in-patient treatment satisfaction questionnaire",
  "abstract": "Aims To develop the first psychometrically validated Diabetes Treatment Satisfaction Questionnaire for in-patients (DTSQ-IP) and examine determinants of in-patient diabetes treatment satisfaction. Methods We studied 366 in-patients with insulin-treated diabetes at a single UK centre. We developed a 19-item DTSQ-IP to assess in-patient diabetes treatment satisfaction, and collected data on in-patient length of stay (LOS) and in-patient care at the same time. Results Psychometric analyses including Principal Components Analysis and Cronbach's alpha reliability coefficient showed that a single satisfaction score (excluding two items scored individually) can be computed for the entire DTSQ-IP, indicating very good internal consistency reliability (0.92). The DTSQ-IP detected considerable dissatisfaction with meal choice and timing (13.7% of in-patients would never have chosen similar meals at home), and with in-patient hypoglycaemia (35.3% felt that their blood glucose was too low most of the time). In-patients on surgical wards, women, and those long established on insulin were significantly more dissatisfied, particularly with competence of hospital staff. Patients who administered their own insulin were not significantly less dissatisfied overall, but were so with the choice of meals (P = 0.005). Multiple regression analysis produced a model accounting for 8.2% of variability in DTSQ-IP (r = 0.29; P = 0.0058) and 21.7% of variability in LOS (r = 0.46; P = 0.0001). Conclusions The DTSQ-IP is a novel, psychometrically validated and sensitive tool that adds to the DTSQ portfolio. The DTSQ-IP facilitates efforts to assess and improve treatment satisfaction in in-patients with diabetes.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "633a33cd621f0d0e819fe2e06c8a1993",
  "timestamp": "2025-05-15T00:55:28.461800"
}