{
  "id": 7918,
  "title": "Farmers' willingness to pay for surface water in the West Mitidja irrigated perimeter, northern Algeria",
  "abstract": "Algeria is among the most water-stressed countries in the world. Because of its climatic conditions, irrigation is essential for agricultural production. Water prices paid by farmers in public irrigation districts are very low and do not cover the operation and maintenance (O&M) costs of the irrigated perimeters, thus leading to the deterioration of these infrastructures. The objective of this paper is to analyse whether farmer's in the West Mitidja irrigation district in northern Algeria would be willing to pay more for surface water in order to maintain the water supply service in its current conditions. We estimated farmers' willingness to pay (WTP) for water using data from a dichotomous choice contingent valuation survey to 112 randomly selected farmers. Farmers' responses were modelled using logistic regression techniques. We also analysed which technical, structural, social and economic characteristics of farms and farmers explain the differences in WTP. Our results showed that nearly 80% of the surveyed farmers are willing to pay an extra price for irrigation water. The average WTP was 64% greater than the price currently paid by farmers, suggesting some scope for improving the financial resources of the Mitidja irrigated perimeter, but insufficient to cover all O&M costs. Some of the key identified factors that affect WTP for surface water relate to farm ownership, access to groundwater resources, cropping patterns, farmers' agricultural training and risk exposure.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63447c163566c9d087414a9e9deac323",
  "timestamp": "2025-05-15T03:13:30.648793"
}