{
  "id": 2681,
  "title": "Engaging Youth Through Digital Badges to Promote Health in Underserved Communities",
  "abstract": "The CHAMPIONS NETWork program trains Chicago high school students as health advocates while preparing them to become future health professionals. We added digital badging to the curriculum in its third year of programming (2018). This article describes methods and student feedback about digital badging, allowing others to implement similar technology-driven opportunities to engage youth and promote healthy living. Program staff created seven online experiences (XPs) on health advocacy that made up a playlist. Students adopted three adults as clients and completed four XPs themselves and three with clients. Completion of all XPs resulted in a digital badge-an electronic portfolio of health advocacy experiences to be shared with employers and colleges. Following the 2019 cohort's completion of the digital badge, we conducted two focus groups with students about their feedback on the digital badge. Results showed that students most liked the healthy eating and cardiopulmonary resuscitation XPs. They had more positive reactions to the experience than negative, and especially appreciated aspects of active learning, as well as the badge's long-term benefits. This technology can potentially help any student with access to an electronic device become a health advocate, and could become a new tool for career development while improving population health.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63574b585b049a502c832020083dcb1b",
  "timestamp": "2025-05-15T01:09:14.971081"
}