{
  "id": 3113,
  "title": "A Data-Driven Residential Transformer Overloading Risk Assessment Method",
  "abstract": "Residential transformer population is a critical type of asset that many electric utility companies have been attempting to manage proactively and effectively to reduce unexpected transformer failures and life loss that are often caused by overloading. Within the typical power asset portfolio, the residential transformer asset is often large in population, has the lowest reliability design, lacks transformer loading data, and is susceptible to customer loading behaviors, such as adoption of distributed energy resources and electric vehicles. On the bright side, the availability of more residential service operation data along with the advancement of data analytics techniques has provided a new path to further our understanding of residential transformer overloading risk statistically. This paper develops a new data-driven method that combines transformer temperature rise and insulation life loss simulation model with clustering analysis technique. It quantitatively and statistically assesses the overloading risk of residential transformer population in one area and suggests proper risk management measures according to the assessment results. Multiple application examples for a Canadian utility company have been presented and discussed in detail to demonstrate the applicability and usefulness of the proposed method.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6358528fbabdd19f28acb65e763caa4e",
  "timestamp": "2025-05-15T01:13:45.201371"
}