{
  "id": 7471,
  "title": "Bitcoin and gold price returns: A quantile regression and NARDL analysis",
  "abstract": "This research analyses the sensitivity of Bitcoin returns to changes in gold price returns and some other international risk factors such as US stock market returns, interest rates, crude oil prices, the volatility index of the American stock market (VIX) and the Saint Louis financial stress index (STLFSI). This study applies the quantile regression approach for the 2010-2018 period. For robustness, this paper splits the whole sample period into two different subsamples: a more volatile and a less volatile sub-period. Moreover, to capture both long- and short-run asymmetries between Bitcoin and gold price returns, an asymmetric nonlinear cointegration approach (NARDL) is applied. The results evidence that the most relevant risk factor is the VIX index, followed by changes in the STLFSI stress index, and both show negative and statistically significant effects on Bitcoin returns in most periods and quantiles. The US stock market returns have statistically significant effects (with positive sign) on Bitcoin returns in all periods and specifically in high quantiles. Bitcoin returns show negative statistically significant sensitivity to changes in nominal interest rates in the highest quantile and the full period. Moreover, Bitcoin returns show negative and statistically significant sensitivity to oil returns at low quantiles, by serving as a safe-haven asset during economic turmoil. Therefore, in general, the sensitivity of Bitcoin returns to movements in international risk factors tends to be more pronounced in extreme market conditions (bullish and bearish scenarios), showing the highest explanatory power in the lowest quantile. Finally, we have applied the non-linear ARDL approach to analyse the long- and short-run relations between Bitcoin and gold price returns and have found a positive and statistically significant connectedness between them.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63713435a6487802785da8c8d8edc6cc",
  "timestamp": "2025-05-15T03:09:07.236006"
}