{
  "id": 6411,
  "title": "Post-earthquake spiritual well-being and depression levels of postpartum women in Turkey",
  "abstract": "This study was carried out to examine the spiritual well-being and depression levels of postpartum women following the two major earthquakes that occurred in 2023 with the epicenter Kahramanmara & scedil; in Turkey. This cross-sectional analytical study was conducted with the participation of 345 postpartum women admitted to the maternity ward of a medical faculty hospital in the provincial center of Kahramanmara & scedil; in Turkey between June and September 2023. Data were collected using the Spiritual Well-Being Scale (SWBS) and the Edinburgh Postnatal Depression Scale (EPDS). Independent-samples t-tests, Pearson's correlation tests, and simple linear regression analysis were used in the analyses. It was determined that 48.7% of the participants were at risk of postpartum depression. The participants whose relatives were lost/injured in the earthquakes and those who experienced financial losses had significantly lower total SWBS scores and significantly higher total EPDS scores (p < 0.05). A negative and statistically significant relationship was found between the total SWBS and total EPDS scores of the participants (p < 0.001). In this study, it was determined that after the Kahramanmara & scedil; earthquakes in 2023, almost one in every two postpartum women was at risk of depression, and their earthquake experience affected their mental health and spiritual well-being negatively. Moreover, as the spiritual well-being of the postpartum women increased, their risk of postpartum depression decreased.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "637a32611864da975192025d4b867b39",
  "timestamp": "2025-05-15T02:57:38.870144"
}