{
  "id": 6336,
  "title": "Comprehensive Risk Analysis of Emergency Medical Response Systems in Serbian Healthcare: Assessing Systemic Vulnerabilities in Disaster Preparedness and Response",
  "abstract": "Background/Objectives: Emergency Medical Response Systems (EMRSs) play a vital role in delivering medical aid during natural and man-made disasters. This quantitative research delves into the analysis of risk and effectiveness within Serbia's Emergency Medical Services (EMS), with a special emphasis on how work organization, resource distribution, and preparedness for mass casualty events contribute to overall disaster preparedness. Methods: The study was conducted using a questionnaire consisting of 7 sections and a total of 88 variables, distributed to and collected from 172 healthcare institutions (Public Health Centers and Hospitals). Statistical methods, including Pearson's correlation, multivariate regression analysis, and chi-square tests, were rigorously applied to analyze and interpret the data. Results: The results from the multivariate regression analysis revealed that the organization of working hours (beta = 0.035) and shift work (beta = 0.042) were significant predictors of EMS organization, explaining 1.9% of the variance (R2 = 0.019). Furthermore, shift work (beta = -0.045) and working hours (beta = -0.037) accounted for 2.0% of the variance in the number of EMS points performed (R2 = 0.020). Also, the availability of ambulance vehicles (beta = 0.075) and financial resources (beta = 0.033) explained 4.1% of the variance in mass casualty preparedness (R2 = 0.041). When it comes to service area coverage, the regression results suggest that none of the predictors were statistically significant. Based on Pearson's correlation results, there is a statistically significant correlation between the EMS organization and several key variables such as the number of EMS doctors (p = 0.000), emergency medicine specialists (p = 0.000), etc. Moreover, the Chi-square test results reveal statistically significant correlations between EMS organization and how EMS activities are conducted (p = 0.001), the number of activity locations (p = 0.005), and the structure of working hours (p = 0.001). Conclusions: Additionally, the results underscore the necessity for increased financial support, standardized protocols, and enhanced intersectoral collaboration to strengthen Serbia's EMRS and improve overall disaster response effectiveness. Based on these findings, a clear roadmap is provided for policymakers, healthcare administrators, and EMS personnel to prioritize strategic interventions and build a robust emergency medical response system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "638bc774dbe9acba9a3a61b20b5999b8",
  "timestamp": "2025-05-15T02:57:07.694263"
}