{
  "id": 880,
  "title": "RETRACTED: Risk analysis method of bank microfinance based on multiple genetic artificial neural networks (Retracted article. See DEC, 2022)",
  "abstract": "As a supplement to the financing of small- and medium-sized enterprises, bank microfinance companies are nonbank financial institutions, and it has played an active role in maintaining the stability of financial markets. However, in the course of the operation of microfinance companies, due to the lack of careful management and risk control, the problem of risk management has become increasingly prominent. The purpose of this paper is to study the microfinance risk based on polygenic artificial neural network, and it provides theory and practice application for risk management of microcredit enterprises. Taking the risk management of China's microfinance companies as the research object, on the basis of previous studies, this paper analyzes the risks of bank microfinance companies. Secondly, the basic theory of neural network model and its transformation function are introduced, and the learning method of neural network. At the same time, the learning algorithm of neural network and its improved algorithm are mainly introduced. It lays a theoretical foundation for the follow-up empirical research. Then, through the empirical study of data-based risk assessment of microcredit of farmers, the sample data are divided into training samples and test samples for comparison. Then, we use MATLAB software to establish a neural network model for farmers' microcredit risk assessment. Finally, in order to make the neural network model of farmers' credit risk assessment better popularize and apply, and effectively reduce the credit risk of farmers' microcredit. The corresponding policy suggestions are put forward, which proves the validity and applicability of the neural network in the field of farmers' microcredit risk assessment. It provides a good basis for rural credit cooperatives to identify the credit risk of farmers.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6390cd3a33b33629b9c555abce8a0bf4",
  "timestamp": "2025-05-15T01:56:17.513772"
}