{
  "id": 4313,
  "title": "The Compounding Effect of Investors' Cognition and Risk Absorption Potential on Enhancing the Level of Interest towards Investment in the Domestic Capital Market",
  "abstract": "It is eminent to understand, be aware of and encourage domestic retail investors towards investment in the capital market in a developing economy such as India for tackling the situation of capital insufficiency and financial instability. Therefore, the study was purposed to find out the different dimensions of cognition that affect investment attitude and the different characteristics of risk absorption affecting the investment decision making. The study also intended to find the direct and the mediating impact of investors' cognition directly and through risk-absorption scenarios on the level of interest on investment. The study used the causative research design and by using stratified random sampling, received 392 responses from investors with risk-absorption characteristics from four strata of Odisha (a state of India) through a self-constructed questionnaire. Factor analysis was used to find out the factor of cognition and risk absorption. Multiple linear regression was used to find out the effect of both factors of cognition and risk absorption on the intensity of purchase financial product or level of interest in investment. Mediation analysis was used to find the mediating impact showing the direct and indirect impact of cognition on interest in investment and through the factors risk absorption. The study found that the dimensions of cognition (hot, cold, social and meta) have a significant impact on the level of interest towards investment, so financial product sellers must use these dimensions and sources of cognition to bring up interest from the domestic investor to invest in the domestic capital market. It has also been found that the risk-absorption characteristics play a mediating and vital role in the relation between investors' cognition and level of interest in investment. Therefore, it is imperative to uplift the risk-absorption capacity through different dimensions of cognition and sources of information, which can reflect in a better understanding of the market and investment scenarios.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63961ea1c5ee148c96ce9efb0a5eb772",
  "timestamp": "2025-05-15T02:36:05.132381"
}