{
  "id": 5718,
  "title": "Investment in renewable energy and electricity output: Role of green finance, environmental tax, and geopolitical risk: Empirical evidence from China",
  "abstract": "The global financial downturn induced by COVID-19 has hampered the effectiveness of renewable energy developments, impeding the accomplishment of the United Nations' sustainable development targets. Green finance is a significant means for promoting renewable energy investment and achieving sustainability. Using data from 2012 to 2021 from fifty energy firms in China, this study highlights the starring part of geopolitical risk, green finance, and environmental tax in investment in renewable energy (IRE) sources. It also investigated how IRE impacts the studied firms' electricity output. The data were analyzed through quantile regression and dynamic analysis techniques. The results indicated that green financing and environmental tax significantly impact IRE sources with 0.137*** and 0.428*** beta values, respectively. However, geopolitical risk significantly impedes such projects. Similarly, IRE significantly increases the electricity output of Chinese energy firms. This research is unique in the sense of studying green financing, geopolitical risk, and environmental tax nexus in renewable energy investments leading to electricity generation, which shows a pivotal role in achieving environmental sustainability and provides valuable insights to environmentalists and policymakers to design and implement ecological strategies leading to achieving sustainable development goals.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "639aa4050e34c1f0ee9b34e7c02626dc",
  "timestamp": "2025-05-15T02:50:53.853340"
}