{
  "id": 5682,
  "title": "Does guanxi in China always produce value? The contingency effects of contract enforcement and market turbulence",
  "abstract": "Purpose - The purpose of this study is to reconcile the positive, non-significant and even negative effects of guanxi on firm performance from two aspects. First, it explores the linear and curvilinear relationships between guanxi and distinct performance dimensions. Second, it examines the moderating effects of both exchange-related behavioral risk (reflected by contract enforcement in this study) and market-related environmental risk (reflected by market turbulence in this study) on the above relationship. Design/methodology/approach - Based on data for 206 samples collected from distributors of house furnishings, computers and their components, a moderated regression is used to test the hypotheses. Findings - The empirical test generally supports the conceptual model and demonstrates three findings. First, guanxi has a linear, positive effect on financial performance and an inverted U-shaped effect on strategic performance. Second, contract enforcement decreases the effect of guanxi on financial performance and enhances its effect on strategic performance. Third, market turbulence enhances the effect of guanxi on financial performance and weakens its effect on strategic performance. Research limitations/implications - First, this study collects data only from China. Future studies should collect data from other emerging markets to allow for either model validation or cross-country comparisons. Second, the data come only from buyers, and suppliers' viewpoints are not included. Third, in addition to contract enforcement and market turbulence, other important contingencies should be considered in the guanxi-performance link. Practical implications - The results provide important implications for managers to manage guanxi in an emerging economy. Managers should be very clear about their primary goal (i.e. pursuing short-term financial revenue or long-term strategic targets); next, they should understand how to match guanxi with various levels of contract enforcement and market turbulence to achieve that goal. Originality/value - First, prior research has documented guanxi's role in channel relationships, but it has not achieved consistent conclusions. Second, although existing studies have analyzed the contingencies of guanxi at the firm level, market level and institutional level, another important contingency the dyadic relationship condition is rarely considered. Third, although the extant research has realized the value of guanxi contingent on various market conditions, conflicting views exist. This study contributes by addressing these issues.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63a85b69f378c376affd0961d36a148b",
  "timestamp": "2025-05-15T02:50:21.218814"
}