{
  "id": 8502,
  "title": "Opportunities and barriers for providing HIV testing through community health centers in mainland China: a nationwide cross-sectional survey",
  "abstract": "Background: Primary care may be an avenue to increase coverage of HIV testing but it is unclear what challenges primary healthcare professionals in low- and middle-income countries face. We describe the HIV testing practices in community health centres (CHCs) and explore the staff's attitude towards further development of HIV testing services at the primary care level in China. Methods: We conducted a national, cross-sectional survey using a stratified random sample of CHCs in 20 cities in 2015. Questionnaires were completed by primary care doctors and nurses in CHCs, and included questions regarding their demographics, clinical experience and their views on the facilitators and barriers to offering HIV testing in their CHC. Multivariate logistic regression was conducted to examine the association between staff who would offer HIV testing and their sociodemographic characteristics. Results: A total of 3580 staff from 158 CHCs participated. Despite the majority (81%) agreeing that HIV testing was an important part of healthcare, only 25% would provide HIV testing when requested by a patient. The majority (71%) were concerned about reimbursement, and half (47%) cited lack of training as a major barrier. Almost half (44%) believed that treating people belonging to high-risk populations would scare other patients away, and 6% openly expressed their dislike of people belonging to high-risk populations. Staff who would offer HIV testing were younger (adjusted odds ratio (aOR) 0.97 per year increase in age, 95% confidence interval (CI):0.97-0.98); trained as a doctor compared to a nurse (aOR 1.79, 95%CI:1.46-2.15); held a bachelor degree or above (aOR 1.34, 95%CI:1.11-1.62); and had previous HIV training (aOR 1.55, 95%CI:1.27-1.89). Conclusions: Improving HIV training of CHC staff, including addressing stigmatizing attitudes, and improving financial reimbursement may help increase HIV testing coverage in China.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63ad7ec8426ea523aa035ee1f4cc82ac",
  "timestamp": "2025-05-15T03:19:21.366008"
}