{
  "id": 4377,
  "title": "Developing technologies and areas of interest in lung cancer screening adjuncts",
  "abstract": "Lung cancer remains the leading cause of cancer mortality. Screening guidelines have been implemented in the past decade to aid in earlier detection of at -risk groups. Nevertheless, computed tomography (CT) scans, the principal screening modality in use today, are still low yield, with 3.6% of lung cancer confirmed amongst 39.1% of lesions detected over a 3 -year period. They also carry relatively high false positive rates, between 9% and 27%, which can bear unnecessary financial and emotional costs to patients. As such, research efforts have been dedicated to the development of lung cancer screening adjuncts to improve detection reliability. We herein review several emerging technologies in this specific arena and their efficacy. These include plasma markers (microDNA, DNA methylation, and tumor -associated antibodies), breath/sputum biomarkers [volatile organic compounds (VOCs) and exhaled breath condensate (EBC)], proteomics, metabolomics, and machine learning, such as radiomics technology. We find that, across the board, they offer promising results in terms of non-invasive diagnostics, genetic sequencing for higherrisk individuals, and accessibility for a diverse cohort of patients. While these screening adjuncts are unlikely to completely replace the current standard of care at the moment, continued research into these technologies is crucial to improve and personalize the identification, treatment, and outcome of lung cancer patients in the near future.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63ce1ca79b7f385622d166c90d9cbf5b",
  "timestamp": "2025-05-15T02:36:38.403452"
}