{
  "id": 9308,
  "title": "The association between health insurance status and utilization of health services in rural Northern Ghana: evidence from the introduction of the National Health Insurance Scheme",
  "abstract": "Background: Many households in low-and middle-income countries face financial hardships due to payments for health care, while others are pushed into poverty. Risk pooling and prepayment mechanisms help to lessen the impact of the costs of care as well as assisting to achieve universal health coverage (UHC). Ghana implemented the National Health Insurance Scheme (NHIS) for the promotion of access to health services for all Ghanaians. In this paper, we examined the association between health insurance status and utilization of outpatient and inpatient health services in rural poor communities. Methods: The study was a cross-sectional household survey conducted in the Kassena-Nankana districts of Northern Ghana. We conducted interviews in 11,175 households and collected data on 55,992 household members. Multiple logistic regression models were used to identify factors associated with the utilization of outpatient and inpatient health services. The dependent variables were the utilization of outpatient and inpatient health services. We adjusted for several potential socio-demographic factors associated with utilization and health insurance status. Results: Significantly, the insured had 2.51 (95% CI 2.3-2.8) and 2.78 (95% CI 2.2-3.6) increased odds of utilizing outpatient and inpatient health services respectively. Respondents with a history of recent illness or injury [32.4 (95% CI 29.4-35.8) and 5.72 (95% CI 4.6-7.1)] and poor or very poor self-reported health status [2.08 (95% CI 1.7-2.5) and 2.52 (95% CI 1.9-3.4)] and those on chronic medication [2.79 (95% CI 2.2-3.5) and 3.48 (95% CI 2.5-4.8)] also had increased odds of utilizing both outpatient and inpatient health services respectively. Among the insured, the poorest use the Community-based Health Planning and Services (CHPS) compounds, while the least poor use private clinics and public hospitals for outpatient health services. The uninsured predominately use pharmacies or licensed chemical shops (LCSs). For inpatient health services, the insured largely use public hospitals, with the uninsured using private clinics or public health centres. Conclusion: The findings suggest that being insured with the NHIS is associated with increased utilization of outpatient and inpatient health services in the study area. Overall, the NHIS can be an effective tool for achieving UHC and hence pragmatic efforts should be made to sustain it.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63cfd7b7826a14c33344a913b37e55c1",
  "timestamp": "2025-05-15T03:27:25.127776"
}