{
  "id": 309,
  "title": "Bankrupcy Risk Forecast Based on Company Balance Sheet Data Using Machine Learning",
  "abstract": "Estimating the risk of bankruptcy of a company has significant economic impact for its owners, investors. In order to determine the risk of bankruptcy or, in other words, success or failure of the company in the future, different models are presented in the literature. The two prominent ones are the Ohlson O-score and the Altman Z-score models. Instead of evaluating all the balance sheets published in the past, these models estimate the bankruptcy risk, taking into account the latest published balance sheet, ie local data rather than historical data. The purpose of this study is to evaluate the risk of bankruptcy risk of the companies, the effect of the performance of the company in the past years, taking into account the effect of more successful estimates can be done. Therefore, the machine learning model has been formed and the predicted success of the model has been investigated on the balance sheet data, which is the label of the company on the risk of bankruptcy in previous periods. In the pre-processing stage of the model, the Information Gain and Principle Component Analysis approaches for the selection of attributes; Logistic Regression, Support Vector Machine and Random Forest are used as machine learning algorithm. The results revealed that a model learning from the previous balance sheet data estimates more successful bankruptcy risk than the financial models that decide on the basis of local data.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63e62315d13d69f4397db887e9dd8c1c",
  "timestamp": "2025-05-15T01:49:04.698200"
}