{
  "id": 9286,
  "title": "Knowledge, Concerns, and Psychological Distress Among Caregivers of Patients Seeking Emergency Medical Care for Non-COVID-19-Related Illness During the COVID-19 Pandemic: A Cross-Sectional Study",
  "abstract": "IntroductionDuring the active phase of the COVID-19 pandemic, the global healthcare system failed to meet the increased demand for healthcare resources, infrastructures, and facilities. The brunt of the healthcare crisis was faced not only by COVID-19 victims; a large majority of non-COVID patients were deprived of routine and emergency care. Factors that possibly affected resource utilization, healthcare-seeking behavior, service delivery patterns, and national health systems' priority during the pandemic were the knowledge and attitudinal concerns related to the COVID-19 disease and its control measures. Here, we evaluated the knowledge, concern, and psychological distress among the caregivers of the patients attending the emergency department at a tertiary healthcare center in India.MethodologyWe conducted a survey-based study using a pre-validated questionnaire on the caregivers of the patients visiting the emergency department (ED) from June to September 2020 (during the first wave of the COVID-19 pandemic). The demographic details and responses of the participants were documented in the semi-structured proforma. A pre-validated COVID-19 Peritraumatic Distress Index (CPDI) questionnaire was used to assess psychological stress.ResultsOut of 1014 participants interviewed, the majority were male attendants (72%), aged 18-45 (82%), and seeking medical attention for patients with chronic illnesses (76%). Acute onset emergencies like stroke, myocardial infarction, trauma, etc. were the ED presentation in only one-fifth of patients. COVID-19-related knowledge was adequate for questions related to age groups at risk for the viral infection (97% agreed that all age groups were at risk), mode of transmission (75-90% were aware of the common modes of transmission), and >65% knew the common symptoms of COVID-19 infection. However, only 38.5% knew about frequent handwashing as a protective measure. More than half of the participants considered the COVID-19 vaccine as the sole ray of hope and disregarded the effectiveness of alternative medicines such as Ayurvedic/homeopathic/allopathic medicines as preventive options. One-third were first-time visitors to the hospital, while two-thirds of all participants were afraid to visit any hospital during the COVID-19 pandemic. The majority (84%) faced difficulty in accessing the index tertiary care center due to transport, socioeconomic support, or lockdown-related restrictions. In comparison, 60% reported some form of discrimination at almost all levels of healthcare settings due to COVID-19-related priority changes. Nearly half (48%) of all enrolled caregivers reported experiencing mild-to-moderate distress (CPDI score=28-51), and 15.7% felt severe distress (CPDI score >51) while seeking treatment for the non-COVID-19 illness of their patient. Age and socioeconomic status were significantly associated with COVID-19-related psychological distress levels (p<0.001 in logistic regression), while gender, education, and residence showed no significant associations.ConclusionMost of the patient caregivers visiting the emergency department during the COVID-19 pandemic had an adequate understanding of risk factors and preventive measures. The major barriers to accessing healthcare facilities were transport, financial issues, and lockdown-related restrictions. Almost two-thirds of the caregivers revealed mild-to-moderate to severe psychological distress due to the pandemic and lockdown-related concerns.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63ebe59c14bf4719fc35e121a9a373c8",
  "timestamp": "2025-05-15T03:27:24.981007"
}