{
  "id": 8176,
  "title": "ECONOMICS AND RISK MANAGEMENT OF BIOFUEL PRODUCTION IN AGRICULTURE",
  "abstract": "The development of the biofuel market in the world has a positive dynamic for growth. The substantiation of the directions of further improvement of the methodology of production management of alternative fuels is taking into account the policy of climate change and the possibility of reducing dependence on external suppliers of traditional fuels. Ukraine has favorable natural and climatic conditions for the development of production of non-traditional fuels. The most common crops that can be grown in Ukraine for biofuels are rapeseed and corn. Based on the material and technical base and production conditions, rapeseed is the best crop for cultivation. Therefore, the object that we have chosen for this study is the production of biodiesel, which does not require significant capital expenditures by agricultural enterprises. For the purposes of the study, the risks were grouped according to various classification criteria (operational and production; marketing; financial; legal and infrastructural; weather; environmental) and the weights of their impact on the performance of agricultural enterprises. The structural scheme of the algorithm of the automated estimation of influence of risk factors for development of bases of the analysis and management of risks of production of biodiesel is constructed. The author's method of calculating the impact of the risk complex takes into account the limit values of the intervals of fuzzy quantities. To preserve soil fertility and reduce the corresponding risks, the proportion of rapeseed in growing areas should be at the limit of 17-18% (when also growing sunflower the upper limit is 12%), then all three analyzed farms can not only use their own land for rapeseed crops, but also, if necessary, rent the necessary plot, or, according to the results of the relevant analysis, its part. In some cases, farms even purchase some of the seeds needed to load the equipment. The results of calculations of the cost of production of biofuels showed that the increase in the cost for small and medium producers is not significant compared to large producers.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "63f9f4b9d9e7a5fa8e9dd5a3e8f60e33",
  "timestamp": "2025-05-15T03:16:17.369912"
}