{
  "id": 6579,
  "title": "Variation in sensitivity of aquatic species to toxicants: Practical consequences for effect assessment of chemical substances",
  "abstract": "This study addresses the relation between the sensitivity of aquatic species and mode of action of different classes of organic chemicals. We analyzed large data sets of ecotoxicological information to reveal the interspecies variation in sensitivity, to relate this variation to the compounds' mode of action, and to explain the observed patterns using general biological information. Here we present a general framework and recommendations for risk assessment procedures. We recommend the use of toxicologically based classification schemes at an early stage of the risk assessment procedure. Screening programs are most efficiently run when only one species per compound is tested to prioritize substances. The toxicity of compounds belonging to the class of nonpolar narcotics is highly predictable and shows little interspecies variation. For these compounds quantitative structure-activity relationships (QSARs) can be used to estimate effect levels. Most effort should be put into testing reactive compounds and compounds with a specific mode of action as toxicity to some species can be 10(5)-10(6) times higher compared with less sensitive species. The use of assessment factors in effect assessment procedures may lead to an underestimation of effects on the more sensitive species. For many priority pollutants there is little information on their ecotoxicity. Predictive techniques are needed to compensate for this lack of data. Knowledge of the relation between modes of action of compounds and interspecies variation in sensitivity should be integrated in risk assessment procedures in order to make more efficient use of the limited financial resources available.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64132e5282023a22b4db6b7e360330de",
  "timestamp": "2025-05-15T02:59:36.945059"
}