{
  "id": 7419,
  "title": "Information risk and asset returns in the Korean stock market",
  "abstract": "Most asset pricing models such as CAPM, APT, and CCAPM, have been developed under the assumption of symmetric information. However, asymmetric information in the market has become an important issue in the modern finance. How does the equilibrium change if we introduce the notion of asymmetric information? The market microstructure model assumes that there are informed investors and uninformed investors in the market. The model predicts that stock with higher information asymmetry will have a higher asset return, because uninformed investors, fearing their loss to the informed, require a higher return to the stock with higher asymmetric information. If this prediction is true, there is a positive relation between information risk and asset return after adjusting other risks. The objective of this paper is to find out whether the information risk is a determinant factor of asset returns in the Korean stock market. For the analysis, we choose measures derived from three econometric models that are widely used in the market microstructure literature: the Glosten and Harris model (1998; GH), the Hasbrouck (1991), Foster and Viswanathan (1993) model (HFV), and Easley, Hvidkjaer, and O'Hara's (2002) PIN (Probability of informed trading) measure. Samples are all non-financial firms listed in the Korean stock market for the period 1993 similar to 2004. Our studies are implemented by three methodologies. These three methods and their results are summarized as follows First, we use the Fama and French (1993) three factor model to adjust the risk. After forming 25 portfolios by sorting the firms by their size (or book-to-market ratio) and information risk measure, we investigate whether the portfolio with higher information risk has higher portfolio returns adjusted by the Fama and French (1993) three factor model. This is implemented by observing the intercepts of the Fama and French (1993) three factor model for each portfolio. The result shows that the GH and HFV measure has a pattern that excess return increases as information risk increases. And F-test of Gibbons et al. (1989) also supports the significance of the GH and HFV results. However, we do not find a significant result in PIN. Second, we use the Fama and French (1992) cross-sectional regression to directly investigate whether there is a positive relation between information risk and the excess return. We add the information risk variables to the Fama and French (1993) cross-sectional regression, which includes variables such as beta, size and book-to-market ratio. The result shows that the GH and HFV measure has a positive relation with excess returns. However, we find a negative relation in PIN. Finally, we pool all data regardless of year and portfolio and regress excess returns on information risk measures. To solve the problem of errors in variables, we use GLS regressions as well as OLS regressions. The result shows that the dummy variable of portfolio with higher information risk has a higher value in case of the GH and HFV measure. But, PIN does not show a significant result. This is a controversial result because the GH and HFV measure supports the positive relation of information risk with excess return, while PIN does not support such finding. Considering the previous studies on the PIN measure in the Korean stock market, we conclude that the result from PIN is another piece of evidence that makes us doubt the reliability of PIN, instead of contradicting the positive relation of information risk with excess return. And as a robustness check, we examine the relation between excess returns and information risk measure of contemporaneous time (we call this regression 'ex-post' analysis) in the appendix. The results of three information risk measures strongly support the positive relation of information risk with excess return. Therefore, we reach two conclusions. One is that information risk operates as a factor which determines the excess return in the Korean stock market. The other is that PIN is not useful as an information risk measure in the Korean stock market. The reason why PIN does not work in Korea can be explained in two ways: the unrealistic assumption of PIN and the difference of market microstructure between Korea and the U.S. More studies on the failure of PIN in Korea will be needed in the future.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "641baf94041b70e025f2a52fd8e65a95",
  "timestamp": "2025-05-15T03:08:37.746634"
}