{
  "id": 7828,
  "title": "Factors affecting adoption of improved method in large cardamom curing and drying and its impact on household income in the Eastern Himalayan road-corridor of Nepal",
  "abstract": "This paper examines the adoption of an improved method of curing and drying of large cardamom, a technology that has recently been introduced at the farm level in the Eastern Himalayan road corridor of Nepal. A probit model was applied to assess factors influencing the adoption of an improved method of curing and drying by using household data of 300 farmers in Taplejung district obtained in 2019. Further, the income regression model was used to investigate factors influencing annual household income from large cardamom. Findings revealed that the adoption of an improved method of large cardamom drying was mostly determined by access to credit from the financial institutions while controlling other explanatory variables. Such adoption of an improved method of large cardamom curing and drying resulted in more than twofold increase in household income from large cardamom. An instrumental variable approach was applied to check the robustness of the findings. The findings revealed that household income from large cardamom, risk aversion of farmers, age, access to credit, access to technical services, experience of farmers on large cardamom farming significantly contributed in the adoption of improved methods in curing and drying; and improved methods of drying and concrete type of houses structure contributed to household income from large cardamom. The impact of the adoption of improved methods of curing and drying boosted the household income by 432% from the large cardamom as compared to traditional methods using instrumental variable model whose contribution was only 34.3% in OLS regression. These findings suggested that the promotion of an improved method of curing and drying is needed at the farm level for the increment of farmers' income and development of competitiveness of large cardamom in the global markets.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "643cbface21907006e349e0f10674986",
  "timestamp": "2025-05-15T03:12:36.427309"
}