{
  "id": 881,
  "title": "Aquifer vulnerability assessment in data-scarce areas: a spatially explicit assessment",
  "abstract": "Groundwater pollution presents a serious concern in arid and semiarid regions, where water resources are already limited. In such contexts, reliable and efficient methods for assessing groundwater vulnerability are critical. Without adequate knowledge of the vulnerability, groundwater is at greater risk of severe contamination. This not only threatens the availability of clean water but also demands significant time and financial resources for remediation and restoration. Modelling groundwater vulnerability is even more demanding and complex in data-scarce regions. Consequently, this study investigates and predicts spatial variations in groundwater quality and vulnerability within a data-scarce area by applying efficient machine learning methods that compensate for the limited availability of quality groundwater data. Supportive machine learning approaches such as bagged adaptive boosting (BAB), averaged neural network (avNNet), heteroscedastic discriminant analysis (HAD), rotation forest (RotationF), and an ensemble method were applied to assess groundwater vulnerability using k-fold cross-validation. The results demonstrate that the BAB model achieved the best performance, with both accuracy and precision exceeding 85%. Furthermore, the stacking ensemble approach, specifically the BAB model combination, increased precision by 4% and reduced false alarms by 6%. The most influential variables affecting groundwater quality include groundwater depth, precipitation, proximity to waterways and roads, topographic humidity, and the percentage of fine-grain material. The results also show that variability in the data significantly impacts the modelling performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "644a3979879d354da4131e97819d1499",
  "timestamp": "2025-05-15T01:56:17.523811"
}