{
  "id": 9203,
  "title": "The association and impact of psychological and social factors on physical activity levels amongst women in the Australian WATCH longitudinal study",
  "abstract": "Introduction: Regular physical activity is important for physical and mental health. Despite the benefits, over 30% of the global population do not meet the World Health Organisation (WHO) physical activity guidelines, with the risk greater for women, especially during reproductive years, compared to men. However, women of this age face many barriers to participation and there are significant gaps in our understanding of the impact of psychological and social adversity on participation levels. This study aimed to identify adversity factors associated with physical inactivity or reduced activity. Methods: Data from 623 women in the WATCH prospective cohort study, a representative sample of women recruited during the antenatal phase, including half from refugee backgrounds, were analyzed to assess the association between prior theoretically supported adversities (e.g., financial stress, living difficulties, intimate partner violence, refugee status and mental health issues) and current physical activity levels. Physical activity was assessed via self-report, using the Physical Activity Vital Sign. A categorical indicator was constructed to describe participants average activity per week based on WHO physical activity and muscle strengthening guidelines; inactive, below recommendation and at or exceeds recommendation. Binary multinomial logistic regression analyses were conducted to examine the crude and demographically adjusted association between each variable and physical activity with. At or exceeds recommendation as the reference group. Results: N = 122 (20 %) of the total sample reported no physical activity (0 min) during the previous week. Meanwhile, n = 445 (71 %) engaged in some physical activity but did not meet the recommended guidelines, and n = 56 (9 %) met the guidelines. The odds of being inactive were significantly higher for women from refugee backgrounds OR = 5.79, 95 % CI 2.70 to 12.41, p < .001. In addition, women who have experience previous trauma, living difficulties, or mental health symptoms had significantly higher odds of being inactive. Conclusion: High rates of physical inactivity among reproductive-age women were observed. Interventions aimed at increasing physical activity should consider adversity factors identified in this study which impact participation levels, including refugee status, trauma exposure, intimate partner violence, living difficulties, and mental disorder symtoms in their design and implementation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6456c9d8e10fd2f572e115b71c4d9ea7",
  "timestamp": "2025-05-15T03:26:26.038553"
}