{
  "id": 9143,
  "title": "Early Readmission following NICU Discharges among a National Sample: Associated Factors and Spending",
  "abstract": "Objective Infants admitted to the neonatal intensive care unit (NICU) are at increased likelihood of hospital readmission when compared with non-NICU admitted infants, resulting in appreciable financial and emotional burdens. Early readmission, days to weeks, following NICU discharge, may be preventable. Population-based data identifying potentially modifiable factors and spending associated with early readmission are lacking. Study Design We conducted a secondary data analysis of privately insured infants in the IBM MarketScan Research Database born from 2011 to 2017 in all 50 states and admitted to the NICU. We examined demographic and clinical characteristics of early readmission within 7 days and between 8 and 30 days following NICU discharge and the payments of NICU and readmission care. Data were analyzed using univariate and multivariable logistic regression. Results Of the 86,741 NICU survivors analyzed, 3,131 infants (3.6%) were readmitted by 7 days and 2,128 infants (2.5%) between 8 and 30 days. Preterm infants had reduced odds of readmission by 7 days compared with term infants. Infants transferred to a step-down facility (vs. discharge home) and those with congenital anomalies had higher independent odds of readmission by 7 and 8 to 30 days. A higher percentage of NICU infants within the lowest quartile of initial NICU length of stay (LOS) were readmitted by 7 days compared with NICU infants in the middle and highest LOS quartiles (64 vs. 36%, p < 0.01). Median payments of readmissions at 7 and 8 to 30 days was $12,785 and 14,380, respectively. Conclusion Being term, being transferred to a step-down facility, and having a congenital anomaly were risk factors for early readmission. Shorter initial NICU LOS may be a contributing factor to readmission by 7 days, especially among term infants. These findings identify factors associated with readmission with the hope of preventing early readmission, minimizing spending, and optimizing ideal timing of NICU discharge.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "645e678d138a0b66faa3cb7560b024f8",
  "timestamp": "2025-05-15T03:25:54.637713"
}