{
  "id": 1905,
  "title": "Development of Machine Learning Algorithms to Predict Patient Dissatisfaction After Primary Total Knee Arthroplasty",
  "abstract": "Background: Postoperative dissatisfaction after primary total knee arthroplasty (TKA) that requires additional care or readmission may impose a significant financial burden to healthcare systems. The purpose of the current study is to develop machine learning algorithms to predict dissatisfaction after TKA. Methods: A retrospective review of consecutive TKA patients between 2014 and 2016 from 1 large academic and 2 community hospitals was performed. Preoperative variables considered for prediction included demographics, medical history, flexion contracture, knee flexion, and outcome scores (patient-reported health state, Knee Society Score [KSS], and KSS-Function [KSS-F]). Recursive feature elimination was used to select features that optimized algorithm performance. Five supervised machine learning algorithms were developed by training with 10-fold cross-validation 3 times. These algorithms were subsequently applied to an independent testing set of patients and assessed by discrimination, calibration, Brier score, and decision curve analysis. Results: Of 430 patients, a total of 40 (9.0%) were dissatisfied with their outcome after primary TKA at a minimum of 2 years postoperatively. The random forest algorithm achieved the best performance in the independent testing set not used for algorithm development (c-statistic: 0.77, calibration intercept: 0.087, calibration slope: 0.74, Brier score: 0.082). The most important factors for predicting dissatisfaction were age, number of medical comorbidities, presence of one or more drug allergies, preoperative patient-reported health state score, and preoperative KSS. Conclusion: The current study developed machine learning algorithms based on partially modifiable risk factors for predicting dissatisfaction after TKA. This model demonstrates good discriminative capacity for identifying those at greatest risk for dissatisfaction and may allow for preoperative health optimization. (C) 2020 Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64636cf3e97b92a65f56ef7e8b735fc0",
  "timestamp": "2025-05-15T02:08:39.089315"
}