{
  "id": 292,
  "title": "Real-time seismic damage simulation for urban building portfolio based on basic building information and machine learning",
  "abstract": "Timely and accurate simulation of seismic damage of the urban building portfolio is essential for pre-earthquake planning and post-earthquake rescue. This study proposes a real-time seismic damage simulation method for the urban building portfolio based on the multiple degree-offreedom (MDOF) shear and flexural-shear model established by basic building information and machine learning. The formulas for predicting periods of six types of structures are proposed, and the surrogate model-I for predicting the critical inter-story hysteretic parameters are established to optimize the MDOF models. The surrogate model-II is established to rapidly predict the engineering demand parameters and damage states of structures under earthquakes. Regarding the generalization capability, an incremental learning strategy is advised to guarantee the accuracy of the surrogate model-II in predicting the seismic damage of other urban building portfolios. The results in two city-scale cases show that the proposed method can achieve real-time seismic damage simulation of urban building portfolio with acceptable accuracy, and it's not necessary to retrain or only needs minor additional training on the existing surrogate model when applied to other urban building portfolios.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64773dd71ee7dc2cd8c531bb1927d1a5",
  "timestamp": "2025-05-15T00:42:00.389432"
}