{
  "id": 8888,
  "title": "Risk factors of anxiety and depressive symptoms in female patients experiencing intimate partner violence",
  "abstract": "Aim. The aim of the study was to find factors associated with higher severity of anxiety and depressive symptoms in female patients experiencing intimate partner violence (IPV). Method. The study was conducted in six randomly selected primary healthcare centers in Lublin province. The HADS (Hospital Anxiety and Depression Scale) and a structured questionnaire designed by the authors were administered to a total of 350 consecutive female patients visiting a GP. Fully completed questionnaire forms were obtained from 200 women. 102 (51%) participants who confirmed experiencing IPV ultimately made up the study cohort. Sequential models were created using backward stepwise multiple regression to investigate the potential risk and the protective factors associated with higher severity of anxiety and depressive symptoms in the study group. Results. 68% and 56% of the participants respectively had positive scores on the HADS anxiety and depression subscales. Living in a small town or in the countryside was associated with higher scores on the anxiety subscale (b = -1.18, p = 0.003), but not on the depression subscale. Chronic physical illness (b = 2.42, p = 0.013; b = 2.86, p = 0.015), being unemployed (b = 0.58, p = 0.024; b = 0.69, p = 0.008), and exposure to economic violence (b = 3.97, p < 0.001; b = 3.88, p = 0.001) were associated with higher scores on both subscales of the HADS. The fact of receiving financial support (b = 2.67, p = 0.002; b = 2.68, p = 0.003) was a protective factor against both kinds of symptoms. Exposure to physical violence was associated with higher scores on the depression subscale (b = 3.09, p = 0.005), but not on anxiety subscale. Conclusions. The type of violence and socioeconomic characteristics were more strongly associated with anxiety and depressive symptoms in women experiencing IPV than demographic variables.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6482bc20f0428e77215848fef97fe121",
  "timestamp": "2025-05-15T03:23:27.830724"
}