{
  "id": 8553,
  "title": "Developing material recovery projects: Lessons learned from processing municipal solid waste incineration residues",
  "abstract": "This research explores the material recovery from bottom-ash, which is a residue from municipal solid waste incineration. The investigations aimed to characterize, evaluate, categorize and classify the development status of the recovery projects in the Canton of Zurich, including two technology pathways, i.e. dry and wet bottom-ash recovery. The temporal scale commenced with the exploration phase in 2003 and concluded with two technological pathways, both operating commercial projects in 2017. A retrospective view allowed the identification of enablers and barriers that affected the development status of the recovery projects. Further the recovery perspective allowed the results to be communicated to the United Nations Framework Classification for Resources (UNFC). The investigation showed two main trends. Firstly, the development status of the recovery projects from exploration to commercial project phase was mainly driven by the knowledge increase regarding sampling and metal characterization in bottom-ash, the readiness and effectiveness of the recovery technologies and the changes of the legal and financial environment. Secondly, the amount of recovered material (dry matter content) increased from about 6900 tons in 2003 to 16,500 tons in 2017, which is congruent with an increase in the recovery rate from 5 to 14 percent per weight. In particular, the amount of elements recoverable with an economic and environmental benefit, such as copper, gold and silver, increased. Correspondingly, the residual particular metal content in the disposable bottom-ash (fraction 2-16 mm) decreased to < 1 percent per weight dry matter and therefore reduced the risk for environmental at the sanitary landfills. The findings provide 'lessons learned' for companies, authorities and investors who intend to develop material recovery projects. Even though the recovery potentials depend on site-specific conditions, the UNFC allows comparing individual recovery projects under different boundary conditions. (C) 2020 The Authors. Published by Elsevier Ltd.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "649ff07026a3608095ddbbfa3f1e28d7",
  "timestamp": "2025-05-15T03:19:52.181695"
}