{
  "id": 6011,
  "title": "Pricing and momentum of syndicated credit in Europe",
  "abstract": "We investigate the determinants of syndicated loan prices for European borrowers, spanning the entire period of credit expansion and crisis. We construct a large data base consisting of 2102 rated syndicated loan deals from 1990 to 2008 in twenty three countries and ten economic sectors. We investigate the effects on the spread paid over the risk free rate of three major groups of factors: loan characteristics, borrower characteristics and characteristics of country of the borrower, using both qualitative and quantitative variables in a hedonic regression. The results show that all three groups are significant joint determinants of prices of syndicated credit. Our results confirm the existing literature but also provide for first time results stemming form the risk characteristics of the borrower and the country of the borrower. It is shown that distance-to-default as well as aggregate risk associated with country of the borrower are of great concern to the lenders and hence significantly affect the pricing of syndicated loans. Furthermore, we report that financial institutions and public utilities are able to negotiate for cheaper loans, but this result is reversed when financing is for acquisition purposes. Overall, risk, liquidity, solvency and sustainable performance by both the borrower and its domicile country are key determinants of syndicated loan prices. (C) 2009 Elsevier Ltd. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64ae25bef4c6e32ecc8171fec4e36142",
  "timestamp": "2025-05-15T02:53:33.515379"
}