{
  "id": 4117,
  "title": "Techno-economic assessment of biomass combustion technologies to generate electricity in South America: A case study for Bolivia",
  "abstract": "Agricultural residues, although widely available, are an unused source of energy in Bolivia. Although the government of Bolivia plans to increase the share of renewables in the power portfolio, none of the proposed projects includes agricultural residues as a source of electricity. The present study investigated the techno-economics of a biomass-based electricity generation facility, including the optimum facility size and the levelized cost of electricity from agricultural residues in Bolivia. The biomass feedstocks are the residues from harvesting sugarcane, soybean, corn, rice, sorghum, and sunflower. A novel framework was developed to geographically locate biomass collection points (BCPs), sites for collecting/storing biomass on roadsides using a model developed using GIS. The cost components are the costs of harvesting biomass from fields, baling, transportation to BCPs, storage, nutrient replacement, the premium paid to the farmer, and capital cost for the plant. The transportation costs were estimated using a detailed GIS study through the analysis of the actual mad network, and the transportation costs were optimized. Regression models were developed to assess the capital costs of the combustion plants. The conversion technologies considered for Bolivia were grate-firing and fluidized bed combustion. A novel integrated framework, named ENergy from BIOmass Techno Economic Model (ENBIOTEM), was developed. Using this model, we estimated the energy cost to be 71.6 $/MWh for an optimal plant capacity of 300 MW. The main barrier against promoting renewables in Bolivia is the fossil fuel subsidy. Although biomass is currently not competitive with fossil fuels in Bolivia, the results provide information to decision makers for future planning.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64af3219c7d5bbd4c17b138dd21d482f",
  "timestamp": "2025-05-15T01:23:58.079923"
}