{
  "id": 6022,
  "title": "The impact of reverse jeonse incidents on the risk of nonreturn of security deposits: an empirical analysis of the South Korean housing market",
  "abstract": "PurposeThis study aims to analyze the impact of reverse jeonse on the risk of nonreturn of security deposits in the South Korean housing market. Reverse jeonse refers to a situation where the market price of a jeonse contract drops below the agreed price, which increases the likelihood of landlords being unable to return deposits.Design/methodology/approachThe analysis uses data from 17 South Korean regions, covering apartments and multifamily dwellings from 2017 to 2022. Key indicators of nonreturn risk include leasehold registration orders, court auctions and jeonse deposit guarantee incidents. A panel regression model is applied to quantify the correlation between reverse jeonse incidents and the increased risk of nonreturn.FindingsThe study finds that an increase in reverse jeonse incidents correlates with a higher frequency of leasehold registration orders, court auctions and deposit guarantee cases, particularly after 2021. Economic disruptions and policy changes exacerbated landlords' financial burdens, highlighting the need for interventions to stabilize the jeonse market.Practical implicationsThe findings suggest strengthening jeonse deposit guarantee schemes and refining legal procedures to mitigate the risk of nonreturn. Policy recommendations include targeted interventions to stabilize the market and protect tenant deposits.Originality/valueThis study fills a gap in existing literature by empirically linking reverse jeonse to the nonreturn of deposits and offering data-driven policy recommendations to ensure market stability and tenant protection.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64b80570ce3792f9af4af6973a9db498",
  "timestamp": "2025-05-15T02:54:03.345081"
}