{
  "id": 7940,
  "title": "Relationship of public farmland and timberland REITs with their private equity counterparts and selected asset classes",
  "abstract": "Purpose The purpose of this study is to examine the return sensitivity of public farmland and timberland real estate investment trusts (REITs) to private-equity farmland, timberland and real estate, long-term corporate bonds and large- and small-cap stocks. The study also examines time-dependent contributions of selected asset classes to farmland and timberland REIT volatility. Design/methodology/approach The authors use a multi-factor asset pricing model under a seemingly unrelated regression framework to evaluate farmland and timberland REIT returns, and a state-space model with the Kalman filter to evaluate the time-dependent contributors of farmland and timberland REIT volatility. The authors first perform orthogonalized regressions to obtain pure independent factors, and then decompose volatility into individual asset components. Findings Significant loadings on financial assets are found for both farmland and timberland REITs, suggesting that they are generally driven by some common state variables. Large-cap stocks are found to be the major contributor of farmland and timberland REIT volatility, despite some differing patterns over time. Originality/value Empirical analysis of farmland REIT is very scarce. The authors compare the risk-return characteristics of farmland and timberland REITs under a state-space framework with the Kalman filter. This study can improve the understanding of the roles of farmland and timberland REITs in a multi-asset portfolio.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64bd1954d35d696930571dc0cccdd7c4",
  "timestamp": "2025-05-15T03:13:30.686166"
}