{
  "id": 4239,
  "title": "The impact of corporate ownership structure on corporate risk disclosure: evidence from an emerging economy",
  "abstract": "Purpose - The aim of this study is to measure the risk disclosure level and to determine the relationship between ownership structure dimensions (institutional ownership, foreign ownership and family ownership) and corporate risk disclosure in Jordan. Design/methodology/approach - This study used a sample of 94 Jordanian listed firms from the Amman Stock Exchange for the period from 2014 to 2017. This study measured risk disclosure using the number of risk-related sentences in the annual report, while random effects regression was used for hypotheses testing. Findings - The results revealed that family ownership has a negative effect on risk disclosure practices, but institutional ownership, foreign ownership, firm size and leverage have no significant effect on the risk disclosure level. Practical implications - The finding of this study is more likely be useful for many concerned parties, researchers, authorities, investors and financial analysts alike in understanding the current practices of the risk disclosure in Jordan, thus helping them in reconsidering and reviewing the accounting standards and improving the credibility and transparency of the financial reports in the Jordanian capitalmarket. Originality/value - This study offers novel evidence detailing the impact of ownership structure toward corporate risk disclosure, its implementation in emerging markets following the minimal amount of scholarly efforts on the topic. To the best of the authors' knowledge, this is the first examination of the impact of ownership structure on corporate risk disclosure. Thus, this study has important implications for the decisions of executives, policymakers, shareholders and lenders, as it enables them to better understand the linkage between ownership structure on corporate risk disclosure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64cdcf328824c3213e9853bbba4112eb",
  "timestamp": "2025-05-15T02:34:48.919158"
}