{
  "id": 1303,
  "title": "A Self-Learning Based Preference Model for Portfolio Optimization",
  "abstract": "An investment in a portfolio can not only guarantee returns but can also effectively control risk factors. Portfolio optimization is a multi-objective optimization problem. In order to better assist a decision maker to obtain his/her preferred investment solution, an interactive multi-criterion decision making system (MV-IMCDM) is designed for the Mean-Variance (MV) model of the portfolio optimization problem. Considering the flexibility requirement of a preference model that provides a guiding role in MV-IMCDM, a self-learning based preference model DT-PM (decision tree-preference model) is constructed. Compared with the present function based preference model, the DT-PM fully considers a decision maker's bounded rationality. It does not require an assumption that the decision maker's preference structure and preference change are known a priori and can be automatically generated and completely updated by learning from the decision maker's preference feedback. Experimental results of a comparison show that, in the case that the decision maker's preference structure and preference change are unknown a priori, the performances of guidance and fitness of the DT-PM are remarkably superior to function based preference models; in the case that the decision maker's preference structure is known a priori, the performances of guidance and fitness of the DT-PM is approximated to the predefined function based model. It can be concluded that the DT-PM can agree with the preference ambiguity and the variability of a decision maker with bounded rationality and be applied more widely in a real decision system.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64dc8b5e2219afa7e4d95a6d4f01730a",
  "timestamp": "2025-05-15T00:54:24.624205"
}