{
  "id": 4309,
  "title": "The three-factor model and artificial neural networks: predicting stock price movement in China",
  "abstract": "Since the establishment of the Shanghai Stock Exchange (SHSE) in 1990 and the Shenzhen Stock Exchange (SZSE) in 1991, China's stock markets have expanded rapidly. Although this rapid growth has attracted considerable academic interest, few studies have examined the ability of conventional financial models to predict the share price movements of Chinese stock. This gap in the literature is significant, given the volatility of the Chinese stock markets and the added risk that arises from the Chinese legal and regulatory environment. In this paper we address this research gap by examining the predictive ability of several well-established forecasting models, including dynamic versions of a single-factor CAPM-based model and Fama and French's three-factor model. In addition, we compare the forecasting ability of each of these models with that of an artificial neural network (ANN) model that contains the same predictor variables but relaxes the assumption of model linearity. Surprisingly, we find no statistical differences in the forecasting accuracy of the CAPM and three-factor model, a result that may reflect the emerging nature of the Chinese stock markets. We also find that each ANN model outperforms the corresponding linear model, indicating that neural networks may be a useful tool for stock price prediction in emerging markets.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64de14d7e5a346f0d73397cda3b961c8",
  "timestamp": "2025-05-15T02:35:26.364192"
}