{
  "id": 4132,
  "title": "Sectoral Counter-Cyclical Approach to Financial Risk Management Based on CSR for Sustainable Development of Companies",
  "abstract": "This research determines the contribution of Corporate Social Responsibility (CSR) to reducing financial risks and, consequently, to the sustainable development of companies in different sectors of the economy and at different phases of the economic cycle (using Russia as an example). The informational and empirical base comprises data on the dynamics of stock prices of sectoral indices of the Moscow Exchange's total return gross (in Russian rubles): oil and gas, electricity, telecommunications, metals and mining, finance, consumer sector (retail trade), chemicals and petrochemicals, and transportation, as well as the Responsibility and Openness index in 2019 (before the crises), in 2020 (COVID-19 crisis), 2022 (sanction crisis), and 2024 (Russia's economic growth). Economic-mathematical models, compiled through regression analysis, showed that the contribution of CSR to reducing the financial risks of companies is highly differentiated among economic sectors and phases of the economic cycle. The research presents a new sectoral perspective on counter-cyclical management of the financial risks of companies through CSR, enabling a deeper study of the cause-and-effect relationships of such management for the sustainable development of companies from different economic sectors. This is the theoretical significance of this research, its novelty, and its contribution to the literature. The research has practical significance, revealing previously unknown best practices for the sustainable development of companies from different economic sectors of Russia across different phases of the economic cycle. The systematized experience will be useful for forecasting the financial risks of companies during future economic crises in Russia and improving the practice of planning and organizing the financial risk management of Russian companies through CSR. The authors' conclusions have managerial significance because they will help enhance the flexibility and efficiency of corporate financial risk management by considering the sectoral specifics and cyclical nature of the economy when implementing CSR.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64e1bec9b596b0efcd9e7a343e5b9d75",
  "timestamp": "2025-05-15T02:33:42.040581"
}