{
  "id": 4616,
  "title": "The increasing medicolegal cost in the care of high-level athletes",
  "abstract": "Background: Medical malpractice represents a significant economic cost in health care. Increasingly large damage claims by professional athletes against physicians have raised concerns about the medicolegal challenges in caring for high-level athletes. Methods: An online proprietary legal research database was queried for lawsuits related to malpractice in the care of professional and amateur athletes from 1992 to 2023. Demographics of plaintiffs and defendants, details of lawsuit filings, and damages claimed were recorded for all cases, settlements, and jury verdicts. Descriptive statistics, linear regression, as well as univariate analysis of demographic factors and damage claims in inflation-adjusted 2023 dollars was performed. Results: Eighty-eight lawsuits were recorded from 1992 to 2023. The sum of indemnities exceeded 186 million in 2023 inflation- adjusted United States Dollars. Football players were the most commonly represented athletes (n 1 / 4 26) and represented 49% of total financial awards. Fourteen cases (16%) involved treatment of the upper extremity. Professional and collegiate level of play was associated with higher damages in favor of plaintiffs when compared to other levels of play. No other demographic was associated with higher financial awards. Linear regression showed a significant positive trend with an increasing inflation-adjusted compensation for plaintiff verdicts in the last 30 years. Conclusions: There is an increasing medicolegal financial risk associated with the care of athletes. This is higher in collegiate and professional levels of play. As physicians, insurers and institutions adjust to these financial risks, care must be taken to avoid ramifications on the availability and quality of care provided to athletes. Shoulder and elbow surgeons may consider additional preoperative counseling, legal waiver forms regarding malpractice claims, and advocacy for medical malpractice reforms in the care of athletes with high earning potential to mitigate these increasing financial risks. Level of evidence: Level IV; Descriptive Epidemiology Study (c) 2024 Journal of Shoulder and Elbow Surgery Board of Trustees. All rights are reserved, including those for text and data mining, AI training, and similar technologies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64e3d9b0a0dc7b9db0b552868bfd968f",
  "timestamp": "2025-05-15T02:39:26.907955"
}