{
  "id": 7383,
  "title": "Burn out among Iranian dental students: psychometric properties of burnout clinical subtype questionnaire (BCSQ-12-SS) and its correlates",
  "abstract": "Background Burnout Clinical Subtype Questionnaire (BCSQ-12-SS) is a short valid questionnaire for assessment of burnout in students. The aim of the present study was to evaluate the psychometric properties of Persian-translated version of the BCSQ-12-SS and assess the burn out clinical subtypes and their correlates in dental students. Methods In this psychometry study, the BCSQ-12-SS questionnaire in domains of overload (4 questions), lack of development (4 questions), and neglect (4 questions) was translated to Persian and back-translated. Six experts determined the content and face validity of the Persian version. The questionnaire was then piloted on 167 dental students of Tehran University of Medical Sciences in 2016. Data were analyzed using Exploratory Factor Analysis (EFA) and Confirmatory Factor Analysis (CFA) for construct validity and Linear Regression modeling in IBM SPSS and AMOS SPSS. To assess reliability, the questionnaire was filled out by 15 students twice and Kappa coefficient and Composite Reliability (CR) were calculated. Results Content validity Ratio (CVR) and Content Validity Index (CVI) values and Cronbach's alphas were all over 0.8. Kappa coefficient ranged from 65 to 82.5%. The average burnout score was 29.6 out of maximum score of 60. There were no significant differences in burnout scores across the different semesters (8,10 and 12). Financial support by the family significantly affected the total score of burnout and lack of development. In addition, gender, mother's education, residential status of student, preparing for post graduate exam and financial support by the family affected the overload. Conclusion The BCSQ-12-SS has good psychometric properties and therefore can be used to assess burnout in IRANIAN dental students. The BCSQ-12-SS may provide an opportunity to identify individuals at risk for burn out and provide counseling to assist in dental student development.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "64f4af020c5e46788c927678e38fb593",
  "timestamp": "2025-05-15T03:08:00.787148"
}