{
  "id": 6645,
  "title": "The Determinants of Capital Structure in Manufacturing Companies Listed on the Indonesia Stock Exchange with the Firms' Size As a Moderating Variable",
  "abstract": "The determinants of capital structure have been debated among financial management researchers. This debate is caused by different research result about the determination of capital structure. The capital structure is a financing mix of short-term debt, long-term debt, and equity. This study investigates the determinants of capital structure in Manufacturing Companies listed on the Indonesia Stock Exchange. Tangibility, profitability, growth opportunities, business risk are used as independent variables, capital structure proxied by debt to equity ratio (DER) as dependent variables and firm size as a moderating variable. The population in this study is Manufacturing Companies listed on the Indonesia Stock Exchange (IDX) during the period 2010-2016; sampling technique used was purposive sampling and data analysis was done using panel data regression. The result shows that there is no significant impact of tangibility, profitability, and business risk to capital structure. The capital structure is significantly positively affected by the growth opportunities at Manufacturing Companies. Meanwhile, firm size as a moderating variable strengthens the positive and significant relationship between asset structure and capital structure. On the basis of these empirical findings, the determinants of capital structure are influenced by the growth of the firms. The firm's size strengthens the positive and significant relationship between asset structure and capital structure.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6514db07a5be54c2ef3543976528042a",
  "timestamp": "2025-05-15T03:00:05.039963"
}