{
  "id": 5337,
  "title": "Out-of-pocket expenditures for prevention and treatment of cardiovascular disease in general and specialised cardiac hospitals in Addis Ababa, Ethiopia: a cross-sectional cohort study",
  "abstract": "Background Cardiovascular disease poses a great financial risk on households in countries without universal health coverage like Ethiopia. This paper aims to estimate the magnitude and intensity of catastrophic health expenditure and factors associated with catastrophic health expenditure for prevention and treatment of cardiovascular disease in general and specialised cardiac hospitals in Addis Ababa. Methods and findings We conducted a cross-sectional cohort study among individuals who sought cardiovascular disease care in selected hospitals in Addis Ababa during February to March 2015 (n=589, response rate 94%). Out-of-pocket payments on direct medical costs and direct non-medical costs were accounted for. Descriptive statistics was used to estimate the magnitude and intensity of catastrophic health expenditure within households, while logistic regression models were used to assess the factors associated with it. About 27% (26.7; 95% CI 23.1 to 30.6) of the households experienced catastrophic health expenditure, defined as annual out-of-pocket payments above 10% of a household's annual income. Family support was the the most common coping mechanism. Low income, residence outside Addis Ababa and hospitalisation increased the likelihood of experiencing catastrophic health expenditure. The bottom income quintile was about 60 times more likely to suffer catastrophic health expenditure compared with the top quintile (adjusted OR=58.6 (16.5-208.0), p value=0.00). Of those that experienced catastrophic health expenditure, the poorest and richest quintiles spent on average 34% and 15% of households' annual income, respectively. Drug costs constitute about 50% of the outpatient care cost. Conclusions Seeking prevention and treatment services for cardiovascular disease in Addis Ababa poses substantial financial burden on households, affecting the poorest and those who reside outside Addis Ababa more. Economic and geographical inequalities should also be considered when setting priorities for expanding coverage of these services. Expanded coverage has to go hand-in-hand with implementation of sound prepayment and risk pooling arrangements to ensure financial risk protection to the most needy.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65140a38015dcacb9de2507dac453dd9",
  "timestamp": "2025-05-15T02:46:44.910326"
}