{
  "id": 110,
  "title": "Calculations of fractional derivative option pricing models based on neural network",
  "abstract": "The work adopts the neural network algorithm to derive optimized series solutions of fractional option pricing equations. The studied models include Caputo time-fractional equation and space-time fractional differential equations. The solutions of fractional derivative models are made up of the time variable and the kernel functions of RBF neural network. According to the characteristics of the models, the information function, the test solution, the output function and the loss function are established in turn. And then the optimal parameters of the solution structures of fractional derivative models are calculated by the designed neural network in conjunction with Chinese market data. For Caputo time-fractional model, the pricing results under different kernel functions, with or without cluster analysis, are compared through numerical analysis and illustration. The results of cluster analysis are better than those without cluster analysis. For spacetime fractional models, comparative studies between the pricing results under Caputo and conformable fractional derivatives and those from conformable fractional derivative are made and analyzed by the market data. The numerical simulations indicate that the space-time fractional derivative models have strong predictive abilities. Application analyses show that it is feasible and operable for fractional calculus tool and neural network algorithm to jointly act on the pricing problems of financial derivatives. & COPY; 2023 Published by Elsevier B.V.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6515579be91686213338eb1ff6556841",
  "timestamp": "2025-05-15T01:28:35.323941"
}