{
  "id": 1503,
  "title": "Bibliometric Analysis of Artificial Intelligence Applications in Asset Pricing",
  "abstract": "The demand for advanced financial solutions has promoted the phenomenal growth of the Artificial Intelligence (AI)-driven finance industry. This article covers the progress of AI-based asset pricing. While conventional models created the framework for understanding asset risk and return, current advancements in AI and Machine Learning (ML) have made it feasible to build more complicated models that can evaluate enormous amounts of data, find trends, and improve investment methods. This work aims to perform a bibliometric study of asset pricing models powered by AI. This study analyzes 154 papers from the Scopus database using VOSviewer and shows a considerable rise in publishing during 2018. The study includes author impact, co-authorship networks, magazine participation, country contribution, and keyword co-occurrence. In terms of publications, the United States leads, demonstrating its strength in technology progress and financial area. The United Kingdom and China are closely following. To highlight authorship influence, we underscore the fact that a majority of authors contributed with only a single work. Co-citation research gives extra light on author cooperation practices. The keyword analysis shows the importance of Machine learning and Financial markets, showing the academic community's strong desire to apply modern computing methods for financial data and market dynamics. The obtained insights are meant to serve as a guide for future study in the growing field of AI-driven asset pricing models, helping both scholars and practitioners.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "651732e1b6ebc6e199f287ec913e3226",
  "timestamp": "2025-05-15T02:03:39.839719"
}