{
  "id": 7371,
  "title": "Leaving Against Medical Advice From In-patients Departments Rate, Reasons and Predicting Risk Factors for Re-visiting Hospital Retrospective Cohort From a Tertiary Care Hospital",
  "abstract": "Background: Approximately 1% to 2% of hospitalized patients get discharged or leave from the hospital against medical advice and up to 26% in some centers. They have higher readmission rate and risk of complications than patients who receive complete care. In this study we aimed to determine the rate of leave against medical advice (LAMA) and reasons for the same across different in-patient departments of a tertiary care hospital. Methods: Retrospective cohort study on patients admitted in all departments at our institute over a 1-year period. All patients who were admitted to an in-patient ward at the hospital and who left against medical advice by submitting a duly filled LAMA form were included. Univariate and multivariate logistic regression models with forward selection methods were employed. Revisit to hospital within 30 days; to clinic or emergency department was outcome variable for regression. Results: From June 2015 to May 2016 there were 429 LAMA patients, accounting for 0.7% of total admissions. Females were 223 (52%) compared to males 206 (48%). Finances were quoted as the most common reason for LAMA by 174 (41%) patients followed by domestic problems 78 (18%). Internal medicine was the service with the highest number of LAMA patients ie, 153 (36%) followed by Pediatric medicine with 73 (17%). Of the 429 patients, 147 (34%) patients revisited the hospital within 30 days. Sixty-one percent of these 'bounced-back' LAMA patients had worsening or persistence of same problem, or new problem/s had developed. In unadjusted bivariate logistic model, patients who were advised for follow-up during discharge against medical advice were four times more likely to revisit the hospital. Patients who were married had an increased odd of revisiting the hospital. Conclusion: Financial reasons are the most common stated reasons to LAMA. Patients who LAMA are at a high risk of clinical worsening and 'bouncing back.' This is the first study from our region on in-patient LAMA rates, to our knowledge. The results can be used for planning measures to reduce LAMA rates and its consequences.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "651aea34808c9324f529958d40631394",
  "timestamp": "2025-05-15T03:08:00.750279"
}