{
  "id": 3029,
  "title": "Reliability of Predicting Early Hospital Readmission After Discharge for an Acute Coronary Syndrome Using Claims-Based Data",
  "abstract": "Early rehospitalization after discharge for an acute coronary syndrome, including acute myocardial infarction (AMI), is generally considered undesirable. The Centers for Medicare and Medicaid Services (CMS) base hospital financial incentives on risk-adjusted read-mission rates after AMI, using claims data in its adjustment models. Little is known about the contribution to readmission risk of factors not captured by claims. For 804 consecutive patients >65 years discharged in 2011 to 2013 from 6 hospitals in Massachusetts and Georgia after an acute coronary syndrome, we compared a CMS-like readmission prediction model with an enhanced model incorporating additional clinical, psychosocial, and sociodemographic characteristics, after principal components analysis. Mean age was 73 years, 38% were women, 25% college educated, and 32% had a previous AMI; all-cause rehospitalization occurred within 30 days for 13%. In the enhanced model; previous coronary intervention (odds ratio [OR] = 2.05, 95% confidence interval [CI] 1.34 to 3.16; chronic kidney disease OR 1.89, 95% CI 1.15 to 3.10; low health literacy OR 1.75, 95% CI 1.14 to 2.69), lower serum sodium levels, and current nonsmoker status were positively associated with readmission. The discriminative ability of the enhanced versus the claims based,model was higher without evidence of overfitting. For example, for patients in the highest deciles of readmission likelihood, observed readmissions occurred in 24% for the claims-based model and 33% for the enhanced model. In conclusion, readmission may be influenced by measurable factors not in CMS' claims-based models and not controllable by hospitals. Incorporating additional factors into risk-adjusted readmission models may improve their accuracy and validity for use as indicators of hospital quality. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6527732dfb9de403ee1b400a3edb1259",
  "timestamp": "2025-05-15T02:21:52.187949"
}