{
  "id": 4127,
  "title": "Current status and perspectives of interventional clinical trials for glioblastoma - analysis of ClinicalTrials.gov",
  "abstract": "The records of 208.777 (100%) clinical trials registered at ClinicalTrials.gov were downloaded on the 19th of February 2016. Phase II and III trials including patients with glioblastoma were selected for further classification and analysis. Based on the disease settings, trials were classified into three groups: newly diagnosed glioblastoma, recurrent disease and trials with no differentiation according to disease setting. Furthermore, we categorized trials according to the experimental interventions, the primary sponsor, the source of financial support and trial design elements. Trends were evaluated using the autoregressive integrated moving average model. Two hundred sixteen (0.1%) trials were selected for further analysis. Academic centers (investigator initiated trials) were recorded as primary sponsors in 56.9% of trials, followed by industry 25.9%. Industry was the leading source of monetary support for the selected trials in 44.4%, followed by 25% of trials with primarily academic financial support. The number of newly initiated trials between 2005 and 2015 shows a positive trend, mainly through an increase in phase II trials, whereas phase III trials show a negative trend. The vast majority of trials evaluate forms of different systemic treatments (91.2%). In total, one hundred different molecular entities or biologicals were identified. Of those, 60% were involving drugs specifically designed for central nervous system malignancies. Trials that specifically address radiotherapy, surgery, imaging and other therapeutic or diagnostic methods appear to be rare. Current research in glioblastoma is mainly driven or sponsored by industry, academic medical oncologists and neuro-oncologists, with the majority of trials evaluating forms of systemic therapies. Few trials reach phase III. Imaging, radiation therapy and surgical procedures are underrepresented in current trials portfolios. Optimization in research portfolio for glioblastoma is needed.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "652be796127f855721098f8f38250fc0",
  "timestamp": "2025-05-15T01:23:58.135355"
}