{
  "id": 9069,
  "title": "The use of professional help and predictors of unmet needs for dealing with mental health to legal problems among victims of violence, accidents, theft and threat, and nonvictims in the general population",
  "abstract": "Aims Victims of violence, accidents, theft, and serious threat (hereafter abbreviated as victims) are more than nonvictims at risk for problems in different domains, varying from mental health to legal problems. However, the extent to which victims with these problems compared to nonvictims with similar problems receive problem-related professional or formal help is unclear. It is unknown if predictors of unmet needs differ between victims and nonvictims. Aim of the present study is to fill this gap of knowledge. Methods Data was extracted from surveys of the VICTIMS-study (2018, 2019 and 2020), conducted with the Dutch population-based longitudinal LISS panel. Each survey assessed 1.) experiences with physical violence, accidents, theft, and serious threat and other traumatic or stressful events in the past 12 months and 2.) various problems and use of professional help, e.g. do receive help, do not need help, could use help but do not use it, cannot find or afford help for these problems. Multivariate logistic regression analyses were performed to assess differences in problems, in the use of problem-related professional help, and in predictors of unmet needs between victims (N = 1,756) and nonvictims (N = 5,000). Results Victims more often had assessed problems than nonvictims. Victims compared to nonvictims with similar problems had 1.5 to 2 times more often unmet needs: they could not find or afford professional help for their mental, physical, partner/family, financial and legal problems. In addition, victims less often received help for legal and administrative problems. Most predictors of unmet needs, e.g. could use help but do not use it, cannot find or afford help, were not significant and hardly differed between both groups. Conclusions The findings that victims compared to nonvictims more often have various problems and more often cannot find or afford problem-related professional help, suggest that there is room for improvement for victims services.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6538df272dbe7984233e6406ccbeb396",
  "timestamp": "2025-05-15T03:25:27.633403"
}