{
  "id": 1669,
  "title": "Toolset for financial risk strategic assessment in corporations based on stochastic modeling",
  "abstract": "The study substantiates the need to develop and test a model for assessment of strategic financial risk level in corporations. It implies modeling for two indicators: relative (financial leverage) and absolute (external capital of indicators). The model should also take into account influence of emergent environment factors and most stakeholder groups' interests when building scenarios for their behaviors in the financial markets -Implementation of the model allows establishing financial risk target values considering deviation calculations between the indicators' modeled and actual values simultaneously determining both tactical and strategic guidelines for Financial Risk Management Policy in corporations, which should involve stakeholders into financial risk-taking process. The model implementation also should be the basis for development and improvement of risk-based forecasting tools, business planning and stress testing. The toolkit for assessing level of current and strategic financial risks in corporations based on simulation modeling was developed and implemented with attraction of general scientific and special methods. Direct results of the study are as follows: in theoretical block of the research - essentially, main attributes of financial risks classification for corporations are identified; they are recognized by time as retrospective, current and strategic financial risks, and correct classification of the latter allows their identification, evaluation and regulation; in practical block of the research - evaluation of financial risk in corporations reveals that the risk apart from other internal factors is highly affected by the level of financial leverage, where its high value increases financial risk; still, corporations do not take into account the influence of environmental factors on its level; the role of tax risk as a part of financial risk is not significant, still it is unfortunate that the Russian legislation system allows double taxation on income tax in the form of dividends, and dividend policy of Russian corporations is unstable; in methodological block of the research -financial risk assessment model for corporations was developed and tested on a platform of a special new software product that determines the target level of financial risk; the model differs from standard approaches to financial risk assessment as it carries strategic forecasting nature and takes into account the impact of emergent environment factors; thus it promotes new areas in strategic financial risk management.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "653fcbeafccb8f713656f84f5f3e2ceb",
  "timestamp": "2025-05-15T02:06:22.391066"
}