{
  "id": 9457,
  "title": "The Influence of Demographical Factors on the Interaction between Entrepreneurship and Unemployment",
  "abstract": "Lithuania has made a significant progress on institution-building and policymaking in support of entrepreneurship over the last ten years (Grundey et al., 2008); however, the constantly changing business environment, information-flow growth, processes of integration into the global market increase business risk, and this complicates the people's determination to start their own business (Remeikiene, Startiene, 2007; Voronova, 2008), because business itself cannot provide the projected free cash flow (Kazlauskiene, Christauskas, 2007); a business establishment is limited by the lack of financial support measures for the start ups and developments of small and medium-sized businesses (Tamosiunas, Lukosius, 2009); in order to survive in the market, firms are not only forced to recognize business risks, but must learn to manage them (Savcuk 2007). A person determined to become an entrepreneur must evaluate not only the external, but also personal circumstances. The article deals with an actual problem - the influence of demographical factors on the interaction between entrepreneurship and unemployment. The interaction between the entrepreneurship and unemployment is mainly analyzed through the two-way relationship between entrepreneurship and unemployment. The authors of studies (Thurik, 2003; Thurik, Verheul, 2002; Stel, Stunnberg, 2004; Audretsch, Carey, Thurik, 2002; Care, Stella, Thurik Audretsch, 2007) found that this relationship exists in the countries such as Japan, OECD countries. While studying the interaction between entrepreneurship and unemployment in other countries (Portugal, Spain, United Kingdom), the conclusion was made that economic analysis is insufficient in order to determine the bonds between them, it is necessary to analyze and evaluate all the chain of factors (cultural, demographic, political, psychological, technological)which determine the mutual relations between entrepreneurship and unemployment By the purpose of the article - the evaluation of the influence of demographical factors on the interaction between entrepreneurship and unemployment - the authors seek to show how demographic factors affect the development of entrepreneurship and reduce unemployment. Lithuanian and foreign scientists, examining the influence demographic factors on the entrepreneurship and unemployment, pays the highest attention to such demographic characteristics as gender, age, education, emigration, ethnic minorities, race, marital status, as they may determine the success of the business creation/survival or reduce the duration unemployment period The research provides interesting facts: individual demographic factors do not always positively influence entrepreneurship/unemployment It appears that the same factors may hinder the establishment of a business, or liberation from unemployment. The question is: why do the demographic factors explored have a twofold influence? Literature does not issue unambiguous answer, but the dual impact of demographic factors is based on the cultures of different countries, their political decisions,, traditions, climate difference or diversity of business fields. Deeper analysis of the interaction between entrepreneurship and unemployment through the prism of the demographical factors was encouraged by the fact that scientists tend to analyze only the effects of demographic factors on entrepreneurship, i.e. the significance of age, education, gender, ethnic minorities and others to business creation. There is the lack of studies which examine demographic factors with interpretation of the mutual bonds of entrepreneurship and unemployment. A systematic analysis of the literature leads to the conclusion that such demographic factors as one of parents'/spouse's being an entrepreneur, emigration, ethnic minorities, race and work experience encourage business creation, while the gender differences - hampers business. Moreover, the demographic factors (education, age, unemployment duration) were determined to affect the start ups of businesses differently. In practical part of the article Pearson's correlation and regression methods were used to examine the reliability presumptions raised. The conclusion was made that education of unemployed men as well as women significantly correlates with the indicator of the relation between the number of established companies with a ratio of the number of operating companies (R-men(2) = 0.74; R-women(2) = 0.77), education of unemployed women - with the number of newly registered enterprises (R-women(2) = 0.71), experience of unemployment - with the indicator of relation between the number of established companies and the number of operating companies (R-1-2(2) (months) = 0.81; R-3-5months(2) = 0.76) and experience of unemployment with the number of newly registered companies (R-1-2(2) (months) = 0.75). This shows that these factors are significant in incorporation of new companies as well as in existing business.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "655f17726f568ce8f4d5a886fb609552",
  "timestamp": "2025-05-15T03:28:46.410177"
}