{
  "id": 9145,
  "title": "Healthcare utilisation, cancer screening and potential barriers to accessing cancer care in rural South West Nigeria: a cross-sectional study",
  "abstract": "Background/aims Cancer burden is predicted to double by 2030 in sub-Saharan Africa; access to healthcare services for cancer management is a priority in the region. In Nigeria, National Cancer Control Plan aims to ensure >50% cancer screening of eligible populations by 2022 for all Nigerians. We describe healthcare utilisation, cancer screening activities and potential barriers to accessing cancer care within an understudied rural community-based adult population in South West Nigeria. Methods In April 2018, we conducted a cross-sectional study of community-based adults (>18 years) similar to 130 km east of Ibadan, 250 km from Lagos in Osun State, South West Nigeria. Participants completed a face-to-face survey in local dialect. We used a questionnaire to assess demographics, health status, income, medical expenditures, doctor visits and cancer screening history. Results We enrolled 346 individuals: with median age of 52 years and 75% women. Of the entire cohort, 4% had medical insurance. 46% reported a major medical cost in the last year. Cancer screening activities were infrequent in eligible participants: 1.5% reported having had cervical cancer screening, 3.3% mammogram and 5% colonoscopy screening. Cancer screening assessment was less frequent in those with less income and lower education levels. Using a multivariable logistic regression model including personal income, insurance status and education, higher personal income was associated with more cancer screening activity (OR 2.7, 95% CI 1.3 to 5.7, p<0.01). Despite this, most individuals had contact with a primary healthcare doctor (52% in the last year), and over 70% access to radio and TV suggesting the opportunity to expand community-based screening interventions and awareness exists. Conclusions Despite national increases in cancer cases, we highlight a deficiency in cancer screening and universal healthcare coverage within a community-based adult Nigerian population. Subject to availability of governmental resources, increasing financial risk protection, awareness and targeted resource allocation may help expand access in Nigeria.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "656a74cb129287ef27392d350580261b",
  "timestamp": "2025-05-15T03:25:54.648436"
}