{
  "id": 4913,
  "title": "Society of Thoracic Surgeons Risk Score predicts hospital charges and resource use after aortic valve replacement",
  "abstract": "Objective: The impact of Society of Thoracic Surgeons predicted mortality risk score on resource use has not been previously studied. We hypothesize that increasing Society of Thoracic Surgeons risk scores in patients undergoing aortic valve replacement are associated with greater hospital charges. Methods: Clinical and financial data for patients undergoing aortic valve replacement at The Johns Hopkins Hospital over a 10-year period (January 2000 to December 2009) were reviewed. The current Society of Thoracic Surgeons formula (v2.61) for in-hospital mortality was used for all patients. After stratification into risk quartiles, index admission hospital charges were compared across risk strata with rank-sum and Kruskal-Wallis tests. Linear regression and Spearman's coefficient assessed correlation and goodness of fit. Multivariable analysis assessed relative contributions of individual variables on overall charges. Results: A total of 553 patients underwent aortic valve replacement during the study period. Average predicted mortality was 2.9% (+/- 3.4) and actual mortality was 3.4% for aortic valve replacement. Median charges were greater in the upper quartile of patients undergoing aortic valve replacement (quartiles 1-3, $39,949 [interquartile range, 32,708-51,323] vs quartile 4, $62,301 [interquartile range, 45,952-97,103], P < .01]. On univariate linear regression, there was a positive correlation between Society of Thoracic Surgeons risk score and log-transformed charges (coefficient, 0.06; 95% confidence interval, 0.05-0.07; P < .01). Spearman's correlation R-value was 0.51. This positive correlation persisted in risk-adjusted multivariable linear regression. Each 1% increase in Society of Thoracic Surgeons risk score was associated with an added $3000 in hospital charges. Conclusions: This is the first study to show that increasing Society of Thoracic Surgeons risk score predicts greater charges after aortic valve replacement. As competing therapies, such as percutaneous valve replacement, emerge to treat high-risk patients, these results serve as a benchmark to compare resource use. (J Thorac Cardiovasc Surg 2011;142:650-5)",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "656f1a44751a7d2168a8d445ead5f7aa",
  "timestamp": "2025-05-15T02:42:36.106211"
}