{
  "id": 2441,
  "title": "Risks in the Role of Co-Creating the Future of Tourism in Stigmatized Destinations",
  "abstract": "The primary goal of this paper was to investigate the strength of the influence of different types of risk on the travelers' intention to visit destinations in future, that are, prejudiced due to COVID-19, marked as stigmatized, isolated, or risky destinations. Field interview research was conducted at the Belgrade Nikola Tesla Airport (Serbia). The results obtained by multiple regression analysis showed that all types of risks influenced the intention of travelers, with financial risk showing a more significant impact. Canonical discriminant analysis indicated that men were most afraid of human induced risk, service quality risk, natural disaster and COVID-19 risk, and they chose safer destinations. Among the women, the biggest fear was financial risk, socio-psychological risk, and food safety risk. Older respondents and those under the influence of external factors decided on safer destinations, while financial status did not play a significant role in predicting the choice of destination. The selection of the destination according to the degree of security was determined by the ordinal regression methodology. The entire research presents a certain novelty, because so far in the numerous studies on the topic of the negative consequences of COVID-19 on tourism, there has been no discussion of stigmatized or risky destinations that received that epithet, and were therefore negatively and unfairly marked in the minds of tourists for future visits.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6573762bb819aabc64b16e824a6f496a",
  "timestamp": "2025-05-15T02:15:27.040607"
}