{
  "id": 833,
  "title": "Psychological well-being during the COVID-19 pandemic in Italy assessed in a four-waves survey",
  "abstract": "COVID-19 pandemic had a negative impact on the mental health and well-being (WB) of citizens. This cross-sectional study included 4 waves of data collection aimed at identifying profiles of individuals with different levels of WB. The study included a representative stratified sample of 10,013 respondents in Italy. The WHO 5-item well-being scale (WHO-5) was used for the assessment of WB. Different supervised machine learning approaches (multinomial logistic regression, partial least-square discriminant analysis-PLS-DA-, classification tree-CT-) were applied to identify individual characteristics with different WB scores, first in waves 1-2 and, subsequently, in waves 3 and 4. Forty-one percent of participants reported Good WB, 30% Poor WB, and 28% Depression. Findings carried out using multinomial logistic regression show that Resilience was the most important variable able for discriminating the WB across all waves. Through the PLS-DA, Increased Unhealthy Behaviours proved to be the more important feature in the first two waves, while Financial Situation gained most relevance in the last two. COVID-19 Perceived Risk was relevant, but less than the other variables, across all waves. Interestingly, using the CT we were able to establish a cut-off for Resilience (equal to 4.5) that discriminated good WB with a probability of 65% in wave 4. Concluding, we found that COVID-19 had negative implications for WB. Governments should support evidence-based strategies considering factors that influence WB (i.e., Resilience, Perceived Risk, Healthy Behaviours, and Financial Situation).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65758a325e78bef334fb59929b9e2df2",
  "timestamp": "2025-05-15T01:55:41.563065"
}