{
  "id": 3166,
  "title": "Examining the psychological and financial impact of travel restrictions on citizens and permanent residents stranded abroad during the COVID-19 pandemic: international cross-sectional study",
  "abstract": "Objectives This study aimed to evaluate the psychological and financial distress reported by citizens and permanent residents stranded abroad due to international travel restrictions introduced in response to the COVID-19 pandemic. Design An international cross-sectional study. Setting A primary analysis of data collected between July and September 2021 through an online survey targeting individuals stranded abroad and unable to return to their country of residence due to international travel restrictions. Respondents A total of 1054 individuals aged 18-84 years. Data analysis Multivariable logistic regression models were used to explore the relationship between higher levels of depression, anxiety and stress and participant variables. Outcome measures The survey answered questions regarding COVID-19 travel restriction-related impacts: personal stress, anxiety and depression (using the validated 21-item Depression, Anxiety and Stress Scale (DASS-21) tool), as well as impacts on housing and financial security and demographic data. Results A total of 75.4% of respondents reported wanting to return to the Oceania region (75.4%), with 45% stranded in Europe. 64.2% reported financial distress while stranded abroad. 64.4% (x=9.43, SD=5.81) reported moderate-to-extremely severe (based on the DASS-21 classification) levels of depression, 41.7% for anxiety (x=5.46, SD=4.74), and 58.1% for stress (x=10.64, SD=5.26). Multivariable analysis indicated that financial stress, an employment change, being <30 years, having a high perceived risk of contracting COVID-19 abroad and being stranded for >2 months were significantly related to scores of moderate-to-extremely severe depression, anxiety and stress. Conclusion The study is among the first to explore the psychological and financial distress-related impacts associated with being stranded abroad due to COVID-19 travel restrictions. It highlights a range of unintended consequences that arise from pandemic-related travel restrictions, identifies the health and social needs of a particularly vulnerable population, and provides clues as to the types of support that may be adopted to best support them.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6589f094c4d3a6046a3e777e0e800938",
  "timestamp": "2025-05-15T02:23:33.479159"
}