{
  "id": 71,
  "title": "Prospective Portfolio Optimization With Asset Preselection Using a Combination of Long and Short Term Memory and Sharpe Ratio Maximization",
  "abstract": "This research presents a novel portfolio optimization model that incorporates asset preselection. This model aims to demonstrate how using Long and Short-Term Memory and Sharpe Ratio Maximization can enhance the efficiency of portfolios.The suggested approach consists of three stages, each with practical applications. During the initial phase, the data is gathered. In the second phase, the LSTM network, a commonly employed tool in predicting stock price movements, is utilized to anticipate the time series of stock closing prices. The third stage of the process focuses on stock selection and determining the appropriate weighting for each stock in the portfolio. The proposed approach is tested and carefully validated using the daily closing prices of ten equities from the FTSE 100. The results demonstrate the model's resilience and efficacy, as the portfolios generated using the anticipated and validation data exhibit high similarity. Given the importance of selecting the right stocks for portfolio optimization, this study will combine asset preselection with portfolio weighting. Furthermore, this study utilized a Long Short-Term Memory network to forecast the optimization model's parameters accurately and introduced a novel portfolio optimization model.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6595104161d7f37a253cdad0408d58dc",
  "timestamp": "2025-05-15T00:31:50.344130"
}