{
  "id": 2546,
  "title": "Drivers of Realized Volatility for Emerging Countries with a Focus on South Africa: Fundamentals versus Sentiment",
  "abstract": "We use a quantile machine learning (random forests) approach to analyse the predictive ability of newspapers-based macroeconomic attention indexes (MAIs) on eight major fundamentals of the United States on the realized volatility of a major commodity-exporting emerging stock market, namely South Africa. We compare the performance of the MAIs with the performance of a news sentiment index (NSI) of the US. We find that both fundamentals and sentiment improve predictive performance, but the relative impact of the former is stronger. We document how the impact of fundamentals and sentiment on predictive performance varies across the quantiles of the conditional distribution of realized volatility, and across different prediction horizons. Specifically, fundamentals matter more at the extreme quantiles at short horizons, and at the median in the long-run. In addition, we report several robustness checks (involving sample period and alternative definitions of realized volatility), and indicate that the obtained results for South Africa also tend to carry over to other emerging countries such as, Brazil, China, India, and Russia. Our results have important implications for investors with volatility being an input for portfolio allocation decisions. In addition, with stock market variability also capturing financial uncertainty, its accurate prediction based on US fundamentals and sentiment also has a role in policy design to prevent possible collapse.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65adf7769075c066436221e814299da0",
  "timestamp": "2025-05-15T01:08:10.719989"
}