{
  "id": 2399,
  "title": "Factors Affecting Financial Risk: Evidence from Listed Enterprises in Vietnam",
  "abstract": "This paper analyzes factors affecting enterprise's financial risk listed on the Vietnam stock market. The panel data of research sample includes 524 non-financial listed enterprises on the Vietnam stock market for a period of eleven years, from 2009 to 2019. The Generalized Least Square (GLS) is employed to address econometric issues and to improve the accuracy of the regression coefficients. In this research, financial risk is measured by the Alexander Bathory model. Debt structure, Solvency, Profitability, Operational ability, Capital structure are independent variables in the study. Finn Size, firm age, growth rate are control variables. The model results show that in order to prevent and limit financial risk for enterprises listed on the Vietnam Stock Market, attention should be paid to variables reflecting Liability structure ratio, Quick Ratio, Return on Assets, Total asset turnover, Accounts receivable turnover, Net assets ratio and Fixed assets ratio. The empirical results show that there are differences in the impact of these factors on the financial risk in state-owned enterprises and non-state enterprises listed on the Vietnam stock market. The findings of this article are useful for business administrators, helping business managers make the right financial decisions to improve the efficiency of financial risk management in enterprises.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65b766943fc7f1c98f88bb523e7d4bb0",
  "timestamp": "2025-05-15T02:14:50.333469"
}