{
  "id": 6991,
  "title": "Divorce, Economic Resources, and Survival among Older Black and White Women",
  "abstract": "Objective This study identifies which midlife economic resources reduce the association between divorce and mortality risk among older Black and White women. Background Despite evidence that divorce increases mortality risk due to economic losses, research has not established which among several common economic resources related to divorce are most important for older women's survival. There is also relatively little research on why marital inequalities in mortality are smaller among older Black women. Drawing from diverse areas of scholarship, we hypothesize that group differences in multiple economic resources explain this finding. Method Fractional logistic regression and Gompertz proportional hazards models were estimated with data from the National Longitudinal Survey of Mature Women (N = 4,668; ) to examine the associations between divorce, economic resources, and mortality among older Black and White women (born 1923-1937). Results Divorced White women had significantly less housing and financial wealth than their continuously married counterparts, and both Black and White divorcees had less vehicle wealth and higher probabilities of indebtedness. With respect to survival, net worth and housing wealth accounted for the largest reductions in marital and racial differences in survival. Conclusion Findings suggest that wealth-home wealth in particular-is key to understanding the greater longevity of married White women compared to Black women and divorced White women. Interventions aimed at reducing health disparities must first address the social practices creating economic inequalities.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65d150da310e429b2e0c19b338325479",
  "timestamp": "2025-05-15T03:03:55.795518"
}