{
  "id": 564,
  "title": "Banks Credit Risk Prediction with Optimized ANN Based on Improved Owl Search Algorithm",
  "abstract": "Credit is one of the most significant elements in banks and financial institutions. It can also be described as unpredicted events, which mainly occur in the form of either assets or liabilities. The risk occurrence is that the facility recipients have no willingness and ability to repay their debt to the bank, which is a default that is synonymous with credit risk. Credit ratings are a way to decrease and measure credit risk and, therefore, manage it appropriately. Credit rating is an approach for estimating the features and recipients of facilities' performance based on quantitative criteria, including the company's financial information. The anticipated future performance allows the applicants to obtain facilities with the exact specifications. In this study, due to the need and significance of calculating the credit risk concept, a novel method based on the hybrid method of artificial neural networks and an improved version of Owl search algorithm (IOSA) and forecasting of C5 risk of decision tree credit is done. This algorithm has two major parts. The decision tree runs based on an IOSA to provide the best weighting of the neural network. The weights created along with the problem data are then given as the input to the main network, and the data are classified. The algorithm has the highest level of accuracy, 96% that is much higher than other algorithms. The results also show a precision of 0.885 and a recall of 0.83 for 618 true positive samples. The proposed method has the highest accuracy and reliability toward the other comparative methods. The study is based on actual data noticed in one of the branches of the Bank Melli, Iran.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65e16ec8ee8ea653b05f6c297d57844a",
  "timestamp": "2025-05-15T01:52:49.377714"
}