{
  "id": 7013,
  "title": "Volatility spillovers during normal and high volatility states and their driving factors: A cross-country and cross-asset analysis",
  "abstract": "Understanding the transmission of volatility across markets is essential for managing risk and financial stability, especially under crisis periods during which an extreme event occurring in one market is easily transmitted to another market. To gain such an understanding and enrich the related literature, we examine in this article the system of volatility spillovers across various equity markets and asset classes using a quantile-based approach, allowing us to capture spillovers under normal and high volatility states. The sample period is 16 March 2011-10 November 2020 and the employed dataset comprises 12 implied volatility indices representing a forward-looking measure of uncertainty of global equities, strategic commodities and the US Treasury bond market. The results show that the identity of transmitters and receivers of volatility shocks differ between normal and high volatility states. The US stock market is at the centre of volatility spillovers in the normal volatility state. European and Chinese stock markets and strategic commodities (e.g. crude oil and gold) become major volatility transmitters in the high volatility state, after acting as volatility receivers during normal periods. Furthermore, we study the drivers of implied volatility spillovers using regression models and find that US Default spread contributes to the total volatility spillover index in both volatility states, whereas TED spread plays a significant role in the normal volatility state. As for the role of short rate and risk aversion, it is significant in the high volatility state. These findings matter to the decision-making process of risk managers and policymakers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "65efa0fd966f22cbba8b57dba2fdf43d",
  "timestamp": "2025-05-15T03:04:22.946978"
}