{
  "id": 9233,
  "title": "The relationship between method of physician payment and patient trust",
  "abstract": "Context.-Trust is the cornerstone of the patient-physician relationship. Payment methods that place physicians at financial risk have raised concerns about patients' trust in physicians to act in patients' best interests. Objective.-To evaluate the extent to which methods of physician payment are related to patient trust. Design.-Cross-sectional telephone interview survey done between January and June 1997. Setting.-Health plans of a large national insurer in Atlanta, Ga, the Baltimore, Md-Washington, DC, area, and Orlando, Fla. Participants.-A total of 2086 adult managed care and indemnity patients. Main Outcome Measure.-A 10-item scale (alpha =.94) assessing patients' trust in physicians. Results.-More fee-for-service (FFS) indemnity patients (94%) completely or mostly trust their physicians to put their health and well-being above keeping down the health plan's costs than salary (77%), capitated (33%), or FFS managed care patients (85%) (P<.001 for pairwise comparisons). In multivariate analyses that adjusted for potentially confounding factors, FFS indemnity patients also had higher scores on the 10-item;trust scale than salary (P<.001), capitated (P<.001), or FFS managed care patients (P<.01). The effects of payment method on patient trust were reduced when a measure based on patients' reports about physician behavior leg, Does your physician take enough time to answer your questions?) was included in the regression analyses, but the differences remained statistically significant, except for the comparison between FFS managed care and FFS indemnity patients (P=.08). Patients' perceptions of how their physicians were paid were not independently associated with trust, but the 37.7% who said they did not know how their physicians were paid had higher levels of trust than other patients (P<.01). A total of 30.2% of patients were incorrect about their physicians' method of payment. Conclusions.-Most patients trusted their physicians, but FFS indemnity patients have higher levels of trust than salary, capitated, or FFS managed care patients. Patients' reports of physician behavior accounted for part of the variation in patients' trust in physicians who are paid differently. The impact of payment methods on patient trust may be mediated partly by physician behavior.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6607a8d86d0df6dd937f10136f6b8981",
  "timestamp": "2025-05-15T03:26:54.551990"
}