{
  "id": 4111,
  "title": "Off-balance sheet activities and scope economies in US banking",
  "abstract": "Propelled by the recent financial product innovations involving derivatives, securitization and mortgages, commercial banks are becoming more complex, branching out into many nontraditional banking op-erations beyond issuance of loans. This broadening of operational scope in a pursuit of revenue diver-sification may be beneficial if banks exhibit scope economies. The existing (two-decade-old) empirical evidence lends no support for such product-scope-driven cost economies in banking, but it is greatly out-dated and, surprisingly, there has been little (if any) research on this subject despite the drastic transfor-mations that the U.S. banking industry has undergone over the past two decades in the wake of techno-logical advancements and regulatory changes. Commercial banks have significantly shifted towards non-traditional operations, making the portfolio of products offered by present-day banks very different from that two decades ago. In this paper, we provide new and more robust evidence about scope economies in U.S. commercial banking. We improve upon the prior literature not only by analyzing the most recent data and accounting for banks' nontraditional off-balance sheet operations, but also in multiple method-ological ways. To test for scope economies, we estimate a flexible time-varying-coefficient panel-data quantile regression model which accommodates three-way heterogeneity across banks. Our results pro-vide strong evidence in support of significantly positive scope economies across banks of virtually all sizes. Contrary to earlier studies, we find no empirical corroboration for scope diseconomies.(c) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6613dd8afaa6736f46884e2b149ace25",
  "timestamp": "2025-05-15T01:23:58.056542"
}