{
  "id": 8392,
  "title": "Depressive symptoms among recent Latinx immigrants in South Florida: The role of premigration trauma and stress, postimmigration stress, and gender",
  "abstract": "In the past decade, recent Latinx immigrants (RLIs) from South and Central America have arrived in the United States seeking asylum from countries affected by war, political upheaval, and high crime and poverty rates. The premigration stress and trauma they experience are further compounded by postimmigration stress due to discrimination, lack of access to health care, and financial instability. Evidence suggests RLIs who experience such stress and trauma have an increased risk of developing depressive symptoms. We examined the combined effect of premigration stress and trauma and postimmigration stress on postimmigration depressive symptoms; we also explored the moderating effect of gender. Hierarchical multiple regression and moderation analyses were conducted on a cross-sectional sample of 540 young adult RLIs (age range: 18-34 years, 50.2% men) in South Florida. Higher levels of postimmigration stress, beta = .37, p .001, were associated with increased postimmigration depressive symptoms. No significant associations emerged between premigration stress and trauma and postimmigration depressive symptoms. Moderation analyses revealed no significant interaction effect of gender. Post hoc analyses indicated that country/region of origin moderated the relation between postimmigration stress and depressive symptoms such that the association was stronger among Venezuelan, beta = 1.51, p .001; other South American, beta = 1.06, p .001; and Central American/Mexican RLIs, beta = 1.38, p .001, compared with Caribbean RLIs, beta = .45, p = .122. These findings suggest that interventions focused on addressing postimmigration stress early in the immigration process can potentially lower subsequent depressive symptoms among RLIs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66147e099a9221e0383d0781c8a01de1",
  "timestamp": "2025-05-15T03:18:19.606164"
}