{
  "id": 8761,
  "title": "Surgical Site Infections in Emergency Abdominal Surgery at Tamale Teaching Hospital, Ghana",
  "abstract": "Surgical site infections (SSIs) result in delayed wound healing, increased use of antibiotics and increased length of hospital stay, putting remarkable physical and financial burden on patients, their relatives and the healthcare facilities. Patient-related factors, such as pre-existing colonization with antibiotic-resistant bacteria, and clinical-related factors, such as adherence to sterile techniques, contribute to the development of SSIs. The objective of this study, therefore, was to determine the SSI rate and risk factors for emergency abdominal surgeries at Tamale Teaching Hospital, Ghana. The study population was composed of patients undergoing emergency abdominal surgery at the Tamale Teaching Hospital between June 2010 and June 2015. Demographic and clinical data were collected and included, but was not limited to, patient age and sex, type of procedure performed, wound class (dirty or contaminated), receipt of perioperative blood transfusion, American Society of Anesthesiologists (ASA) score, presence of SSI, length of hospital stay and outcome of surgery. Standard multiple regression was used to statistically assess the independent variables for their association with SSI, and Pearson correlation coefficient was used to determine the strength of association. The beta (beta) values, which had the greatest influence on the overall SSI, indicated the relative influence of the entered variable(s). A total of 1011 patients underwent various emergency abdominal surgical procedures during the period of study. The beta values were 0.008 for perioperative blood transfusion, 0.050 for sex, - 0.048 for ASA risk, - 0.001 for having health insurance, 0.037 for being referred from another health facility and 0.034 for age. Sex was the most distinctive contributor to SSI, while perioperative blood transfusion showed the least influence. Sex and ASA score were the best predictors of SSI occurrence. The coefficients of the P values for wound class and serum haemoglobin level (g/dL) were 0.000 and 0.032, respectively. The outcome of surgery was significantly and strongly associated with overall SSI and vice versa (r = 0.088, P < 0.01 two-tailed). Sex, ASA score, perioperative blood transfusion, wound class and haemoglobin level can predispose to SSI.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6628846509f18b4325e938aff61db633",
  "timestamp": "2025-05-15T03:21:56.761501"
}