{
  "id": 7943,
  "title": "Depression and socio-economical burden are more common in primary caregivers of patients who are not aware of their cancer: TURQUOISE Study by the Palliative Care Working Committee of the Turkish Oncology Group (TOG)",
  "abstract": "In this study, we aimed to determine the personal, social and economic burden and the frequency of depression, as well as in caregivers of cancer patients who are being treated with chemotherapy in Turkey. The study is designed as a cross-sectional survey study using a 5-point Likert-type response scale, and the last part of the questionnaire includes the Beck Depression Inventory. The depression rate was found to be 64% (n=476) among all subjects (n=968), with 91% of those with depression demonstrating signs of mild depression. In this study, a significant difference was found between the presence of depression and age (young), sex (female), educational level (high), economic status (low), financial loss during treatment, patient's lack of knowledge about his/her diagnosis, metastatic disease and short survival time. In addition, 64% of all subjects had concerns of getting cancer, and 44% of all subjects had feelings of anger/rage against other people. In a multivariate regression analysis, the patient's lack of knowledge of the diagnosis was the independent risk factor. In conclusion, depression incidence and burden rate increased among cancer caregivers, and care burden was highly associated with depression. Accordingly, approaches to reducing the psycho-social effects of cancer should focus intensively on both the patients and their caregivers in Turkey.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "662b8bdcd8ea7ff9ccf04ccdfa132a73",
  "timestamp": "2025-05-15T03:13:30.691179"
}