{
  "id": 7830,
  "title": "Higher complication rates after management of lower extremity fractures in lower socioeconomic classes: Are risk adjustment models necessary?",
  "abstract": "Introduction: Alternative payment models, such as bundled payments, have been proposed to control rising costs in orthopaedic trauma surgery. Without risk adjustment models, concerns exist about the financial burden incurred by so called safety-net hospitals that serve patients of lower socioeconomic status. The purpose of this study was to determine whether lower socioeconomic status was associated with increased complications and subsequently higher resource utilization following surgical treatment of high-energy lower extremity fractures. Methods: The National Inpatient Sample database was queried for patients who underwent surgical fixation of the femur and tibia between 2005-2014. The top and bottom income quartiles were compared. Demographics, medical comorbidities, length of stay (LOS), complications, in-hospital mortality were compared between patients of top and bottom income quartiles. Multivariate logistic regression analysis was then performed to identify factors independently associated with complications, mortality, and increased resource utilization. Results: Patients with femur fracture in the bottom income quartile had longer length of stay (6.9 days vs 6.5 days, p < 0.001) and a higher mortality rate (1.9% vs 1.7%, p = 0.034). Patients with tibia fracture in the bottom income quartile had greater complication rates (7.3% vs 6.1%, p < 0.001), longer length of stay (5.3 days vs. 4.5 days, p < 0.001), and higher mortality (0.3% vs. 0.2%, p < 0.001). Conclusions: Lower income status is associated with increased in-hospital mortality and longer length of stay in patients following lower extremity fractures. Risk adjustment models should consider the role of socioeconomic status in patient resource utilization to ensure continued access to orthopedic trauma care for all patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "662e1dcad6d8d6e8423eec0b622df251",
  "timestamp": "2025-05-15T03:12:36.430841"
}