{
  "id": 6199,
  "title": "Financial difficulty and biopsychosocial predictors of loneliness: A cross-sectional study of community dwelling older adults",
  "abstract": "Aim: To investigate the interplay of sociodemographic, health, functional and psychosocial factors in predicting loneliness in community dwelling older adults accessing home support services and long-term aged residential care. Methods: Older New Zealanders (age 65+), who had their first interRAI Home Care assessment between July 2014 and June 2016, were included. The outcome variable was the binary interRAI item Lonely. The predictor variables included sociodemographics, hearing, vision, self-reported health, activities of daily living, social interaction and support, and depression. Results: Data from 51,239 assessments of older adults (mean age: 82.3 years; female: 61%; European: 87.3%) were analysed. Loneliness was reported in 21%. A stepwise logistic regression model explained 12.1% of the variance and was statistically significant (Chi(2) = 3501.0.8, df = 22; p < 0.001). The factors with the largest odds ratios (OR > 1.5) were depression, living alone, being Asian, financial difficulty and not in a relationship. Functional impairment was negatively associated with loneliness. Conclusions: Determining the predictors of older adults' loneliness is complex, multi-factorial, with each factor having a small, additive effect on the development of loneliness. Depression, social factors and financial difficulty are the strongest predictors but much of the variance remains unexplained. These factors could be targeted as modifiable risk factors for addressing loneliness in older adults.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6633fa5031ffbe362af92855108a3797",
  "timestamp": "2025-05-15T02:55:44.617386"
}