{
  "id": 1775,
  "title": "Measuring costly behavioral bias factors in portfolio management: a review",
  "abstract": "Various factor models extended by Jensen's (J Financ 23:389-416, 1968) alpha have been used to measure the retail investors' portfolio (under-) performance compared to the market portfolio. The previous studies tried to explain this anomaly in behavioral finance by examining retail investors' cognitive biases that induce irrational trading behavior. While operationalizing these cognitive biases in trading is not trivial, researchers still have found measures to proxy for biases and prove their statistical and economic significance. However, these studies only focused on linking one or a subset of behavioral biases and their effect on portfolio performance. In addition, different measures of biases across studies complicate the comparability of results. Therefore, this paper provides a structured overview of the current state of the literature regarding behavioral biases and their measurements to design a behavioral factor model that should help to explain the performance alpha from a behavioral finance perspective. The paper presents an overview of 11 behavioral bias factors and 29 corresponding measurements to consider inputting in such a model. With an application-oriented focus, it is recommended to include the most researched bias factors in a factor model, which are also the most detrimental to portfolio performance, as well as to include the most frequently used and least complex measures, which results in the primary inclusion of the following eight behavioral bias factors: disposition effect, under-diversification, home bias, local bias, lottery stock preference, trend chasing, overtrading, and trade clustering.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "663c7f5b644f346d48e819f885672251",
  "timestamp": "2025-05-15T00:59:23.025565"
}