{
  "id": 6401,
  "title": "Contribution of parental health to the subsequent social assistance entry of the family with children: a nationwide register-linked birth cohort study in Finland",
  "abstract": "AimOur aim in this paper was to estimate the contribution of different parental specialised health care diagnoses to the subsequent risk of entry into the social assistance system for families with children in the period 1998-2013. MethodsWe used longitudinal population-level register data consisting of all children born in 1997 in Finland and their registered parents (54 960 one and two-parent families with 801 336 observations in the period 1998-2013). Diagnoses assigned in public specialised healthcare and social assistance records were derived from nationwide administrative registers. Measures of parental socioeconomic status and previous diagnoses and the birth weight of the child were adjusted for in regression models which estimated the association between parental diagnoses and entry into the social assistance system in the following year. ResultsFamilies with a parent somatic diagnosis had a risk ratio of 1.4 for social assistance entry in the subsequent year of the diagnosis though substantial variation by diagnosis category was detected. Parent psychiatric diagnoses were linked to a higher, 3.01-fold risk of social assistance entry. Covariate adjustment reduced these risk ratios to 1.2 and 2.1, respectively. Some 2.9% of all social assistance entries may be attributed to parental psychiatric diagnoses while somatic health records account for another 7.2%, making their total contribution over 1/10th of all cases. ConclusionParental specialised healthcare records were associated with a higher risk of social assistance need. Thus more interventions to support financial management are required for parents with psychiatric diagnoses.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6649d589a6b0b7f9e97e5a48590157b2",
  "timestamp": "2025-05-15T02:57:38.818867"
}