{
  "id": 2446,
  "title": "Two-stage DEA-Truncated Regression: Application in banking efficiency and financial development",
  "abstract": "This study evaluates the efficiency of peripheral European domestic banks and examines the effects of bank-risk determinants on their performance over 2007-2014. Data Envelopment Analysis is utilised on a Malmquist Productivity Index in order to calculate the bank efficiency scores. Next, a Double Bootstrapped Truncated Regression is applied to obtain bias-corrected scores and examine whether changes in the financial conditions affect differently banks' efficiency levels. The analysis accounts for the sovereign debt crisis period and for different levels of financial development in the countries under study. Such an application in the respective European banking setting is unique. The proposed method also copes with common misspecification problems observed in regression models based on efficiency scores. The results have important policy implications for the Euro area, as they indicate the existence of a periphery efficiency meta-frontier. Liquidity and credit risk are found to negatively affect banks productivity, whereas capital and profit risk have a positive impact on their performance. The crisis period is found to augment these effects, while bank-risk variables affect more banks' efficiency when lower levels of financial development are observed. (C) 2017 Elsevier Ltd. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "664a9e9c56727eb75505d053564219f5",
  "timestamp": "2025-05-15T02:15:27.077669"
}