{
  "id": 518,
  "title": "Data management within new product development and collaborative engineering: a bibliometric and systemic analysis",
  "abstract": "Purpose Although organizations have more data than ever at their disposal, actually deriving meaningful insights and actions from them is easier said than done. In this concern, the main objective of this study is to identify trends and research opportunities regarding data management within new product development (NPD) and collaborative engineering. Design/methodology/approach Bibliometric and systemic analyses have been carried out using the methodological procedure ProKnow-C, which provides a structured framework for the literature review. A bibliographic portfolio (BP) was consolidated with 33 papers that represent the state of art in the subject. Findings Most recent researches within the BP indicate new trends and paradigm shifts in this area of research, tackling subjects such as the internet of things, cloud computing, big data analytics and digital twin. Research gaps include the lack of data automation and the absence of a common architecture for systems integration. However, from a general perspective of the BP, the management of experimental data is suggested as a research opportunity for future works. Although many studies have tackled data and collaboration based on computer-aided technologies environments, no study examined the management of the measured data collected during the verification and validation stages of a product. Originality/value This work provides a fresh and relevant source of authors, journals and studies for researchers and practitioners interested in the domain of data management applied to NPD and collaborative engineering.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6675b4e6203a96cdd6cfe1db49b56838",
  "timestamp": "2025-05-15T00:37:01.719220"
}