{
  "id": 9126,
  "title": "Economic Impact of Donating a Kidney on Living Donors: A Korean Cohort Study",
  "abstract": "Rationale & Objective: Although existing studies have reported adverse health outcomes after kidney donation, its socioeconomic impact on living donors requires further study. Study Design: A retrospective observational cohort study including a matched comparison group. Setting & Participants: 1,285 living kidney donors from 7 tertiary hospitals between 2003 and 2016, and a matched comparison group consisting of the same number of health screening examinees with similar baseline clinical characteristics and socio-economic status. All participants were receiving Korean national health insurance. Exposure: Kidney donation as reflected in the Korean National Health Insurance System (NHIS) database. Outcome: Changes in household economic status estimated by Korean national health insurance fees and changes in employment status reflected in the NHIS database. Analytical Approach: The outcomes of the donor group and matched control group were compared annually using multivariable logistic regression analyses adjusted for clinical and demographic characteristics. Results: The median ages of the donors and matched controls were 45 and 46 years, respectively; 44.6% of both groups were male. Compared to the comparison group, living donors were at higher risk of being unemployed or losing employment during the first 2 years after donation (eg, first-year loss of employment: odds ratio (OR), 2.27 [95% CI, 1.55-3.33]); however, this association did not persist. Donors also had a significantly lower odds of improvement in economic status (OR, 0.57 [95% CI, 0.47-0.71]) and a higher odds of deterioration in financial status (OR, 1.54 [95% CI, 1.23-1.93]) in the first year after transplantation and subsequently. Limitations: Unmeasured differences between donors and matched controls creating residual selection bias and confounding. Conclusions: Living kidney donors may suffer loss of employment and poor economic status after their voluntary donation. The socioeconomic impact on these donors should be considered in conjunction with the potential long-term adverse health outcomes after donation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6685d9997e7d9598c3063e73ba691965",
  "timestamp": "2025-05-15T03:25:54.559613"
}