{
  "id": 5822,
  "title": "Risk-adjusted banks' resource-utilization and investment efficiencies: does intellectual capital matter?",
  "abstract": "Purpose - The purpose of this study is twofold. First, this research estimates banks' efficiencies from the perspectives of resource utilization and investment after incorporating risk measures as an exogenous input in the investment-efficiency stage. Second, the current study examines the relationship between intellectual capital (IC) and banks' efficiencies. Design/methodology/approach - First, this study uses a dynamic network data envelopment analysis approach in investigating the efficiencies of 24 Taiwanese banks in 2007-2018 from two perspectives. Second, this research utilizes various regression techniques, namely, ordinary least squares (OLS), robust least squares and truncated regression, to gauge the impact of IC on banks' efficiencies. Typically, IC is determined based on a monetary value-based measure and value-added intellectual coefficient (VAICTM). Findings - Resource-utilization (investment) efficiencies were observed as 0.941 (0.964), thereby contributing to the mean overall efficiency of the sample banks at 0.952. However, the related efficiency changes decline over the sample period, thereby suggesting that the average banks' efficiencies hardly increase. Regression analyses show a significantly positive relationship between IC and banks' overall resource-utilization and investment efficiencies. Research limitations/implications - Overall, this study suggests that researchers should consider risks when estimating banks' efficiencies owing to their connection to banks' investment performance. From banks' dynamic two-stage efficiencies, this study demonstrated that investments in IC will bring improved future economic benefits. Originality/value - Different from prior studies, this study improves banks' efficiency evaluation models by incorporating risk measures and assuming weighted periods for the 2007-2008 global financial crisis. Moreover, the use of monetary value-based measure of IC provides consistent results as the commonly-used VAICTM does.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66abd81df5ccd615dacee4cf036f5570",
  "timestamp": "2025-05-15T02:51:58.525879"
}