{
  "id": 4243,
  "title": "Risk Factors for Financial Hardship in Patients Receiving Adjuvant Chemotherapy for Colon Cancer: A Population-Based Exploratory Analysis",
  "abstract": "Purpose Characteristics that predispose patients to financial hardship during cancer treatment are poorly understood. We therefore conducted a population-based exploratory analysis of potential factors associated with financial hardship and treatment nonadherence during and following adjuvant chemotherapy for colon cancer. Patients and Methods Patients diagnosed with stage III colon cancer between 2008 and 2010 were identified from a population-based cancer registry representing 13 counties in Washington state. Patients were asked to complete a comprehensive survey on treatment-related costs. Patients were considered to have experienced financial hardship if they accrued debt, sold or refinanced their home, borrowed money from friends or family, or experienced a 20% or greater decline in their annual income as a result of treatment-related expenses. Logistic regression analysis was used to investigate factors associated with financial hardship and treatment nonadherence. Results A total of 284 responses were obtained from 555 eligible patients (response rate, 51.2%). Nearly all patients in the final sample were insured during treatment. In this sample, 38% of patients reported one or more financial hardships as a result of treatment. The factors most closely associated with treatment-related financial hardship were younger age and lower annual household income. Younger age, lower income, and unemployment or disability (which occurred in most instances following diagnosis) were most closely associated with treatment nonadherence. Conclusion A significant proportion of patients undergoing adjuvant chemotherapy for stage III colon cancer may experience financial hardship, despite having health insurance coverage. Interventions to help at-risk patients early on during therapy may prevent long-term financial adverse effects.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66bbae4abe8f4af65bbfbeea6d1e2f74",
  "timestamp": "2025-05-15T02:34:48.924161"
}