{
  "id": 7346,
  "title": "Factors influencing SME project returns on Islamic Fintech lending platform",
  "abstract": "PurposeIslamic financial technology (fintech), primarily peer-to-peer (P2P) lending, plays a substantial role in funding the unbanked population and small and medium enterprises (SMEs) by offering streamlined financial services through online digital technology. In addition, Islamic fintech lending offers a promising return rate for individual and institutional investors, and therefore, it is considered a worthy investment alternative for diversification. This study aims to examine the determinants of project returns of SMEs on Islamic fintech lending platforms, taking the case study of one Islamic fintech lending platform registered at the Financial Service Authority in Indonesia.Design/methodology/approachProject return information and other information, such as the name of the SME raising fund, project duration, location, contract (aqad) and value (amount of money) to be raised, were extracted from the Islamic fintech lending platform. Furthermore, a regression analysis was performed using the completed projects as sample data (n = 122) on the platform.FindingsThe results show that the rate of return is significantly affected by project duration and type of Sharia-compliant contract. Location and project value are, however, found to be statistically insignificant. This study's overall results align with the Signaling theory, indicating the importance of information for decision-making.Research limitations/implicationsDue to limited access to the data, our study uses data from one of seven Islamic fintech lending platforms; thus, the study results may not be generalized to the general population.Practical implicationsThe results suggest that investors aspiring to invest their funds in SME projects on Islamic fintech lending platforms should consider the project duration and contractual agreement since these factors significantly influence the return. Additionally, society may consider the Islamic fintech lending platform a viable investment instrument since its return rate follows the risk-return principle in classical and established finance theories. That is why Islamic fintech lending platforms are competitive compared to the more established ones, such as the Islamic stock market.Originality/valueTo the best of the authors' knowledge, this study is the first study using an empirical approach to reveal the project return determinants of SMEs on Islamic fintech lending platform.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66c0d8d6b96f16eaaa67abc8c5dc744e",
  "timestamp": "2025-05-15T03:07:31.920820"
}