{
  "id": 5412,
  "title": "Policy and priorities for national cancer control planning in low- and middle-income countries: Lessons from the Association of Southeast Asian Nations (ASEAN) Costs in Oncology prospective cohort study",
  "abstract": "Background: Evidence to guide policymakers in developing affordable and equitable cancer control plans are scarce in low- and middle-income countries (LMIC). Methods: The 2012-2014 ASEAN Costs in Oncology Study prospectively followed-up 9513 newly diagnosed cancer patients from eight LMIC in Southeast Asia for 12 months. Overall and country-specific incidence of financial catastrophe (out-of-pocket health costs >= 30% of annual household income), economic hardship (inability to make necessary household payments), poverty (living below national poverty line), and all-cause mortality were determined. Stepwise multinomial regression was used to estimate the extent to which health insurance, cancer stage and treatment explained these outcomes. Results: The one-year incidence of mortality (12% in Malaysia to 45% in Myanmar) and financial catastrophe (24% in Thailand to 68% in Vietnam) were high. Economic hardship was reported by a third of families, including inability to pay for medicines (45%), mortgages (18%) and utilities (12%), with 28% taking personal loans, and 20% selling assets (not mutually exclusive). Out of households that initially reported incomes above the national poverty levels, 4 9% were pushed into poverty at one year. The adverse economic outcomes in this study were mainly attributed to medical costs for inpatient/outpatient care, and purchase of drugs and medical supplies. In all the countries, cancer stage largely explained the risk of adverse outcomes. Stage-stratified analysis however showed that low-income patients remained vulnerable to adverse outcomes even when diagnosed with earlier cancer stages. Conclusion: The LMIC need to realign their focus on early detection of cancer and provision of affordable cancer care, while ensuring adequate financial risk protection, particularly for the poor. (C) 2017 Elsevier Ltd. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66d5ca6d07f0aba80febbf69d364c773",
  "timestamp": "2025-05-15T02:47:14.136869"
}