{
  "id": 835,
  "title": "Financial Advisor Recruitment: A Smart Crowdsourcing-Assisted Approach",
  "abstract": "Successful portfolio management requires, in addition to advanced optimization strategies, effective recruitment of specialized financial advisors. Hiring the wrong ones can be detrimental to investors' financial goals. In this article, we propose an automated crowdsourcing system to organize cooperation between financial advisors and investors. Without interfering with their private portfolio optimization techniques, we design a recruitment framework that matches financial advisors to investors based on their profiles and features, as well as the previous activities of their peers. Using the database of the crowdsourcing platform, we employ an unsupervised technique to regroup advisors with a high degree of similarities into clusters and, hence, shrink the search space. Afterward, we train a machine learning regression model to predict the matching score that can be achieved if an investor hires a particular advisor. These scores are converted to weights of bipartite graphs to which we apply a double-phased many-to-many maximum weight matching algorithm to determine a suitable investor-advisor combination. In the simulations, we investigate the performance of the proposed recruitment approach and show that, compared with other traditional approaches, higher returns can be reached for both investors and financial advisors.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66df03a752e041339bad78a5ce96a4c0",
  "timestamp": "2025-05-15T00:48:22.521956"
}