{
  "id": 3782,
  "title": "Cumulative Adverse Financial Circumstances: Associations with Patient Health Status and Behaviors",
  "abstract": "This article examines associations between cumulative adverse financial circumstances and patient health in a sample of 1,506 urban emergency department (ED) patients. Study participants completed a previously validated Social Health Survey between May and October 2009. Five categories of economic deprivation were studied: food insecurity, housing concerns, employment concerns, cost-related medication nonadherence, and cost barriers to accessing physician care. Logistic regression that adjusted for the effects of demographics (age, gender, race, education) tested the association between the cumulative number of adverse financial circumstances (range:0 to 5) and patients' health status (self-rated health, stress level, depressed mood) and health behaviors (smoking and substance abuse). Approximately 48 percent of respondents reported one or more financial concern, and 31 percent reported two or more financial concerns. A significant graded relationship was found between the number of adverse financial circumstances and patients' poor/fair self-rated health, depressed mood, high stress, smoking, and illicit drug use. Findings suggest that in today's acute health safety net, patients' concerns related to financial insecurity are very relevant to patient health. This underscores the imperative for hospital-based social workers to design models of routine social health risk screening and system interventions that address patient financial well-being in the ED.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66df71a526c00d431a83e004237d9aa7",
  "timestamp": "2025-05-15T02:29:59.155335"
}