{
  "id": 6646,
  "title": "Glaucoma Risk Alleles at CDKN2B-AS1 Are Associated with Lower Intraocular Pressure, Normal-Tension Glaucoma, and Advanced Glaucoma",
  "abstract": "Purpose: Genetic variation at the 9p21 locus encompassing the CDKN2B-AS1, CDKN2A, and CDKN2B genes has been associated with primary open-angle glaucoma (POAG) in several independent studies. This study aimed to dissect the association further and to determine genotype-phenotype correlations between genetic variation at this locus and a range of glaucoma-related traits in a large cohort of POAG patients. Design: Comparative case series and case-control study. Participants: One thousand four hundred thirty-two POAG patients and 595 unaffected controls recruited from 2 population-based and 2 cross-sectional studies. Methods: Each patient was genotyped at 9 single nucleotide polymorphisms (SNPs) previously associated with POAG at the 9p21 locus. Each SNP was assessed for association with each outcome measure using linear regression under an additive genetic model. Associated traits were explored further including adjustment for relevant covariates. Highest recorded intraocular pressure (IOP) also was analyzed both with and without correction for central corneal thickness (CCT) and was dichotomized into high-tension glaucoma and normal-tension glaucoma (NTG). Main Outcome Measures: Intraocular pressure and vertical cup-to-disc ratio (VCDR). Results: Glaucoma risk alleles at 9p21, particularly, rs7049105 and rs10120688, were associated with the presence of both NTG and advanced POAG. The SNP rs10120688 was associated with greater VCDR after adjustment for covariates (P = 0.003; beta = 0.016; standard error, 0.006). In addition, multiple SNPs in the region were associated with reduced IOP, before and after adjustment for CCT. The SNP most significantly associated with IOP was also rs10120688 (P = 0.001; beta = -2.135; standard error, 0.634) after adjustment for covariates under an additive model. In a comparison of high-tension versus low-tension glaucoma, this SNP was also the most significantly associated, particularly when IOP was corrected for CCT before classification of the type of glaucoma (P = 0.0009; odds ratio, 0.63; 95% confidence interval, 0.48-0.83). Conclusions: Patients with POAG carrying the glaucoma risk alleles at the 9p21 locus have larger VCDR and lower IOP than POAG patients without these alleles. Carriers of these alleles seem to be predisposed to POAG developing at lower IOP levels and exhibit stronger associations with NTG and advanced glaucoma phenotypes. This may be of relevance when setting target pressures in patients carrying these risk alleles. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:1539-1545 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66e46dabebe2ea9c148368ac48cd2dbd",
  "timestamp": "2025-05-15T03:00:05.046103"
}