{
  "id": 4822,
  "title": "Hybrid robust and stochastic optimization for a capital-constrained fresh product supply chain integrating risk-aversion behavior and financial strategies",
  "abstract": "A fresh product supply chain is considered in which an omnichannel retailer procures products from multiple suppliers and distributes them through a distribution center to physical stores to serve both online and offline customers. A two-stage stochastic optimization model is formulated for the strategic and operational decisions of the omnichannel retailer incorporating the decision maker's risk aversion behavior and financial flow into supply chain optimization. In the model, the amount of capital possessed by the retailer is treated as a hard constraint, and trade credit and bank loans are both considered as financial sources. After linearization, the two-stage stochastic optimization model is transformed into a mixed integer linear programming model. A hybrid robust and stochastic optimization approach is developed to simultaneously cope with two different types of uncertainties in the supply chain by including stochastic scenarios for transportation costs and using interval + polyhedral  uncertainty sets for demands and deterioration rate. The robust counterpart of the mixed integer linear programming model is constructed. An improved sample average approximation method using the k means clustering technique is adopted to solve the problem. The applicability of the proposed model and the efficiency of the solution approach are investigated through numerical studies. Some important managerial insights are provided through the model, the solution approach and the numerical studies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66e7ab3e8d89f61c723c157ff478b870",
  "timestamp": "2025-05-15T02:41:32.684440"
}