{
  "id": 5774,
  "title": "Inter-linkages and performance of Asian stock markets amidst COVID 2019",
  "abstract": "The corona virus outbreak, which originated in China, has infected lakhs of people. Its spread has left businesses around the world counting costs. The corona virus is going global, and it could bring the world economy to a standstill. COVID-2019 that began in the depths of China's Hubei province is spreading rapidly, persuading the World Health Organization to declare it as a pandemic. There are now significant outbreaks from South Korea to Italy and Iran, from America to Britain. The ongoing spread of the new corona virus has become one of the biggest threats to the global economy and financial markets. The economic impact of the COVID-2019 pandemic has introduced extraordinary volatility in global financial markets, as participants are obliged to reassess their valuations of all investments and associated derivatives as the situation develops. In an environment where uncertainty makes it unusually hard to price assets and for market-makers to operate, exchanges are providing the only way to establish consensus on these valuations in real time. Volatility has reached levels comparable with the Global Financial Crisis of 2008, with one-day losses not seen since 1987. The situation is made more challenging by high levels of indebtedness and already low interest rates. The financial markets are all integrated into one as global markets in the current era of globalization. It is important that financial markets remain able to perform their role - providing investors with liquidity, facilitating price discovery, and allowing for risk transfer and the transmission of monetary policy. This study aims at examining the performance of the selected Asian stock markets amidst the times of COVID-2019. This study intends to examine the interlinkages of Asian stock markets selected and to observe the impact of COVID-2019 on these markets. The period of study is from 1st December, 2019 to 31st March, 2020. The tools adopted for the study are correlation, regression, ANOVA and paired sample t test.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66f1f9d46e37d749ba45dcfacfc8fa7e",
  "timestamp": "2025-05-15T02:51:29.981274"
}