{
  "id": 7118,
  "title": "Social and regional variations in health status and health behaviours among Swiss young adults",
  "abstract": "OBJECTIVE: To provide nationwide data on health status and health behaviours among young adults in Switzerland, and to illustrate social and regional variations. METHODS: Data came from the Swiss Federal Surveys of Adolescents, conducted in 2010/11. The sample consisted of 32,424 young men and 1,467 young women. We used logistic regression models to examine patterns of social inequality for three measures of health status and three measures of health behaviour. RESULTS: Among men, lower self-rated health, overweight and lower physical fitness levels were associated with lower educational and fewer financial resources. Patterns were similar among young women. Unfavourable self-rated health (odds ratio [OR]: men 0.83, women 0.75) and overweight (OR: men 0.84, women 0.85; p >0.05) were less common in the French-than in the German-language region. Low physical fitness was more common in the French-than in the German-language region. In both sexes, daily smoking was associated with fewer educational resources, and physical inactivity was associated with lower educational and fewer financial resources. Males from the Italian-language region were three times more likely to be physically inactive than their German-speaking counterparts (OR 2.95). Risk drinking was more wide-spread among males in the French-than in the German-speaking language region (OR 1.47). CONCLUSIONS: Striking social and moderate regional differences exist in health status and health behaviours among young Swiss males and females. The current findings offer new empirical evidence on social determinants of health in Switzerland and suggest education, material resources and regional conditions to be addressed in public health practice and in more focused future research.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66f78bcdbd12b90f8327bfa05438cdd9",
  "timestamp": "2025-05-15T03:05:32.007910"
}