{
  "id": 6578,
  "title": "The interactive impact of tax avoidance and tax risk on the firm value: new evidence in the Tunisian context",
  "abstract": "PurposeThe purpose of this study is to examine the interactive impact of tax avoidance and tax risk on the firm value.Design/methodology/approachThis study covers 290 observations on non-financial corporations listed on the Tunisian Stock Exchange for the period ranging from 2008 to 2020, using the multiple linear regression technique.FindingsThe results show that tax avoidance positively affects the firm value while tax risk has a negative influence on the company value. More importantly, tax risk moderates the positive impact of tax avoidance on the firm value. Accordingly, tax avoidance must be considered in conjunction with tax risk when studying the effect on the firm value. The findings of additional analyses indicate that when tax avoidance is associated with a high level of tax risk, it negatively affects the firm value. Thus, investors negatively rate the high-risk tax avoidance.Research limitations/implicationsThe major limitation of this study is that it focuses only on Tunisian listed companies since their financial statements are publicly available. Although the sample is relatively small due to the problem of data availability, it is satisfactory owing to the twelve-year sampling period (from 2008 to 2020). Research implications- The results obtained are of great interest to researchers as they should be more careful in simply using effective tax rates as a measure of risky or aggressive tax avoidance.Practical implicationsThe findings may signal the need for Tunisian firm managers to consider spillovers when adopting risky tax avoidance strategies and to implement a tax risk management policy within the firm. They are also substantial for Tunisian regulators to create requirements for reporting risky tax avoidance practices in the company annual reports to protect the investors' rights and the society interest in general. The results are also useful for the investors who would like to make good decisions with respect to tax planning strategies. It is not enough to rely on the Effective Tax Rate (ETR) to judge whether or not tax planning is risky. Volatile ETRs, as a proxy of the tax risk, can be useful for them in decision-making.Social implicationsThe results also highlight that risky tax avoidance decreases the firm value, and thus confirm the negative repercussions that such behavior can have not only on the firm, but also on the society in general, as the corporate tax contributes to covering the State public expenditure. Hence, it is considered a general concern.Originality/valueThe present study differs from others in the existing literature. In fact, it examines the joint effect of tax avoidance and tax risk on the firm value for Tunisian listed companies which are characterized by the predominance of agency conflicts between major shareholders and minor ones. Therefore, the authors seek to investigate if small shareholders can penalize risky tax avoidance practices by decreasing the firm value.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "66fd515361ebf0ffa45b668d363a27c3",
  "timestamp": "2025-05-15T02:59:36.944539"
}