{
  "id": 524,
  "title": "Optimal techno-economic assessment of isolated microgrid integrated with fast charging stations using radial basis deep learning",
  "abstract": "The global transportation electrification commerce sector is now booming. Stakeholders are paying an increased attention to the integration of electric vehicles and electric buses into the transportation networks. As a result, there is an urgent need to invest in public charging infrastructure, particularly for fast charging facilities. Consequently, and to complete the portfolio of the green environment, these fast-charging stations (FCSs) are designed using 100% of renewable energy sources (RESs). Thus, this paper proposes an optimization model for the techno-economic assessment of FCSs comprising photovoltaic and wind turbines with various energy storage devices (ESDs). In this regard, the FCS performance is evaluated using flywheels and super capacitors due to their high-power density and charging/discharging cycles and rates. Then, optimal sizing of these distributed generators is attained considering diverse technical and economical key performance indicators. Afterwards, the problem gets more sophisticated by investigating the effect of RES's uncertainties on the selection criterion of the FCS's components, design and capacity. Eventually, as an effort dedicated to an online energy management approach, a deep learning methodology based on radial basis network (RBN) is implemented, validated, and carried out. In stark contrast to conventional optimization approaches, RBN demonstrates its superiority by obtaining the optimum solutions in a relatively short amount of time.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "670469af77c4589dadc30832e2ca5f28",
  "timestamp": "2025-05-15T00:37:01.738533"
}