{
  "id": 6065,
  "title": "Low HIV Viral Load Suppression and Its Implications for Controlling HIV among Refugee Adolescents and Youth Living in Refugee Settlements in Uganda: A Cross-sectional Analysis",
  "abstract": "Viral load suppression (VLS) is considered crucial in the global efforts to end the HIV/AIDS pandemic and young people lag behind adults in this important indicator. However, little is known about VLS among refugee adolescents and youth (RAY), a vulnerable group, often ignored by research, with multiple intersecting risk factors and unique challenges. The goal of this study was to determine the prevalence of VLS and examine associated risk and protective factors among RAY in refugee settlements in Uganda, a country severely affected by the HIV/AIDS pandemic and currently hosting the most refugees in sub-Saharan Africa (SSA). We analyzed cross-sectional data from a pilot cluster randomized trial with 180 participants (ages 13-30) recruited from 20 health centers in three refugee settlements between July and December 2023. We employed a hierarchical (mixed-effects) logistic regression model to examine the association between selected demographic, psychosocial, and economic factors and VLS. The prevalence of VLS among RAY was very low at just 52%. Factors associated with VLS included financial stability, adherence self-efficacy, and HIV status disclosure. Having financial savings was associated with VLS (adjusted odds ratio:2.68; 95% CI: 1.48-5.11; p = 0.003). Treatment support from others including teachers and health care providers had five-fold odds of VLS (5.0, 1.64-15.24; p = 0.005). Conversely, older age and interactions between stigma/self-efficacy and stigma/HIV status disclosure were associated with viral load non-suppression. This study highlights the urgent need for tailored interventions targeting economic and psychosocial hardships like poverty, stigma, and food insecurity to enhance HIV VLS and other treatment outcomes among RAY.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "674b3781e35e1834b61e1a01f270cc68",
  "timestamp": "2025-05-15T02:54:38.731887"
}