{
  "id": 2415,
  "title": "The Role of Corporate Governance in Investment Efficiency and Financial Information Disclosure Risk in Companies Listed on the Tehran Stock Exchange",
  "abstract": "This study's primary purpose is to investigate corporate governance's role in investment efficiency and financial information disclosure risk in companies listed on the Tehran Stock Exchange. A multivariate linear regression model based on the panel data model was used to test the research hypotheses. The results of the survey of 140 companies listed on the Tehran Stock Exchange from 2015 to 2021 indicate that investment efficiency has increased by increasing the quality of corporate governance. In addition, research findings show that improving the quality of corporate governance reduces the risk of financial information disclosure. The life cycle and firm size were used to evaluate the robustness of the results obtained in this study. It was observed that improving corporate governance in companies in the stages of growth and maturity increases investment efficiency and reduces the financial information disclosure risk. In contrast, in companies that are in the decline stage, it reduces investment efficiency and increases the risk of financial information disclosure. In terms of firm size, it was also observed that, in small firms, as corporate governance increases, investment efficiency decreases, and the risk of financial information disclosure increases. However, investment efficiency and financial information disclosure reduce risk by improving large companies' corporate governance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "675c8089771024373cd8975fb2e0eae3",
  "timestamp": "2025-05-15T02:15:26.926742"
}