{
  "id": 8688,
  "title": "Associated factors for multidimensional attitudes and behaviors of reproductive health toward pregnancy among early and late adolescents in Tanzania: a cross-sectional study",
  "abstract": "BackgroundAdolescent pregnancy is a serious reproductive health problem in Tanzania. However, the risk factors for multidimensional attitudes and behaviors of reproductive health toward pregnancy in Tanzanian adolescents remain unexplored.MethodsWe collected baseline characteristics and information on attitudes and behaviors of reproductive health from 4161 Tanzanian adolescents in all 54 primary and secondary schools in the Korogwe district. We applied mixed effect multiple regression analyses stratified by sex to find the factors related to reproductive health attitudes and behaviors toward pregnancy.ResultsIn female students, regarding the attitudes of reproductive health, higher age, hope for marriage in the future, a talk with a parent about sex or pregnancy, and a higher hope score were significantly associated with a lower score. For the behaviors of reproductive health, higher age, a talk with a parent about sex or pregnancy, time to talk with a parent about daily life, and a higher hope score were significantly associated with a lower score. In male students, regarding the attitudes of reproductive health, a higher hope score was significantly associated with a lower score. For the behaviors of reproductive health, higher age, time to talk with a parent about daily life, and a higher hope score was significantly associated with a lower score.ConclusionsThe heterogeneous factor-outcomes association between female and male students suggested that sex-specialized interventions may be required to change their risky attitudes or behaviors of reproductive health. Although we cannot conclude as points of intervention, our study suggested that it may be practical to improve parent-adolescents communication about sex or reproductive health and change adolescents' views of pregnancy or marriage for gaining financial or social status.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67609729ff8fb75dc588382df625b515",
  "timestamp": "2025-05-15T03:21:24.683011"
}