{
  "id": 919,
  "title": "Proceedings From a National Heart, Lung, and Blood Institute and the Centers for Disease Control and Prevention Workshop to Control Hypertension",
  "abstract": "Hypertension treatment and control prevent more cardiovascular events than management of other modifiable risk factors. Although the age-adjusted proportion of US adults with controlled blood pressure (BP) defined as <140/90 mm Hg, improved from 31.8% in 1999-2000 to 48.5% in 2007-2008, it remained stable through 2013-2014 and declined to 43.7% in 2017-2018. To address the rapid decline in hypertension control, the National Heart, Lung, and Blood Institute and the Division for Heart Disease and Stroke Prevention of the Centers for Disease Control and Prevention convened a virtual workshop with multidisciplinary national experts. Also, the group sought to identify opportunities to reverse the adverse trend and further improve hypertension control. The workshop immediately preceded the Surgeon General's Call to Action to Control Hypertension, which recognized a stagnation in progress with hypertension control. The presentations and discussions included potential reasons for the decline and challenges in hypertension control, possible big ideas, and multisector approaches that could reverse the current trend while addressing knowledge gaps and research priorities. The broad set of big ideas was comprised of various activities that may improve hypertension control, including: interventions to engage patients, promotion of self-measured BP monitoring with clinical support, supporting team-based care, implementing telehealth, enhancing community-clinical linkages, advancing precision population health, developing tailored public health messaging, simplifying hypertension treatment, using process and outcomes quality metrics to foster accountability and efficiency, improving access to high-quality health care, addressing social determinants of health, supporting cardiovascular public health and research, and lowering financial barriers to hypertension control.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "676091ee61cf9fd46e9d1dbe481e5c8d",
  "timestamp": "2025-05-15T01:44:35.361632"
}