{
  "id": 3072,
  "title": "The Interaction of Dopamine Genes and Financial Stressors to Predict Adulthood Intimate Partner Violence Perpetration",
  "abstract": "Three dopamine genes (DAT1, DRD2, and DRD4) have been associated with interpersonal delinquency, aggression, and violence when individuals experience adverse environmental exposures. Guided by the catalyst model of aggression, risk alleles identified in previous studies were hypothesized to be associated with intimate partner violence (IPV) perpetration in the presence of financial stressors, a possible environmental trigger. This hypothesis was tested using weighted, clustered logistic regression with data from the National Longitudinal Study of Adolescent to Adult Health. The direct effects DAT1, DRD2, and DRD4 on IPV perpetration, and the interaction of DAT1, DRD2, and DRD4 and financial stressors on IPV perpetration were assessed. Due to cell size, only White men and women were included in this analysis. Increasing number of financial stressors was associated with increased odds of IPV perpetration, regardless of DAT1, DRD2, and DRD4 alleles. As predicted, increasing number of financial stressors was more strongly associated with IPV perpetration among individuals with high-risk DAT1 alleles, than individuals with low-risk alleles. However, this relationship was inverted for DRD2. Although there was still a significant interaction between DRD2 and financial stressors, individuals with low-risk alleles had higher odds of IPV perpetration in the presence of financial stressors. A similar, nonsignificant relationship was found for DRD4. These findings indicate that these genes may interact differently with environmental exposures and types of violent behavior. In addition, the findings may, if replicated, suggest dopamine plays a different role in IPV perpetration compared with other forms of aggression and violence.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67628b63ca885dd4d99b720288c50ece",
  "timestamp": "2025-05-15T02:22:25.061301"
}