{
  "id": 8534,
  "title": "Intimate partner violence among women with mental health-related activity limitations: a Canadian population based study",
  "abstract": "Background: There is strong evidence that women with serious or chronic mental illness experience higher rates of violence than women in the general population. Our objective was to examine the risk of intimate partner violence (IPV), a form of violence that is often recurrent and linked to negative physical and psychological consequences, among a representative sample of non-institutionalized women with activity limitations (ALs) due to a mental health condition. Methods: Data from the 2009 General Social Survey were used, a national, population-based, cross-sectional survey. The sample included 6851 women reporting contact with a current or former partner in the previous five years, of whom 322 (4.7%) reported a mental health-related AL always/often or sometimes. Results: The prevalence of any type of IPV was highest among women with mental health-related ALs always/often (54.4%), followed by women reporting ALs sometimes (49.9%), and those reporting no ALs (18.3%, p < 0.0001). The same pattern was observed for emotional (51.1%, 45.5%, 16.3%, p < 0.0001) and financial IPV (18.1%, 9.5%, 4.0%, p < 0.0001). For physical/sexual violence, rates were similar among women reporting mental health-related ALs always/often and sometimes, but were lower among those reporting no ALs (20.2%, 20.9%, 5.9%, p < 0.0001). In a logistic regression analysis the odds of having experienced any IPV remained greater for women reporting ALs always/often (OR = 3.65; 95% CI: 2.10, 6.32) and sometimes (OR = 3.20; 95% CI: 2.15, 4.75) than those reporting no ALs. Several social capital variables, including perceptions of having experienced discrimination, a weak sense of belonging in their local community, and low trust toward family members and strangers were also significantly associated with having experienced IPV. Conclusion: Findings suggest that women with mental health-related ALs may be at increased risk of IPV. Health and social service providers may need, therefore, to better target prevention and intervention initiatives to this population.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6785744fa9a3e5bd4da4a173fd54f850",
  "timestamp": "2025-05-15T03:19:52.110967"
}