{
  "id": 7293,
  "title": "The role of ESG scoring and greenwashing risk in explaining the yields of green bonds: A conceptual framework and an econometric analysis",
  "abstract": "This article aims to investigate the factors that most influence the yields of public sector and corporate green bonds besides those conveyed by the conventional finance theory (e.g., rating, volatility, maturity). To accomplish that, we first develop a theoretical framework that postulates the negative relationship between the size of the underlying project financed by a green bond issuance, the use of the ESG metrics to quantify such impact, as well as the positive relationship between the risk of greenwashing practices by the issuer, and the yield to maturity of the green bond. We then provide an empirical validation of our conceptual framework by estimating multiple regression models applied to two distinct samples of public and corporate green bonds issued globally in the 2012-2020 period. The reliability of our results is confirmed by further exploring the effects of some key determinants on the yield spread of green versus comparable ordinary bonds of corporate issuers. Our findings corroborate our theoretical predictions showing that investors are inclined to accept lower returns in exchange for contributing to the funding of infrastructure projects with greater impact on the sustainability of target communities or territories and require higher premia as a form of compensation when being exposed to higher risk of greenwashing by issuers. At corporate level, greenwashing risk is higher among manufacturing (rather than services) firms but more pronounced in the financial sector. At public level, green washing strategies may be more easily pursued by multinational or sovereign issuers rather than local governments as the former's greater distance from communities enables them to elude investors' controls. Important recommendations are drawn for investors, rating agencies, and policymakers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "679432b58c648fb6c4298b25d9be733a",
  "timestamp": "2025-05-15T03:07:02.653689"
}