{
  "id": 3154,
  "title": "Analyzing the nexus between financial risk and economic risk in India: Evidence through the lens of wavelet coherence and non-parametric approaches",
  "abstract": "The gravest challenge for economic sustainability is the undetermined growth in the financial and economic risks of the nation, which need to be overcome with adequate measures without compromising economic growth. The uncertainty of economic factors produces fluctuations in the financial sector and makes them more vulnerable. However, the existing literature has not significantly focused on the economic and financial risk challenge for sustainable economic growth. Therefore, to fill the gap, an in-depth study is imperative to explore the association be-tween these risks. To do so, this study incorporates both economic and financial risk to determine how risks are interconnected across time (frequency) and how they are linked by utilizing quarterly data from 1984-Q1 to 2020-Q4 and by applying both the wavelet power spectrum (WPS) and wavelet coherence (WTC) approaches, to examine the time-frequency dependency of each variable on the other. The findings of WTC revealed that the economic and financial risks have a positive dependency on each other in India at high, medium, and low frequencies. Like-wise, the wavelet power spectrum outcomes reflect the high economic and financial risks vulnerability during 1991, 1992, and 1996. In addition, for the robustness check, the study employed both the quantile regression (QR) and quantile-on-quantile regression (QQR). Both the QQR and QR endorsed the positive association between FR and ER. Hence, our paper is the first research of its kind for the Indian economy, and it extends to the existing literature by examining the link between the two most significant indicators in terms of both time and fre-quency dependency. The findings in our paper offer excellent perspectives for investors and policymakers to assess prospects for investment and policy changes if necessary.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "679445d2c60f6c1c148d1f3c67ba068d",
  "timestamp": "2025-05-15T02:22:56.821524"
}