{
  "id": 521,
  "title": "Credit default prediction using a support vector machine and a probabilistic neural network",
  "abstract": "The design of consistent classifiers to forecast credit-granting choices is critical for many financial decision-making practices. Although a number of artificial and statistical techniques have been developed to predict customer insolvency, how to provide an inclusive appraisal of prediction models and recommend adequate classifiers is still an imperative and understudied area in credit default prediction (CDP) modeling. Previous evidence demonstrates that the ranking of classifiers varies for different criteria with measures under different circumstances. In this study, we address this methodological flaw by proposing the simultaneous application of support vector machine and probabilistic neural network (PNN)-based CDP algorithms, together with frequently used high-performance models. We fill the gap by introducing a set of multidimensional evaluation measures combined with some novel metrics that are helpful in discovering unseen features of the model's performance. For effectiveness and feasibility purposes, six real-world credit data sets have been applied. Our empirical study shows that the PNN model is more robust than its rivals, and traditional performance evaluations are more or less consistent with their original counterparts. With these contributions, therefore, our investigations offer several advantages to practitioners of financial risk management.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67a35cfec50ee6b4a2e222fba471ee3e",
  "timestamp": "2025-05-15T01:52:12.204128"
}