{
  "id": 4091,
  "title": "The Effect of State Competitive Food and Beverage Regulations on Childhood Overweight and Obesity",
  "abstract": "Purpose: Policy efforts for combating childhood obesity have sought stronger state policies for regulating competitive foods and beverages (CF& Bs)available in schools. However, the evidence linking state policies to children's overall diet and body weight outcomes is limited and mixed, and experts have called for more rigorous studies that are able to address concerns about selection bias. The present study leverages a rare natural experiment where children in military families are assigned to different state policies, due to their military parent's periodic relocation, to examine whether state CF&B policies were associated with children's body mass index (BMI) and overweight or obesity. Methods: We analyzed data from 894 children (12-13 years old) in army families attending public schools located near 25 installations across 23 states in 2013. State CF&B policy measures from the Bridging the Gap project were linked to the child data. Primary outcomes included BMI z-scores and indicator for overweight or obesity. For a subsample of children with self-reported food frequency measures, we also examined the link between state CF&B policies and overall diet. All regression analyses adjusted for a rich set of child and family covariates. Results: Having strong or weak policies was significantly associated with lower BMI z-scores, lower odds of overweight or obesity, and better dietary outcomes, relative to no policy. Conclusions: A portfolio of policies that includes multiple strong policies is likely needed to observe any meaningful changes in BMI and obesity. (C) 2016 Society for Adolescent Health and Medicine. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67a449b81dc342a9eaa11a29eac735f3",
  "timestamp": "2025-05-15T01:23:58.011746"
}