{
  "id": 1189,
  "title": "A two-stage hybrid credit risk prediction model based on XGBoost and graph-based deep neural network",
  "abstract": "The credit risk prediction technique is an indispensable financial tool for measuring the default probability of credit applicants. With the rapid development of machine learning and the application of big data, increasingly sophisticated models have been designed to construct effective credit risk prediction models. In this study, we propose a two-stage hybrid model to enhance the prediction performance of credit risk. First, to make full use of the classified information hidden in credit data, we employ XGBoost to linearize and transform the original features into a high-dimensional sparse feature matrix. Second, to effectively process the transformed high dimensional data and to discover the relationships between the features, a recently proposed graph-based neural network (forgeNet) model, which is good at addressing high-dimensional data, is deployed to predict the credit risk. The real-world credit data of the Lending Club for the period from 2007 to 2016 were collected and partitioned based on the economic cycle to validate the robustness of the proposed model. The experimental results show that feature transformation and feature graph mining are two pragmatic processes for credit risk prediction when analyzing credit data. Furthermore, the proposed model is robust against different economic cycles and achieves the best average prediction results of 87.52%, 93.13% and 85.59% in terms of accuracy, F1 score, and G-mean compared with other benchmarks, including individuals, hybrid models, and ensembles. The average performance of the proposed model rose by 6.14, 7.59 and 6.18 percentage points, respectively, which demonstrates the outperformance of the proposed two-stage model in credit risk prediction applications",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67a9612a6da0794b1c30f1e3520cfc32",
  "timestamp": "2025-05-15T01:59:56.308994"
}