{
  "id": 827,
  "title": "Enterprise Financing Risk Analysis and Internal Accounting Management Based on BP Neural Network Model",
  "abstract": "A BP neural network-based model is proposed to study corporate financial risk analysis and internal accounting management. Using MATLAB software and the BP neural network model, it is possible to obtain enterprise financing risk situations over a period by simulating and predicting enterprise financing risks by creating an early warning model for enterprise financing risks. Finally, from the point of view of the company's internal and external operations, the company's financial risk prevention measures and proposals are proposed to improve the financing efficiency of the companies and to prevent financial risks. This study predicts the financing risk of companies listed on the Mongolian Stock Exchange and analyzes the causes of the risk status. According to the test results, the learning speeds for successive substitutions are as follows: 0.005, 0.01, 0.02, 0.03, and 0.04. Finally, it was found that the error was minimal and the stability was best when the learning speed was exactly 0.01. The error is 0.0031011, and the step size is 157, which is only slightly lower than the target error value, which indicates that the learning speed is good. In addition, the novelty of this study is the use of the BP neural network model to conduct an early warning study of corporate financial risks. The BP neural network assessment model for corporate lending risk in this document is highly accurate. In addition to providing theoretical insights to researchers, it can be a good tool for banks to realistically assess the credit risk of SME supply chain financing.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67ad496fe4529467123b1153c49a5799",
  "timestamp": "2025-05-15T01:55:41.550705"
}