{
  "id": 113,
  "title": "Forecasting Portfolio Optimization using Artificial Neural Network and Genetic Algorithm",
  "abstract": "Investment has an important role in the economic growth of a country. The higher investment value obtained by a country, the faster the country is able to develop their prosperity. However, the investor faces some obstacle in investment activity to have a reasonable return and acceptable risk. In stock investments area, investors could increase chance of getting higher returns by making predictions and diversifying by forming a stock portfolio. Previous studies have stated that Artificial Neural Network (ANN), which are one of the machine learning models inspired by the activity of human brain cells have more advantages to predict the stock future value in terms of speed, accuracy, and the amount of data that can be processed compared to other stock prediction models. Diversification is a method of dividing investment funds into different index stocks, with the aim of reducing the investment risk. With thousands of stocks in the market, deciding which portfolio should be chosen is difficult. This study extends the scope of several previous studies, which are only limited to perform predictions using ANN or GA without forming an optimal stock portfolio. The objective of this study is to predict future stock values using ANN, then form those optimal stock portfolios using GA with aims to get the best optimization of maximal return and minimal risk value. The results of this study show, the implementation of GA as an alternative to the Single Index Model (SIM) method show better optimization index.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67adf4fe9cf4cca71922e952d8883ccc",
  "timestamp": "2025-05-15T00:39:32.568707"
}