{
  "id": 6548,
  "title": "The role of financial factors and non-financial factors on corporate bond and sukuk rating Indonesia",
  "abstract": "Purpose This study aims to analyze the determinants of ratings of corporate bonds and sukuk issued by firms listed on the Indonesia Stock Exchange (IDX) for the 2013-2019 period. Design/methodology/approach This study uses a quantitative approach by testing hypotheses and using logistic regression. Ordinal logistic endogenous (or dependent) variables (Y) in ordinal logistics use data in the form of levels (ordinal scale). Independent (or exogenous) variables (X), include financial and non-financial factors for dependent (or endogenous) variables (Y), namely, of corporate bonds and sukuk ratings. There are two approaches to the study they are Logit and Gompit (Negative Log-Log. The population of the study is Indonesian companies listed on the IDX that issued bonds and sukuk for the 2013-2019 periods. The sampling technique is purposive. In total, 16 corporate companies adhering to the above criteria and issuing bonds and sukuk were chosen. In total, 270 types of bonds and 280 types of sukuk were selected as samples. Findings The results of the Logit and Gompit regression show that leverage ratio, firm size, security structure and maturity date are important determinants of corporate bond ratings while profitability and liquidity ratios appear to have no influence on the rating. In the case of sukuk, profitability, liquidity and maturity date play important roles in influencing the corporate sukuk rating. However, there is no evidence to suggest that leverage ratio, company size and security structure may affect sukuk ratings. Research limitations/implications For both sukuk and bond issuers, it is necessary to pay attention to the factors that may affect the ratings. Specifically, Sukuk issuers need to pay attention to the return of asset, current ratio, growth and structure. On the other hand, bond issuers need to consider depth to equity, structure and maturity. As for investors, the findings of this study reveal that both bond and sukuk ratings reflect their performance. Practical implications This study provides useful information for investors that allows them to assess the risk of sukuk or bonds chosen based on rating and financial performance. Originality/value The novelty of this study lies in its econometric methodology used to identify factors which influence sukuk and bond ratings. Specifically, this study used two different techniques that allow a robust conclusion to be drawn. Furthermore, this study provides a systematic analysis which allows comparison between factors which affect bond and sukuk ratings in Indonesia.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67b5a1ef934e7806e9ac390b6295fc20",
  "timestamp": "2025-05-15T02:59:07.556907"
}