{
  "id": 6750,
  "title": "Occupation, industry, and the risk of prostate cancer: a case-control study in Montreal, Canada",
  "abstract": "Background: Age, family history and ancestry are the only recognized risk factors for prostate cancer (PCa) but a role for environmental factors is suspected. Due to the lack of knowledge on the etiological factors for PCa, studies that are both hypothesis-generating and confirmatory are still needed. This study explores relationships between employment, by occupation and industry, and PCa risk. Methods: Cases were 1937 men aged <= 75 years with incident PCa diagnosed across Montreal French hospitals in 2005-2009. Controls were 1994 men recruited concurrently from electoral lists of French-speaking Montreal residents, frequency-matched to cases by age. In-person interviews elicited occupational histories. Unconditional logistic regression estimated odds ratios (OR) and 95 % confidence intervals (CI) for the association between employment across 696 occupations and 613 industries and PCa risk, adjusting for potential confounders. Multinomial logistic models assessed risks by PCa grade. Semi-Bayes (SB) adjustment accounted for the large number of associations evaluated. Results: Consistently positive associations-and generally robust to SB adjustment-were found for occupations in forestry and logging (OR 1.9, 95 % CI: 1.2-3.0), social sciences (OR 1.6, 95 % CI: 1.1-2.2) and for police officers and detectives (OR: 1.8, 95 % CI 1.1-2.9). Occupations where elevated risk of high grade PCa was found included gasoline station attendants (OR 4.3, 95 % CI 1.8-10.4) and textile processing occupations (OR 1.8, 95 % CI 1.1-3.2). Aside from logging, industries with elevated PCa risk included provincial government and financial institutions. Occupations with reduced risk included farmers (OR 0.6, 95 % CI 0.4-1.0) and aircraft maintenance workers (OR 0.1, 95 % CI 0.0-0.7). Conclusions: Excess PCa risks were observed across several occupations, including predominantly white collar workers. Further analyses will focus on specific occupational exposures.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67b76586c9ab449e49ab24229c42ed58",
  "timestamp": "2025-05-15T03:01:03.633730"
}