{
  "id": 3754,
  "title": "Patient-Reported Financial Toxicity Associated with Contemporary Treatment for Localized Prostate Cancer",
  "abstract": "Purpose: Contemporary treatment modalities for localized prostate cancer provide comparable overall and cancer-specific survival. However, the degree of financial burden imposed by treatment, the factors contributing to that burden, and how different treatments compare with regard to financial toxicity remain poorly understood. Materials and methods: The Comparative Effectiveness Analysis of Surgery and Radiation (CEASAR) study enrolled men with localized prostate cancer from 2011 to 2012. Questionnaires were collected at 6, 12, 36, and 60 months after enrollment. Differences in patient-reported financial burden were compared between active surveillance, radical prostatectomy, and external beam radiotherapy using multivariable logistic regression. Results: Among 2,121 patients meeting inclusion criteria, 15% reported large or very large burden of treatment costs within 6 months, declining to 3% by year 5. When controlling for age, education, income and other covariates, external beam radiotherapy was associated with greater financial burden than active surveillance and radical prostatectomy at 1 year (OR 2.2, 95% CI 1.2-4.1 and OR 1.5, 95% CI 1.0-2.3, respectively) and 3 years (OR 3.1 95% CI 1.1-8.8 and OR 2.1, 95% CI 1.2-3.7, respectively). Radical prostatectomy and active surveillance had similar rates of financial burden at all time points. Age, race, education, and D'Amico risk group were associated with financial burden. Conclusions: External beam radiotherapy was associated with the highest financial burden, even when controlling for age, education and income. Prospective studies that directly measure out-of-pocket and indirect costs and account more thoroughly for baseline socioeconomic differences are warranted in order to identify those most at risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67c4684e60972bca2bc2468d4c4d6a48",
  "timestamp": "2025-05-15T02:29:28.083947"
}