{
  "id": 3309,
  "title": "The Relationship between Integrated Thinking and Financial Risk: Panel Estimation in a Global Sample",
  "abstract": "There is a growing interest in identifying the benefits that companies may have once they disclose financial and sustainability information in integrated reports. The aim of this study is to analyze the relationship between integrated thinking and reporting (ITR) and financial risk in nonfinancial companies worldwide. Data were collected mainly from the Refinitiv Eikon database for 7111 companies from 85 countries over the period 2017-2021. The focal industries are basic materials, consumer discretionary, consumer staples, energy, healthcare, industrials, real estate, technology, telecommunications, and utilities. Panel regression was used as a statistical procedure and random effects models are preferred. Hypotheses related to signaling theory are confirmed, as companies are interested in high-quality disclosures in integrated reports, reflecting a positive outlook and reduced financial risk. Our results show a negative relationship between ITR and the weighted average cost of capital, and a positive association between the main predictor and liquidity measured by the cash ratio. In addition, designing a compensation system linked to sustainability performance leads to a reduced cost of financing through debt and equity. Robustness tests were applied to the relationship between ITR and the weighted average cost of capital; the results show that stricter board oversight and holistic stakeholder management can decrease the average cost of capital and the financial risk for the company. This research is important for stakeholders looking to improve their knowledge about integrated reports and for practitioners seeking to enhance the quality of integrated reports and reduce the financial risk of companies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67ca443c5ad935affbf5291423c5eaec",
  "timestamp": "2025-05-15T02:24:39.767913"
}