{
  "id": 1388,
  "title": "Advanced Artificial Intelligence Model for Financial Accounting Transformation Based on Machine Learning and Enterprise Unstructured Text Data",
  "abstract": "Machine learning belongs to the science of artificial intelligence, so its main exploration goal is artificial intelligence, mainly to accumulate experience and improve the relevant performance of the algorithm. ML is a complex discipline that learns and improves skills primarily through imitation. Unstructured text data refer to unstructured data in the form of text. Financial accounting is a basic work of an enterprise, mainly to provide decision-making reference information for enterprise managers to ensure the normal operation of the enterprise. Financial accounting is a management activity that monitors the business and provides relevant information to the relevant authorities. This paper aims to study the advanced artificial intelligence model of financial accounting transformation based on machine learning and enterprise unstructured text data, expecting to use machine learning and unstructured text technology to upgrade the management of financial accounting and improve its analysis level. In this paper, an improved KMP algorithm is proposed for the keyword matching problem of unstructured data. Then, the data crawling technology of unstructured text is studied. It mainly uses the crawler technology based on the Python language and obtains a large amount of information on the Internet by formulating appropriate regular expressions. The algorithm is used to mine the data set and generate frequent itemsets. The association rules mining algorithm is proposed and implemented, and the association rules with practical reference value are obtained. The test leads in this document indicate that the return on assets of the enterprise is -11.2%, the net interest rate on equity is -44.5%, and the business profit rate is -12.1%. This shows that the profitability of the company has been declining in recent years, and there is even the risk of bankruptcy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67cd5f4c3c0b5b5d36ac2f4386cb93fa",
  "timestamp": "2025-05-15T02:02:22.740372"
}