{
  "id": 4306,
  "title": "Living in a large family and low daily water consumption substantially expose for human scabies in rural Ethiopia: a matched analysis",
  "abstract": "BackgroundScabies has been added to the neglected tropical diseases portfolio for large-scale disease control action since 2017 and is part of the WHO roadmap for NTDs 2021-2030, targeted at ending the neglect to achieve the sustainable development goals. Previous studies have not fitted matched analysis to identify predictors of scabies infestation in Ethiopia. Information is also scarce about predictors of scabies infestation in this area. Therefore, this study aimed to identify predictors of scabies infestation in rural Aneded District, northwest Ethiopia.MethodsA community-based matched case-control study involving 183 cases and 549 controls was undertaken from March 1 to May 31, 2021, in rural Aneded District. A two-stage sampling technique with a house-to-house census for the screening of scabies cases was employed. A structured questionnaire with questions on sociodemographics, behavior, water supply, sanitation, and hygiene, and delivery of scabies-specific interventions was used. Pretesting, training of data collectors and supervisors, and supervision were applied to keep the data quality. A multivariable conditional logistic regression model was fitted to identify predictors of scabies.ResultsUnmarried individuals or those in separated families (adjusted matched odds ratio (AmOR = 2.71; 95% CI 1.30-5.65); those unable to read and write or in illiterate families (AmOR = 5.10; 95% CI 1.81-14.36); those in large families (AmOR = 6.67; 95% CI 2.83-15.73); households that had longer travel times for water collection (AmOR = 2.27; 95% CI 1.08-4.76); those that had low daily water consumption (AmOR = 6.69; 95% CI 2.91-15.37); households that disposed of solid wastes in open fields (AmOR = 5.60; 95% CI 2.53-12.40); and households that did not receive scabies-specific interventions (AmOR = 2.98; 95% CI 1.39-6.39) had increased odds of scabies.ConclusionsBeing unmarried, illiteracy, large family, long travel time for water collection, low daily water consumption, open dumping of solid wastes, and inaccessibility of scabies-specific interventions are predictors of scabies. This information is instrumental for redesigning improved scabies-specific interventions that consider educational status, marital status, family size, water collection time, daily water consumption, solid waste disposal, and equity and optimization in delivering existing interventions in rural Ethiopia.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67dc78842ff00190962848e17692fd3f",
  "timestamp": "2025-05-15T01:25:50.504824"
}