{
  "id": 1611,
  "title": "Business models for local energy market and circular economy establishment in municipalities: A case study in an Austrian municipality",
  "abstract": "Energy communities often lack authority for establishment and operation management. Municipal authorities could take the role of such community operators. Therefore, Local Sustainable Municipalities are introduced, providing a local energy market on the municipal level with inclusion of sustainable resource utilization. The analyses include examinations of the scope of local markets in a municipality, portfolio investigations on different waste treatment plants and greywater system installation analyses. Furthermore, different adopted municipality strategies and their impact on municipal portfolio and market operation are examined. A clustering-based optimization framework for portfolio and market optimization is developed to perform these analyses. The proposed modeling approach leads to a significant model size reduction compared with hourly data optimization while providing location determination and portfolio estimation. The results indicate energy-sharing differences between municipal markets and local markets in energy communities. Decentralized energy provision is similar to centralized energy provision but on the municipal level. Furthermore, results show that waste incineration energy recovery can provide dispatchable low-emission energy with a high level of energy security and should be supported until the energy transition is more advanced. Finally, results on local strategies show that specific municipal goals always lead to increased costs for the municipality.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67fcb13a934c95a0600fe0f0618a0e1e",
  "timestamp": "2025-05-15T00:57:46.820825"
}