{
  "id": 73,
  "title": "RETRACTED: Risk Prediction and Response Strategies in Corporate Financial Management Based on Optimized BP Neural Network (Retracted Article)",
  "abstract": "This paper mainly analyzes the theories related to the financial risk of the company and combines the principles of principal component analysis, particle swarm optimization algorithm, and artificial neural network to derive the financial risk index system of the company. To improve the accuracy of financial risk prediction, principal component analysis and particle swarm algorithm are applied to optimize the BP neural network model, the input data of the prediction model is improved, and the optimal initial weights and thresholds are given to the BP neural network by using particle swarm algorithm search, whereby the financial risk prediction model of particle swarm optimization BP neural network is constructed. The empirical results show that the model constructed by BP neural network not only has a high accuracy rate for static financial risk evaluation but also has a better prediction effect. After training and testing, the BP neural network-based enterprise financial risk evaluation model can accurately determine the existing financial situation of enterprise financial management and has a good prediction effect. Our research method is a fusion of the processing of the two methods, which belongs to the first integration of results.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "67fe2bba113407de1f1e0afe36c81b44",
  "timestamp": "2025-05-15T01:46:39.494292"
}