{
  "id": 6438,
  "title": "A Segmented Regression Analysis of Household Income and Recurrent Falls Among Adults in a National Cohort Study",
  "abstract": "Falls can have life-altering consequences for older adults, including extended recovery periods and compromised independence. Higher household income may mitigate the risk of falls by providing financial resources for mobility tools, remediation of environmental hazards, and needed supports, or it may buffer the impact of an initial fall on subsequent risk through improved assistance and care. Household income has not had a consistently observed association with falls in older adults; however, a segmented association may exist such that associations are attenuated above a certain income threshold. In this study, we utilized segmented negative binomial regression analysis to examine the association between household income and recurrent falls among 2,302 participants in the Reasons for Geographic and Racial Differences in Stroke (REGARDS) Study recruited between 2003 and 2007. Income-fall association segments separated by changes in slope were considered. Model results indicated a 2-segment association between household income and recurrent falls in the past year. In the range below the breakpoint, household income was negatively associated with the rate of recurrent falls across all age groups examined; in a higher income range (from $20,000-$49,999 to >=$150,000), the association was attenuated (weaker negative trend) or reversed (positive trend). These findings point to potential benefits of ensuring that incomes for lower-income adults exceed the threshold needed to confer a reduced risk of recurrent falls.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "681ef6edaa4e348cd453a21cd641d22d",
  "timestamp": "2025-05-15T02:58:05.696265"
}