{
  "id": 8939,
  "title": "Caring for a Child with Phenylketonuria: Parental Experiences from a Eurasian Country",
  "abstract": "Objectives: Phenylketonuria (PKU) and mild hyperphenylalaninemia (HPA) are characterized by increased blood phenylalanine concentrations varying from mild to severe. Management of PKU was reported to be time consuming and burdensome for caregivers. This study intended to explore the experiences of families caring for a child with PKU/HPA in a country with a high PKU rate. The aim of this study was to compare parental well-being between parents of children with and without dietary restrictions and to explore the factors associated with parental psychological well-being. Methods: Participants were interviewed about their experiences, concerns, and challenges related to the disease by using a semistructured questionnaire. After the interview, parents filled out the Beck Depression Inventory and State-Trait Anxiety Inventory-Trait. Results: This study highlighted the adverse psychological, financial, and social effects of the diagnosis and management of the disease regarding the lives of the families of children with PKU/HPA. Although parental anxiety scores of children with and without dietary restrictions were similar, depressive symptom scores were higher in parents of children with dietary restrictions. However, in multiple regression analysis, lower household income and absence of perceived social support were found to be independent factors associated with higher depressive symptom scores. Having a daughter diagnosed with PKU/HPA and lower household income were found to be factors associated with higher anxiety scores. Conclusion: This study revealed that income level, perceived social support, and gender of the child were factors associated with psychological well-being of parents caring for children with PKU/HPA. Health care professionals should identify the challenges faced by families and should be aware of risk factors associated with lower parental well-being to achieve better family adjustment and better health outcomes.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68578571f1048772342b48e61020f8e6",
  "timestamp": "2025-05-15T03:23:56.101158"
}