{
  "id": 4029,
  "title": "Financial Strain Across 25 years and Men's Lower Urinary Tract Symptoms: A Life Course Perspective",
  "abstract": "This research utilizes Coronary Artery Risk Development in Young Adults (CARDIA) cohort study data to examine whether financial strain is associated with subsequent lower urinary tract symptoms among men and whether healthcare barriers, health risk behaviors, and comorbid conditions explain this association. CARDIA recruited Black and White participants aged 18 to 30 years at baseline (1985-1986) from four United States cities. The analytic sample was comprised of men with complete data for analyses involving financial strain trajectories across 7 assessments (n = 602) and mediation tests of data collected at 4 assessments (n = 634). The outcome variable, assessed when the mean age of men was 50 years, was the American Urologic Association Symptom Index score, recoded into four symptom categories: none (6.3%); mild (62.6%), moderate (28.5%), and severe (2.6%). Symptom category was regressed on financial strain variables, adjusting for age, race, education, and self-reported benign prostatic hyperplasia. Regression analyses and structural equation modeling tested potential mediators. Compared to not being financially strained across early and midlife adulthood, experiencing more than one shift in financial strain was associated with 84% greater odds (95% confidence interval [1.24, 2.75]) of being categorized into a worse symptom category. Structural equation modeling showed that both difficulty receiving healthcare and depressive symptoms explained an association between difficulty paying for medical care and worse symptoms. Additional research is needed to confirm findings and examine other mechanisms that may further explain associations between financial strain and symptoms, such as stress responses. Accumulated evidence may inform future prevention interventions, including integrated healthcare approaches.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "686d20be6f94a7390a448c449b8c0913",
  "timestamp": "2025-05-15T02:32:27.500739"
}