{
  "id": 4799,
  "title": "Do sustainability practices influence financial performance? Evidence from the Nordic financial industry",
  "abstract": "Purpose The purpose of this study is to explore the impact of sustainability (environmental, social and governance or ESG) practices on the financial performance (FP) of the Nordic financial industry. Design/methodology/approach The study covers a sample selection of observations for a total of 152 firm-years for 39 financial companies within the Nordic region (Sweden, Denmark, Finland and Norway) for the business years including 2015-2019. Data regarding ESG and FP indicators were extracted from the Thomson Reuters Eikon database in July 2020. This is a quantitative study using regression and a generalized method of moments. Findings Using static and dynamic estimators, the authors found both positive and negative impacts of sustainability practice on FP. The authors identified a negative relationship between ESG practices and FP (return on invested capital, return on equity and earnings per share). The authors identified a positive relationship between governance and return on assets. Originality/value A key contribution to the accounting literature is the finding that there is a risk for financial firms in adopting sustainability practices, as they follow a logic that contradicts the purely economic rationale. On the other hand, the positive relationship between governance and FP helps not only companies but also regulators and researchers to understand the positive impact of a good governance structure.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "686e86529afa38477ad931f6196c6f5e",
  "timestamp": "2025-05-15T02:41:00.900095"
}