{
  "id": 8766,
  "title": "Adherence and Psychosocial Well-Being During Pandemic-Associated Pre-deployment Quarantine",
  "abstract": "Background: With the purpose of preventing SARS-Cov-2 traveling with the troops, pre-deployment and post-deployment quarantine are mandatory for the German military. This study investigates which factors could be addressed in order to facilitate adherence and mental health during isolation.Method: Six hundred three soldiers completed questionnaires at the beginning and at the end of pre-deployment quarantine: Mini-SCL (BSI), Perceived Social Support (FSozU-K22), Unit Cohesion, Military Quarantine Adherence Questionnaire (MQAQ), and quarantine-associated factors including informedness about Covid-19, perceived individual risk, benefit of quarantine, clarity of quarantine protocol, need of intimacy, social norms, stigma, practicality of the quarantine, financial disadvantages, boredom, and health promoting leadership.Results: Using stepwise regression analyses, up to 57% of the quarantine adherence was explained by social norms, boredom, perceived benefit/effectiveness of the quarantine, clear communication of the quarantine protocol and perceived risk of an infection, with social norms explaining 43%. In respect to mental health (Mini-SCL) at the beginning of quarantine, only 15% is explained by being in a partnership, (un)fulfilled need for bonding/intimacy, perceived unit cohesion, and perceived social support. Up to 20 % of the variance in mental health at the end of quarantine is explained by accumulated days of isolation before pre-deployment quarantine, age, clear communication of the quarantine protocol, perceived social support, fulfilled need for bonding/intimacy and perceived stigma. Mental health and quarantine adherence did correlate significantly, but to a slight extent. No differences between the beginning and the end of pre-deployment quarantine were found for the overall group in respect to mental health, quarantine adherence, perceived social support and perceived unit cohesion, while their trajectories differed for different subgroups including age, gender, rank, and accumulated days of quarantine: With increasing accumulated days of isolation prior to pre-deployment quarantine, mental health declined over the course of quarantine, though to a small degree.Conclusion: Findings suggest that addressing the norms of fellow soldiers and dependents alike could contribute to quarantine adherence in pre-deployment quarantine. Ongoing research should examine long-term effects on mental health, including these of accumulated days of quarantine, also taking into account post-deployment quarantine.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68774c47b7d5c735a277f851c92c1c1d",
  "timestamp": "2025-05-15T03:22:25.968162"
}