{
  "id": 1840,
  "title": "Modeling and analyzing project interdependencies in project portfolios using an integrated social network analysis-fuzzy TOPSIS MICMAC approach",
  "abstract": "Despite academics' and practitioners' increasing focus on project portfolio management over the last three decades, very few methods and tools have been proposed for modeling and analyzing interdependencies among projects within a portfolio. This paper proposes the use of a novel approach that integrates three techniques: social network analysis (SNA), fuzzy technique for order of preference by similarity to ideal solution (TOPSIS), and cross-impact matrix multiplication applied to classification (MICMAC). Network mapping provides project managers with a holistic view of interdependencies among projects; fuzzy TOPSIS MICMAC and SNA measures are used to classify projects in terms of their driving power and dependence power and out- and in-degree centrality. This categorization offers a helpful tool for project managers to distinguish among projects and classify them based on their interdependency levels, and thus, aids in identifying critical projects. For the demonstration, the approach is applied to model and analyze interdependencies between projects within a real-life portfolio from the industry. The results of this application show that the proposed approach can serve as a viable and practical means of capturing and analyzing interdependencies among projects within a portfolio.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "689b17d735937914e811b796380182ac",
  "timestamp": "2025-05-15T01:00:27.253366"
}