{
  "id": 3884,
  "title": "Determinants of Corporate Social Responsibility Disclosure: An Empirical Study of Polish Listed Companies",
  "abstract": "In this paper we explore whether a number of elements influence the levels of corporate social responsibility (CSR) disclosure in the annual reports of Polish companies. These elements include the following: company size, profitability, financial leverage, industry environmental sensitivity, board size, women on the board, internationalization, and reputation. We use content analysis to determine the quality of CSR disclosures. We test our hypotheses using a Tobit regression analysis on a sample of 60 reports from Polish companies listed on the Warsaw Stock Exchange. We find industry environmental sensitivity to have significant influence on CSR disclosures. Our research findings also reveal a relationship between company turnover, duration of the stock exchange listing, inclusion in the Respect Index portfolio and foreign capital share, and the level of CSR disclosures. This study extends the scope of previous studies by including non-commonly used independent variables: the company's internationalization and reputation. To the authors' knowledge, it is the primary step to investigating CSR reporting practices coupled with the corporate characteristics in a Central and Eastern European country such as Poland. The paper contributes to the understanding of determinants of CSR disclosure and offers findings which are potentially useful for both theory and practice.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68aba9ff73fecd020d5155a312422055",
  "timestamp": "2025-05-15T01:21:41.417404"
}