{
  "id": 3682,
  "title": "A role of industrial innovation system in innovation intensive service platform for manufacturing specialization",
  "abstract": "This research focuses on analyzing the critical linkages between manufacturing and service industries. Particularly, a service approach of innovation strategy, namely, the US (innovation intensive service) platform, is used as an enabler for manufacturing specialization. Globalization and proliferation of product knowledge in knowledge-based economy demands a new approach for industrial specialization, where integration of systems knowledge is pivotal in controlling information trafficking and management. Under this circumstance, we construct a specialization model enabled by US platform that depicts the inter-linkages among six innovation types (product, process, market, organization, structure, and investment) and eight specialization strategies (R&D, marketing, market diversity, production, regional clustering, technology, investment portfolio, and innovation services). Starting from customized services, this institutional framework will enable a contextual understanding of the transition from different innovation types into specific industrial specialization. The model also develops a strategic analysis by the firm-level US Matrix, which will help to deduce critical elements of industrial environment and technological system at the industry level by strategic positioning in the firm level. The requirements of industrial environment and technological system for developing specialization strategies will be consolidated into the industrial innovation system by using the US approach, thereby constructing an analytical framework of industrial innovation system in US platform for manufacturing specialization. The results of study should be of great academic and practical importance. Not only does it provide a mechanistic understanding of manufacturing and service interfaces, it also gives a guideline of strategic resource allocation for industrial specialization.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68ba20ea6ba2cba81c6e6165ff395140",
  "timestamp": "2025-05-15T01:19:26.267739"
}