{
  "id": 6996,
  "title": "CHARACTERISTICS THAT INFLUENCE LEVEL OF CONSERVATISM OF ACCOUNTING UN- DERGRADUATES",
  "abstract": "Objective: This study aims to investigate how risk aversion manifests itself in accounting students and what is the effect of their sociodemographic characteristics in determining a more or less conservative profile. ackground: In contrast to the Modern Finance Theory (Fama, 1970), this research presents a study that questions the perfect rationality of agents and investigates the characteristics that influence the level of conservatism's behavioral bias and its effect on students' decision making. accounting courses. Method: The data were obtained through the application of a questionnaire based on the one elaborated by Kahneman and Tversky (1979) for students of the accounting course in a public education institution in the Northeast of Brazil. Data were analyzed using descriptive analysis of responses, hierarchical cluster analysis, Mann-Whitney non-parametric test and logistic regression. Results: The results revealed that the majority of students in the accounting course are conservative and (risk averse) and there was evidence that students in the last two years of the course, that is, with more experience, are more likely to be conservative. However, no evidence was found that gender, age and income influence the level of conservatism... Contributions: These results contribute to a greater understanding of the decision-making process of individuals in the preparation of information and in the quality of financial information, through the identification of the influence of cognitive characteristics in decision making.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68cec7b723e3c704d7390e137e754b4a",
  "timestamp": "2025-05-15T03:03:55.816094"
}