{
  "id": 834,
  "title": "Investigation of changes in the cumulative number of magnetic anomalies before and after earthquakes using satellite data",
  "abstract": "Iran is always at risk of destructive earthquakes due to its location on the Alpine-Himalayan seismic belt. Many significant earthquakes have occurred there so far, which have caused a lot of financial and human losses. The plateau consists of a composite system of collision-oblique transpressive fold-and-thrust mountain belts with active reverse and strike-slip faulting, range-and-basin terrains, active subduction zones, recent volcanic activity, variable crust thicknesses and rigidity, and relatively stable aseismic blocks of different dimensions with low. topographic relief and nearly flat areas., as a result, attention to earthquakes and research in its various fields is necessary and inevitable in Iran. This study investigated Iran's earthquakes from 2014 to 2021 with a magnitude above 5.5. A total of 30 earthquakes were investigated, of which 21 cases were considered due to solar activities and the simultaneous occurrence of some earthquakes. For this purpose, Swarm Alpha and Swarm Charlie satellite data belonging to the European Space Agency have been used vector magnetic field of all the paths that passed near the place of the earthquake was used between two months before the occurrence and one month after it. First, by performing the first stage of processing for the paths that are close to the earthquake in terms of time, the vivid anomalies caused by the event are identified in the y component of the magnetic field. Then, using these anomalies, a threshold value for the standard deviation is defined for each event so that the anomalies with a higher standard deviation than this threshold value are examined and analyzed. Finally, the occurrence of the studied earthquakes was predicted by fitting the sigmoid function to the cumulative number of anomalies. Because the sigmoid function is not a dynamic function, at the same time, a cubic function has been used to estimate the critical time of the system so that when the sigmoid function cannot fit the data, the cubic function can do this. A first-order curve has also been used to show the proper fit of the data with the sigmoid and cubic functions. And also, C-factor has been used to show the strong compatibility of sigmoid and cubic functions with the cumulative number of anomalies. In the last stage, an analysis has been done under the title of Confutation analysis in such a way that the said algorithm is applied to the areas where the earthquake did not occur, and it is expected that the cumulative number of anomalies drawn, will be closer to the linear state than when the earthquake occurred. Using the existing database, 90% of the occurrence of earthquakes studied in this study, pre-indication abnormalities are observed a few hours to a month before the incidence of earthquakes. Also, a Confutation analysis was performed on three cases of earthquakes to show that the obtained results were not random and the change in the cumulative number of magnetic anomalies could be caused by the earthquake. (c) 2024 COSPAR. Published by Elsevier B.V. All rights are reserved, including those for text and data mining, AI training, and similar technologies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68dc7f3c0b7bf8f37ab9a83a7734c477",
  "timestamp": "2025-05-15T01:43:20.583661"
}