{
  "id": 9218,
  "title": "Efficacy of post-operative X-rays after operatively treated ankle fractures: What is their role?",
  "abstract": "Objective: The utility of routine post -operative imaging in clinically asymptomatic patients is unclear. We sought to determine how frequently X-rays following operatively treated ankle fractures result in a change in management. Design: Retrospective cohort study conducted with hospital electronic health record Setting: Single level 1 trauma center in major urban city. Patients/Participants: 193 patients with operatively treated ankle fractures at our institution between January 2020 and December 2021. Main Outcome Measures: Patient radiographs were categorized as surveillance X-rays and clinically indicated Xrays. Changes in management were defined as alteration in follow-up, deviation from standard post -operative protocols, or revision surgery. A logistic regression was performed looking at factors predicting whether an Xray changes management. A cost analysis was also performed looking at the financial implications of asymptomatic surveillance of ankle fractures. Results: 438 post -operative X-rays were found and included in analysis. Of these, 391 were considered surveillance X-rays and 47 clinically indicated. 23 X-rays were determined to have resulted in changes in management (18 clinically indicated, 5 taken in asymptomatic patients). The number of management changing X-rays was significantly higher in the clinically indicated group ( p < 0.0001). The only factor associated with whether an Xray changed management was whether the patient was symptomatic at the visit ( p < 0.0001). Asymptomatic surveillance X-rays cost our institution 21,825.62 USD per year. Conclusions: Radiographs in clinically asymptomatic patients with operatively managed ankle fractures have a low likelihood of changing management. Such imaging represents costs to the healthcare system, increased time for patients during clinic visits, and radiation exposure. The use of screening radiographic studies remains commonplace because the risk of delayed diagnosis is great, and the goal of any surgeon should be the swift identification of complications in order to minimize patient morbidity. Future surveillance protocols should consider the findings of this and other studies on the use of screening radiographs and strike a careful balance between minimizing unnecessary imaging, maximizing early complication detection, and ensuring a personalized approach towards patient -level factors to optimize care and efficiency for both patient and health system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68e318bdcf1a6ef3674e332c4744129b",
  "timestamp": "2025-05-15T03:26:54.487627"
}