{
  "id": 6178,
  "title": "Change in Fall Status of Older People With Dementia and Caregiving Difficulties: Moderation Effects of Living Arrangements",
  "abstract": "ObjectivesWe aim to investigate the associations between 2-year fall status among community-dwelling older people with dementia and care partners' emotional, physical, and financial difficulties, with living arrangements (co-residence vs. separate residence) as a moderator. MethodWe used the 2015-2017 National Health and Aging Trends Study and the linked survey 2017 National Study of Caregiving (935 care partners for 567 community-dwelling older people with dementia). We employed multilevel generalized linear regression models to examine the associations of fall status between 2015 and 2017 with caregiving difficulties in 2017 for co-residing and non-co-residing care partners. We then evaluated the moderation effect of care partners' living arrangements. ResultsFor co-residing care partners, high (p = 0.001), increased (p = 0.001), and decreased (p = 0.001) fall frequency over 2 years was significantly associated with emotional difficulties. For non-co-residing care partners, high (p < 0.001), increased (p = 0.001), and decreased (p = 0.002) fall frequency was significantly associated with their physical difficulties. Compared to co-residing care partners, those who lived apart experienced greater physical difficulties when the fall frequency increased over 2 years (p < 0.05), but this effect became non-significant after the Bonferroni correction. High fall frequency was significantly associated with financial difficulties for co-residing (p = 0.009) and non-co-residing (p = 0.003) care partners, and decreased fall frequency was only significantly associated with financial difficulties for non-co-residing care partners (p = 0.018). All findings for financial difficulties became non-significant after the Bonferroni correction. DiscussionThis study found differential associations between fall status over 2 years and care-related difficulties by care partners' living arrangements. Preventing falls for this population can potentially reduce the informal caregiving burden, especially the emotional difficulties for co-residing care partners and the physical difficulties of non-co-residing caregivers. Tailored interventions to manage fall risk among older people with dementia and support care partners with different living arrangements are crucial to improving their well-being.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68eba3e704492e35e784638df2c3530a",
  "timestamp": "2025-05-15T02:55:44.478823"
}