{
  "id": 4396,
  "title": "Financially distressed suppliers: exit, neglect, voice or loyalty?",
  "abstract": "Purpose Major crises such as the global financial crisis 2007-08 or the COVID-19 crisis increase the level and likelihood of supplier financial distress. This research expands the understanding of how cooperatively, respectively, uncooperatively buying firms might respond to suppliers who suffer from financial distress in the course of major crises. Design/methodology/approach The authors build on a collaborative project with a German automotive OEM, analyze OEM internal financial quick check data, questionnaire data and longitudinal supplier financial data and apply regression, mediation and difference-in-difference estimation analyses. Findings The results show that the stronger the dependence on the distressed supplier, the more cooperative the buying firm's response. Furthermore, a more cooperative response of the buying firm has a strong positive influence on the suppliers' financial performance and hence recovery from the distress situation. Insights from supplier financial distress in the course of the financial crisis 2007-2008 can serve as learnings for the COVID-19 crisis. Research limitations/implications The study fills a gap in the scholarly literature on response to risk incidents and response formation. Resource dependence theory and resource dependence dynamics offer a strong rationale for the type of response buying firms are likely to choose. Practical implications Besides offering the first menu of response options, this study can help practitioners in figuring out the most appropriate response to distressed suppliers. The findings can assist buying firms in their decisions how to deal with suppliers during major economic and financial crises. Originality/value This research is the first to conceptualize buying firms' response options to financially distressed suppliers, to investigate the influence of dependence on buying firm's response and to reveal the consequences of the buying firm's response for the supplier's financial recovery.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68f39de8df1a7a30b8298656b8cdc361",
  "timestamp": "2025-05-15T02:36:38.511503"
}