{
  "id": 4119,
  "title": "The impact of compensation on late mortality after traumatic brain injury: A multi-centre study",
  "abstract": "Objectives: To determine the impact of financial compensation on long-term mortality in adults with severe traumatic brain injury (TBI). Design, setting and participants: An inception cohort, of 2545 adults consecutively discharged from three metropolitan, post-acute inpatient rehabilitation, services of the NSW Brain Injury Rehabilitation Programme from 1 July 1990 to,1 October 2007. Main Outcome Measure: Survival status at 1 October 2009. Results: Compensation data were available for 1851 (73%) participants, with 826 (45%) receiving financial compensation. Yearly standardized mortality ratios remained elevated above general population norms for six to ten years for both groups. Compensation had a protective effect on mortality risk as a univariate predictor. However, when considered in multivariate Cox regression analysis, compensation had minimal effect on mortality risk when modelled with non-modifiable demographic factors and pre-existing medical history. Conversely, compensation trended towards a protective effect when modelled with post-injury variables. Conclusions: Financial compensation had a protective effect against late mortality following rehabilitation for severe TBI through complex interactions with rehabilitation service variables, but not with injury-related variables. This finding suggests that wider access to compensation (and hence rehabilitation) through recently implemented schemes (e.g., NSW Lifetime Care and Support) may further improve life expectanty for this clinical population.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "68f767648176fc64f96a35f354e0a1b8",
  "timestamp": "2025-05-15T02:33:42.002731"
}