{
  "id": 214,
  "title": "Application of deep learning model under improved emd in railway transportation investment benefits and national economic attribute analysis",
  "abstract": "The railway transportation industry is one of the essential factors to promote economic development, so research is made on improving the investment benefit of construction planning of the railway transportation industry, and on this basis, the national emergency attribute is analyzed. A prediction model of railway transportation investment benefits and national economic attributes based on EEMD-LSTM (ensemble empirical mode decomposition-long-short-term memory) model is proposed. The EEMD algorithm is used to decompose the daily investment price of the railway transportation industry to obtain the IMF (intrinsic mode function) with different cycle characteristics. The daily investment price, IMF component, and residual series of the railway transportation industry are taken as input data. The input data are transmitted through the LSTM model to predict the investment price of the next day. The results show that the EEMD-LSTM model can retain the advantages of EEMD and LSTM and meet the accurate prediction of financial data. The model has good performance for the fitting of actual data and forecast data, and the model has the highest prediction accuracy of 0.2964%. In conclusion, the model proposed is a useful model for predicting financial time series. The exploration can provide an absolute theoretical basis for the formulation and planning of investment risk coping strategies of the railway transportation industry and provide particular theoretical support for the national economic attribute and positioning of the railway transportation industry.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "691512c2af1ca58cbcbe447786721866",
  "timestamp": "2025-05-15T01:35:04.608491"
}