{
  "id": 8673,
  "title": "Physical Activity Behaviors in Women with Newly Diagnosed Ductal Carcinoma-In-Situ",
  "abstract": "Epidemiological evidence suggests that physical activity may affect breast cancer risk and other health outcomes. Little information is available regarding changes in activity after diagnosis and treatment of in-situ cancer. We enrolled 487 women with newly diagnosed ductal carcinoma-in-situ (DCIS) in a longitudinal cohort study. Exercise behaviors were assessed at enrollment and at 18 months. Changes in exercise frequency over time were compared, and the impact of demographic and treatment-related variables was evaluated. Enrollment and 18-month exercise data were available for 391 women (80%). At enrollment, most women performed strenuous physical activity infrequently, and only half engaged in any type of exercise more than twice a week. Overall activity patterns did not change greatly over the course of the study. However, logistic regression modeling of changes in exercise revealed that women who underwent unilateral or bilateral mastectomy (hazard ratio [HR], 2.4; 95% confidence interval [95% CI], 1.3-4.4) and those who were anxious at enrollment (HR, 2.1; 95% CI, 1.1-4.1) were statistically significantly more likely to decrease exercise levels, and women who worked were significantly more likely to increase exercise over the course of the study (HR, 1.9; 95% CI, 1.1-3.3). Nonsignificant variables included age, reconstructive surgery, depressive symptoms, financial status, education, and tamoxifen use. A large proportion of women with newly diagnosed DCIS were inactive and remained so over time. Women who underwent mastectomy, as well as women who were more anxious, were more likely to decrease their level of physical activity. Women with DCIS might benefit from targeted interventions to increase physical activity.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "691f03e9a77ded8e824af857c5407a4b",
  "timestamp": "2025-05-15T03:21:24.637999"
}