{
  "id": 517,
  "title": "Systematic Review of Lithium-Ion Battery Recycling Literature Using ProKnow-C and Methodi Ordinatio",
  "abstract": "Recycling lithium-ion batteries (LIBs) plays an important role in environmental preservation since it prevents heavy metals from polluting the soil and underground water through the recovering of valuable metals. The interest in LIB recycling has grown in recent years due to the environmental and economic gains which can be seen by increasing number of articles and publications. This review uses two methodologies: ProKnow-C and Methodi Ordinatio to create a bibliographic portfolio (BP) that defines the state-of-the-start literature in LIB recycling. This review is vital because it proposes a database of a finite number of publications of relevant authors and articles to service new research on the LIB recycling theme. The research started off with 2515 articles related to the search query which were later filtered and treated to be systematically analyzed. After filtering, 591 articles were left in the filtered raw article database (FRA-database). The efficiency and parameters of ProKnow-C and Methodi Ordinatio were counter-compared forming two databases. These databases were analyzed systematically and it was found that in the initial stages there were no differences between them. Nevertheless, in the final phases, a difference in the ranking was established when compiling the final BP of the 23 best ranked articles and authors. By using ProKnow-C and Methodi Ordinatio, this review sets out to establish a concise BP of paramount importance to the LIB recycling theme.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69260ab937e3e4a7a340c5b77f8e547f",
  "timestamp": "2025-05-15T00:37:01.716752"
}