{
  "id": 7392,
  "title": "Subjective Impact of the COVID-19 Pandemic on Schizotypy and General Mental Health in Germany and the United Kingdom, for Independent Samples in May and in October 2020",
  "abstract": "Studies reported a strong impact on mental health during the first wave of the COVID-19 pandemic in March-June, 2020. In this study, we assessed the impact of the pandemic on mental health in general and on schizotypal traits in two independent general population samples of the United Kingdom (May sample N: 239, October sample N: 126; participation at both timepoints: 21) and in two independent general population samples of Germany (May sample N: 543, October sample N: 401; participation at both timepoints: 100) using online surveys. Whereas general psychological symptoms (global symptom index, GSI) and percentage of responders above clinical cut-off for further psychological investigation were higher in the May sample compared to the October sample, schizotypy scores (Schizotypal Personality Questionnaire) were higher in the October sample. We investigated potential associations, using general linear regression models (GLM). For schizotypy scores, we found that loneliness, use of drugs, and financial burden were more strongly corrected with schizotypy in the October compared to the May sample. We identified similar associations for GSI, as for schizotypy scores, in the May and October samples. We furthermore found that living in the United Kingdom was related to higher schizotypal scores or GSI. However, individual estimates of the GLM are highly comparable between the two countries. In conclusion, this study shows that while the general psychological impact is lower in the October than the May sample, potentially showing a normative response to an exceptional situation; schizotypy scores are higher at the second timepoint, which may be due to a stronger impact of estimates of loneliness, drug use, and financial burden. The ongoing, exceptional circumstances within this pandemic might increase the risk for developing psychosis in some individuals. The development of general psychological symptoms and schizotypy scores over time requires further attention and investigation.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "692c56ce78a1d448c29b7fadbce3f1e0",
  "timestamp": "2025-05-15T03:08:00.827343"
}