{
  "id": 4726,
  "title": "Enhancing Auto Insurance Fraud Detection Using Convolutional Neural Networks",
  "abstract": "With the increasing number of vehicles in the global fleet, the size of the auto insurance market is projected to reach $ 1.3 billion USD by 2030. While this growth in the issuance of auto insurance policies brings prosperity to the industry, it also amplifies the risk of fraudulent activities. These fraudulent practices have a significant impact on the industry, resulting in the loss of billions of USD annually. Despite efforts to prevent such activities, the expertise available is often overwhelmed by the sheer volume of cases. In this paper, we propose an auto insurance fraud detection system that leverages a one-dimensional Convolution Neural Network (1D-CNN) model in combination with two data augmentation techniques, Synthetic Minority Over-sampling Technique (SMOTE) and Conditional Tabular Generative Adversarial Networks (CTGAN), to address the class imbalance problem prevalent in fraud detection datasets. Furthermore, we also employ Focal Loss as the loss function in our deep learning model to effectively tackle the difficulty in classifying the minority class. By combining the 1D-CNN model with these imbalance manipulation techniques and the Focal Loss function, we aim to enhance the system's ability to accurately identify fraudulent activities, even in the presence of highly imbalanced data. Our proposed approach seeks to mitigate the financial losses incurred by the auto insurance industry due to fraud and provide a more robust and efficient fraud detection system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69336feb644bd3ea297e4c629b366054",
  "timestamp": "2025-05-15T02:40:27.908093"
}