{
  "id": 902,
  "title": "Portfolio Optimization Using Novel Intelligent Probabilistic Forecasts of Risk Measures",
  "abstract": "There has been a growing interest in studying risk forecasting using data-driven exponential weighted moving average (DD-EWMA) volatility models as well as nonlinear neuro volatility models based on Neural network (NN). However, the recently proposed volatility forecasting models have not been used to study portfolio optimization. Large kurtosis of the portfolio return sequence shows that it follows a heavy-tailed t distribution. Significant sample autocorrelations of the absolute portfolio returns and squared portfolio returns suggest that time-varying volatility models are more appropriate to model the volatility. In this paper, a DD-EWMA portfolio volatility forecasting model is used to study the generalized portfolio optimization using the intelligent probabilistic risk forecasts based on data-driven t distribution of the portfolio returns. Optimal portfolio weights are obtained by minimizing the corresponding risk forecasts of portfolio volatility, mean absolute deviation (MAD), Value-at-Risk (VaR), and conditional Value-at-Risk (CVaR) for minimum risk forecast portfolios. Moreover the portfolio weights of the generalized tangency portfolios with different risk measures are obtained by maximizing the corresponding portfolio Sharpe ratio (PSR) forecasts. Experiments are conducted to show that the DD-EWMA volatility forecasting model is most computationally efficient (less computing time), whereas neuro volatility model takes longer time to obtain one-step ahead portfolio volatility forecasts. Moreover, the superiority of the portfolio selection based on data-driven volatility forecasts over the portfolio selection based on volatility estimates is demonstrated through numerical experiments using ten frequently traded stocks.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "693636f756c1d88b3c8f57d02a24174b",
  "timestamp": "2025-05-15T00:49:36.271917"
}