{
  "id": 9236,
  "title": "Communicative health literacy with physicians in healthcare services- results of a Hungarian nationwide survey",
  "abstract": "BackgroundIn an efficient and effective healthcare delivery, good communication plays an essential role. The communicative health literacy (COMM-HL) of the patients is an important attribute, but the number of validated COMM-HL assessment tools is low, and they do not cover all aspects of COMM-HL. That's why a new scale has been developed within an international collaboration. Our aims are to check the measurement properties of the Hungarian version of this COMM-HL questionnaire, to describe the COMM-HL of the Hungarian adult population and to investigate its determinants.MethodsA total of 1205 adults completed the telephone interview in 2020 as part of the European Health Literacy Population Survey 2019-2021. The questionnaire included items on sociodemographic data, self-perceived health, social support and COMM-HL. The questionnaire's measurement properties were assessed using Cronbach's alpha, Spearman-Brown, and item-total correlation coefficients, while the construct validity was investigated with principal component (PCA) and confirmatory factor analysis. The determinants of the COMM-HL were investigated by linear regression.ResultsBoth the value of Cronbach's alpha and the Spearman-Brown correlation were 0.87. The items belonged to one factor and 62.2% of the total variation was explained by this factor based on the PCA. The fit indices indicated that the one-factor structure of the six-item questionnaire exhibited a good fit for the data. The mean score on the COMM-HL scale was 86.8. The easiest task was explaining health concerns while getting enough time in the consultation was rated as the most difficult one. COMM-HL was lower among females, while it was higher among people aged 66-75 years (compared with 18-25 years), those with greater social support and those without financial deprivation.ConclusionsThe questionnaire can be characterized with good internal consistency and the structure of the COMM-HL questionnaire was best explained as a one factor model. In consultations with patients, the effectiveness of communication should be improved, so that patients do not feel that there is not enough time for consultation. At-risk groups with low COMM-HL need special attention during the interactions and the role of social support has to be clarified, too.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "693e60fd6b9ea82186efff013750a039",
  "timestamp": "2025-05-15T03:26:54.559522"
}