{
  "id": 4233,
  "title": "The FX exposure puzzle: insights from SEC disclosures",
  "abstract": "Purpose - Using firm-specific SEC currency risk disclosures, this paper aims to provide insight into the puzzling absence of significant returns-based foreign exchange exposure (FXE). Such a hand gathered disclosure data identify the bilateral exchange rate to which the firm is most vulnerable (BRV) and the firm's FX hedge techniques. Design/methodology/approach - The BRV-based estimates of FXE are compared to the FXE estimates using the broad trade-weighted index (TWI) data that are prevalent in prior research. Multivariate regression and sample partitioning by level of value and size premiums are used to analyze these alternative FXE estimates. Findings - The univariate results reveal a higher percentage of firms with significant BRV-estimated FXE compared to TWI-estimated FXE. Multivariate tests indicate a negative relation between firm-specific financial hedging and BRV-estimated FXE (but not TWI-estimated FXE), controlling for firm-specific non-financial/operational hedging, size and industry effects. Moreover, firms in the first and fifth quintiles for measures of value/growth and size have higher levels of FXE. Practical implications - Using SEC currency risk disclosures improves the analysis of firm-specific FXE, allowing investors to better estimate risk and cost of capital. Originality/value - The paper helps resolve the FX exposure puzzle using a unique dataset of firm-specific currency risk disclosures. The improved estimates of FXE provide a more detailed risk profile of multinational firms.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "695581dad0d8779069638bf9fadb1899",
  "timestamp": "2025-05-15T02:34:48.901658"
}