{
  "id": 4186,
  "title": "Cash Flow Performance of Fannie Mae Multifamily Real Estate: Evidence from Repeated NOI and EGI Indices",
  "abstract": "Using a unique dataset of building operating statements from Fannie Mae, we develop repeated measures regression (RMR) indices for NOI, EGI and PGI to track the cash flow performance of Fannie Mae-financed multifamily real estate. Our three-stage RMR estimate shows an average NOI growth of about 1.8 % during 1993-2011, which is lower than inflation rate and significantly lower than what is usually perceived by investors. Based on the RMR estimates, we find that the whole portfolio of Fannie Mae multifamily properties outperforms NCREIF multifamily properties in NOI growth, especially during the 2000-2001 recession and the Great Recession, which helps explain the superior performance of Fannie Mae multifamily mortgage loans during the recent crisis. In the cross section, multifamily properties in supply-constrained areas have substantially larger NOI growth. Workforce housing performs better than low-income housing even after we control for locational differences and property features. We do not find a size effect in NOI growth once we control for supply constraints. We also find EGI growth to be much less volatile than NOI growth, which implies that changes in operating expenses are the main driving factor of the cyclicality of NOI. Operating expenses also tend to be pro-cyclical - they grow faster during recessions. EGI growth (decline) leads PGI growth (decline), which supports the stock-flow model of rental adjustment where vacancy changes before rent. From a methodological perspective, we find that the conventional methods such as simple average and weighted average over-estimate multifamily NOI growth, likely due to significant sample selection bias and outlier influence. In contrast, the RMR indices control for changes in property quality and are much more robust in the presence of data errors and outliers.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69668a0f22707fcebcbe452198fdc791",
  "timestamp": "2025-05-15T01:24:25.486434"
}