{
  "id": 9142,
  "title": "How prepared are young, rural women in India to address their sexual and reproductive health needs? a cross-sectional assessment of youth in Jharkhand",
  "abstract": "Background: Young, rural Indian women lack sexual and reproductive health (SRH) information and agency and are at risk of negative sexual and reproductive health outcomes. Youth-focused interventions have been shown to improve agency and self-efficacy of young women to make decisions regarding their sexual and reproductive health. The objectives of this study were to assess young women's sexual and reproductive health knowledge; describe their health-seeking behaviors; describe young women's experiences with sexual and reproductive health issues, including unwanted pregnancy and abortion; and identify sources of information, including media sources. Method: A cross-sectional survey with a representative sample of 1381 married and unmarried women young women (15-24 years) from three rural community development blocks in Jharkhand, India was conducted in 2012. Participants were asked a series of questions related to their SRH knowledge and behavior, as well as questions related to their agency in several domains related to self-efficacy and decision-making. Linear regression was used to assess factors associated with greater or less individual agency and to determine differences in SRH knowledge and behavior between married and unmarried women. Results: Despite national policies, participants married young (mean 15.7 years) and bore children early (53 % with first birth by 17 years). Women achieved low composite scores on knowledge around sex and pregnancy, contraception, and abortion knowledge. Around 3 % of married young women reported experiencing induced abortion; 92 % of these women used private or illegal providers. Married and unmarried women also had limited agency in decision-making, freedom of mobility, self-efficacy, and financial resources. Most of the women in the sample received SRH information by word of mouth. Conclusions: Lack of knowledge about sexual and reproductive health in this context indicates that young rural Indian women would benefit from a youth-friendly SRH intervention to improve the women's self-efficacy and decision-making capacity regarding their own health. A communication intervention using outreach workers may be a successful method for delivering this intervention.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "697a4a5f45d3d2b83fcb0b26787b7b14",
  "timestamp": "2025-05-15T03:25:54.635113"
}