{
  "id": 9140,
  "title": "Economic Burden of Healthcare Services on Cancer Survivors in Bangladesh",
  "abstract": "BackgroundCancer is a critical public health issue that imposes a considerable economic burden, especially in low-resource countries. In Bangladesh, there has been a noticeable lack of research focusing on the economic burden associated with cancer. Aims: This study aimed to examine the economic burden of cancer care and the contributing factors.MethodsThis cross-sectional study included 623 cancer patients. Data were collected between January and May 2022. The magnitude of the economic burden (no burden to extreme burden) was the outcome variable. A logistic regression model was performed to determine the associated factors of the economic burden of cancer.ResultsOverall, 34% of cancer survivors experienced extreme economic burden due to treatment costs. Patients with prostate (relative risk ratio, RRR = 23.24; 95% confidence interval, CI: 1.97, 273.70), bone (RRR = 5.85; 95% CI: 1.10, 31.04), and liver cancer (RRR = 4.94; 95% CI: 1.29, 18.9) reported significantly higher extreme economic burden compared to patients with other cancers. The economic burden was significantly higher for patients diagnosed with Stage III (RRR = 38.69; 95% CI: 6.17, 242.72) and Stage IV (RRR = 24.74; 95% CI: 3.22, 190.11) compared to Stage 0. Patients from low-income households suffered from nine times more extreme burden (RRR = 8.85; 95% CI: 4.05, 19.36) compared with those from high-income households.ConclusionOur study found a disproportionately high economic burden among patients with cancer, across disease sites, stages, and income quintiles. The burden was significantly higher among patients with prostate, bone, and liver cancer, and those diagnosed with advanced stage. The findings underscore the importance of early cancer detection before metastasis which may lead to more efficient treatment, avoid disease progression, lower disease management costs, and better health outcomes. Patients from low-income households experience an extreme economic burden due to cancer, highlighting the need for affordable healthcare services, financial support, and healthcare subsidies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "699d09f3888bd91a78fb2df67971f5d9",
  "timestamp": "2025-05-15T03:25:54.620072"
}