{
  "id": 8682,
  "title": "Effects of the economic crisis on smoking prevalence and number of smokers in the USA",
  "abstract": "Objective Scanty and controversial information is available on the impact of macroeconomic fluctuations on smoking behaviour. No study has quantified the effects of fiscal crises on smoking prevalence. This study aimed to investigate the effects of the 2007-2008 economic crisis on smoking prevalence and number of smokers in the USA. Methods Using data from the repeated Behavioural Risk Factor Surveillance System (BRFSS) surveys in pre-crisis (2005-2007) and post-crisis (2009-2010) periods on a total of 1 981 607 US adults, we separated the expected (after allowance for the demographic growth of the US population, secular smoking prevalence trends and changes in sociodemographic characteristics) from the unexpected (assumed attributable to the economic crisis) changes in the number of smokers across different employment statuses. Results Joinpoint regression analysis revealed no significant changes in smoking prevalence trends over the period 2005-2010. The crisis resulted in an increase in the number of smokers in the US by 0.6 million. This is largely due to an unexpected decrease of 1.7 million smokers among employed and an increase of 2.4 million smokers among unemployed individuals, whose smoking prevalence also remains extremely high in the post-crisis period (32.6%). Conclusions The 2008 financial crisis had a weak effect on smoking prevalence. The pro-cyclical relationship (ie, the crisis results in a lower number of smokers) found among the employed is offset by the counter-cyclical relationship (ie, the crisis results in a higher number of smokers) found among unemployed individuals. Public health interventions should specifically target those in unemployment, particularly in hard times.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69a95b5c2ef57fa198f2f2397732e1cf",
  "timestamp": "2025-05-15T03:21:24.657423"
}