{
  "id": 5613,
  "title": "Pre-Hospital Delays Represent Unnoticed Intervals That Affect Mortality Rates in Geriatric Hip Fractures: A Prospective Cohort Study",
  "abstract": "IntroductionSurgery is recommended within 24-48 hours for geriatric hip fractures. In developing countries. However, delayed presentation to the hospital due to various factors often precludes surgery from occurring within these recommended intervals. Therefore, our objective was to identify the hurdles that prevent early surgery for geriatric hip fractures and assess their effect on mortality.MethodsA prospective cohort study was conducted with 78 geriatric patients (age > 60 years) who suffered hip fractures between September 2019 and November 2020. The demographic, American Society of Anesthesiologists (ASA) classification, Charlson Comorbidity Index (CCI), injury to admission, admission to surgery, and injury to surgery time were all recorded for each patient. A follow-up was conducted at one month and six months postoperatively for each patient. Mortality rate at 30 days and causes for delay in presentation to the hospital and delayed surgery were assessed. Multivariate logistic regression was done to assess the risk factors for 30-day mortality.ResultsThe mean age of the patients was 74.2 years, and 64.1% of the patients were female. The mean (SD) injury to-admission time was 3.45 (5.50) days, and the admission-to-surgery time was 4.28 (3.03) days. A total of 41% of patients had delayed presentation, commonly due to a lack of local healthcare infrastructure, financial constraints, and a lack of care providers. Furthermore, 65.3% of the patients underwent delayed surgery, and 44% faced organizational delays. Thus, the 30-day mortality rate was calculated at 19.2%, while the six-month mortality rate was 25.6%. The injury to admission time (OR 1.22 [1.03-1.44; p = 0.018]) and CCI were found to be risk factors in the 30-day mortality (OR 1.76 [0.93-3.33; p = 0.085]).ConclusionsPre-hospital delays and CCI are risk factors for short-term mortality following hip fractures. This underlines the need to generate awareness, improve the referral chain, and establish protocol-based care in hospitals. Further studies are required to assess the socioeconomic factors involved in the delayed treatment of geriatric hip fractures in developing countries.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69acded2fa11c377d41670cf5003280c",
  "timestamp": "2025-05-15T02:49:50.188777"
}