{
  "id": 221,
  "title": "A Novel Data Driven Machine Learning Algorithm For Fuzzy Estimates of Optimal Portfolio Weights and Risk Tolerance Coefficient",
  "abstract": "Recently, there has been a growing interest in portfolio optimization using graphical LASSO (GL) machine learning method, by assuming normality for asset returns. However, a major drawback is that most of the asset returns follow nonnormal distributions and sample percentiles are used to study the portfolio optimization with Value-at-Risk (VaR) as a risk measure. In this paper, a data-driven random weights algorithm (RWA) and a sign correlation based portfolio return distribution are used to study the fuzzy portfolio optimization. The superiority of RWA over the commonly used genetic algorithm (GA) in computing the optimal portfolio weights is demonstrated by comparing the computing time. When comparing the estimate of the risk tolerance coefficient and the theoretical value for tangency portfolios with volatility as a risk measure, RWA outperforms (smaller absolute error) the GA. The novelty of this paper is the use of RWA and GA to calculate the fuzzy estimates (interval estimates) of the risk tolerance coefficient/optimal weights and using the sign correlation to obtain the data-driven distribution of the portfolio returns. More specifically the novelty is to obtain the fuzzy estimates of the risk tolerance coefficient and portfolio weights by modelling the portfolio volatility as an asymmetric triangular fuzzy number from the data-driven observed portfolio volatilities. In particular, the proposed RWA as well as GA lead to machine learning solutions for the portfolio optimization problems without a closed form solution and provide fuzzy estimates of the risk tolerance coefficient and the optimal portfolio weights.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69beef9e52946beb32edcc33e232ec49",
  "timestamp": "2025-05-15T00:40:34.193804"
}