{
  "id": 8745,
  "title": "Currency change and capital structure decisions: evidence from the birth of the Euro area",
  "abstract": "PurposeThe paper investigates if the process that led to the birth of the Euro Area had a significant impact in homogenizing the capital structure decisions of European firms since the first introduction of the common currency.Design/methodology/approachA large sample of firms was constructed, and a Tobit-censored regression model was utilized to investigate the determinants of firms' observed capital structures. The Black-Scholes-Merton model was used to infer market values of assets, as well as the volatility of those values, from the observed market values of equity and the corresponding volatility. The existing differences in national tax rules were considered for estimating firm-specific marginal tax rates.FindingsIt was found that, despite the currency union and the institutional harmonization process, certain factors still play a different role. In particular, the impact of profitability is consistent with the pecking order view in some countries, and with the trade-off theory in others. Assets risk, measured as the annualized volatility of the market enterprise value, is the best predictor of observed leverage ratios. The sector of activity is significant in determining leverage decisions even when assets' risk is taken into account. Despite the monetary union and the increased financial and institutional integration in the Euro Area, the country of origin still plays a significant role in capital structure decisions, suggesting that other country-level factors may affect firms' financing behaviour.Practical implicationsThe paper indicates that, despite the long harmonization process of institutions, regulations and public budget required to join the Euro, firms' financing decisions are still affected by country-specific factors once the common currency is introduced. Therefore, new entrant countries in the Euro area should not expect their companies to immediately conform with those located in other countries within the common currency area.Originality/valueThis article investigated the impact of the currency change from national currencies to the Euro on the determinants of capital structure choices. It was shown that, despite the long harmonization process that led to the birth of the Euro Area, national factors still affect firms' financing decisions. This provides guidance for policymakers in countries that are planning to join the Euro about the impact this will have on firms' financing decisions in the entrant country.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69c4bdc1015994148c185b1861f88f9e",
  "timestamp": "2025-05-15T03:21:56.652086"
}