{
  "id": 6749,
  "title": "Adverse experiences in childhood, adulthood neighbourhood disadvantage and health behaviours",
  "abstract": "Background Early life adversities may play a role in the associations observed between neighbourhood contextual factors and health behaviours. Methods We examined whether self-reported adverse experiences in childhood (parental divorce, long-term financial difficulties, serious conflicts, serious/chronic illness or alcohol problem in the family, and frequent fear of a family member) explain the association between adulthood neighbourhood disadvantage and co-occurrence of behavioural risk factors (smoking, moderate/heavy alcohol use, physical inactivity). Study population consisted of 31 271 public sector employees from Finland. The cross-sectional associations were analysed using two-level cumulative logistic regression models. Results Childhood adverse experiences were associated with the sum of risk factors (cumulative OR 1.32 (95% CI 1.25 to 1.40) among those reporting 3-6 vs 0 adversities). Adverse experiences did not attenuate the association between neighbourhood disadvantage and risk factors; this cumulative OR was 1.52 (95% CI 1.43 to 1.62) in the highest versus lowest quartile of neighbourhood disadvantage when not including adversities, and 1.50 (95% CI 1.40 to 1.60) when adjusted for childhood adversities. In adversity-stratified analyses those reporting 3-6 adversities had 1.60-fold (95% CI 1.42 to 1.80) likelihood of risk factors if living in the neighbourhood of the highest disadvantage, while in those with fewer adversities this likelihood was 1.09-1.34-fold (95% CI 0.98 to 1.53) (p interaction 0.07). Conclusions Childhood adverse experiences and adulthood neighbourhood disadvantage were associated with behavioural risk factors. Childhood experiences did not explain associations between neighbourhood disadvantage and the risk factors. However, those with more adverse experiences may be susceptible for the socioeconomic conditions of neighbourhoods.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69cbcdaefa410c6c444275c99c48d1d7",
  "timestamp": "2025-05-15T03:01:03.631235"
}