{
  "id": 4793,
  "title": "The Relationship between Working Capital Management and Financial Performance: Evidence from Jordan",
  "abstract": "Efficient working capital management involves planning and controlling current assets and current liabilities in a manner that eliminates the risk of inability to meet short-term obligations and at the same time avoiding excessive investment in current assets. The study's objective is to investigate the moderating effect of working capital investment and financing policy on the relationship between working capital management efficiency and the financial performance of industrial firms listed on the Amman Stock Exchange (ASE). To achieve the objective of the study, this study used time series and data covering the period 2010-2018. A sample of 42 manufacturing firms listed on the ASE was used in the analysis and hypotheses testing. Return on assets is used to measure financial performance, while inventory turnover, receivables turnover, current assets turnover, working capital turnover, and inventory-to-sales ratio are used to measure the working capital management efficiency. This study involved two hypotheses, and both hypotheses were tested to emphasize a 95 percent level of confidence. For data analysis, we used descriptive statistics and the multiple linear regression method was used for hypotheses testing. The study finds that inventory turnover, receivables turnover, current assets turnover, and working capital turnover affect the financial performance of the manufacturing firms, whereas no substantial differences were found between the direct or the moderating models in estimating financial performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69d52072ec6e180942784f34bc9808e5",
  "timestamp": "2025-05-15T02:41:00.887595"
}