{
  "id": 2383,
  "title": "AIRMS: A risk management tool using machine learning",
  "abstract": "In this work, an innovative approach to exploit the true potentials of machine learning (ML) by the financial industry is presented; using ML technology not as a source of investment ideas but as a consultant for trading decisions. In particular, the artificial intelligent risk management system (AIRMS) is presented that introduces one of the first efforts in the literature to utilize supervised ML as a risk management tool. Two AIRMSs systems are developed based on two well-known ML algorithms, i.e. artificial neural networks and decision trees. These two systems are applied into the five major currency pairs (FOREX) using signals obtained from an existing technical breakout trading strategy introduced in previous study by the authors, covering a seven-year period (2010-2016). Technical indicators and times series of the past entry points feed AIRMS in order to classify produced signals from the trading strategy into two classes: profitable and not. Constructing new portfolios using signals classified only as profitable resulted in an increased profit of more than 50% compared to the original ones. In this work, technical improvements are also proposed on the application of ML algorithms to financial data related to evaluation metrics and smoothing inputs. The obtained results revealed that the two AIRMSs can achieve impressive improvements to the performance of already profitable portfolios and proved that using ML to build risk management tools is very promising. (C) 2018 Elsevier Ltd. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69d9d8bf793e27f126f23c055a86c213",
  "timestamp": "2025-05-15T02:14:50.297893"
}