{
  "id": 7316,
  "title": "Quality of education impacts late-life cognition",
  "abstract": "Objectives Screening tests of global cognition detect racial differences in scores even after adjustment for educational attainment. Differential educational environments in adolescence may affect individual cognitive function. This study examines the impact of high school educational quality on late-life cognition among community-dwelling older adults. Methods/design Data were collected from community-dwelling individuals from the Philadelphia Healthy Brain Aging (PHBA) cohort at the University of Pennsylvania Health System. The present analysis included subjects from the PHBA over the age of 55 years without a diagnosis of Parkinson's disease or dementia, who had attended high school in the City of Philadelphia. Cognition was assessed using the Montreal Cognitive Assessment (MoCA); clinical information was abstracted from the subject's electronic health record. High school information was obtained from the Philadelphia Board of Education. After univariable correlations were defined, we performed stepwise multiple linear regression models to determine the most significant predictors of late-life cognitive status. Results A total of 130 subjects meeting inclusion criteria were included in the analysis. Years of education, race, educational level, school district, and financial status were all positively associated with MoCA. Significant negative associations included composite vascular risk, attendance at highly segregated schools, and historical poverty status. In stepwise multiple linear regression modeling, the impact of race on cognition remained significant when educational attainment was added to the model but was no longer significant once segregation status was added. Conclusions This work suggests that academic and community factors beyond years of education have a marked impact on late-life cognition.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69e8dc5310e3ff490e800817493b4921",
  "timestamp": "2025-05-15T03:07:31.841402"
}