{
  "id": 6003,
  "title": "PREVALENCE OF FALL AND ASSOCIATED FACTORS AMONG COMMUNITY-DWELLING EUROPEAN OLDER ADULTS: A CROSS-SECTIONAL STUDY",
  "abstract": "Aim: As a person ages, the risk of fall increases, which affects quality of life and represents a financial burden to health- and social-systems, and a greater morbidity and mortality risk. Fall leads to decreased social contact, anxiety, long-term physical disability, severe dependency and hospitalizations. Currently, few studies address this phenomenon using a uniform methodology; therefore, this study aims to explore the prevalence of fall and associated-variables in older adults across Europe. Methods: In this cross-sectional analysis, we used data from Wave 6 of SHARE. The prevalence of fall was assessed through the answer falling down to the question For the past six months at least, have you been bothered by any of the health conditions on this card?. Multilevel logistic regression was used, using fall as a dependent variable. Multilevel univariable logistic regression models were made to identify potential associated factors. Results: From the 41,098 participants, 56.3% were female, and the average age was of 70.0 +/- 8.9 years. The prevalence of fall was 8.2% (CI 8.0% to 8.4%), being higher in women (10.1% vs. 5.8%) and increasing with age. Age, female gender, being frail or pre-frail, higher scores on the EURO-D scale, polypharmacy and fear of falling were found to be significantly associated with fall. Conclusions: We found that fall is prevalent in the European community-dwelling population, with variations between countries. As a public health priority, identification of the variables associated with fall is important in order to identify/monitor the risk in older groups and develop tailored and cost-effective interventions for fall prevention.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "69f9401460be647552d6695ae44f1caf",
  "timestamp": "2025-05-15T02:53:33.483842"
}