{
  "id": 7184,
  "title": "Deposit interest rates, asset risk and bank failure in Croatia",
  "abstract": "During the 1980's and 1990's, financial liberalization became an almost universally-accepted policy prescription. Large numbers of countries eased licensing, deregulated interest rates and dismantled systems of directed lending. However, banking system crises, first in the southern cone of Latin America in the early 1980's and later in the U.S., Scandinavian countries and a large set of emerging market economies, raised questions about the links between financial liberalization and instability. In particular, Hellman, Murdoch and Stiglitz (2000) question the wisdom of complete deregulation of deposit interest rates, arguing that this can facilitate purchasing market share to fund gambling. The transition countries of Central and Eastern Europe provide an interesting laboratory to test these arguments. Starting in the early 1990's, these countries rapidly liberalized their banking markets, removing restrictions on entry, asset composition and interest rates. For this reason, the experience of such countries may help confirm whether the U.S. experience of the 1980's was typical. In this paper, we examine the experience of Croatia, which liberalized its banking regulations in the early 1990's. After the end of the wars surrounding the break-up of former Yugoslavia, Croatia experienced rapid growth in the number of banks, strong deposit growth and substantial increases in deposit interest rates in the period 1995-98. This buoyant period was punctuated by the failures of numerous medium-sized banks in 1998 and 1999. Our argument is that high deposit interest rates helped fund the expansion of risk-loving banks, and had important negative external effects on healthy banks, thus making a strong contribution to the banking crisis of 1998-99. We proceed in two steps. First, using panel regression techniques, we show that banks were able to increase deposit growth, and thus fund rapid expansion, by raising interest rates in the pre-crisis period. We also show that the interest-elasticity of deposits completely vanished during the banking crisis. Second, we provide a set of predictive models of bank failures. These models show that deposit interest rates were one of the most significant variables predicting bank failures. High risk banks-the ones that eventually failed-often offered higher deposit interest rates than low risk banks. Having shown that high deposit interest rates were a source of funding for risky banks, and that high deposit interest rates are correlated with eventual failure, we end the paper with a discussion of policy implications.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a029565e9d3a06cc35f04fb21aa7d70",
  "timestamp": "2025-05-15T03:06:01.217041"
}