{
  "id": 3297,
  "title": "Duration of Care and Operative Time Are the Primary Drivers of Total Charges After Ambulatory Hip Arthroscopy: A Machine Learning Analysis",
  "abstract": "Purpose: To develop a machine learning algorithm to predict total charges after ambulatory hip arthroscopy and create a risk-adjusted payment model based on patient comorbidities. Methods: A retrospective review of the New York State Ambulatory Surgery and Services database was performed to identify patients who underwent elective hip arthroscopy between 2015 and 2016. Features included in initial models consisted of patient characteristics, medical comorbidities, and procedure-specific variables. Models were generated to predict total charges using 5 algorithms. Model performance was assessed by the root-mean-square error, root-mean-square logarithmic error, and coefficient of determination. Global variable importance and partial dependence curves were constructed to show the impact of each input feature on total charges. For performance benchmarking, the best candidate model was compared with a multivariate linear regression using the same input features. Results: A total of 5,121 patients were included. The median cost after hip arthroscopy was $19,720 (interquartile range, $12,399-$26,439). The gradient-boosted ensemble model showed the best performance (root-mean-square error, $3,800 [95% confidence interval, $3,700- $3,900]; logarithmic root-mean-square error, 0.249 [95% confidence interval, 0.24-0.26]; R-2 = 0.73). Major cost drivers included total hours in facility less than 12 or more than 15, longer procedure time, performance of a labral repair, age younger than 30 years, Elixhauser Comorbidity Index (ECI) of 1 or greater, African American race, residence in extreme urban and rural areas, and higher household and neighborhood income. Conclusions: The gradient-boosted ensemble model effectively predicted total charges after hip arthroscopy. Few modifiable variables were identified other than anesthesia type; nonmodifiable drivers of total charges included duration of care less than 12 hours or more than 15 hours, operating room time more than 100 minutes, age younger than 30 years, performance of a labral repair, and ECI greater than 0. Stratification of patients based on the ECI highlighted the increased financial risk borne by physicians via flat reimbursement schedules given variable degrees of comorbidities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a02bf7401d6f60ea09b3ec107dfa9cc",
  "timestamp": "2025-05-15T02:24:39.725693"
}