{
  "id": 79,
  "title": "A dynamic financial risk prediction system for enterprises based on gradient boosting decision tree algorithm",
  "abstract": "As financial technology develops, the dynamic prediction of enterprise financial risks has become a focus of attention in the financial field. The research aims to construct a dynamic financial risk prediction system for enterprises based on gradient boosting decision trees to improve the predicting accuracy and adaptability. The minimum absolute value shrinkage and selection operator algorithm were used for dynamic indicator selection. A dynamic prediction model was constructed by combining gradient boosting decision trees. The decision tree model parameters were optimized through gradient optimization using the sparrow search algorithm. The integrated model performed excellently on multiple evaluation indicators, with an area under the receiver operating characteristic curve of 0.8. The average accuracy was 92.38%, the recall was 94.27%, and the root mean square error and average absolute error were lower than other models, demonstrating high prediction accuracy and reliability. The average user satisfaction of this integrated model was 85%, significantly higher than the 46% of the ordinary gradient boosting decision tree model. This model can not only accurately identify risk situations, but also meet the actual needs of enterprise users. This study provides a new financial risk assessment tool for enterprises. This helps enterprises to identify and manage potential risks in a timely manner, which is of great significance for promoting healthy and sustainable development of enterprises.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a07dd819fcbf04f58ec0682013ea1ea",
  "timestamp": "2025-05-15T01:46:39.559735"
}