{
  "id": 3102,
  "title": "Russia-Ukraine war and G7 debt markets: Evidence from public sentiment towards economic sanctions during the conflict",
  "abstract": "War-related expectations cause changes to investors' risks and returns preferences. In this study, we examine the implications of war and sanctions sentiment for the G7 countries' debt markets during the Russia-Ukraine war. We use behavioural indicators across social media, news media, and internet attention to reflect the public sentiment from 1st January 2022 to 20th April 2023. We apply the quantile-on-quantile regression (QQR) and rolling window wavelet correlation (RWWC) methods. The quantile-on-quantile regression results show heterogenous impact on fixed income securities. Specifically, extreme public sentiment has a negative impact on G7 fixed income securities return. The wavelets correlation result shows dynamic correlation pattern among public sentiment and fixed income securities. There is a negative relationship between public sentiment and G7 fixed income securities. The correlation is time-varying and highly event dependent. Our additional analysis using corporate bond data indicates the robustness of our findings. Furthermore, the contagion analysis shows public sentiment significantly influence G7 fixed income securities spillover. Our findings can be of great significance while framing strategies for asset allocation, portfolio performance and risk hedging.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a3c3dfd36839fc164ce6d9f5f211599",
  "timestamp": "2025-05-15T01:13:45.142918"
}