{
  "id": 8173,
  "title": "Cost-Effectiveness of Oral Nutritional Supplements in Malnourished or at Risk of Disease-Related Malnutrition Cancer Patients in North Macedonia",
  "abstract": "Purpose: This study aimed to assess the cost-effectiveness of medical nutritional support in a cancer care program in North Macedonia, comparing specialized oral nutritional supplements (ONS) with the standard of care (SOC) in managing disease-related malnutrition (DRM) in patients with or at risk of tumor cachexia syndrome. Methods: A previously published decision tree model was employed to evaluate the economic impact of supportive treatment in cancer patients eligible for ONS. Monthly transition probabilities between health states, length of hospital stay for each treatment strategy, and utility parameters were derived from the literature. For base-case analysis, the cancer care program duration was set at 30 days. The analysis was conducted from the perspective of a national health insurance fund, utilizing a 13-year time horizon with monthly cycles. Only direct supportive care costs, estimated from publicly available data, were considered. Quality-adjusted life-years (QALYs) gained per patient and associated costs were calculated, with outcomes and costs discounted at 3.0% annually. One-way and probabilistic sensitivity analyses were performed to assess results robustness. Results: In the base case analysis, ONS was the dominant treatment strategy, with total costs per patient of 2605.01 for ONS versus 3759.23 for SOC, indicating a significant cost reduction. Reduced hospitalization expenses outweighed the higher acquisition costs of ONS. Additionally, ONS provided greater health benefits, achieving 8.21 QALY vs 7.91QALY in the SOC group. The resulting Incremental Cost-Effectiveness Ratio (ICER) was negative, reinforcing ONS as the dominant strategy. Sensitivity analyses confirmed that the cost-effectiveness was primarily driven by cancer program duration, with cost-saving benefits up to 132 days. Conclusion: Our findings demonstrate that specialized ONS is a cost-effective treatment option within a cancer care program compared with SOC. While this study focuses on North Macedonia, the results are applicable to countries with similar economic and healthcare structures, reinforcing ONS as a valuable intervention across comparable healthcare systems. Plain Language Summary: Approximately 50% of patients with advanced cancer present with cachexia syndrome, a severe form of disease-related malnutrition (DRM). Medical nutrition is a specialized category of nutrition that addresses specific dietary needs and deficiencies. Early nutritional interventions with specialized oral nutritional supplements (ONSs) have demonstrated the ability to alleviate the negative effects of cancer and its treatments on nutritional status. Assessing the economic impact of specialized ONSs is essential for managing chronic diseases such as cancer, which creates considerable financial challenges. Evidence of economic implications is limited and differs across healthcare settings, intervention types, and patient demographics. This study aimed to provide decision-makers in the Republic of North Macedonia with supportive evidence on the relative and incremental cost-effectiveness of ONS in managing patients with cancer who are malnourished or at risk of severe DRM. Our findings indicate that the cost-effectiveness of early ONS intervention is primarily driven by the duration of the cancer care program, with cost- saving benefits observed within the 30-day base-case scenario and up to 132 days in sensitivity analysis. Beyond this period, ONS remained cost-effective within the willingness-to-pay threshold. This supports reimbursement decisions for addressing malnutrition in this vulnerable patient group, helping to maximize health benefits within constrained budgets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a4067356fbbb5d123882f10e443b1b6",
  "timestamp": "2025-05-15T03:16:17.362394"
}