{
  "id": 8199,
  "title": "COVID-19 Pandemic and Stock Performance: Evidence from the Sub-Saharan African Stock Markets",
  "abstract": "Emerging stock markets provide great opportunities for investment growth and risk diversification. However, they are more vulnerable to extreme market events. This study examines the effects of the COVID-19 pandemic on stock performance in sub-Saharan African stock markets. An event study method was used to determine whether there was any significant difference in sector returns before and during the pandemic, and panel data regression was used to determine the causal relationship between COVID-19 events and the abnormal returns observed. Four stock exchanges were chosen, including the two largest and two fastest-growing markets in sub-Saharan Africa. According to the study's findings, the information technology, consumer staples, and healthcare sectors outperformed during the pandemic, while the industrials, materials, and real estate sectors underperformed. The financial and consumer discretionary proved to be the most stable sectors during the pandemic. We also observed that the imposition of lockdown had a negative impact on the performance of most sectors in sub-Saharan African markets, whereas government assistance in the form of economic stimulus packages had no significant positive impact on stock performance except in the South African market. Furthermore, we find that increases in COVID-19 cases and deaths had no negative impact on capital markets, where stocks have responded positively to economic recovery aid. The study concludes that during the COVID-19 pandemic, stocks reacted more to government actions than the occurrence of the pandemic itself.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a406edc0e4435b63d604dcf2568ab60",
  "timestamp": "2025-05-15T03:16:17.433689"
}