{
  "id": 1047,
  "title": "A multi-objective mean-variance portfolio selection model combining sequential three-way decision and regret theory",
  "abstract": "For portfolio selection, a typical uncertain decision problem, decision-makers are often bounded rational. In decision-making behavior, they do not always pursue the maximum utility, but choose the plan that best suits their own wishes. Therefore, this paper proposes a multi-objective mean-variance (MOMV) portfolio selection model based on regret theory (RT) and sequential three-way decision (STWD) under the framework of bounded rationality, i.e., the RT-STWD-MOMV model. Specifically, the RT-STWD-MOMV model mainly consists of the following two components: (1) Asset clustering method considering investor regret; (2) MOMV model considering investor regret. First, an evaluation function fused with grey correlation degree was constructed, and an optimization model was established based on the regret utility function and shadow set to obtain the threshold of each granularity level, so as to obtain an STWD asset clustering model. The model provides asset clustering results that better align with investors' psychological needs, improve the rationality of asset selection, and optimize risk control capabilities. Second, based on the aforementioned asset clustering results, select stocks from categories with lower correlations to construct the optimal investment portfolio. Finally, the MOMV model is improved by introducing an upper limit constraint that reflects the degree of regret of decision-makers, and the optimal portfolio is achieved through this improved model. The empirical results show that the RT-STWD-MOMV model is effective and feasible. In addition, the comparison phase shows that the RT-STWD-MOMV model consistently outperforms the MOMV model integrated with other clusters on multiple real-world datasets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a51ebbf5e3f9ddfe22389b133743eff",
  "timestamp": "2025-05-15T00:51:25.838248"
}