{
  "id": 3597,
  "title": "Financial Hardship and Self-Rated Health Among Low-Income Housing Residents",
  "abstract": "Background. Self-rated health (SRH) has been shown to be predictive of morbidity and mortality. Evidence also shows that SRH is socioeconomically patterned, although this association differs depending on the indicator of socioeconomic status used. The purpose of this study was to determine the association between SRH and financial hardship among residents of low-income housing. Methods. We analyzed cross-sectional data from the Health in Common Study (N = 828), an observational study to investigate social and physical determinants of cancer risk-related behaviors among residents of low-income housing in three cities in the Boston metropolitan area. Modified Poisson regression models were used to obtain the relative risk of low SRH (fair or poor), adjusting for demographic and socioeconomic characteristics. Results. Unadjusted models revealed that the respondents reporting financial hardship were 53% more likely to report low SRH compared with those not reporting financial hardship. After controlling for demographic characteristics, socioeconomic characteristics, and psychological distress, the results showed that those reporting financial hardship were 44% more likely to report low SRH. Conclusion. Our results suggest that financial hardship is a robust predictor of SRH; and over and above the influence of demographic and traditional socioeconomic indicators, and even psychological distress, financial hardship remains strongly associated with low SRH. Additional research needs to be conducted to further elucidate this pathway and to better understand the determinants of variability in financial hardship among low-income housing residents to ensure the most appropriate policy levers (e.g., housing-related policy, food-related policy) are chosen to improve health outcomes in this population.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a51b1990c14f92cdc70153fb29f0274",
  "timestamp": "2025-05-15T02:27:54.091902"
}