{
  "id": 4086,
  "title": "Financial inclusion, financial capability and financial fragility during COVID-19 pandemic",
  "abstract": "PurposeFinancial inclusion can be proxied by banking status. The purpose of this study is to investigate the potential effects of financial capability on the financial fragility of US adults with various banking statuses during the COVID-19 pandemic.Design/methodology/approachThis study utilized the 2021 National Financial Capability Study (NFCS) dataset to investigate the relationship between financial capability and financial fragility among consumers with different banking statuses. The analysis controlled for employment shocks, health shocks and other consumer characteristics. Banking statuses included fully banked, under-banked (utilizing both banking and alternative financial services) and unbanked individuals. Logistic regression analyses were conducted on both the entire sample and subsamples based on banking statuses.FindingsThe results showed that financial capability was negatively associated with financial fragility. The magnitude of the potential negative effect of financial capability was the greatest among the fully banked group, followed by the underbanked and unbanked groups. Respondents who were underbanked or unbanked were more likely to experience financial fragility than those who were fully banked. Additionally, respondents who were laid off or furloughed during the pandemic were more likely to experience financial fragility than those without employment shocks. The effect size of financial capability factors was greater than that of COVID-19 shock factors. These results suggest that higher levels of both financial capability and financial inclusion may be effective in reducing the risk of financial fragility.Originality/valueThis study represents one of the first attempts to examine the potential effects of financial capability on financial fragility among consumers with various banking statuses during the COVID-19 pandemic. Furthermore, this study offers new evidence to determine whether COVID-19 shocks, as measured by health and employment status, are associated with financial fragility. Additionally, the effect size of financial capability factors is greater than that of COVID-19 shock factors. The results from the 2021 NFCS dataset provide valuable insights for banking professionals and public policymakers on how to enhance consumer financial wellbeing.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a58f59a18154280bd4cc5e505328844",
  "timestamp": "2025-05-15T02:33:03.413454"
}