{
  "id": 7443,
  "title": "Implementing sustainability taxonomies to redirect capital flows: the case of South Africa",
  "abstract": "Sustainability taxonomies are comprehensive classification systems that define what constitutes a sustainable economic activity. They aim to increase transparency in financial markets and redirect capital flows to sustainable investments. Such sustainable finance policies can be important levers for the transformation of the economy towards climate neutrality, as today's investments will shape economic production processes for decades to come. While sustainability taxonomies have been developed in recent years in many countries, existing research on taxonomies has so far often focused on the European Union and has hardly addressed questions of policy implementation. This case study focuses on South Africa's Green Finance Taxonomy (GFT) and addresses the question of what factors influence the adoption of sustainability taxonomies by potential users. Based on 44 semi-structured expert interviews with taxonomy stakeholders from the private sector, government, civil society and academia, it finds that one year after its publication, the GFT has hardly been used in practice. Important factors hindering an effective implementation are a lack of regulatory embedding, the absence of a legal recognition of the GFT by the European Union (EU), hesitance among financial market participants to build capacity to collect the necessary data, and fossil-fuel path dependencies in South Africa's economy. Given the difficulties many jurisdictions currently face in implementing their newly developed sustainability taxonomies, these findings have important policy implications not only for South Africa but also for other countries. Sustainability taxonomies that are established without adequate regulatory embedding and accompanying policy measures run the risk of not being used.Policy-makers and regulators need to clarify the purpose and use cases of a sustainability taxonomy and send a credible signal to the market that the taxonomy will indeed become the common standard, for example by issuing mandatory disclosure requirements.Designing sustainability taxonomies of different jurisdictions in an interoperable way and achieving a mutual recognition of taxonomies of a similar level of ambition is key.Training and exchange formats can be important to reduce capacity constraints on the part of taxonomy users.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a58810aca8b5cca6f75d3ffd840aacf",
  "timestamp": "2025-05-15T03:08:37.873093"
}