{
  "id": 7629,
  "title": "Sexual violence against ever-married reproductive-age women in East Africa: further analysis of recent demographic and health surveys",
  "abstract": "BackgroundSexual violence is a violation of women's rights, resulting in significant physical and psychological challenges and adverse reproductive health outcomes. Addressing these issues demands urgent public health interventions and support systems to mitigate the profound impact on individuals and societies. Thus, this study aimed to assess sexual violence against ever-married reproductive-age women in East Africa. MethodsData retrieved from the recent Demographic and Health Survey (DHS) of East African countries was used, and a weighted sample of 40,740 ever-married reproductive-age women was included. To identify factors associated with sexual violence, multilevel mixed-effects models utilizing robust Poisson regression were applied. Akaike's and Bayesian information criteria, as well as deviance, were utilized to compare the models. In the multivariable regression model, adjusted prevalence ratios (APR) with 95% confidence intervals (CI) were used to estimate the strength of association, with statistical significance set at a p-value < 0.05. ResultThe pooled proportion of sexual violence among ever-married reproductive-age women in East Africa was 13.05% (95% CI: 12.74-13.36). The multivariable multilevel robust Poisson regression revealed that age at first cohabitation/marriage, having a primary educational level, being employed, residing in a female-headed household, having a husband/partner who drinks alcohol, and living in rural areas were positively associated with sexual violence. On the contrary, having secondary and higher educational levels and living in communities with a high proportion of uneducated women were negatively associated with sexual violence. ConclusionEmpowering girls and women through education reduces their vulnerability. Effective programs should prioritize workplace safety, financial independence, and robust legal protections against harassment and abuse. Raising awareness about the impact of alcohol abuse on relationships and the heightened risk of sexual violence is crucial. Moreover, enhancing access to support services and community networks, especially in rural areas, is essential for preventing and responding to sexual violence.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a6c48a5dc84f8832608f093ea39a3a2",
  "timestamp": "2025-05-15T03:10:33.001744"
}