{
  "id": 4107,
  "title": "Measurement and determinants of financial protection in health in Afghanistan",
  "abstract": "Background Out of pocket (OOP) payments for health are significant health financing challenges in Afghanistan as it is a source of incurrence of catastrophic health expenditure (CHE) and impoverishment. Measuring and understanding the drivers and impacts of this financial health hardship is an economic and public health priority, particularly in the time of COVID-19. This is the first study that measures the financial hardship and determines associated factors in Afghanistan. Methods Afghanistan Living Conditions Survey data for 2016-2017 was used for this study. We calculated incidence and intensity of catastrophic health expenditure by using different thresholds ranging from 5 to 40% of total and nonfood consumption and subsequent impoverishment due to OOPs. Logistic regression was used to assess the degree to which Afghan households are protected from the catastrophic household expenditure. Results Results revealed that 32% of the population in Afghanistan incurred catastrophic health expenditure (as 10% of total consumption) and when healthcare payments are netted out of household consumption, the Afghan population live in extreme poverty ($1.9 in 2011 PPP), increased from 29 to 36%. Based on our findings from logistic regression in Afghanistan, having an educated head or being employed are protective factors from financial hardship while having a female head, an elderly member, a disabled, or a sick member are the risk factors of facing catastrophic health expenditure. Moreover, the people living in rural/nomadic areas or facing an economic shock are more likely to face catastrophic health expenditure and hence to be impoverished due to direct OOPs on health. Conclusions The high rate of poverty and catastrophic health expenditure in Afghanistan emphasizes the need to strengthen the health financing system. Although Afghanistan has made great efforts to support households against health expenditure burden during the pandemic, households are at higher risk of poverty and financial hardship due to OOPs. Therefore, there is need for more financial and supportive response policies by providing a better and easier access to primary health services, extending to all entitlement to health services particularly in the public sector, eliminating user fees for COVID-19 health services and suspending fees for other essential health services, expanding coverage of income support, and strengthening the overall health financing system.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a81940d6852f683b5aa20f7b54d97ff",
  "timestamp": "2025-05-15T02:33:03.561551"
}