{
  "id": 8454,
  "title": "Adolescents who use the emergency department as their usual source of care",
  "abstract": "Objective: To examine the factors associated with use of the emergency department (ED) as the only source of health care among adolescents. Design: Analyses of the 1997 Commonwealth Fund Survey of the Health of Adolescent Girls, a nationally representative sample of 6748 in-school male and female adolescents in 5th through 12th grade. The chi(2) statistics and logistic regression analyses were computed with the use of SUDAAN. Results: Overall, 4.6% of the adolescents in the survey, or 1.5 million adolescents in the United States, reported that the ED was their usual source of health care. In multivariate models, factors associated with the use of the ED included male sex, African American ethnicity, fewer financial resources, and living in a rural area. Adolescents with higher levels of risky behaviors, a history of physical or sexual abuse, and higher depression scores were all more likely to use the ED as their usual source of care. Adolescents who reported using the ED as their usual care source were also less likely to have had regular well visits and were more likely to report having missed needed care than those with other sources of primary care. Conclusions: Adolescents who use the ED as their usual source of care are often from vulnerable populations. Many have special mental or physical needs that are unlikely to be met with ED visits only, and they are likely to have missed care they needed. Creating linkages between EDs and other sen ices could help at-risk adolescents identify and use more appropriate sources of primary care.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a815f452b83015c7ab1c1fbb4e07d6d",
  "timestamp": "2025-05-15T03:18:51.707804"
}