{
  "id": 3908,
  "title": "A comprehensive review and analysis of patents on biological and biosimilar products listed in the purple book",
  "abstract": "The pharmaceutical industries are including and expanding their product portfolio with biological and biosimilar products due to their rampant demand and profitability. The products with marketing approval through the biological license application (BLA) are listed in the Purple Book published by the USFDA and their concerned patent numbers. The purpose of the present article is to review innovations listed in the purple book to understand a gross innovative and technical picture behind the approved biologicals. More than ninety patents on biological products listed in the purple book are reviewed in the present review article, and gist inventions are briefly presented. The patents are clustered using the text -mining approach to simplify the review. The text -mining approach of natural language processing (NPL) simplifies the review process. The patents were clustered based on their technical similarity of innovation through the hierarchical clustering technique of text -mining. Fifteen such clusters were identified, and each cluster's patents were systematically studied to extract actual innovative steps. Innovations for new products, new processes, and improving product quality hold a significant share in these clusters. The review throws the spotlight on innovations of Low acidic species for improving product quality; Cell culture composition for product yield optimization; novel products for arthritis, psoriasis, ankylosing spondylitis, and cancer; method for modulating the lysine variants and galactosylation; controlling damage to disulfide bonds; controlling the lactate and host-cell protein level during the production; method for anti-TNF alpha antibodies; injectors for biologicals; etc. The present work provides complete landscaping of patents on the biological products listed in the purple book. The present work also demonstrates the application of text mining for reviewing a large pool of patent datasets. It also allows us to understand continuously updating patent data, like in the case of Purple Book.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a8291340a8cb84c3470da183254829d",
  "timestamp": "2025-05-15T01:22:11.834535"
}