{
  "id": 6625,
  "title": "Low-cost detection and monitoring of coronary artery disease using ultrasound",
  "abstract": "Cardiovascular disease has a signiflicant impact on global public health both due to its prevalence and high morbidity and mortality as well as its large financial burden. Prevention strategies using traditional risk factors miss many opportunities, because these risk factors do not identify the atherosclerotic plaques that are responsible for the target ischemic events. We present a new technology that could be used to develop a new prevention strategy by providing a low-cost tool for detection of coronary artery disease (CAD). This technology can be used in a decentralized primary care setting. This technology uses ultrasound for measuring minute local vibrations in the cardiac wall associated with acoustic markers of CAD. We have developed a programmable ultrasound platform that has enabled the rapid translation of this technology from the research laboratory to clinical evaluation. Preliminary feasibility studies indicate the promising potential of this technology for detecting and classifying CAD in a symptomatic population. For more effective secondary prevention of patients with diagnosed CAD, this technology can be used in conjunction With another new ultrasound-based method for measuring local variation of mechanical strain in the carotid artery wall as a surrogate. for monitoring the progression or regression of CAD.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a89e1bbaea85095e1315bd02371273f",
  "timestamp": "2025-05-15T03:00:04.964455"
}