{
  "id": 4009,
  "title": "Herd behaviour experimental testing in laboratory artificial stock market settings. Behavioural foundations of stylised facts of financial returns",
  "abstract": "Many scholars express concerns that herding behaviour causes excess volatility, destabilises financial markets, and increases the likelihood of systemic risk. We use a special form of the Strongly Typed Genetic Programming (STGP) technique to evolve a stock market divided into two groups-a small subset of artificial agents called 'Best Agents' and a main cohort of agents named 'All Agents'. The 'Best Agents' perform best in term of the trailing return of a wealth moving average. We then investigate whether herding behaviour can arise when agents trade Dow Jones, General Electric, and IBM financial instruments in four different artificial stock markets. This paper uses real historical quotes of the three financial instruments to analyse the behavioural foundations of stylised facts such as leptokurtosis, non-IIDness, and volatility clustering. We found evidence of more herding in a group of stocks than in individual stocks, but the magnitude of herding does not contribute to the mispricing of assets in the long run. Our findings suggest that the price formation process caused by the collective behaviour of the entire market exhibit less herding and is more efficient than the segmented market populated by a small subset of agents. Hence, greater genetic diversity leads to greater consistency with fundamental values and market efficiency. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6a993743487c88942e543d2ea865a34e",
  "timestamp": "2025-05-15T02:31:58.720030"
}