{
  "id": 5443,
  "title": "Filicide-suicide ideation among Taiwanese parents with school-aged children: Prevalence and associated factors",
  "abstract": "This study explored the prevalence of filicide-suicide ideation among Taiwanese parents with school-aged children. Multiple risk factors associated with filicide-suicide ideation were assessed, and the potential effect of traditional family values was evaluated. A random sample of 1,564 parents was recruited from 21 elementary schools in a rural area of Taiwan. Potential risk factors, including demographics, family finance, psychological maladjustment, family interaction, and cultural beliefs, were further examined using a hierarchical logistic regression. Overall, 14.6% of the respondents reported having filicide-suicide ideation during the past year. The hierarchical logistic regression analysis showed that demographic factors including age, gender, and ethnicity had no significant effect. Family finances, depression, and conflict with the respondent's spouse were positively associated with filicide-suicide ideation. Finally, the parents' beliefs in traditional family values had a positive effect on filicide-suicide ideation. In other words, filicide-suicide thoughts were more common among those who upheld a strong parental responsibility for care giving and family solidarity. This study revealed a substantial prevalence of filicide-suicide ideation among local parents and identified a number of risk factors associated with those thoughts, namely family financial status, parental depression, and conflict with one's spouse. More importantly, the results highlighted the effect of traditional family values in the process. The potential intention of filicide-suicide as mercy killing and its cultural relevance were discussed. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6aac1c5632a337188021008f71adc01d",
  "timestamp": "2025-05-16T17:50:25.562875"
}