{
  "id": 1493,
  "title": "A Study on How International Portfolio Investment Flows Affect Macrofinancial Risks and Control Channels",
  "abstract": "In the current complex global economic background, international capital flows are becoming more frequent. Based on this, this paper takes international portfolio investment as the research object and empirically tests the causal relationship and control channel between international portfolio flows and macrofinancial risk in emerging economies. It selects the panel data of emerging economies from 2001 to 2020, constructs macrofinancial risk indicators by using contingent claim analysis and the entropy-based TOPSIS method, tests the effect of international portfolio flows on macrofinancial risk by using the panel distributed lag regression model, and explores the management effect of foreign exchange reserves and capital controls on the risk effect by using the panel threshold regression model. The results show that long-term international portfolio flows help reduce macrofinancial risk, but short-term capital flows appear to increase macrofinancial risk. In addition, both foreign exchange reserves and capital controls effectively reduce the risk effect of portfolio flows. However, when considering different types of portfolios, we find that foreign exchange reserves do not effectively control the risk effect of equity securities flows, while stricter capital controls do. This paper argues that emerging economies should be more open to international long-term portfolio flows, focus on the monitoring of short-term portfolio capital flows and equity securities flows, and coordinate the use of foreign exchange reserves and capital control instruments to manage the risk effects of portfolio flows. This paper verifies the risk effect of international portfolio investment flows through empirical analysis, tests the effectiveness of foreign exchange reserves and capital controls, and provides a decision-making reference for emerging economies to timely identify, effectively manage, and prevent the risk effect of international capital flows.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ab475c06ecfc1498e14f794c084288a",
  "timestamp": "2025-05-15T00:56:38.930311"
}