{
  "id": 1034,
  "title": "The Way to Invest: Trading Strategies Based on ARIMA and Investor Personality",
  "abstract": "In the field of financial investment, accurate prediction of financial market values can increase investor profits. Investor personality affects specific portfolio solutions, which keeps them symmetrical in the process of investment competition. However, information is often asymmetric in financial markets, and this information bias often results in different future returns for investors. Nowadays, machine learning algorithms are widely used in the field of financial investment. Many advanced machine learning algorithms can effectively predict future market changes and provide a scientific basis for investor decisions. The purpose of this paper is to study the problem of optimal matching of financial investment by using machine learning algorithms combined with finance and to reduce the impact of information asymmetry for investors effectively. Moreover, based on the model results, we study the effects of different investor personalities on factors such as expected investment returns and the number of transactions. Based on the time-series characteristics of price data, through multi-model comparison, we select the ARIMA model combined with particle swarm algorithm to determine the optimal prediction model and introduce the concepts of mean-variance model, Sharpe ratio, and efficient frontier to find the balance point of risk and return. In this study, we use gold and bitcoin price data from 2016-2021 to develop optimal investment strategies and study the impact of investor behavior on trading strategies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ab4d3c9687ca215f62f4eedfbcf42cd",
  "timestamp": "2025-05-15T01:58:08.492928"
}