{
  "id": 7855,
  "title": "Unmet needs in long-term care and their associated factors among the oldest old in China",
  "abstract": "Background: With a rapidly aging population and a decline in the availability of family caregivers, the number of elders in China who have unmet long-term care needs is increasing. Because unmet needs often have negative consequences, it is increasingly important to identify factors associated with unmet needs. Utilizing Andersen's behavioral model of health services use, this study examines the roles of predisposing factors (demographics), enabling factors (resources), and need (e.g., illness level) in long-term care among the oldest old in China. Methods: Data from three waves (2005, 2008, and 2011) of the Chinese Longitudinal Healthy Longevity Survey (CLHLS) were analyzed. Four sequential, logistic regression models were designed to investigate how predisposing factors, enabling factors, and need were associated with unmet needs in long-term care. Results: Logistic regression analyses reveal that the significant factors for both rural and urban residents were economic status, someone other than a family member as the primary caregiver, caregivers' willingness to provide care, timely medication, self-rated health, and self-rated life satisfaction. Significant factors among only urban residents were age, a son/daughter-in-law as the primary caregiver, activities of daily living (ADL) disabilities expectation of access to community-based care services, and optimism. Significant factors among only rural residents were gender and cognitive function. Conclusions: The risk of having unmet needs associated with ADL disabilities in long-term care is largely determined by the oldest old's economic status and caregivers' willingness to provide care for both rural and urban residents. Given that the availability of informal caregivers-mainly family members-is declining, it is crucial to provide financial assistance to the oldest old, to increase formal services such as paid home service and community-based care services, and to reduce family caregivers' burden in order to reduce the unmet needs of the oldest old in China.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6abdd5df2ec94f07275393f534fbdfcd",
  "timestamp": "2025-05-15T03:12:36.547066"
}