{
  "id": 558,
  "title": "Using OneNote as an ePortfolio: Promoting Experiential Learning and Self-Regulation",
  "abstract": "The pedagogical role of ePortfolios has been established in numerous studies. It has been suggested that ePortfolios facilitate deep learning, as they allow students to achieve a contextual understanding of their own learning. Other pedagogical advantages of ePortfolios are: enabling students to build a more holistic sense of their learning journey, enhancing learning outcomes and making learning visible. This study draws on previous research and develops the pedagogical potential of ePortfolios further. It presents a learning ePortfolio based on OneNote, the Self-Regulatory ePortfolio, where the pedagogical functions are embedded. The OneNote ePortfolio has been designed around a learning cycle based on experiential and self-regulation learning consisting of the functions: identify /plan/ action / record / review. This design of ePortfolio is much more than a tool to allow or catalyse a learning process, it is directly guiding students through the learning process and training them in self-regulative learning. This paper reports on this new model of Self-Regulatory ePortfolio and explains its structure and features within OneNote. It presents how it has been used at the Open University to work in languages and education modules in relation to Personal Development Planning (PDP) and as a Languages Portfolio in the context of the ECML (European Centre for Modern Languages). It reports on the promising results of pilot studies and scholarship projects carried out to evaluate this Self-Regulatory ePortfolio. It discusses the main findings of the studies and in particular the relation to students' experiences using it. This paper concludes by suggesting further ways to implement this learning ePortfolio in other contexts and platforms.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ac88053b0ee9211e7cd728fecc65e05",
  "timestamp": "2025-05-15T00:37:38.125050"
}