{
  "id": 993,
  "title": "Research on the Market Structure Visualization of Chinese High-Liquidity Equity ETFs Based on the Affinity Propagation Algorithm",
  "abstract": "In today's financial markets, Exchange-Traded Funds (ETFs), particularly high-liquidity equity ETFs exhibiting robust market liquidity, have garnered increasing attention from investors. This study conducts an analysis of 50 highly liquid equity Exchange-Traded Funds (ETFs) within the Chinese securities market, covering the period from October 25, 2022, to October 26, 2023. Employing the Sparse Inverse Covariance Estimation method (GraphicalLassoCV), the research calculates the conditional correlation among ETFs. Additionally, an unsupervised learning method, the Affinity Propagation algorithm from machine learning, is utilized for further analysis and exploration of the market structure of Chinese high-liquidity equity ETFs. Subsequently, 'manifold' techniques are applied for data visualization. The results reveal that 50 high-liquidity equity ETFs are divided into 11 clusters, and specific clusters exhibit industry cohesion, reflecting similar intraday volatility patterns within sectors. The Broad Market Indices and Banking Cluster and the Semiconductor and Artificial Intelligence Cluster are the largest and most active categories. They account for 31.88% and 24.87% of the total market capitalization, and 8.62% and 38.66% of the total trading volume, respectively.This represents the trend over the past year, where short-term investors have shown a preference for innovative companies in sectors such as semiconductors and artificial intelligence. On the other hand, long-term capital tends to favor ETFs associated with banking, market indices, and other sectors characterized by high dividend yields and strong risk diversification capabilities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ac994b7cd9213751a195f1e374938a1",
  "timestamp": "2025-05-15T01:57:29.921130"
}