{
  "id": 2307,
  "title": "Review on Pest Detection and Classification in Agricultural Environments Using Image-Based Deep Learning Models and Its Challenges",
  "abstract": "Agronomic pests cause agriculture to incur financial losses because they diminish production, which lowers revenue. Pest control, essential to lowering these losses, involves identifying and eliminating this risk. Since it enables management to take place, identification is the fundamental component of control. Utilizing the pest's traits, visual identification is done. These characteristics differ between animals and are intrinsic. Since identification is so difficult, specialists in the field handle most of the work, which concentrates the information. Researchers have developed various techniques for predicting crop diseases using images of infected leaves. While progress has been made in identifying plant diseases using different models and methods, new advancements and discussions still offer room for improvement. Technology can significantly improve global crop production, and large datasets can be used to train models and approaches that uncover new and improved methods for detecting plant diseases and addressing low-yield issues. The effectiveness of machine learning and deep learning for identifying and categorizing pests has been confirmed by prior research. This paper thoroughly examines and critically evaluates the many strategies and methodologies used to classify and detect pests or insects using deep learning. The paper examines the benefits and drawbacks of various methodologies and considers potential problems with insect detection via image processing. The paper concludes by providing an analysis and outlook on the future direction of pest detection and classification using deep learning on plants like peanuts.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6acc74918a75ec57c454e873703a0b4b",
  "timestamp": "2025-05-15T02:13:31.905509"
}