{
  "id": 7744,
  "title": "A case-control study of risk factors of chronic venous ulceration in patients with varicose veins",
  "abstract": "Background/objectives Venous ulcers carry psychological and high financial burden for patients, causing depression, pain, and limitation of mobility. The study aimed to identify factors associated with an increased risk of venous ulceration in patients with varicose veins in Armenia. Methods A case-control study design was utilized enrolling 80 patients in each group, who underwent varicose treatment surgery in two specialized surgical centers in Armenia during 2013-2014 years. Cases were patients with varicose veins and venous leg ulcers. Controls included patients with varicose veins but without venous leg ulcers. Data were collected using interviewer-administered telephone interviews and medical record abstraction. Multiple logistic regression analysis was used to identify the risk factors of venous ulceration. Results There were more females than males in both groups (72.5% of cases and 85.0 % of controls). Cases were on average older than controls (53.9 vs. 39.2 years old, p0.001). After adjusting for potential confounders, the estimated odds of developing venous ulcer was higher in patients with history of post thrombotic syndrome (odds ratio=14.90; 95% confidence interval: 3.95-56.19; p=0.001), with higher average sitting time (odds ratio=1.32 per hour of sitting time; 95% confidence interval: 1.08-1.61; p=0.006), those with reflux in deep veins (odds ratio=3.58; 95% confidence interval: 1.23-10.31; p=0.019) and history of leg injury (odds ratio=3.12; 95% confidence interval: 1.18-8.23; p=0.022). Regular exercise in form of walking (5 days per week) was found to be a protective factor from venous ulceration (odds ratio=0.26; 95% confidence interval: 0.08-0.90; p=0.034). Conclusion We found that reflux in deep veins, history of leg injury, history of post thrombotic syndrome, and physical inactivity were significant risk factors for venous ulceration in patients with varicose veins, while regular physical exercise mitigated that risk. Future studies should investigate the relationships between the duration and type of regular exercise and the risk of venous ulceration to make more specific recommendations on preventing ulcer development.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ae3a8dfdca68390e745f20ece3187db",
  "timestamp": "2025-05-15T03:11:38.552592"
}