{
  "id": 5348,
  "title": "Variability in nursing workload within Swiss Diagnosis Related Groups",
  "abstract": "Nursing care inputs represent one of the major cost components in the Swiss Diagnosis Related Group (DRG) structure. High and low nursing workloads in individual cases are supposed to balance out via the DRG group. Research results indicating possible problems in this area cannot be reliably extrapolated to SwissDRG. An analysis of nursing workload figures with DRG indicators was carried out in order to decide whether there is a need to develop SwissDRG classification criteria that are specific to nursing care. The case groups were determined with SwissDRG 0.1, and nursing workload with LEP Nursing 2. Robust statistical methods were used. The evaluation of classification accuracy was carried out with R-2 as the measurement of variance reduction and the coefficient of homogeneity (CH). To ensure reliable conclusions, statistical tests with bootstrapping methods were performed. The sample included 213 groups with a total of 73930 cases from ten hospitals. The DRG classification was seen to have limited explanatory power for variability in nursing workload inputs, both for all cases (R-2 = 0.16) and for inliers (R-2 = 0.32). Nursing workload homogeneity was statistically significant unsatisfactory (CH < 0.67) in 123 groups, including 24 groups in which it was significant defective (CH < 0.60). Therefore, there is a high risk of high and low nursing workloads not balancing out in these groups, and, as a result, of financial resources being wrongly allocated. The development of nursing-care-specific SwissDRG classification criteria for improved homogeneity and variance reduction is therefore indicated.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6af1b13dcff81e8bf2e28030ff1aae9d",
  "timestamp": "2025-05-15T02:46:44.951030"
}