{
  "id": 7005,
  "title": "The evolution of the debt-equity doctrine in the light of financial instruments' digitalization",
  "abstract": "The article outlines the basics for using the debt-equity dichotomy in the financial instruments typology and analyzes the contradictions and shortcomings of the existing approach to classification. It is shown that the trap of the debt-equity dichotomy comes from the path dependence process, mainly formed by the inertia of the tax system. It is noted that the applying of the debt-equity dichotomy entails a formalist approach to classification, which does not bring closer to the clarity of the delimitation of contracts according to the criteria of risk and reward distribution, and restrictions on post-contractual opportunism. Arguments are given to explain why the foundations of the debt-equity doctrine may be weakened in relation to crypto assets. This is supported by the fact that the genesis of digital assets occurs in a specific technological context, which determines its own criteria and framework for the typology of instruments. Another set of arguments comes from the fact that the world of crypto assets appears to be coherent with the specific environment of venture capital investment. This environment, in turn, arouses the demand for overcoming the debt-equity dichotomy to implement the tasks of risky investors and structuring the relations of the parties involved in projects. This demand has now led to the emergence of a number of instruments that cannot be classified as either debt or equity, including those using the construct of tokens or contractual agreements used by crowdfunding platforms. Overall, the intellectual effort that previously satisfactorily explained companies' choices of financing styles and modes is now insufficient to reconcile capital structure theories with the practice of digital asset financing.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6af31a93dff708fc4e94b864c67a1994",
  "timestamp": "2025-05-15T03:03:55.855265"
}