{
  "id": 4504,
  "title": "What determines investment in the Nippon Individual Savings Account? an investigation of Japan's tax-exempt investment account",
  "abstract": "In 2014, the Japanese government introduced the Nippon Individual Savings Account (NISA) to encourage tax-exempt investment and asset accumulation. In January 2024, the NISA underwent significant restructuring to boost household savings in financial asset investments. Taking advantage of the launch of the revamped NISA, we analyzed data collected in late 2022 of 95,632 active investors in a leading securities company to explore their preferences in the previous NISA. Notably, investors exhibit a preference for installment NISA over ordinary NISA, indicating an inclination for long-term capital establishment through gradual investments in secure financial assets. Regression analysis reveals that installment NISA investors are typically female, older, married, or divorced, have lower educational qualifications, engage in part-time employment, have higher incomes, display risk aversion, maintain larger asset balances, and adopt long-term perspectives. By contrast, those favoring ordinary NISA tend to be male, young, married, and financially literate and to have lower incomes, higher asset balances, and shorter-term perspectives. This study advocates maintaining both NISA types, increasing the annual and total investment limits, and eliminating tax exemption periods. These measures would be advantageous for tax savings and capital formation. However, a robust financial education campaign is emphasized to encourage individuals to invest in financial assets, breaking the tradition of keeping funds idle.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b00135db0d75ea767cb67d5be598c3b",
  "timestamp": "2025-05-15T02:37:47.581680"
}