{
  "id": 2783,
  "title": "A novel agent model of heterogeneous risk based on temporal interaction network for stock price simulation",
  "abstract": "We propose a novel agent-based financial price model with heterogeneous transmission risks on a time-dependent interaction network to investigate financial market dynamics, the underlying network is the combination of the SIS-type epidemic model and the temporal exponential random graph model-TERGM, in which individuals are placed as nodes and the links represent their social interactions with a temporal pattern for formations and eliminations. This mimic financial market consists of a heterogeneous population with two types of investors: senior traders with the high information dissemination ability (risk) and general traders with the low information dissemination ability (risk). At any given time, investors can have one of two distinct types of states: activeand passive, the activetraders follow their neighbors' attitude states +/- 1 regarding buying or selling an asset, and the passivetraders naturally make a neutral decision, and the dissemination of their investment decisions along the network are characterized by node interactions in the contact process of the epidemic model. Compared with several real-world financial indices, our model exhibits fundamental qualitative and quantitative real-world market features of returns, such as volatility clustering, fat-tailed distributions, and multifractality of the original returns and the decomposed series with different frequencies. Furthermore, we find out the underlying network structure of agents like social network of traders and heterogeneous agents' (traders') information propagation capabilities can effect the financial market dynamics on prices. (c) 2023 Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b016e286465a5205014646773d6cb23",
  "timestamp": "2025-05-15T02:19:08.448752"
}