{
  "id": 7806,
  "title": "Predictors of Family Caregivers' Depressive- and Prolonged-Grief-Disorder-Symptom Trajectories",
  "abstract": "Objective. Depression and prolonged grief disorder (PGD) are related but distinct constructs with different risk factors and treatments. We aimed to determine commonality and differences in factors predicting membership in depressive- and PGD-symptom trajectories to highlight uniqueness of each construct to guide further care and treatments. Methods. We previously identified four shared trajectories for depressive- and PGD-symptom trajectories (endurance, transient-reaction, resilience, and prolonged-symptomatic) with unique trajectories of chronically distressed and potential recurrence for depressive and PGD symptoms, respectively. This secondary-analysis study examined pre- and postloss factors predisposing 849 bereaved caregivers of cancer patients to membership in depressive- and PGD-symptom trajectories from the integrative framework of predictors for bereavement outcomes by a multinomial logistic regression model (the endurance trajectory as reference). Results. Common factors predicted membership in depressive- and PGD-symptom trajectories: higher postloss personal coping capacity protected from more distressing symptom trajectories, spousal relationship with the patient predicted membership in the transient-reaction trajectory, while financial hardship and preloss depressive symptoms predicted for the resilience trajectory. Yet, accurate prognostic awareness protected caregivers from more distressing depressive-symptom trajectories only. Higher preloss subjective caregiving burden protected caregivers from the four more distressing depressive-symptom trajectories but only from the transient-reaction and resilience trajectories for PGD symptoms. Conclusion. Commonality and differences in factors predicting membership in PGD- and depressive-symptom trajectories confirm that PGD and depression are related but distinct constructs. Interventions should be tailored to caregivers' unique risk profile for depressive- and PGD-symptom trajectories to reduce the likelihood of suffering both or individual symptom trajectories. (C) 2021 American Academy of Hospice and Palliative Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b01afa31f12aa2e96dd823899edde05",
  "timestamp": "2025-05-15T03:12:11.700850"
}