{
  "id": 6947,
  "title": "A Perioperative Patient Support System Was Unable to Mitigate the Risk of Hospital Readmission for Total Hip Arthroplasty Patients With High American Society of Anesthesiologists Grades",
  "abstract": "Background: Utilization of a patient support system including a patient navigator to maintain patient engagement upon discharge home has successfully reduced the number of hospital readmissions after arthroplasty procedures. Although successful in a general patient population, the ability of the support system to reduce readmissions in subsets of  high-risk patients has not been evaluated. Methods: We identified 878 primary total hip arthroplasties (THAs) performed at a single institution between 2013 and 2015. A binary regression was used to determine if a model of patient factors could accurately predict readmission, and the individual effects of each factor on readmissions were assessed. Results: No combination of patient factors was able to accurately predict the need for hospital readmission. However, those with American Society of Anesthesiologists (ASA) grades 3 or 4 (32/375 [8.8%]) were twice as likely to be readmitted than those with ASA grades 1 or 2 (23/503 [4.4%], P = .02; odds ratio = 2.0 [95% CI = 1.2- 3.6], P = .01). Conclusion: Maintaining routine communication with the patient and surgeon's office throughout the postoperative period successfully reduced readmission rates for those with low ASA grades; however, implementing this program did not lessen the risk of readmission for patients with greater comorbidity burdens. Future studies are necessary to determine if interventions to medically optimize patients with high ASA grades can reduce readmission rates, but until such time, risk adjustment methodologies are necessary to avoid financial penalties for readmissions for high-ASA grade patients that have been repeatedly demonstrated to be at an inherently increased risk. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b192f68e38a86497e2ad67af120c55c",
  "timestamp": "2025-05-15T03:03:13.507641"
}