{
  "id": 4835,
  "title": "Evaluating Corporate Performance and Bank Productivity in China: The Moderating Role of Independent Directors",
  "abstract": "Corporate governance (CG) is not an abstract goal. It exists to serve the bank's purpose by giving a framework through which investors, directors, and the top management can efficiently follow its objectives. Subsequently, it boosts the financial performance of the bank for its shareholders. This paper explores CG and its impacts on financial performance from the evidence collected from selected commercial banks (CB) in China. The data sample for this research comprises selected CBs in China for the period from 2008 to 2019. Applying selection standards provides us a data sample of 17 CBs. We employed the generalized method of moments (GMM) regression model constructed on 170 observations to identify the variables' relationship. Our findings show that female independent directors positively and significantly affect bank financial performance. Despite the literature review, we found that the existence of female directors alone does not positively and significantly improve banks' financial performance. The finding suggests that female directors are more efficient when they are selected as independent directors. The findings show that CEO duality affects bank financial performance positively and significantly. CEO duality strengthens the financial performance of CBs because of the solidarity of the order it presents. The results also show that CEO shareholding and financial performance of Chinese CBs have a positively significant bond with each other. This result suggests that a blend of CG instruments is more impressive than one CG component. The investigation results added a new dimension to the governance literature that could be an important source of knowledge for policymakers and regulators to improve the current governance structure for better performance across countries. This paper support principal-agent theory and the author also provide some help for the theories that regulators should support gender quotas in the board of directors of banks to decrease risk-taking behavior.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b20e54908eea61e9986a15bcc220084",
  "timestamp": "2025-05-15T02:41:32.741763"
}