{
  "id": 8295,
  "title": "Does the charitable medical assistance program impact catastrophic medical expenditures for families of children with leukemia? An evidence-based study in China",
  "abstract": "BackgroundPediatric leukemia is the most prevalent childhood cancer in China, exerting a considerable financial impact on affected families. Despite the mandatory participation of all Chinese children in the Resident Basic Medical Insurance, out-of-pocket (OOP) expenses remain substantial for families of children with leukemia. However, charity assistance has been shown to help mitigate these financial burdens. The Love Union Project is a comprehensive charitable medical assistance program designed to support families of children with leukemia within China's multi-tiered healthcare security system. This study was designed to evaluate the impact of the Love Union Project on reducing the incidence of catastrophic health expenditure (CHE) among families of children with leukemia in China.MethodsThe study involved 85 children in the intervention group from H city and 36 matched control children from S and Y cities. Data on demographics, medical expenses, and assistance were collected. Non-normally distributed costs were reported as medians. Multivariate logistic regression analyzed the impact of the Love Union Project on CHE.ResultsThanks to the program's intervention, the CHE rate among the intervention group decreased from 75.3% to 65.9%, while the incidence of CHE in the control group was 75.0%. Compared to families with children aged 0-6 years, those aged 7-12 were more likely to incur CHE (OR 5.224; 95% confidence intervals 1.412-19.322). Families with five or more members were also at higher risk of CHE than those with four members or fewer (OR 2.847; 95% confidence intervals 1.056-7.676). Additionally, families with a monthly income of CNY8000($1,120) or more were less likely to experience CHE than those with a monthly income of CNY4000($560) or less (OR 0.257; 95% confidence intervals 0.072-0.923). Lastly, families receiving assistance from the Love Union Project reported significantly lower CHE rates than those who didn't receive such support (OR 0.151; 95% confidence intervals 0.044-0.524).ConclusionWhile medical insurance provides limited relief, the Love Union Project enhances economic resilience for families of children with leukemia. Attention should focus on younger patients, larger households, lower-income families, and those not receiving charity support.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b28a7cbd7ff465d284af5bd19fa0fb5",
  "timestamp": "2025-05-15T03:17:21.566519"
}