{
  "id": 9314,
  "title": "Impact of Coronavirus Disease (COVID-19) Pandemic on Psychological Well-Being of the Pakistani General Population",
  "abstract": "Background and Objectives: In order to curb the spread of coronavirus disease 2019 (COVID-19), the countries took preventive measures such as lockdown and restrictions of movements. This can lead to effects on mental health of the population. We studied the impact of COVID-19 on psychological well-being and associated factors among the Pakistani general population. Methods: An online cross-sectional survey was conducted between 26th April and 15th May and included participants from all over the Pakistan. Attitudes and worriedness about COVID-19 pandemic were assessed using a structured questionnaire. A validated English and Urdu version of the World Health Organization Well-Being Index (WHO-5) was used to assess the well-being. Factor analysis was done to extract the attitude item domains. Logistic regression was used to assess the factors associated with poor well-being. Results: A total of 1,756 people participated in the survey. Almost half 50% of the participants were male, and a similar proportion was employed. About 41% of the participants were dependent on financial sources other than salary. News was considered a source of fear as 72% assumed that avoiding such news may reduce the fear. About 68% of the population was worried about contracting the disease. The most common coping strategies used during lockdown were spending quality time with family, eating healthy food, adequate sleep, and talking to friends on phone. Prevalence of poor well-being was found to be 41.2%. Female gender, being unemployed, living in Sindh and Islamabad Capital Territory (ICT), fear of COVID-19, and having chronic illness were significantly associated with poor well-being. Similarly, coping strategies during lockdown (doing exercise; spending time with family; eating healthy food; having good sleep; contributing in social welfare work and spending time on hobbies) were also significantly associated with mental well-being. Conclusion: We found a high prevalence 41.2% of poor well-being among the Pakistani general population. We also investigated risk factors of poor well-being which included female gender, unemployment, being resident of ICT and Sindh, fear, chronic illness, and absence of coping strategies. This calls for immediate action at population level in the form of targeted mass psychological support programs to improve the mental health of population during the COVID-19 crises.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b3540ec4c2b05865e2aa8b5528638ec",
  "timestamp": "2025-05-15T03:27:53.290615"
}