{
  "id": 7831,
  "title": "The effect of neighbourhood unemployment on health-risk behaviours in elderly differs between Slovak and Dutch cities",
  "abstract": "Background: Health-risk behaviours (HRB) increase the risk of disability and chronic diseases at an older age. This study aimed to compare Slovakia and the Netherlands regarding differences in the prevalence of HRB by neighbourhood and individual deprivation and to determine whether area differences could be explained by the socioeconomic position (SEP) of the residents. Methods: We obtained data on non-institutionalized residents aged >= 65 years from the EU-FP7: EURO-URHIS 2 project from Slovak (N = 665, response rate 44.0%) and Dutch cities (N= 795, response rate 50.2%). HRB concerned daily smoking, binge drinking, physical activity, consumption of fruits and vegetables and body mass index. Area deprivation was measured by the neighbourhood unemployment rate. Individual SEP was measured by education and household income with financial strain. We used multilevel logistic regression. Results: In Slovakia, no HRB was associated with either neighbourhood unemployment or individual SEP. The elderly in the Netherlands from the least favourable neighbourhoods were more likely to be daily smokers [odds ratio (OR) 2.32; 95% confidence interval (CI) 1.25, 4.30] and overweight (OR 1.84; 95% CI 1.24, 2.75) than residents from the most favourable ones. For the Dutch elderly the gradients varied per HRB and per individual-level SEP indicator. Individual SEP explained country differences in the association of area unemployment with smoking and lack of physical activity but not that with overweight. Conclusion: Countries differed in the associations with HRB of both neighbourhood unemployment and individual SEP among the elderly urban residents. The local importance of socio-economic factors on both levels should be considered when developing health-promotion activities for the elderly.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b49e4e6e5c894ff1c1e26f572b87030",
  "timestamp": "2025-05-15T03:12:36.440353"
}