{
  "id": 8184,
  "title": "Economic burden of atopic manifestations in patients with atopic dermatitis - Analysis of administrative claims",
  "abstract": "BACKGROUND: Atopic dermatitis (AD) has been associated with atopic manifestations (AMs), such as food allergies, asthma, allergic rhinitis, and allergic conjunctivitis. OBJECTIVES: To (1) compare the risk of developing AMs in patients with AD versus those without AD, (2) estimate the incremental costs attributable to AMs in patients with AD, and (3) examine the factors associated with incremental costs. METHODS: In this retrospective cohort study, the authors used MarketScan research databases containing medical and pharmacy claims with dates of service from January 1, 1999, to December 31, 2004. Patients were considered to have AD if they had at least 1 medical claim with a primary or secondary diagnosis of AD (international Classification of Diseases, Ninth Revision, Clinical Modification [ICD-9-CM] codes 691.8x) or contact dermatitis or other eczema of unspecified cause (ICD-9-CM codes 692.9x). To create comparable study cohorts, patients with AD were matched with non-AD patients using propensity scores that represented the likelihood of developing AD as predicted by logistic regression. After propensity score matching, the AD and non-AD cohorts did not statistically differ with respect to age, gender, geographic region, type of health insurance, Charlson Comorbidity Index, or baseline measures of medical and prescription drug utilization. The relative risks of developing AMs in the AD and non-AD cohorts were estimated using competing risk-survival analysis. AM was defined by ICD-9-CM codes for asthma (493.xx), allergic rhinitis (477.xx), allergic conjunctivitis (372.05 or 372.14), and food allergy (693.1x, 692.5x, 995.60). The annual incremental cost attributable to AMs in these AD patients was calculated from medical claims with AM and AD diagnosis codes and from pharmacy claims for prescription drugs used to treat asthma, allergic rhinitis, allergic conjunctivitis, or food allergy, and 95% confidence intervals (CIs) were calculated using the bootstrap method. RESULTS: Patients with AD were significantly more likely to develop AMs than patients without AD (21.8% versus 16.9%, adjusted relative risk [RR] = 1.33, 95% Cl, 1.28-1.38). Among AD patients who developed AMs, allergic rhinitis was the most frequent manifestation (66.3%), followed by asthma (24.8%), allergic conjunctivitis (7.6%), and food allergy (1.8%). The incidence and adjusted RRs of developing AM for AD patients versus comparison patients were 5.3% versus 4.5% for asthma (RR=1.20, 95% Cl, 1.12-1.29), 14.6% versus 11.2% for allergic rhinitis (RR=1.35, 95% Cl, 1.29-1.41), 1.6% versus 1.1% for allergic conjunctivitis (RR = 1.50, 95% Cl, 1.31-1.72), and 0.3% versus 0.1% for food allergy (RR = 2.35, 95% Cl, 1.66-3.32). The annual AD+AM treatment costs for patients with AD increased substantially after they developed AMs. The additional financial burden attributable to AMs was estimated to be $482 per year, an almost 1.5-fold increase compared with AD cost alone (from $338 before AM development to $820 afterward, P<0.001), with approximately equal distribution of costs between medical services ($243) and prescription drugs ($239). The largest incremental costs were observed in asthma ($973), followed by allergic rhinitis ($341). CONCLUSIONS: Patients with AD are significantly more likely to develop AM compared with patients without AD. The total treatment costs for AD patients who developed AMs were nearly 2.5 times the total treatment costs for patients with AD alone.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b494fb0718a78019cf6999fea903768",
  "timestamp": "2025-05-15T03:16:17.388272"
}