{
  "id": 4086,
  "title": "Simultaneous hedging strategy for price and volume risks in electricity businesses using energy and weather derivatives",
  "abstract": "In general, electric utilities face intrinsic risks as their revenues depend on high volatility factors including price and volume of sales/procurements. Aiming for an effective strategy to control those risks, we construct a hedging portfolio based on energy and weather derivatives, which can minimize the revenue fluctuations. To this end, we provide unique methods by applying nonparametric regression techniques to synthesize the payoff functions of derivatives that change with time, based on tensor product spline functions. The proposed methodology enables us to incorporate two dimensional smoothing conditions of the underlying asset price and expiration date with a yearly cyclical trend. Moreover, we show that the applied method of Analysis of Variance (ANOVA) decomposition can separate deterministic time trends from the original multivariate payoff functions, and hence, a simultaneous estimation of multiple derivatives payoff functions is achieved. By assuming that revenues have yearly cyclical trends even when viewed at the rate of annual change, we also introduce a spline function with cross variables to consider such a mixed effect. In addition, we propose new standardized derivatives with the square of the temperature prediction error as the underlying asset. Empirical analysis using data from both the Japan Electric Power Exchange (JEPX) and PJM in the U.S. demonstrates the significant hedging effect and supports the versatility of the proposed modeling approach . (c) 2021 The Author(s). Published by Elsevier B.V. This is an open access article under the CC BY license (http:// creativecommons.org/licenses/by/4.0/).",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b4cc0e23d814d6935c35b7e47d44af4",
  "timestamp": "2025-05-15T01:23:27.455469"
}