{
  "id": 2694,
  "title": "Misclassifications in financial risk tolerance",
  "abstract": "This paper analyses the empirical risk tolerance of individuals and the role of physiological measures of risk perception. By using a test that mimics the financial decision process in a laboratory setting (N = 445), we obtained an ex-post empirical measure of individual risk tolerance. Predictive classification models allow us to evaluate the accuracy of two alternative risk-tolerance forecasting methods: a self-report questionnaire and a psycho-physiological experiment. We find that accuracy of self-assessments is low and that misclassifications resulting from questionnaires vary from 36 to 65%: individuals asked to self-evaluate their risk tolerance reveal a high probability of failing their judgement, i.e. they behave as risk takers, even if, before the task, they define themselves as risk averse (and vice versa). Conversely, when the risk-tolerance forecast is obtained from individuals' physiological arousal, observed via their somatic activation before risky choices, the rate of misclassification is considerably lower (~17%). Emotions are confirmed to influence the financial risk-taking process, enhancing the accuracy of the individual risk-tolerance forecasting activity. Self-report questionnaires, conversely, could lead to inadequate risk-tolerance assessments, with consequent unsuitable investment decisions. Bridging these results from the individual to the institutional level, our findings should enhance cautiousness, among regulators and financial institutions, on the (ab)use of risk tolerance questionnaires as tools for classifying individuals' behaviour under risk.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b4f7a68d201d9a66dd16387a67690b3",
  "timestamp": "2025-05-15T02:18:06.223494"
}