{
  "id": 8916,
  "title": "Life Aspirations, Generativity and Compulsive Buying in University Students",
  "abstract": "The study of goal-oriented behaviour, because of its undeniable repercussions on physical and mental health, is one of the target topics of contemporary research. However, the content of life aspirations, emphasised from the self-determination theory, has received little attention from the field of compulsive buying although it plays an important role in the regulation of behaviour and well-being. Generativity, the personal construct that captures the intentions and/or the need to contribute (leave a legacy) to others, has never been analysed with respect to compulsive buying although it has been the source of interest of related fields (responsible consumption). Accordingly, this study seeks to shed light on the role of both constructs (life aspirations and generativity) in compulsive buying among university students. The sample consisted of 1093 Spanish university students classified either as non-compulsive buyers or compulsive buyers. Estimated prevalence of compulsive buying was 7.9%. The results of Student's test confirm that, besides gender (women report greater propensity to the phenomenon), compulsive buyers score higher and show statistically significant differences with respect to non-compulsive buyers in all extrinsic goals (financial success, image, popularity and conformity) and hedonism. Non-compulsive buyers show significantly higher scores for the intrinsic goals of self-acceptance, affiliation and community feeling and also report a higher generative concern. The logistic regression analysis confirms that being female and the life aspirations of image, popularity and hedonism act as risk factors in compulsive buying in university students while generativity and the importance granted to the intrinsic goals of self-acceptance and affiliation are protective factors. Potential lines of action for this worrying phenomenon are discussed in the light of the findings.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b4fe0756760284d1202f3f7fbe41857",
  "timestamp": "2025-05-15T03:23:56.028810"
}