{
  "id": 8768,
  "title": "Factors associated with HIV testing and condom use in Mozambique: implications for programs",
  "abstract": "Background: To identify predictors of HIV testing and condom use in Mozambique. Methods: Nationally representative survey data collected in Mozambique in 2009 was analyzed. Logistic regression analysis was used for two outcomes: HIV testing and condom use. Results: Women at a higher risk of HIV were less likely to be tested for HIV than women at a lower risk: compared to married women, HIV testing was lower among never married women (OR = 0.37, CI: 0.25-0.54); compared to women with one lifetime partner, HIV testing was lower among women with four or more lifetime partners (OR = 0.62, CI: 0.47-0.83). Large wealth differentials were observed: compared to the poorest women, HIV testing was higher among the wealthiest women (OR = 3.03, CI: 1.96-4.68). Perceived quality of health services was an important predictor of HIV testing: HIV testing was higher among women who rated health services as being of very good quality (OR = 2.12, CI: 1.49-3.00). Type of sexual partner was the strongest predictor of condom use: condom use was higher among men who reported last sex with a girlfriend (OR = 9.75, CI: 6.81-13.97) or a casual partner (OR = 11.05, CI: 7.21-16.94). Being tested for HIV during the last two years was the only programmatic variable that predicted condom use. Interestingly, being tested for HIV more than two years ago was not associated with condom use. Frequent mass media exposure was neither associated with HIV testing nor with condom use. Conclusions: The focus of HIV testing should shift from married women (routinely tested during antenatal care visits) to unmarried women and women with multiple sexual partners. Financial barriers to HIV testing appear to be substantial. Since HIV testing is done without a fee being charged, these barriers are presumably related to the cost of transportation to static health facilities. Mechanisms should be developed to cover the cost of transportation to health facilities. Substantially increasing community-based counseling is one way of reducing the cost of transportation. Men should be encouraged to test for HIV periodically.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b4f7a26dd1df504cbd08c2ac8f6e1bb",
  "timestamp": "2025-05-15T03:22:25.975190"
}