{
  "id": 3888,
  "title": "Renewable energy requirements on the ballot: An analysis of county-level voting results",
  "abstract": "National polling data consistently find a large, bipartisan group of Americans support state renewable portfolio standards (RPS), policies which mandate generation of electricity from renewable sources. However, when such policies are actually put before voters on the ballot, they have been met with mixed success: out of seven RPS ballot initiatives, only four have been approved. From a newly compiled dataset of county-level voting results, we use ordinary least-squares regression to investigate the determinants of public support for RPS ballot proposals. Two models are constructed based on literature related to legislative adoption of RPS and, separately, public support of pro-renewable policies. Consistent with previous studies, political, economic, and demographic variables are found to be significant in predicting voter behavior. State-level fixed effects, however, are the largest contributors to both models. A synthesis model, combining elements from both the legislative adoption and public acceptance literatures, performs best when fixed effects are removed. As climate advocates increasingly call for policies to more quickly transition the electricity sector to renewable energy sources, this research provides greater insight into the prospects of successfully achieving that aim through a ballot initiative. It also, however, reveals insights applicable to legislature-driven RPS policies.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b5fdcaab5ec63c744c86c5e56634852",
  "timestamp": "2025-05-15T01:21:41.442022"
}