{
  "id": 2029,
  "title": "Assessing the Impact of Supplier Group Stability on Public Procurement Performance in Slovakia: A Causal Forest Analysis of Collusion Signals",
  "abstract": "Public procurement plays a crucial role in economic systems, accounting for approximately 15% of global GDP. While electronic reverse auctions (eRAs) enhance transparency and efficiency, repeated supplier interactions can lead to reduced competition and potential collusion. This study investigates the relationship between supplier group stability in historical savings and its impact on procurement outcomes, leveraging an extensive dataset of 30,349 public contracts from Slovakia's national e-procurement platform, EKS. Using advanced causal machine learning methods, specifically causal forests, the study estimates heterogeneous treatment effects to uncover the nuances of supplier behavior. Results indicate that contracts involving supplier portfolios with stable tender performance experience, on average, 71% lower savings compared to those with volatile outcomes. However, the magnitude of this negative impact varies significantly across supplier group dynamics, with some situations exhibiting noticeable collusion signals. By estimating individual treatment effects and aggregating them at the supplier portfolio level, the model identifies groups showing potential competition suppression. The study's findings highlight the presence of collusion signals even in highly transparent procurement systems, emphasizing the importance of targeted policy interventions.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b63b29baa901d1ae391ad460698cd28",
  "timestamp": "2025-05-15T01:02:10.271059"
}