{
  "id": 9431,
  "title": "Rates of osteoporosis screening and treatment following vertebral fracture",
  "abstract": "BACKGROUND CONTEXT: Osteoporosis remains an underrecognized and undertreated disease entity in the orthopaedic setting, accounting for substantial long-term morbidity and mortality. Osteoporosis is often not diagnosed or treated until multiple fractures have occurred. Vertebral compression fractures are the most common sentinel fracture, providing an opportunity to intervene with antiresorptive therapy before more debilitating fractures occur. Little data has been published on osteoporosis screening and treatment following vertebral fractures. Further elucidation of the osteoporosis care gap in these patients is warranted. PURPOSE: To demonstrate the current state of post vertebral fracture osteoporosis management at a large tertiary care center with no established secondary fracture prevention program. STUDY DESIGN: Retrospective cohort study. SETTING: A large tertiary care hospital or one of its affiliated community hospitals. PATIENT SAMPLE: All 2,933 patients, 50 years of age or older, who presented to an emergency department with a new vertebral fracture between 2008 and 2014. OUTCOME MEASURES: The physiological measures are rates of new fractures within 2 years following first vertebral fracture. PATIENT CARE METRICS: Post vertebral fracture rates of dual energy X-ray absorptiometry (DXA) testing, calcium and vitamin D supplementation, and pharmacotherapy for osteoporosis within 1 year postfracture, and more than 1 year postfracture. Linear trend of the rate of new antiosteoporosis pharmacotherapy among previously antiosteoporosis medication naive patients within 1 year of fracture over time from 2008 to 2014. METHODS: All patients aged 50 years or older presenting to an emergency department with a vertebral fracture between 2008 and 2014 were included. Only an individual's first documented vertebral fracture was considered. Individuals were assessed for DXA screening, calcium and vitamin D supplementation, treatment with an antiosteoporosis medication, and additional fractures following incident vertebral fracture. Statistical analyses included descriptive statistics and a simple logistic regression. No specific funding was provided for this study. The authors of this study report no relevant financial conflicts of interests or associated biases. RESULTS: Between 2008 and 2014, 2,933 unique patients were seen at an included emergency department for one or more vertebral fracture encounters. Ninety-eight percent did not receive a DXA scan within the preceding 2 years or 1 year following fracture. Seven percent of patients were started on antiresorptive therapy after their fracture, with 341 (5%) starting within 1 year of fracture and 211 (2%) starting thereafter. Twenty-one percent (n=616) had taken an antiresorptive medication before their fracture. Seventy three percent (n=2,128) were never prescribed antiresorptive therapy. Treatment rates slightly decreased over time. Thirty eight percent of patients presenting with a vertebral fracture (n=1,115) went on to develop a second fragility fracture within 2 years. CONCLUSIONS: In the absence of a specific local program to improve secondary fracture prevention following minimal trauma spinal fractures, recognition and treatment of osteoporosis in patients at this institution remained dismal over time despite numerous calls to action on the topic in the orthopaedic literature and elsewhere. Undertreatment of osteoporosis puts patients at increased risk of incurring additional fractures. Within 2 years, 38% of the patients in this sample developed an additional fragility fracture. This study demonstrates a profound post vertebral fracture osteoporosis care gap. (C) 2018 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b79be86fb87df14191b8c796c95cc21",
  "timestamp": "2025-05-15T03:28:46.286886"
}