{
  "id": 7887,
  "title": "Robotic versus open pancreatic surgery: a propensity score-matched cost-effectiveness analysis",
  "abstract": "Background Robotic pancreatic surgery (RPS) is associated with high intraoperative costs compared to open pancreatic surgery (OPS). However, it remains unclear whether several advantages of RPS such as reduced surgical trauma and a shorter postoperative recovery time could lead to a reduction in total costs outweighing the intraoperative costs. The study aimed to compare patients undergoing OPS and RPS with regards to cost-effectiveness in a propensity score-matched (PSM) analysis. Methods Patients undergoing OPS and RPS between 2017 and 2019 were included in this monocentric, retrospective analysis. The controlling department provided financial data (costs and revenues, net loss/profit). A propensity score-matched analysis was performed or OPS and RPS (matching criteria: age, American society of anesthesiologists (ASA) score, gender, body mass index (BMI), and type of pancreatic resection) with a caliper 0.2. Results In total, 272 eligible OPS cases were identified, of which 252 met all inclusion criteria and were thus included in the further analysis. The RPS group contained 92 patients. The matched cohorts contained 41 patients in each group. Length of hospital stay (LOS) was significantly shorter in the RPS group (12 vs. 19 days, p = 0.003). Major postoperative morbidity (Dindo/Clavien >= 3a) and 90-day mortality did not differ significantly between OPS and RPS (p > 0.05). Intraoperative costs were significantly higher in the RPS group than in the OPS group (7334euro vs. 5115euro, p < 0.001). This was, however, balanced by other financial categories. The overall cost-effectiveness tended to be better when comparing RPS to OPS (net profit-RPS: 57euro vs. OPS: - 2894euro, p = 0.328). Binary logistic regression analysis revealed major postoperative complications, longer hospital stay, and ASA scores < 3 were linked to the risk of net loss (i.e., costs > revenue). Conclusions Surgical outcomes of RPS were similar to those of OPS. Higher intraoperative costs of RPS are outweighed by advantages in other categories of cost-effectiveness such as decreased lengths of hospital stay.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b7e88e6567759a3cb49c200559efb51",
  "timestamp": "2025-05-15T03:13:04.923597"
}