{
  "id": 9273,
  "title": "Sexual harassment before and during the COVID-19 pandemic among adolescent girls and young women (AGYW) in Nairobi, Kenya: a cross-sectional study",
  "abstract": "Objectives Sexual harassment among adolescent girls and young women (AGYW) is a prevalent and understudied form of gender-based violence (GBV) with negative impacts on health and well-being. The COVID-19 pandemic raised global concern about GBV within homes; less is known about how it affected GBV in public spaces. Methods Present analyses use cross-sectional data from a cohort of adolescents and young adults residing in Nairobi, Kenya, restricted to female participants. Data were collected August-October 2020 via phone after implementation of COVID-19 restrictions. Prevalence of past-year sexual harassment and harassment relative to COVID-19 restrictions were calculated for overall sample, and by individual, household, and pandemic-related factors. Multivariate negative binomial regression models examine correlates of (1) past-year sexual harassment and (2) increases in sexual harassment relative to COVID-19 restrictions. Results Overall, 18.1% of AGYW experienced past-year sexual harassment at the 2020 survey. Among this group, 14.6% experienced sexual harassment pre-COVID-19 only, 18.8% after only and 66.6% at both time points. Among the latter group, 34.9% reported more occurrences following COVID-19 restrictions, 20.5% reported less occurrences and 44.7% reported no change in occurrence. Overall, 42.0% of AGYW experienced an increase in sexual harassment while 58.0% experienced no increase since COVID-19. In adjusted models, past-year sexual harassment was associated with higher educational attainment (adjusted risk ratio, aRR 2.11; 95% CI 1.27 to 3.52) and inability to meet basic financial needs (aRR 1.67; 95% CI 1.05 to 2.66). Increased sexual harassment since COVID-19 was associated with having full control to leave the home (aRR 1.69; 95% CI 1.00 to 2.90). Conclusions Sexual harassment among AGYW in Nairobi, Kenya was prevalent before and during COVID-19 restrictions. Safety in public spaces remains a highly gendered issue that impacts women's safety and ability to participate in public life. Prevention and support services to address sexual harassment remain an important element in ensuring safe, sustainable public spaces.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b8024affe5362099a4ddeae19537ba6",
  "timestamp": "2025-05-15T03:27:24.941044"
}