{
  "id": 7694,
  "title": "Differences between adults who smoke cigarettes daily and do and do not co-use cannabis: Findings from the 2020 ITC four country smoking and vaping survey",
  "abstract": "Background: Little is known about population-level differences between adults who exclusively smoke cigarettes and those who smoke cigarettes and also use cannabis (co-consumers). Thus, this study describes differences on sociodemographic, cigarette-dependence, health and behavioral variables, and risk perceptions associated with smoking cannabis. Methods: This cross-sectional study included 6941 respondents from the 2020 ITC Four Country Smoking and Vaping Survey (US, Canada, Australia, England). Adult daily cigarette smokers were included and categorized as: cigarette-only smokers (never used cannabis/previously used cannabis, but not in the past 12 months, n = 4857); occasional co-consumers (cannabis use in the past 12 months, but < weekly use, n = 739); or regular co-consumers (use cannabis >= weekly, n = 1345). All outcomes were self-reported. Regression models were conducted on weighted data. Results: Overall, 19.9 % of respondents reported regular cannabis co-use and 10.1 % reported occasional co-use. Regular co-use was highest in Canada (27.2 %), followed by the US (24.4 %), England (12.7 %) and Australia (12.3 %). Compared to cigarette-only smokers, regular co-consumers were more likely to be male and report chest/breathing problems (p < 0.001). All co-consumers were more likely to be younger, have lower income, be experiencing financial stress, reside in Canada, have depressive symptoms, use alcohol more frequently and binge drink, use other tobacco/nicotine products, and perceive smoking cannabis as low health risk and less harmful than smoking cigarettes (all p < 0.001). Cigarette dependence measures were similar between co -consumers and cigarette-only smokers (all p >= 0.05). Conclusions: Although there were no differences on cigarette dependence measures between daily cigarette smokers who do and do not use cannabis, there are several other risk factors that may affect tobacco use and abstinence among co-consumers (e.g., greater depression, high-risk alcohol consumption). Thus, tobacco cessation treatment may require multi-pronged strategies to address other health behaviors. Continued sur-veillance is needed to determine the nature and health implications of co-use considering changing policies, markets, and products.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6b8ef458b711eb57441ce3d1a00c4582",
  "timestamp": "2025-05-15T03:11:04.586979"
}