{
  "id": 8992,
  "title": "Comorbidity of mental disorders and alcohol- and drug-use disorders: Analysis of New South Wales inpatient data",
  "abstract": "Introduction and Aims. Alcohol- and other drug-use disorders have been found to be associated with mental disorders, however, complete characteristics of these comorbid mental disorders are not completely clear in early population based studies. This study aimed to explore the extent and profiles of comorbid mental disorders with alcohol- and other drug-use disorders using a large inpatient dataset. Methods. The data source was the New South Wales (NSW) Inpatient Statistic Data Collection which collects the clinical data of hospital admissions in NSW, Australia. The data were coded using the International Classification of Diseases-10th Revision (ICD-10). The data were from 1 July 2005 to 30 June 2006 the Australian financial year and statistical analysis was performed using SAS. Results. Of 1 592 156 patients admitted, 91 510 (6%) had at least one mental disorder diagnosis and 18 283 (1.1%) had at least one alcohol- or other drug-related diagnosis. Of these patients, an overall 9.6% had dual diagnoses. Comorbidity was nearly five times higher in alcohol- and other drug-use disorders than in mental health disorders (52.4% vs. 10.5%). Comorbidity was higher in males than females (12% vs. 7.1%) and was the most common in patients aged from 20 to 49 regardless of sex. There was a significantly increased risk of developing a comorbid condition in all age groups above 10 years. The most common mental health disorders were major depressive disorders, followed by dementia, anxiety and severe stress. Alcohol-use disorder was the most common diagnosis, followed by cannabis and opioids. Discussion and Conclusion. This study shows the characteristics of comorbid mental and alcohol- or other drug-use disorders. The study extends our understanding of issues addressed in previous population studies. [Lai HMX, Huang QR. Comorbidity of mental disorders and alcohol- and drug-use disorders: Analysis of New South Wales inpatient data. Drug Alcohol Rev 2009].",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ba8135c5e6b353e8e8ec56dc8f02ca1",
  "timestamp": "2025-05-15T03:24:26.373755"
}