{
  "id": 6664,
  "title": "Stress and parenting during the global COVID-19 pandemic",
  "abstract": "Background: Stress and compromised parenting often place children at risk of abuse and neglect. Child maltreatment has generally been viewed as a highly individualistic problem by focusing on stressors and parenting behaviors that impact individual families. However, because of the global coronavirus disease 2019 (COVID-19), families across the world are experiencing a new range of stressors that threaten their health, safety, and economic well-being. Objective: This study examined the impacts of the COVID-19 pandemic in relation to parental perceived stress and child abuse potential. Participants and Setting: Participants included parents (N = 183) with a child under the age of 18 years in the western United States. Method: Tests of group differences and hierarchical multiple regression analyses were employed to assess the relationships among demographic characteristics, COVID-19 risk factors, mental health risk factors, protective factors, parental perceived stress, and child abuse potential. Results: Greater COVID-19 related stressors and high anxiety and depressive symptoms are associated with higher parental perceived stress. Receipt of financial assistance and high anxiety and depressive symptoms are associated with higher child abuse potential. Conversely, greater parental support and perceived control during the pandemic are associated with lower perceived stress and child abuse potential. Results also indicate racial and ethnic differences in COVID-19 related stressors, but not in mental health risk, protective factors, perceived stress, or child abuse potential. Conclusion: Findings suggest that although families experience elevated stressors from COVID-19, providing parental support and increasing perceived control may be promising intervention targets.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bb35ad57c0b87fba6ded160700d236c",
  "timestamp": "2025-05-15T03:00:35.298264"
}