{
  "id": 8676,
  "title": "Bridging the gaps in pediatric complex healthcare: the case for home nursing care among children with medical complexity",
  "abstract": "Background Children with medical complexity (CMC) comprise < 1% of the pediatric population, but account for nearly one-third of healthcare expenditures. Further, while CMC account for up to 80% of pediatric inpatient hospital costs, only 2% of Medicaid spending is attributed to home healthcare. As a result, the current health system heavily relies on family caregivers to fill existing care gaps. This study aimed to: (1) examine factors associated with hospital admissions among CMC and (2) contextualize the potential for home nursing care to improve outcomes among CMC and their families in South Carolina (SC). Methods This mixed-methods study was conducted among CMC, their family caregivers, and physicians in SC. Electronic health records data from a primary care clinic within a large health system (7/1/2022-6/30/2023) was analyzed. Logistic regression examined factors associated with hospitalizations among CMC. In-depth interviews (N = 15) were conducted among physicians and caregivers of CMC statewide. Patient-level quantitative data is triangulated with conceptual findings from interviews. Results Overall, 39.87% of CMC experienced >= 1 hospitalization in the past 12 months. CMC with higher hospitalization risk were dependent on respiratory or neurological/neuromuscular medical devices, not non-Hispanic White, and demonstrated higher healthcare utilization. Interview findings contextualized efforts to reduce hospitalizations, and suggested adaptations related to capacity and willingness to provide complex care for CMC and their families. Conclusions Findings may inform multi-level solutions for accessible, high-quality home nursing care among CMC and their families. Providers may learn from caregivers' insight to emphasize family-centered care practices, acknowledging time and financial constraints while optimizing the quality of medical care provided in the home.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bc41ad1a0ed9ede2d335d1bf42523b4",
  "timestamp": "2025-05-15T03:21:24.644554"
}