{
  "id": 8282,
  "title": "The Financial Burden of Non-Communicable Chronic Diseases in Rural Nigeria: Wealth and Gender Heterogeneity in Health Care Utilization and Health Expenditures",
  "abstract": "Objectives Better insights into health care utilization and out-of-pocket expenditures for non-communicable chronic diseases (NCCD) are needed to develop accessible health care and limit the increasing financial burden of NCCDs in Sub-Saharan Africa. Methods A household survey was conducted in rural Kwara State, Nigeria, among 5,761 individuals. Data were obtained using biomedical and socio-economic questionnaires. Health care utilization, NCCD-related health expenditures and distances to health care providers were compared by sex and by wealth quintile, and a Heckman regression model was used to estimate health expenditures taking selection bias in health care utilization into account. Results The prevalence of NCCDs in our sample was 6.2%. NCCD-affected individuals from the wealthiest quintile utilized formal health care nearly twice as often as those from the lowest quintile (87.8% vs 46.2%, p = 0.002). Women reported foregone formal care more often than men (43.5% vs. 27.0%, p = 0.058). Health expenditures relative to annual consumption of the poorest quintile exceeded those of the highest quintile 2.2-fold, and the poorest quintile exhibited a higher rate of catastrophic health spending (10.8% among NCCD-affected households) than the three upper quintiles (4.2% to 6.7%). Long travel distances to the nearest provider, highest for the poorest quintile, were a significant deterrent to seeking care. Using distance to the nearest facility as instrument to account for selection into health care utilization, we estimated out-of-pocket health care expenditures for NCCDs to be significantly higher in the lowest wealth quintile compared to the three upper quintiles. Conclusions Facing potentially high health care costs and poor accessibility of health care facilities, many individuals suffering from NCCDs particularly women and the poor forego formal care, thereby increasing the risk of more severe illness in the future. When seeking care, the poor spend less on treatment than the rich, suggestive of lower quality care, while their expenditures represent a higher share of their annual household consumption. This calls for targeted interventions that enhance health care accessibility and provide financial protection from the consequences of NCCDs, especially for vulnerable populations.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bcf9721d345f6f98b82f39dae56ee80",
  "timestamp": "2025-05-15T03:17:21.527796"
}