{
  "id": 8867,
  "title": "Determinants in an occupational health and safety program implementation",
  "abstract": "Objective. To identify predictors for the degree to which a program that integrates occupational health surveillance with labor safety, and involves occupational health/safety specialists, company management, and employees, is implemented. Method. This ecological study evaluated companies implementing the occupational health and safety program (OHSP) proposed by the state of Bahia's regional department of Servico Social da Industria (Social Services for Industry, SESI) during the 2005-2006 cycle. The companies that participated were randomly selected. Data were collected through interviews with key contacts within the companies and from technical reports issued by SESI. Multiple linear regression was used to identify factors related to the company, employee, occupational/safety specialist, and any subdimensions that might promote OHSP implementation. Results. Of the 78 companies selected Q 384 employees), the degree to which OHSP was implemented was advanced in 24.4%, intermediate in 53.8%, and initial in 19.3%. Company-related, employee-related and specialist-related factors were positively associated with OHSP implementation (P < 0.001). The most important factor overall was the program's financial autonomy (P = 4.40; P < 0.001). Bivariate analysis revealed that the degree of implementation was associated with the employees' level of health/safety knowledge (P = 1.58; P < 0.05) and training (P = 0.40; P < 0.001) and with communication between the occupational safety team (P = 1.89; P < 0.01) and the health team (P = 0.58; P < 0.05). These findings remained unchanged after adjustment for levels of education among managers and employees, salary/wages, company size, and risk. Conclusions. The time and resources available for employees to dedicate to occupational health and safety, the integration and reinforcement of employee and manager training programs, and improved relationship between occupational health and safety teams may contribute to the success of health and safety promotion efforts among employees.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bdf56fbdef961d0370a3fe76a384be9",
  "timestamp": "2025-05-15T03:23:27.754568"
}