{
  "id": 6405,
  "title": "Stock prediction and mutual fund portfolio management using curve fitting techniques",
  "abstract": "Investment in the share market helps generate more profit than the other financial instruments but has the threat of market risk that might lead to a high loss. This risk factor refrains many potential investors from investing in the share market directly. Instead, they invest in different mutual funds that are being managed by experienced portfolio managers. To avoid the risk factors and increase the gain, they put the accumulated capital in multiple stocks. They need to perform many calculations and predictions to overcome the uncertainties and unpredictability and need to ensure higher gains to the investors of that mutual fund. In this research work initially, a data mining based approach employs a curve fitting/regression technique to forecast the individual stock price. Based on the above analysis, we propose a framework to diversify the investment of the capital fund. This method employs buy and hold strategy using both statistical features and basic domain knowledge of the share market. The proposed framework distributes the capital first, by distributing sector-wise, and then for each sector, investing company-wise, as a diversified approach among different stocks for higher return but maintaining lower risks. Experimental results show that the proposed framework performs well and generates a good yield compared to some benchmark and ranked mutual funds in the Indian stock market.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bec0bc14ee63243b983095f5303d4c3",
  "timestamp": "2025-05-15T02:57:38.848446"
}