{
  "id": 9063,
  "title": "Geopolitical uncertainty and the cost of debt financing: the moderating role of information asymmetry",
  "abstract": "Purpose - This paper aims to study the impact of geopolitical uncertainty on corporate cost of debt and the moderating role of information asymmetry between creditors and borrowing firms. Design/methodology/approach - This study uses 5,223 firm-quarter observations on German-listed firms spanning 2010:Q1-2021:Q4. This study regresses the cost of debt financing on the geopolitical risk, accounting quality and other control variables. Information asymmetry is measured using the performance-matched Jones-model discretionary accrual and the stock bid-ask spread. It uses interaction terms to check if information asymmetry moderates the impact of geopolitical uncertainty on the cost of debts and control for the moderating role of business risk. For the sake of robustness check, it uses long-term cost of debt and bond spread as alternative dependent variables. In addition, this study executes instrumental variables regression and propension score matching to control for potential endogeneity problems. Findings - Estimation results showthat geopolitical uncertainty exerts a positive impact on the cost of debt. This impact is found to be more important on the cost of long-termdebts. Information asymmetry is found to exacerbate the positive impact of geopolitical risk on the cost of debt. These results are robust to the change of the dependent variable and to the mitigation of potential endogeneity. At high levels of information asymmetry, this impact is more important for firms belonging to Transportation, Automobiles and auto parts, Chemicals, Industrial and commercial services, Software and IT services and Industrial goods business sectors. Research limitations/implications - Geopolitical uncertainty should be seriously considered when setting strategies for corporate financial management in Germany and similar economies that are directly exposed to geopolitical risks. Corporate managers should design a comprehensive set of corporate policies to improve their transparency and accountability during increasing uncertainty. Policymakers are required to implement innovative monetary and fiscal policies that take into consideration the heterogeneous impact of geopolitical uncertainty and information transparency in order to contain their incidence on German business sectors. Originality/value - Despite its relevance to corporate financing conditions, little is known about the impact of geopolitical uncertainty on the cost of debt financing. To the best of the authors' knowledge, there is still no empirical evidence on how information asymmetry between creditors and borrowing firms shapes the impact of geopolitical uncertainty on the cost of debt. This paper tries to fill this gap by interacting two measures of information asymmetry with geopolitical uncertainty. In contrast with previous studies, this study shows that the impact of geopolitical uncertainty on the cost of debt is non-linear and heterogeneous. The results show that the impact of geopolitical uncertainty does not exert the same impact on the cost of debt instruments with different maturities. This impact is found to be heterogeneous across business sectors and to depend on the level of information asymmetry.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6bf4eace8e736fe3e59d884f6abd8198",
  "timestamp": "2025-05-15T03:25:27.622069"
}