{
  "id": 2900,
  "title": "What we learn from nexus between greener growth and energy-related emissions: Sustainability perspective evidence in context of financial globalization",
  "abstract": "With gradually increasing global climate issues, the Energy Protection Agency (EPA) emphasizes emission reduction measures at the national and international levels. Financial globalization and green innovation are considered a solution to the low-income problem through internalization and specialization of markets and bring technological progress and innovation through open market access. The developed nations have been using financial globalization as the main driver of economic progress. This study examines the effects of financial globalization and green innovation on energy-related greenhouse gas emissions for G7 countries. Unlike the literature that considered carbon and overall greenhouse gas emissions, this study is novel as it specifically focuses on energy-related emissions in developed economies. The authors use the panel data of G7 economies from 1990 to 2020. To estimate the individual effects of each explanatory variable on emissions despite the nonlinear data distribution, this study uses the novel method of moment quantile regression (MMQR) approach. The results suggested that financial globalization, income, eco-innovation, financial risk and human capital significantly influence greenhouse gas emissions in G7 countries, where economic growth and human capital are the leading drivers of energy-related emissions. However, green technology, financial globalization and financial risk significantly help improve the environmental quality of the region. The results suggested fruitful implications, including increased participation in global economic activities, investment in green innovation, human capital and efficient financial risk management to attain sustainable development.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c00f92e5b2317a1edb9bc9a3cab59e6",
  "timestamp": "2025-05-15T02:20:16.953351"
}