{
  "id": 8984,
  "title": "Prenatal exposure to airborne polychlorinated biphenyl congeners and male reproductive health",
  "abstract": "STUDY QUESTION Is fetal exposure to lower-chlorinated polychlorinated biphenyls (LC-PCBs) in indoor air of private homes built with PCB-containing materials associated with semen characteristics and testicular volume in adult men? SUMMARY ANSWER We observed only marginal and inconsistent associations between maternal exposure to PCBs in indoor air and semen quality, testicular size and reproductive hormones in the adult offspring. WHAT IS KNOWN ALREADY Recent studies have shown LC-PCBs to exhibit endocrine-disrupting properties and increase the risk of cryptorchidism. Although exposure to LC-PCBs in indoor air is relatively common, the long-term impact of prenatal exposure on male reproductive health has not yet been investigated. STUDY DESIGN, SIZE, DURATION In this cohort study, participants were men (18+ years) whose mothers carried them while living in one of two residential areas where indoor air had been contaminated by LC-PCB evaporating from building materials in subsets of the apartments. Men were considered prenatally exposed if their mother had lived in a PCB-contaminated apartment and unexposed if their mother had lived in an uncontaminated apartment for a minimum of 1 year during the 3.6 years before conception or during the first trimester. Mothers of prenatally unexposed men could not have lived in a contaminated apartment at any point. Recruitment lasted from 2017 to 2019. In total, 73 exposed and 111 unexposed men gave a blood and semen sample. PARTICIPANTS/MATERIALS, SETTING, METHODS Percentage differences in semen volume, sperm concentration, total sperm count, morphologically normal spermatozoa, progressively motile spermatozoa and DNA fragmentation index (DFI) between prenatally exposed and unexposed men were estimated using negative binomial regression. Associations with total and calculated free testosterone (CFT), LH and FSH were modeled using the linear regression. Odds of small testicular volume was estimated with logistic regression. MAIN RESULTS AND THE ROLE OF CHANCE Overall, the results of this study were conflicting. No differences in semen volume, sperm concentration, testosterone and CFT were observed between the groups, but there were slight indications of lower total sperm count, increased FSH and risk of small testicles, alongside lower sperm DFI and a higher proportion of normal spermatozoa in men exposed to LCB-PCBs from indoor air during fetal life. There is no apparent biologically plausible explanation for the apparently improved measures of DNA fragmentation and morphology, and these findings may have occurred purely by chance. LIMITATIONS, REASONS FOR CAUTION Owing to the indirect measure of exposure, lack of adjustment for paternal factors, the potential for self-selection due to known exposure status and fertility issues, inability to take time spent away from the residence, limited statistical power and lack of comparable literature, independent replication of the study in larger cohorts is warranted. WIDER IMPLICATIONS OF THE FINDINGS While our findings may appear reassuring for the large number of people residing and/or working in buildings with indoor air contaminated with LC-PCBs, further efforts to understand the full range of health consequences of fetal LC-PCB exposure are needed. STUDY FUNDING/COMPETING INTEREST(S) The study was supported by the Independent Research Fund Denmark (ref no. 6110-00085B), Bispebjerg Hospital, Landsbyggefonden, Realdania (ref. no. PRJ-2017-00176), Grundejernes Investeringsfond (ref. no. 18-58) and Helsefonden (ref. no. 16-B-01-22 and 21-B-0412). K.S.H. was supported by FFIKA, Focused Research Effort on Chemicals in the Working Environment, from the Danish Government. The authors declare that they have no financial, personal or professional competing interests.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c0407f93dd870327cad299eb98bd1a0",
  "timestamp": "2025-05-15T03:24:26.330204"
}