{
  "id": 8794,
  "title": "Preventing Obesity in the USA: Impact on Health Service Utilization and Costs",
  "abstract": "With more than two-thirds of the US population overweight or obese, the obesity epidemic is a major threat for population health and the financial sustainability of the healthcare service. Whether, and to what extent, effective prevention interventions may offer the opportunity to 'bend the curve' of rising healthcare costs is still an object of debate. This study evaluates the potential economic impact of a set of prevention programmes, including education, counselling, long-term drug treatment, regulation (e.g. of advertising or labelling) and fiscal measures, on national healthcare expenditure and use of healthcare services in the USA. The study was carried out as a retrospective evaluation of alternative scenarios compared with a 'business as usual' scenario. An advanced econometric approach involving the use of logistic regression and generalized linear models was used to calculate the number of contacts with key healthcare services (inpatient, outpatient, drug prescriptions) and the associated cost. Analyses were carried out on the Medical Expenditure Panel Survey (1997-2010). In 2010, prevention interventions had the potential to decrease total healthcare expenditure by up to $US2 billion. This estimate does not include the implementation costs. The largest share of savings is produced by reduced use and costs of inpatient care, followed by reduced use of drugs. Reduction in expenditure for outpatient care would be more limited. Private insurance schemes benefit from the largest savings in absolute terms; however, public insurance schemes benefit from the largest cost reduction per patient. People in the lowest income groups show the largest economic benefits. Prevention interventions aimed at tackling obesity and associated risk factors may produce a significant decrease in the use of healthcare services and expenditure. Savings become substantial when a long-term perspective is taken.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c08e1cef70e3adc41b3c7a75c12c1c4",
  "timestamp": "2025-05-15T03:22:26.076533"
}