{
  "id": 352,
  "title": "Efficacy of different dietary patterns on lowering of blood pressure level: an umbrella review",
  "abstract": "Background: Many systematic reviews and meta-analyses have assessed the efficacy of dietary patterns on blood pressure (BP) lowering but their findings are largely conflicting. Objective: This umbrella review aims to provide an update on the available evidence for the efficacy of different dietary patterns on BP lowering. Methods: PubMed and Scopus databases were searched to identify relevant studies through to June 2020. Systematic reviews with meta-analyses of randomized controlled trials (RCTs) were eligible if they measured the effect of dietary patterns on systolic (SBP) and/or diastolic blood pressure (DBP) levels. The methodological quality of included systematic reviews was assessed by A Measurement Tool to Assess Systematic Review version 2. The efficacy of each dietary pattern was summarized qualitatively. The confidence of the effect estimates for each dietary pattern was graded using the NutriGrade scoring system. Results: Fifty systematic reviews and meta-analyses of RCTs were eligible for review. Twelve dietary patterns namely the Dietary Approaches to Stop Hypertension (DASH), Mediterranean. Nordic. vegetarian, low-salt, low-carbohydrate, low-fat, high-protein. low glycemic index, portfolio, pulse, and Paleolithic diets were included in this umbrella review. Among these dietary patterns, the DASH diet was associated with the greatest overall reduction in BP with unstandardized mean differences ranging from -3.20 to -7.62 mmHg for SBP and from -2.50 to -4.22 mmHg for DBP. Adherence to Nordic, portfolio, and low-salt diets also significantly decreased SBP and DBP levels. In contrast, evidence for the efficacy of BP lowering using the Mediterranean, vegetarian, Paleolithic, low-carbohydrate, low glycemic index, high-protein, and low-fat diets was inconsistent. Conclusion: Adherence to the DASH, Nordic, and portfolio diets effectively reduced BP. Low-salt diets significantly decreased BP levels in normotensive Afro-Caribbean people and in hypertensive patients of all ethnic origins.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c1419b3fb8d7a305e4461e0087bbaca",
  "timestamp": "2025-05-15T00:35:17.423658"
}