{
  "id": 6061,
  "title": "Mental health problems and influencing factors in Japanese women 4 months after delivery",
  "abstract": "Background: Postpartum mental health problems are a major public health issue; however, studies on the mental health status of mothers and its influencing factors between 8 weeks and 1 year postpartum are scarce. Furthermore, it would be necessary to examine the factors influencing mothers' mental health in order to evaluate their physiological adaptations to the nursing environment. Methods: We examined the mental health status of postpartum women and the factors influencing poor mental health at 4 months after delivery. A cross-sectional study of 584 postpartum women was conducted. Information on mental health status, delivery, and other factors was collected using a self-administered questionnaire. Women were asked about their age, height, weight, gestational or marital status, whether they were eating regular meals, appetite, frequency of going out, financial difficulty, stressful life events, and history of depression. The Japanese version of the 12-item General Health Questionnaire (GHQ-12) was used to identify potential poor mental health status. Participants with GHQ-12 scores of >= 4 were classified as the high GHQ-12 score group (poor mental health status) and participants with GHQ-12 scores of <= 3 were classified as the low GHQ-12 score group (good mental health status). Results: Forty-five women (7.7%) were classified as having high GHQ-12 scores. Multiple logistic regression analysis revealed that older age, not eating meals regularly, and history of depression were significantly associated with poor mental health. Financial difficulty had a borderline association with poor mental health in this model. Conclusions: These risk factors might help practitioners identify women at high risk of poor mental health after delivery.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c2d04b1d724be3a909021c3238ee9ed",
  "timestamp": "2025-05-15T02:54:03.551410"
}