{
  "id": 5959,
  "title": "Study of the Sustainable Functioning of Construction Companies in the Conditions of Risk Factors",
  "abstract": "The risk factors that arise during the implementation of investment and construction projects differ in nature, degree of influence, and other characteristics. Ignoring these factors and measures to manage them often leads to critical consequences in the form of disruptions in the timing of work. The article discusses the risk factors arising at the construction stage, their classification, as well as the measures and strategies necessary to manage these factors. A methodology has been developed that includes conducting a survey in the form of a questionnaire in order to collect information about risk factors that affect the implementation of investment and construction projects. The fuzzy TOPSIS technique was used to compare the sustainable functioning of three construction companies (alternatives) on the basis of its application of measures and strategies necessary to deal with risk factors (criteria). Experts with experience in the construction sector were involved in the survey. The results showed that financial, technical, legal, economic, managerial, and natural factors have the greatest impact on investment and construction projects. It is recommended to pay special attention to the listed factors when developing measures aimed at preventing risks and their consequences. The methodology described in the study can be used by construction companies in strategic planning. The analysis of the stability of construction companies, depending on their use of various ways to counteract risk factors, allowed us to develop a number of practical recommendations to reduce the impact of the studied factors on achieving the goals of investment and construction projects.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c335ad91021c8362f4686706ec0d483",
  "timestamp": "2025-05-15T02:53:03.202860"
}