{
  "id": 4044,
  "title": "The price continuity, return and volatility spillover effects of regular and after-hours trading",
  "abstract": "This study employs a bivariate EGARCH model to examine the Taiwan Futures Exchange's regular and after-hours trading, focusing on the critical aspects of spillover and expiration effects, as well as volatility clustering and asymmetry. The objective of this study is to observe the impact on the trading sessions in Taiwan by the influences of the European and American markets, focusing on the essential roles of the price discovery function and risk disclosure effectiveness of the regular hours trading. This research is imperative considering the increasing interconnectedness of global financial markets and the need for comprehensive risk assessment for investment strategies. It also examines the hedging behavior of after-hours traders, thereby aiming to contribute to pre-investment analysis by future investors. This examination is vital for understanding the dynamics of after-hours trading and its influence on market stability. Results indicate price continuity between both trading sessions, with regular trading often determining after-hours price ranges. Consequently, after-hours price changes can inform regular trading decisions. This finding highlights the importance of after-hours trading for shaping market expectations. Significant profit potential exists in after-hours trading open interest, which serves speculative and hedging purposes. While regular trading volatility influences after-hours trading, the reverse is not true. This suggests Taiwan market information poses a higher risk impact than European and American market data, emphasizing the unique position of the Taiwan market in the global financial ecosystem. After-hours trading volatility reflects the absorption of international market information and plays a crucial role in advance revelation of risks. This underscores the importance of after-hours trading in global risk management and strategy formulation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c35c3fe1bc5ab08d1ef1a00bc3b6d11",
  "timestamp": "2025-05-15T02:32:27.592702"
}