{
  "id": 5998,
  "title": "Bundled Payments in Cardiac Surgery: Is Risk Adjustment Sufficient to Make It Feasible?",
  "abstract": "Background. Policymakers have proposed risk-adjusted bundled payment as the single most promising method of linking reimbursement to value rather than to quantity of service. Our objective was to assess the relationship between risk and cost to develop a model for forecasting the costs of cardiac operations under a bundled payment scheme. Methods. All patients undergoing adult cardiac operations for which there was a Society of Thoracic Surgeons (STS) risk score over a 5-year period (2008 to 2013) at a tertiary care, university hospital were reviewed. Patients were stratified into five groups based on preoperative risk as a basis for negotiating risk-adjustedbundles. A multivariable regression model was developed to analyze the relationship between risk and log-transformed costs. Monte Carlo simulation was performed to validate the model by comparing predicted with actual fiscal year 2013 costs. Results. Among the 2,514 patients analyzed, preoperative risk was strongly correlated with costs (p < 0.001) but was able to explain only 28% (R-2 = 0.28) of the variation in costs between individual patients. The use of bundling to diffuse and adjust for risk improved prediction to only 33% (R-2 = 0.33). Actual costs in 2013 were $21.6M compared with predicted costs of $19.3M (+/-$350K), which is well outside the forecast's 95% confidence interval. Conclusions. Even among the most routine cardiac operations and with use of the most widely validated surgical risk score available, much of the variation in costs cannot be explained by preoperative risk or surgeon. Consequently, policymakers should reexamine whether individual practices or insurers are best suited to manage the residual financial risk. (C) 2015 by The Society of Thoracic Surgeons",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c3883a5a1f5ba23a127cf4f2df68700",
  "timestamp": "2025-05-15T02:53:33.471519"
}