{
  "id": 2029,
  "title": "Predictors of financial sustainability for cryptocurrencies: An empirical study using a hybrid SEM-ANN approach",
  "abstract": "Cryptocurrencies stand as a significant financial innovation, poised to transform traditional financial systems by facilitating faster, cost-efficient, and inclusive value transfers. Understanding their sustainability is essential in comprehending their potential to reshape established financial frameworks. Hence, this study aimed to identify the factors predicting the financial sustainability of cryptocurrencies. The study proposed a model based on the Expectation Confirmation Theory (ECT) and tested the model using a multi-analytical approach by combining Structural Equation Modeling (SEM) and Artificial Neural Network (ANN). The sample of the study included 1649 participants, ranging in age from 17 to 70. Results indicated that perceived risk, regulation, price volatility, innovativeness, and confirmation of expectations significantly predicted perceived usefulness, which in turn significantly predicted satisfaction with cryptocurrencies. The findings highlighted that users' degree of confirmation of expectations significantly influenced their satisfaction with and perceived usefulness of cryptocurrencies. The specified paths within the model accounted for 61 % and 74 % of the variance in perceived usefulness and financial sustainability, respectively. In comparison to the results obtained through SEM analysis, the deep ANN multi-layer perceptron displayed superior performance in predicting perceived usefulness. This was evident from its enhanced predictive accuracy, achieving averages of 87.34 % for training and 87.76 % for testing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c46cabd658ad28e649ebedf4ee3ad99",
  "timestamp": "2025-05-15T02:10:25.721638"
}