{
  "id": 959,
  "title": "TriXY-Homogeneous genetic sexing of highly degraded forensic samples including hair shafts",
  "abstract": "Sexing of biological evidence is an important aspect in forensic investigations. A routinely used molecular-genetic approach to this endeavour is the amelogenin sex test, which is integrated in most commercially available polymerase chain reaction (PCR) kits for human identification. However, this assay is not entirely effective in respect to highly degraded DNA samples. This study presents a homogeneous PCR assay for robust sex diagnosis, especially for the analysis of severely fragmented DNA. The introduced triplex for the X and Y chromosome (TriXY) is based on real-time PCR amplification of short intergenic sequences (< 50 bp) on both gonosomes. Subsequent PCR product examination and molecular-genetic sex-assignment rely on high-resolution melting (HRM) curve analysis. TriXY was optimized using commercially available multi-donor human DNA preparations of either male or female origin and successfully evaluated on challenging samples, including 46 ancient DNA specimens from archaeological excavations and a total of 16 DNA samples extracted from different segments of eight hair shafts of male and female donors. Additionally, sensitivity and cross-species amplification were examined to further test the assay's utility in forensic investigations. TriXY's closed-tube format avoids post-PCR sample manipulations and, therefore, distinctly reduces the risk of PCR product carry-over contamination and sample mix-up, while reducing labour and financial expenses at the same time. The method is sensitive down to the DNA content of approximately two diploid cells and has proven highly useful on severely fragmented and low quantity ancient DNA samples. Furthermore, it even allowed for sexing of proximal hair shafts with very good results. In summary, TriXY facilitates highly sensitive, rapid, and costeffective genetic sex-determination. It outperforms existing sexing methods both in terms of sensitivity and minimum required template molecule lengths. Therefore, we feel confident that TriXY will prove to be a reliable addition to the toolbox currently used for sex-typing in forensic genetics and other fields of research. (C) 2016 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c575c9bc208b64ecfb66a3b26b0e0f0",
  "timestamp": "2025-05-15T01:44:35.548688"
}