{
  "id": 669,
  "title": "Detecting biotechnology industry's earnings management using Bayesian network, principal component analysis, back propagation neural network, and decision tree",
  "abstract": "The characteristic of long value chain, high-risk, high cost of research and development are belong to high knowledge based content in the biotech medical industry, and the reliability of biotechnology industry's financial statements and the earnings management behavior conducted by the management in their accrual manipulation have been a critical issue. In recent years, some studies have used the data mining technique to detect earnings management, with which the accuracy has therefore risen. As such, this study attempts to diagnose the detecting biotechnology industry earnings management by integrating suitable computing models, we first screened the earnings management variables with the principal component analysis (PCA) and Bayesian network (BN), followed by further constructing the integrated model with the back propagation neural network (BPN) and C5.0 (decision tree) to detect if a company's earnings were seriously manipulated. The empirical results show that combining the EN screening method with C5.0 decision tree has the best performance with an accuracy rate of 98.51%. From the rules set in the final additional testing of the study, it is also found that an enterprise's prior period discretionary accruals play an important role in affecting the serious degree of accrual earnings management. (C) 2014 Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c5dccb18f8c040cc129b1d91a18e17e",
  "timestamp": "2025-05-15T01:53:59.299463"
}