{
  "id": 4857,
  "title": "Mental health and sociodemographic characteristics among Icelanders, data from a cross-sectional study in Iceland",
  "abstract": "Background Mental health challenges are on the rise worldwide. In Iceland, little is known about the sociodemographic factors associated with poor mental health. This study aimed to investigate symptoms of depression, anxiety, stress, and psychiatric medication for mental disorders in a nationally representative sample in Iceland and to explore its associations with sociodemographic factors.Methods This Icelandic cross-sectional study 'Health and Wellbeing of Icelanders' was conducted in 2017 and included 9,887 randomly chosen adults. Participants' depression, anxiety, and stress levels were measured with the Depression Anxiety and Stress scale-21(DASS-21) and the association with sociodemographic factors and prescribed psychiatric medication was assessed in a multinominal logistic regression analysis.Results The youngest age group (18 to 29 years old) had the poorest mental health. Males had a higher risk of medium and high depression scores than females, RRR 1.23 (95% CI 1.06-1.44) and RRR 1.71 (95% CI 1.25-2.33) when adjusted for sociodemographic factors (age, sex, education, marital status, financial status, living area, employment) and use of psychiatric medication. Participants with the most considerable financial difficulties had the highest risk of high scores on depression RRR 11.19 (95% CI 5.8-21.57), anxiety RRR 12.35 (95% CI 5.62-27.14) and stress RRR 11.55 (95% CI 4.75-28.04) when compared to those that do not.Conclusions The youngest participants and those with the most extensive financial difficulties had the highest depression, anxiety, and stress scores. Males scored higher than females on depression. There was a trend towards worse mental health with lower sociodemographic status. Higher education, living with someone, and financial security were associated with better mental health. These results implicate the importance of government actions to counteract social inequalities in the Icelandic nation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c67ebdf649bb991ed8ffc8061b24c6e",
  "timestamp": "2025-05-15T02:41:32.854757"
}