{
  "id": 7103,
  "title": "Adoption of fintech products through environmental regulations in Jordanian commercial banks",
  "abstract": "PurposeThis study aims to examine the adoption of fintech products in Jordanian commercial banks, focusing on the influence of environmental regulations. Specifically, the study investigates the impact of environmental pressures (competitors pressure, customer pressure) and top management support on the adoption of fintech products.Design/methodology/approachA questionnaire survey was conducted, and data from 550 respondents familiar with the bank's operations, once you have responses, use structure equation modeling to understand the relationships between variables. Also, applied the regression model to predict outcomes for new respondents. Ensure ethical considerations, like informed consent, are addressed throughout the process.FindingsThe results reveal that competitors pressure and customer pressure have a significant positive influence on the adoption of fintech products, indicating that banks are more likely to adopt fintech solutions when faced with increasing competition and customer demands. Furthermore, top management support was found to be positively associated with the adoption of fintech products, emphasizing the importance of leadership in driving successful integration. Also, regulators and policymakers can foster FinTech adoption in the banking sector by creating supportive frameworks that balance innovation and risk. The findings highlight the need for Jordanian commercial banks to recognize and respond to environmental pressures to remain competitive and meet customer expectations. Additionally, regulations might encourage the development of financial products and services within the fintech sector. This study enriches fintech adoption literature in the context of Jordanian commercial banks.Originality/valueThis study contributes to the existing literature by shedding light on the factors influencing fintech adoption in Jordanian commercial banks and provides practical implications for banks, regulators and policymakers seeking to promote fintech adoption within the financial sector.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6c7eb3161ee855b7f0b66cbde9153784",
  "timestamp": "2025-05-15T03:05:03.557269"
}