{
  "id": 3249,
  "title": "Expert retrieval based on local journals metadata to drive small-medium industries (SMI) collaboration for product innovation",
  "abstract": "Innovation in the small-medium industries (SMI) sector, which has limited human resources, requires collaboration with academic researchers. Thus, SMI needs an appropriate search tool to find a suitable researcher. Since the skill classification of researchers arranged in an academic environment is very formal and hierarchical, it tend to be challenging for laypeople to understand that skills classification. This study proposes a method to combine expert retrieval based on portfolio content with expert topic maps based on search keywords from user preferences using local journal publication sources indexed at Portal Garuda. This research evaluates the TFIDF-VSM method with the BM25 Okapi for expert retrieval and text rank with text network analysis (betweenness centrality value) for the construction of a map of the topic of its expertise. Furthermore, the prototype was tested with the System Usability Scale instrument to measure the level of usability. The combined use of the BM25 Okapi method and the text network analysis with betweenness centrality value shows a pretty good usability with a value of 73,489. The different backgrounds of academics and SMI practitioners require an appropriate search method approach. Therefore, combining expert retrieval with expert topic maps based on keywords becomes a solution that can help ordinary people (SMI practitioners) find expert researchers to support product innovation in their SMI.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ca365288d175d5c163267c0278c1c0a",
  "timestamp": "2025-05-15T01:15:26.058318"
}