{
  "id": 250,
  "title": "Self-Attention Recurrent Conditional Generative Adversarial Networks for Corporate Credit Rating Prediction",
  "abstract": "Financial risk management has always been a critical issue; banks, debt issuers, and government officials all need credit ratings in order to make intelligent financial decisions. Most of the existing studies on corporate credit rating prediction utilize financial statement features as their input data. Credit rating is closely related to credit risk. However, very few studies consider credit risk elements, such as credit systematic risk / beta and Credit Default Swap (CDS) spread data in credit rating prediction. Furthermore, the application of generative adversarial learning for corporate credit rating prediction was rarely investigated. In this work, a novel generative adversarial network (GAN), Self-Attention Recurrent Conditional GAN (SAR-CGAN) for corporate credit rating prediction is proposed. The proposed model takes advantage of Conditional GAN and Recurrent GAN to improve prediction performance. The financial statement features and corporates' CDS spread-related features: credit systematic risk / beta and quarter mean of CDS spread are used as input features. The proposed model adopts long short-term memory networks (LSTM) based on self-attention to process historical data and generate corporate credit rating. We improve the recurrent-based GAN model by modifying the network structure, in which the self-multi-head attention layer is added to capture the weighted importance of the time series data. Moreover, a data sampling strategy is designed to alleviate the overfitting issue and enhance the effectiveness of the proposed GAN model. The experimental results indicate that the proposed model performs better than other state-of-art models on the applied datasets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ca8dd7f853faf562dbf87e93863f3cb",
  "timestamp": "2025-05-15T01:35:45.596836"
}