{
  "id": 387,
  "title": "A Novel DenseNet-based Deep Reinforcement Framework for Portfolio Management",
  "abstract": "The objective of portfolio management is to realize portfolio optimization, i.e., maximizing the cumulative return of the portfolio over continuous trading periods. Using Artificial Intelligence algorithms, e.g., Deep Reinforcement Learning (DRL), to realize portfolio optimization is an emerging research trend. Jiang et al.'s Ensemble of Identical Independent Evaluators (EIIE) framework achieves at least a four-fold improvement in the indicator of final portfolio value. Their framework has high flexibility to allow us to replace components to achieve continuous improvement. In EIIE, the DRL agent uses neural networks to extract data features from historical data of assets and evaluate each asset's potential growth. This paper introduces a novel network architecture called Dense Based EIIE (DBE), which is embedded in an DRL framework based on Convolutional Neural Network (CNN) and Densely Convoluted Neural Network (DenseNet) module. Compared to Jiang et al.'s strategy, our improved framework uses DenseNet to achieve the EIIE framework, further increasing profitability. In all three experiments carried out, our strategy outperforms Jiang et al.'s strategy and nine traditional strategies. Our strategy achieves at least a 17% improvement in cumulative return compared to other strategies. Furthermore, it achieves at least twice as much in Sharpe Ratio as other strategies.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6cc01186a4c9374b367b440d1ab6a555",
  "timestamp": "2025-05-15T00:42:32.613830"
}