{
  "id": 3820,
  "title": "A comparative study on bank income diversification: which non-interest income component is beneficial?",
  "abstract": "PurposeThis paper aims to conduct a comparative study on the impact of income diversification and the main non-interest components on banks' financial performance and risk-adjusted profitability in China and Egypt.Design/methodology/approachThis study uses both static and dynamic panel regression analyses on a sample of Egyptian and Chinese banks from 2009 to 2022.FindingsIncome diversification yields positive effects on bank profitability in Egypt and China. Trading income consistently exhibits a significant positive influence on bank profitability in both nations. Conversely, fee-based income positively impacts bank profitability in China, whereas in Egypt, this effect is observed under dynamic-based regression models. On the contrary, income diversification does not consistently increase risk-adjusted profitability in both countries, especially Egypt.Originality/valueTo the best of the authors' knowledge, this is the first study to examine the impact of income diversification on Egyptian bank performance while identifying the most significant non-interest income components. In addition, the comparative analysis conducted in this study reveals the positioning of China, the largest economy among emerging countries, in terms of the degree of income diversification, its impact on bank profitability and the extent to which non-interest income components contribute to bank profitability when compared with Egypt, representing an emerging country characterised by different levels of bank market power, financial infrastructure and expertise. Findings hold significant implications, suggesting that bank managers and policymakers should prioritise diversifying income sources, particularly through fee-based services and trading activities in China, and trading activities in Egypt, to enhance financial profitability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6cc49913ec9f7d118efadec6fa9a9059",
  "timestamp": "2025-05-15T02:30:28.627799"
}