{
  "id": 3947,
  "title": "Adoption of green electricity policies: Investigating the role of environmental attitudes via big data-driven search-queries",
  "abstract": "Despite the rising influence of public opinion on government energy policy formulation and implementation, the roles of pro and/or anti-environmental attitudes among residents have not been empirically examined. To quantify time-varying environmental attitudes among local residents, we exploit geo-specific Google search-query data derived from Internet-based big data and verify through ordinary least squares regression outcomes regarding environmental behavior. For the purpose of drawing policy implications, we revisit decisions by state governments of the United States to adopt three well-known green electricity policies: renewable energy portfolio, net metering rules, and public benefit funds. As some states have not yet adopted some (or any) of these policies, unlike previous studies, we handle the issue by examining right-censored data and applying a duration-based econometric method called the accelerated failure time model. We found state residents' environmental attitudes to have statistically significant roles, after controlling for other traditional time-varying policy adoption factors. Interestingly, the extent to which anti-environmental attitudes affect a state's policy adoption differs across green energy policies, and knowing this can help a local government formulate better-tailored environmental policy. In particular, researchers can use our method of incorporating citizens' environmental attitudes to discuss relevant issues in the field of energy policy. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6cd05cbef63feb1dc360b376be58d69b",
  "timestamp": "2025-05-15T01:22:39.307452"
}