{
  "id": 4925,
  "title": "Systemic risk and network effects in RCEP financial markets: Evidence from the TEDNQR model",
  "abstract": "The Regional Comprehensive Economic Partnership (RCEP) has brought both opportunities and new challenges to the Asia-Pacific financial markets. To analyze the spillover effects of stock market risk among RCEP countries, this paper constructs a comprehensive framework for systemic risk management encompassing three aspects: risk measurement, connectivity analysis and identification of influential factors. Specifically, we apply the CoES as a risk measurement metric to construct a tail risk network. Based on risk decomposition in sliding windows, we examine the hierarchical propagation pathways, intensities and evolution mechanisms of systemic risk in RCEP stock markets across four levels (system, group, country and institution). Subsequently, we use a tail-event driven dynamic network quantile regression (TEDNQR) model to explore the influence of network topology, node heterogeneity, and common factors on stock price changes across different quantile levels. Finally, we employ robustness analysis based on goodness-of-fit and DM test to validate the reliability of our methodology and conclusions. The empirical results indicate that both the risk performance and the influential factors of RCEP stock markets exhibit time-varying and tail characteristics. Overall, simultaneous network effects significantly and positively impact stock movements, playing a dominant role among all factors.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6cd728de61e680de5dcf77bf95e8f5c3",
  "timestamp": "2025-05-15T02:42:36.128805"
}