{
  "id": 422,
  "title": "How the political elite make decisions",
  "abstract": "The political elite make policy decisions in noisy environments and under time pressure, and so are prone to using heuristics. There are conflicting schools of thought as to whether it is appropriate for them to do so. Experienced decision-makers are thought to be more effective at using heuristics, so it is possible that for the political elite with experience in a particular context, heuristic decision-making is appropriate. Yet, many politicians are asked to make decisions on matters about which they are not experts. To add to the debate, we facilitated a discussion with a highly experienced cohort of 21 current and former senior politicians, former advisers, and current and former senior bureaucrats. When presented with a carefully considered and innovative new transport network pricing policy, we sought to identify whether and, if so, how they used heuristics to make a decision. We found that they used heuristics (1) to decide whether to engage with the issue at all and (2) how to act, having made the decision to engage. We describe how these heuristics were used and discuss the implications for theory and public administration practice.Points for practitioners There is a growing body of evidence that the political elite use heuristics for decision-making and that the use of heuristics is influenced by seven factors. We gained rare access to the political elite deciding on a politically risky issue and observed not only which heuristics they used, but how they used them. We observed a three-step decision tree, incorporating the 'wait-and-see' heuristic being used to decide whether to act, and political empathy, or intuiting voter heuristics to help decide how to act. We outline five options for public administrators who think that the political elite are using heuristics inappropriately for decision-making.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6cdd1753de1f121692e2061078a3db31",
  "timestamp": "2025-05-15T01:31:50.724857"
}