{
  "id": 7475,
  "title": "High Prevalence of HIV, HCV and Tuberculosis and Associated Risk Behaviours among New Entrants of Methadone Maintenance Treatment Clinics in Guangdong Province, China",
  "abstract": "Background: Methadone maintenance treatment (MMT) has been available in Guangdong province, China since 2006. This study aims to estimate the prevalence levels of HIV, Hepatitis C (HCV), Tuberculosis (TB) and their co-infections and associated demographic and risk behaviours among MMT entrants. Method: A total of 2296 drug users at the time of their MMT enrolment were recruited from four clinics during 2006-2011. Participants' demographic characteristics, infection status and self-reported high-risk drug-use and sexual behaviours were surveyed. Log-linear contingency analysis was employed to investigate the demographic and behavioural differences between gender and drug-user type, while multivariate regression analysis was used to identify the associated factors of HIV, HCV and TB infections. Results: Female drug users demonstrate significantly higher frequency of daily drug consumption (Log-linear contingency analysis, G(2)=10.86, p=0.013) and higher proportion of having had sex in the past three months (G(2)=30.22, p<0.001) than their male counterparts. Among injecting drug users, females also inject (chi(2)=16.15, p=0.001) and share syringes (chi(2)=13.24, p=0.004) more frequently than males. Prevalence of HIV, HCV and TB among MMT entrants are 6.3%, 78.7% and 4.4% respectively. Co-infections of HIV/HCV, HIV/TB, HCV/TB and HIV/HCV/TB reportedly infect 5.6%, 0.5%, 3.8% and 0.3% of study participants. Infection risks of HIV, HCV and TB are consistently associated with increasing length of drug use, injecting drugs, financial dependence and reduced sexual activities. Conclusion: Injecting drug use is the major contributing factor in prevalence levels of HIV, HCV and TB among MMT entrants. Female drug users are more disadvantaged in their social status and risk-taking in their drug use behaviours than males.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d0a37d90a32d8cdbe5ed1abcf963e94",
  "timestamp": "2025-05-15T03:09:07.244639"
}