{
  "id": 8280,
  "title": "Night Vision Symptoms and Progression of Age-related Macular Degeneration in the Complications of Age-related Macular Degeneration Prevention Trial",
  "abstract": "Objective: To describe baseline night vision symptoms and their association with >= 3-lines loss in visual acuity (VA), choroidal neovascularization (CNV), and geographic atrophy (GA). Design: Cohort study within a multicenter randomized clinical trial. Participants: A total of 1052 participants with >= 0 large (> 125 mu) drusen and VA E >= 20/40 in each eye. Methods: At baseline, participants self-administered a 10-item Night Vision Questionnaire (NVQ-10). VA testing was performed at baseline, 6 months, and annually. One eye of each participant was randomly assigned to laser treatment, and the contralateral eye was assigned to observation. During follow-up, trained readers identified CNV on the basis of fluorescein angiograms and end point GA, defined as >1 disc area of new GA, based on color photographs. Evaluation was performed by repeated-measures logistic regression for NVQ-10 score as a risk factor for >= 3-lines loss in VA and by survival analysis for CNV and GA, with and without adjustment for participant and ocular characteristics. Evaluations were based on observed eyes and treated eyes, considered separately and combined. Main Outcome Measures: A 3-lines loss in VA, development of CNV and end point GA. Results: At baseline, NVQ-1 0 scores ranged from 3 to 100 with a mean of 70 (100 corresponds to no night vision symptoms). Compared with participants with the best night vision (fourth quartile of scores), participants with the worst night vision (first quartile of scores) were at increased risk of 3-lines loss in VA in both observed and treated eyes; odds ratios (95% confidence interval) were 2.85 (1.85-4.39) and 2.00 (1.27-3.14), respectively. The relative risk for the first quartile versus the fourth quartile for development of GA was 4.18 (1.80-9.68) in observed eyes and 2.59 (1.13-5.95) in treated eyes. The relative risk for CNV incidence was 1.99 (1.12-3.54) in observed eyes and 1.33 (0.81-2.19) in treated eyes. These relationships were maintained after adjustment for baseline participant and ocular characteristics. Conclusions: Participants who perceived the most problems in their night vision at baseline had an increased risk of 3-lines loss in VA, CNV, and GA. These associations are independent of established risk factors. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2008;115:1876-1882 @ 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d0a1fa40ee3de00f237c98507fe08fd",
  "timestamp": "2025-05-15T03:17:21.521296"
}