{
  "id": 4463,
  "title": "The Determinants of CDS Spreads: The Case of UK Companies",
  "abstract": "Credit default swap spreads are considered as a measure of credit risk and as a leading indicator of the future development of creditworthiness, which can reflect the potential situation, resp. financial health of a company. Thus investors should pay attention to the factors that can affect credit default swap spreads. The aim of this study is to find out which determinants have the most significant influence on the spreads of credit default swaps issued on the debt of UK entities. A panel data regression is employed in order to explore the influence of selected determinants. The theoretical factors at companies' level and market determinants are taken into consideration - leverage, liquidity, equity volatility, risk free interest rate, slope of term structure, market return and market volatility. The role of observed variables is investigated in three periods - before, during and after the financial crisis and within the individual rating groups. The results are consistent with theoretical assumptions in most of the cases. The theoretical determinants have an explanatory power, but the power of individual variables was different in the particular periods. The findings can be beneficial for investors, as well as for analysts, risk managers or decision makers. (C) 2014 The Authors. Published by Elsevier B.V.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d0ec9e8b6770b619f23c617d23540b3",
  "timestamp": "2025-05-15T02:37:47.469005"
}