{
  "id": 6511,
  "title": "Does the DOSPERT scale predict risk-taking behaviour during travel? A study using smartphones",
  "abstract": "Background: Despite the continuing growth of international tourism, very little research has been done on the link between individual risk attitudes and health behaviours during travel. Our study uses a validated risk-taking questionnaire Domain-Specific Risk-Taking Scale (DOSPERT) and data from a smartphone application to study the association between pre-travel risk attitudes and the occurrence of behaviours during travel. Methods: A prospective cohort of travellers to Thailand used a smartphone application to answer a daily questionnaire about health behaviours and events. Prior to travel, participants completed the DOSPERT, a validated 30-item scale that assesses risk-taking and perception in five content domains: financial decisions, health/safety, recreational, ethical and social decisions. Multiple linear regression models were used to model the relationship between DOSPERT risk-taking subdomain score and health behaviour. Results: Of the 75 travellers that completed the study, 70 (93.3%) completed the DOSPERT pre-travel. Men, back-packers and young travellers reported a higher willingness to take recreational risks than women, luxury travellers and older travellers. Incidence of drug and alcohol risk behaviours during travel, itching from mosquitoes, smoking and failing to use a seatbelt in automobiles while at home were all significantly associated with an individual's score on the health and safety DOSPERT subdomain. Conclusions: In our study, individual scores on risk-taking in the health and safety subdomain of the DOSPERT questionnaire seem to be predictive of health behaviours both during travel and at home. By pairing new methods of data collection with questionnaires such as DOSPERT that identify key traveller characteristics to intervene on, travel medicine doctors will be able to provide more specialised health advice, ensuring that all travellers receive well-rounded advice about the full range of health challenges they will face during travel.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d10d87098da0492dcf922a512a3abd8",
  "timestamp": "2025-05-15T02:58:34.348844"
}