{
  "id": 7929,
  "title": "Stressful events and coping with infertility: factors determining pregnancy outcome among IVF couples in Jamaica",
  "abstract": "Objective: The goal of this study was to investigate infertility-coping patterns and pregnancy outcome among IVF participants who face stressful life events in addition to their infertility. Background: Many studies on stress and IVF-assisted pregnancy focus specifically on infertility-related stress without considering the role of other stressful events. Additionally, these studies seldom include the mediating influence of coping patterns. Methods: In a retrospective study, we reviewed the clinical records of 430 men and women who attended the sole fertility centre in Jamaica over a 10-year period. Using cross-sectional analyses, we examined exposure to past significant losses (death, intimate relationship, income) and current stressors (health, work, financial, personal relationships), as well as different coping patterns that emerged (problem-focused, emotion-focused, congruence between partner) with pregnancy outcome. Results: Univariate analyses and logistic regression revealed that participants exposed to multiple stressors were not at increased risk for a negative pregnancy outcome, but women who used problem-focused strategies to cope with their infertility were more likely to become pregnant than those who used emotion-focused strategies. Regardless of coping strategies, however, age was the only independent predictor of pregnancy outcome. Conclusions: Determinants of pregnancy outcome are identified, and the experience of general stress for IVF couples is discussed within the context of a developing country. Areas of future research are highlighted along with implications for psychosocial interventions.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d2938753ab65b6dad47d7f6f23d77a4",
  "timestamp": "2025-05-15T03:13:30.662951"
}