{
  "id": 8967,
  "title": "Health Financing and Catastrophic Payments for Health Care: Evidence from Household-level Survey Data in Botswana and Lesotho",
  "abstract": "The financing of health care is a complex issue for policy makers. This is because high out-of-pocket payments on health care have been found to further impoverish the poor who have limited income to divide among basic necessities of which health care is one catastrophic health expenditure (CHE). The Millennium Development Goals (MDGs) may be difficult to attain with high out-of-pocket payments by the poor; this is an issue of serious concern and highlights the need for the kind of analyses in this paper. The analysis used data collected by the Household and Expenditure Survey (HIES) 2002/2003 for Botswana and by the Household Budget Survey (HBS) 2002/2003 for Lesotho. Our results showed that in Botswana the proportion of households facing CHE at the 20 per cent and 40 per cent thresholds was 11 per cent and 7 per cent respectively, and the share of out-of-pocket health payments during the survey period was about 0.93 per cent. For Lesotho the proportions of those facing CHE expenditure at the 20 per cent and 40 per cent thresholds were 3.22 per cent and 1.25 per cent, and the share of out-of-pocket payment in total monthly expenditure was 1.34 per cent. Results from regression analyses suggest that having at least one senior member in the household imposes a higher risk for CHE for the household in Lesotho; for Botswana gender and education status of household head influence the probability of facing CHE. In designing health systems, policy makers need to ensure that households are not only able to access health services when needed, but that they are also protected from facing financial catastrophe by reducing out-of-pocket payments.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d336bfd561aa5b81d13cba43595ecde",
  "timestamp": "2025-05-15T03:24:26.258898"
}