{
  "id": 3250,
  "title": "Analysis of gender gap in financial competence: an analysis using unsupervised classification methods",
  "abstract": "Objective: This study aims to empirically analyse the relationship between gender and financial education. In addition, the study examines whether certain socio-demographic characteristics, the financial product portfolio itself, financial planning and savings attitudes can explain behavioural differences between men and women. Our approach stands out for its originality in using a representative dataset and statistical learning techniques. Methodology: To carry out this research work, data from the Survey of Financial Competences conducted by the Bank of Spain and the National Securities Market Commission, on a representative sample of 8,554 individuals in Spain, is analysed. Statistical learning methods, based on classification trees and gradient boosting, are used to identify the variables that best explain the gender difference in this context, and to obtain a statistical classification of the observed population. Results: Financial competencies provide a partial explanation for the gender gap. Employment status stands out as an explanatory factor for said gap. Limitations: : The limitations of this work are due to the use of the variables present in the Survey of Financial Competences, some of which are dichotomous and, therefore, offer very generic information. Moreover, the study is cross-sectional, and we cannot analyse changes over time. Practical implications: The findings provide valuable input for implementing differentiated programs and strategies targeting women to help mitigate gender inequalities.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d340e5434265e3902aeca8d6fe30d18",
  "timestamp": "2025-05-15T01:15:26.059344"
}