{
  "id": 7244,
  "title": "Practicum in the European Higher Education Area (EHEA): education professionals' map of competences",
  "abstract": "The text presented here is the result of a study conducted over the last five years by the members of the MPI (Modelo de Practicum Integrador, or Integrative Practicum Model) as part of the MQD (Millora de la Qualitat de la Docencia, or Improvement of Teaching Quality) project, recipient of financial aid awarded on a competitive basis by the Catalonian Regional Government on three consecutive occasions. The objective of the innovation is to develop a Practicum model as close as possible to real-life professional situations. The authors' feeling is that this can be done only if students are able to work in a coordinated fashion with other professionals and too if it is possible to determine which functions and which competences students can develop at the many different types of institutions where they will later work in a professional capacity. This study presents the functions that, from a generic point of view, these professionals can perform, the most frequent work areas and the competences that are developed in such contexts. The classification of areas of work is based on the schools at which the students in the study regularly do their work experience, although this should not be understood to mean any kind of limitation of potential areas of work. Nine areas are outlined: the media; health, consumer affairs and the environment; public administration; the education system; justice, adults and young people; employment; culture and leisure time; childhood and adolescence at risk; and socio-educational research. The proposed competences are the result of consultations with the form room teachers at the schools with which the authors' school most commonly works. The proposal is far more than a mere structured classification, for it envisages application via the Practicum course for three degrees offered by the School of Education Science at the Universitat Autonoma de Barcelona: pedagogy, educational psychology and social education.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d3568e3ea08a8f02648661fe2859ed8",
  "timestamp": "2025-05-15T03:06:35.407734"
}