{
  "id": 8228,
  "title": "Sociodemographic factors influencing island foods consumption in the Pacific Islander Health Study",
  "abstract": "Objectives: Pacific Islander Americans are a small, but quickly growing population that experiences alarming disparities in obesity and obesity-related chronic illnesses influenced by dietary patterns. This population also has a unique culinary heritage including traditional foods and more contemporary imports such as tinned meats and refined carbohydrates. This analysis is a novel attempt to understand the sociodemographic factors influencing island foods consumption. Design: A sample of 240 Samoan and Tongan adults in California from the Pacific Islander Health Study was used. Following univariate and bivariate analyses, a series of four multivariable regression models were created to predict past week frequency of island foods consumption after sequential adjustment for demographic, socioeconomic, and cultural covariates. Results: Participants reported consuming island foods an average of 2.93 times in the previous week, with the largest proportion of participants (20.42%) reporting eating island foods 6 or more times. Age and Samoan ethnicity were initially significant, positive predictors of island foods consumption, but their effect was attenuated after addition of cultural covariates. With the third model that adjusted for birthplace, financial insecurity and Tongan birthplace were positive predictors. Both lost significance in the fourth and final model upon addition of cultural affinity, which was positively associated with island foods. Conclusion: Understanding how sociodemographic factors are associated with island foods consumption is a first step in understanding the broad way in which an ethnically specific dietary pattern may be associated with obesity-related chronic illness risk among Pacific Islander Americans.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d36b9d153662f2328218cbaa5025f49",
  "timestamp": "2025-05-15T03:16:48.908257"
}