{
  "id": 6521,
  "title": "A proposed approach to systematically identify and monitor the corporate political activity of the food industry with respect to public health using publicly available information",
  "abstract": "Unhealthy diets represent one of the major risk factors for non-communicable diseases. There is currently a risk that the political influence of the food industry results in public health policies that do not adequately balance public and commercial interests. This paper aims to develop a framework for categorizing the corporate political activity of the food industry with respect to public health and proposes an approach to systematically identify and monitor it. The proposed framework includes six strategies used by the food industry to influence public health policies and outcomes: information and messaging; financial incentive; constituency building; legal; policy substitution; opposition fragmentation and destabilization. The corporate political activity of the food industry could be identified and monitored through publicly available data sourced from the industry itself, governments, the media and other sources. Steps for country-level monitoring include identification of key food industry actors and related sources of information, followed by systematic data collection and analysis of relevant documents, using the proposed framework as a basis for classification of results. The proposed monitoring approach should be pilot tested in different countries as part of efforts to increase the transparency and accountability of the food industry. This approach has the potential to help redress any imbalance of interests and thereby contribute to the prevention and control of non-communicable diseases.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d40178a446cb064bf26328a09e35fac",
  "timestamp": "2025-05-15T02:59:07.430111"
}