{
  "id": 4428,
  "title": "Household Financial Status and Gender Perspectives in Determining the Financial Impact of Foot and Mouth Disease in Lao PDR",
  "abstract": "The socioeconomic impacts of foot and mouth disease (FMD) during 2011-12 outbreaks on large ruminant smallholders in Laos were investigated, including examination of data on gender, household financial status and farmer husbandry practices. A mix of participatory tools and survey questionnaires at the village and household level, respectively, were conducted, involving individual farmer interviews (n=124) and group meetings with village elders to establish criteria for classification of household financial status as being poor, medium or well off' according to rice sufficiency, assets and household incomes. FMD-attributable financial losses were determined by inclusion of losses due to: mortality, morbidity and costs of treatments. The estimated mean financial losses due to FMD were USD 436 (+/- 92) in the poor' and USD 949 (+/- 76) in the well off' household categories (P<0.001), being 128% and 49% of income from the sale of large ruminants, respectively. Variation in financial losses reflected differences in morbidity, farmer husbandry practices including frequency of observation of animals and thus recognition of FMD and choice of treatments. Of concern were adverse financial impacts of treatment especially where antibiotics were used; delays in reporting of FMD cases after observation of signs (mean of 2days); admission that 10% of farmers had sold FMD-affected livestock; and that 22% of respondents claimed their large ruminants were cared for by females. The findings confirm that FMD has the most severe financial impact on poorer households and that females have a significant role in large ruminant production. It is recommended that livestock extension activities promote the benefits of prevention rather than treatment for FMD and encourage participation of women in biosecurity and disease risk management interventions including rapid reporting and regulatory compliance, particularly with animal movement controls and other biosecurity practices that reduce the negative impacts of FMD on regional food security and poverty reduction in rural communities.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d433c5c79b2162b37e208113c63465a",
  "timestamp": "2025-05-15T02:37:16.800839"
}