{
  "id": 1587,
  "title": "The Risk Analysis of Digital Inclusive Financial Platform Using Deep Learning Approach",
  "abstract": "This paper intends to investigate the risk management of inclusive digital financial platforms. First, it explains the idea of smart cities, their function, and inclusive financial risk control technologies based on big data. The varieties of digital inclusive financial platforms and their risk profiles are next examined. The Back Propagation (BP) neural network is used to build a BP-KMV model based on the KMV model. Finally, utilizing M Company as a case study, this paper uses the BP-KMV model to examine the credit risk and risk management of unlisted enterprises on the digital inclusive financial platform. The results show that of the four unlisted companies, L Company has the greatest default rate (7.35%), while J Company has the lowest default rate (4.82%). The highest research and development (R&D) spending rate is 14.1% for J company, while the highest patent ownership rate is 43.09% for L company. The data demonstrates a negative correlation between the percentage of R&D expenditures and the default rate of unlisted enterprises. In other words, a larger default risk is associated with lower R&D expense rates. Additionally, there is a correlation between patent ownership and default rates that is positive, suggesting that higher patent ownership rates are linked to higher default rates. Additionally, the risk management technologies of M business can complement one another. The theoretical research of comprehensive digital inclusive finance risk control can be enriched by the risk analysis of digital inclusive financial platforms utilizing the BP-KMV model in the context of smart cities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d4f181566dc7fd72df05be81819a417",
  "timestamp": "2025-05-15T02:05:08.172223"
}