{
  "id": 9421,
  "title": "Unraveling the hidden expenses of free delivery services: a cross-sectional analysis of the public health facilities of the Harari Region, Ethiopia",
  "abstract": "BackgroundFacility-based delivery services are a critical intervention for improving maternal and infant health and reducing mortalities. However, in Ethiopia, high costs have been reported to hinder access to care, particularly for low-income families. Despite the importance of institutional delivery services, little is known about the true cost of using these services in public health facilities. As such, there is a pressing need for evidence to shed light on this issue and identify potential solutions to improve access to care for all women and infants in need. This study aims to estimates the cost of delivery services and associated factors on women attending public health facilities in the Harari Region, Eastern Ethiopia.MethodsA facility-based cross-sectional study design was used to collect data from January 01, 2022, to February 15, 2022, among 446 randomly selected mothers who delivered at selected facilities. A pretested and structured questionnaire was used to collect data through face-to-face interviews and participant record reviews. The total median cost of delivery services was estimated from the patient perspective using microcosting and human capital approaches and predictors of median costs was identified using a quantile regression model considering skewed cost data.ResultsThe current study revealed that the median cost of delivery services was US$ 27.3 (with an interquartile range, IQR, of 14.1 to 61.8 US$). Among these costs, direct nonmedical expenses held notable significance, constituting 77.46% of the direct costs. This proportion was largely influenced by food-related expenses, with a median cost of US$ 15.16 (IQR: 6.97-32.34). Direct medical costs accounted for 22.54% of the direct costs, primarily attributed to pharmaceutical expenses, forming the majority of the medical expenditure (IQR, US$ 0.00-8.49). The median indirect cost of delivery services was US$ 0.79 (IQR, 0.00-4.49US$). Types of facility visited (beta = 30.17; 95% CI: 21.71, 38.62), distance from facility (beta = 0.58; 95% CI: 0.26, 0.91), pharmaceutical providers (beta = 20.42; 95% CI: 7.93, 32.90), modes of delivery (beta = 16.53; 95% CI: 7.54, 25.53), length of stay (beta = 7.21; 95% CI: 0.29, 14.14), and number of accompanying persons (beta = 4.48; 95% CI: 2.61, 6.35) were predictors of the median total cost of delivery service.ConclusionsThis study highlights the considerable out-of-pockets payments that families incur when delivering in public health facilities. Despite the policy of providing delivery services free of charge in public facilities, significant out-of-pocket costs were incurred by women, with direct non-medical expenses accounting for a substantial portion of the total cost, underscoring the need for evidence-based policies to address this challenge. Ensuring the financial risk protection of women is a critical step toward achieving universal health coverage.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d6cd8cda6a7f59c819f6a08509ce808",
  "timestamp": "2025-05-15T03:28:46.258612"
}