{
  "id": 8864,
  "title": "I want to go home: should we abandon open surgery for treatment of rectal prolapse? Consideration of discharge destination following surgery for rectal prolapse",
  "abstract": "Aim: Despite the financial and value-based implications associated with higher levels of care at discharge, few studies have evaluated modifiable treatment factors that may optimize postacute care. The aim of this work was to assess the association between operative approach and disposition to a higher level of care and other outcomes following surgery for rectal prolapse. Method: Using a retrospective cohort study design, the database of the National Surgical Quality Improvement Program was used to identify patients with rectal prolapse who underwent perineal repair or open or laparoscopic rectopexy with or without resection between 2012 and 2017. Discharge destination and 30-day postoperative outcomes were compared using propensity score mathcing and weighting. Nomograms generated using multivariable regression calculated the risk of requiring higher levels of care upon discharge and morbidity. Results; Propensity-score analysis included 3000 patients [1500 in the perineal group, 580 in the open abdominal group and 920 in the minimally invasive (MIS) group]. Patients who received open abdominal surgery were more likely to require elevation of care at destination compared with those who received perineal surgery (OR 1.65, 95% CI 1.22-1.24) and MIS abdominal surgery (OR 1.80, 95% CI 1.18-2.76). Similar effects were seen for overall morbidity. Increased age, higher American Society of Anesthesiologists class, congestive heart failure, dependent functional status and open surgery were independent predictors of discharge to higher level of care (c-statistic = 0.79). Conclusion: Open surgery compared with MIS and perineal surgery was associated with higher levels of discharge disposition following rectal prolapse surgery. Future research should continue to identify modifiable treatment factors that reduce poor postoperative outcomes among patients with rectal prolapse.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d94da3f301a9ce06d3a33a50486b743",
  "timestamp": "2025-05-15T03:23:27.749004"
}