{
  "id": 6282,
  "title": "Investment Strategies and Returns of University Endowment Funds",
  "abstract": "Motivation: Investment management of university endowments has been the focus of increased attention. This study extends the literature to examine the linkage between the increased allocation to alternative assets and investment returns for different-sized funds. Premise: University endowment funds shifted asset allocation from public listed securities to alternative assets in recent years. We investigate if such strategy resulted in better investment performance. We also review spending rate and investment performance. Approach: This research uses variables such as size of endowment, rate of return, asset allocation (percentage in equities, fixed-income, and alternative assets), and spending rate. Annual data for 2002 to 2017 are used to perform panel data regression analysis. Results: Spending rates are similar for all endowments. Increasing investments in alternatives did not lead to higher returns for small and midsize endowments. The average returns for large endowments underperformed the passive benchmark after the 2008 financial crisis. The regression results do not show positive marginal impacts of alternatives on investment returns. Conclusions: The strong returns of high-profile endowments could not be duplicated by endowments of all sizes during the sample period. Successful investing in alternatives is more than allocating money. Identification and access to top-performing managers at the right time are important. Consistency: University endowments are managed to provide a permanent funding source that maintains the university's mission of teaching, research, and public service. This study shows the risk of underperformance with strategies that outperformed the market for mega endowments. Such risk impacts the university's ability to fulfill its mission.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d9a20f97b96df3bf130a249344931de",
  "timestamp": "2025-05-15T02:56:37.326061"
}