{
  "id": 285,
  "title": "High return and low risk: Shaping composite financial investment decision in the new energy stock market",
  "abstract": "As an emerging market, the new energy stock market is characterized by high volatility and instability, and investors seeking to make investment decisions face significant challenges. To enable investors to diversify risk and obtain more consistent high returns, we have built a composite financial investment decision system that combines portfolio selection, trend forecasting, and quantitative trading. The system takes a sequential, rolling Sharpe ratio calculation and dynamically selects portfolios to reduce risk from market changes and achieve optimal portfolio diversification. Then, the variational mode decomposition (VMD)-bidirectional gated recurrent unit (BiGRU) model is introduced to predict the trend of the portfolio and quantify the trades of the portfolios. Experimental results show that the system can obtain an average annual return of up to 758,508 CNY with a principal capital of 30,000 CNY. Compared with observing the investment ratio of the portfolio statically, selecting the portfolio by calculating the Sharpe ratio continuously and rolling can improve the portfolio return and diversify the risk. In terms of trend forecasting, VMD-BiGRU is shown to greatly improve forecasting performance compared to single gated recurrent unit (GRU) or long short-term memory (LSTM) models. Compared with human-driven trading, quantitative trading has been shown to have the advantage of short holding times, low risk, and high returns by capturing trading opportunities promptly based on the results obtained from predictive models.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6d9ef7d53cc82eafdd63d9b9fb7c380e",
  "timestamp": "2025-05-15T01:36:21.937321"
}