{
  "id": 961,
  "title": "Research on corporate financial performance prediction based on self-organizing and convolutional neural networks",
  "abstract": "Economic risks faced by manufacturing enterprises are gradually increasing and risk reduction whilst maintaining high financial performance has become key to their survival and development of enterprises. Enterprise performance affects not only enterprise development but also does the interests of investors and creditors. Therefore, a well-performing model for financial performance prediction is particularly important. In this paper, we combine unsupervised and supervised learning, fusing self-organizing mapping neural networks and convolutional neural networks, and apply deep learning to financial analysis to construct a new financial performance prediction model, called SNN-CNN. This paper uses crawler technology to obtain financial data of listed manufacturing enterprises and classifies their financial performance into five levels. It finds that enterprises with high financial performance tend to have balanced financial indicators, strong corporate vitality and stable development of various capabilities, while enterprises with low financial performance have poor repayment and profitability, significant risks in corporate operation and limited growth and development. Compared with traditional risk prediction models, the SOM-CNN model has a higher accuracy rate, up to 95.69%.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6da5d98c04c274c2d24e0f6ae96aca96",
  "timestamp": "2025-05-15T01:56:49.767728"
}