{
  "id": 547,
  "title": "The design and implementation of a deep reinforcement learning and quantum finance theory-inspired portfolio investment management system",
  "abstract": "Deep Learning (DL) and Reinforcement Learning (RL) are common machine learning techniques used in automatic trading, notwithstanding, RL is deficient in portfolio investment in terms of funds distribution, potential loss control, profit maximization, and examine undetected environment. This paper proposed an intelligent Quantum Finance-based portfolio investment system (QFPIS), which is a combination of Deep Reinforcement Learning (DRL) with Quantum Finance Theory (QFT) to improve these conditions. There are two major agents embodied in the system: 1) a trading agent based on Deep Deterministic Policy Gradient algorithm to determine investment weighting for different financial products by generating continuous actions; 2) an intelligent agent based on Policy Gradient (PG) algorithm to enact risk control and determine whether to hold current orders by producing discrete actions depend on daily Quantum Price Levels (QPLs). The advantages of incorporating a two agents system design are to devise stable and realistic fund allocation for different products in portfolio. Experiment results had shown robustness, flexibility, and profitability on a series of forex products and the U.S. stocks in the back-testing phase as compared to other RL trading systems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6db0170963d5530321a8403363c2c92f",
  "timestamp": "2025-05-15T01:52:12.273607"
}