{
  "id": 4380,
  "title": "Financial Strain and Contraceptive Use Among Women in the United States: Differential Effects by Age",
  "abstract": "Introduction: Low-income and young women experience disproportionately high rates of unintended pregnancy. Traditional measures of socioeconomic status may not be appropriate indicators of financial status, particularly during emerging adulthood. This study investigates the relationship between financial strain and contraceptive use, focusing on the differential effects by age group. Methods: Multinomial logistic regression analyses assessed the relationship between financial strain and contraceptive use in a national sample of U.S. women ages 18-39 years (N = 932). Models were adjusted for income, employment status, and other sociodemographic characteristics and tested the interaction of financial strain and age group. Results: Women with high financial strain were less likely to use short-acting methods (compared with using no method) in the adjusted model; when the age and financial strain interaction was included, associations held only for women ages 18-24 and 25-29 years of age. Relative to contraceptive nonuse, women ages 18-24 years with high financial strain were less likely to use long-acting reversible (relative risk ratio [RRR], 0.10; 95% confidence interval [CI], 0.01-0.99) and short-acting hormonal (RRR, 0.03; 95% CI, 0.00-0.18) methods. Women ages 25-29 with high financial strain were less likely to use short-acting hormonal (RRR, 0.20; 95% CI, 0.05-0.87) and coital-specific (RRR, 0.11; 95% CI, 0.02-0.51) methods. Implications for Practice and/or Policy: Young women may be vulnerable to the effect of high financial strain on contraceptive nonuse. Providers working with this group should consider incorporating financial strain into screening tools to identify patients who may need extra attention in contraceptive decision-making conversations. Antipoverty programs could also have a positive effect on effective contraceptive use. (C) 2019 Jacobs Institute of Women's Health. Published by Elsevier Inc.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6dcbc334d461584280c05c8d50f8f138",
  "timestamp": "2025-05-15T02:36:38.433978"
}