{
  "id": 3435,
  "title": "Independent contributions of family and neighbourhood indicators of socioeconomic status and migrant status to risk of mental health problems in 4-12 year old children",
  "abstract": "Rationale: A range of family and neighbourhood indicators of socioeconomic status and migrant status have been shown to be associated with risk of mental health problems (MHP) in children. In this study we determined the independent contributions of these indicators. Objectives: The main objective is to examine independent associations of family and neighbourhood socioeconomic status indicators and migrant status with risk of MHP in children. Methods: We analyzed data from an anonymous public health survey among 5010 parents/caretakers of children aged 4-12 years living in Rotterdam, The Netherlands, gathered in 2018. Outcome of interest was risk of MHP measured using the total difficulties score of the Strengths and Difficulties Questionnaire. Associations of parent-reported perceived financial difficulties, material deprivation (not being able to provide certain goods, or leisure, educational or cultural activities or care use for children due to financial restrictions), parental educational level, child's migrant status and neighbourhood socioeconomic status with risk of MHP and with the total difficulties score were assessed using multilevel multivariable logistic and linear regression models. Results: In total, 473 (9.5%) children had a high risk of MHP. We observed independent associations of perceived financial difficulties, material deprivation and parental educational level with risk of MHP and with an increase in total difficulties score (P < 0.05). Migrant status and neighbourhood socioeconomic status were not independently associated with risk of MHP or a change in total difficulties score. Conclusions: Already in early life, perceived financial difficulties by parents, material deprivation reported by parents and lower parental education appeared to be independently associated with the risk of MHP in 4-12 year olds. Health professionals should be aware of the relatively higher risks in these subgroups and consider policies address this.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6de51e18a93f393d90eeb7f662fa1b2f",
  "timestamp": "2025-05-15T02:26:09.161969"
}