{
  "id": 5635,
  "title": "Association of COVID-19 preventive behavior and job-related stress with the sleep quality of healthcare workers one year into the COVID-19 outbreak: a Japanese cross-sectional survey",
  "abstract": "Background This study aimed to evaluate the association of COVID-19 preventive behavior and job-related stress with sleep quality among healthcare workers (HCWs). We conducted a cross-sectional survey using a questionnaire at the National Center of Neurology and Psychiatry, Tokyo, Japan. Methods A total of 586 participants who completed the questionnaire were eligible for the study. The Pittsburgh Sleep Quality Index was used to evaluate sleep quality. We examined the level of engagement between poor sleep and COVID-19-related infection preventive behaviors, such as avoiding closed spaces, crowded places, and close contact (three Cs), a distance of at least one meter from others, wearing a face mask regularly, washing hands regularly, and working remotely, as well as job-related stress in the work environment, exposure to patients, potential risk of infection, fear of infecting others, need for social confinement, and financial instability. We conducted a hierarchical logistic regression analysis to examine the relationship between poor sleep and COVID-19 preventive behavior, job-related stress, and other covariates, including age, sex, and the Kessler Psychological Distress Scale (K6), which was used to measure non-specific psychological distress. Results Poor sleep was observed in 223 (38.1%) participants. Adherence to COVID-19 preventive measures was relatively high: 84.1% of participants answered always for wearing a face mask regularly and 83.4% for washing hands regularly. In the multivariate logistic regression analysis, stress in the work environment (odds ratio [OR] = 2.09, 95% confidence interval [CI], 1.37-3.20; p < 0.001), financial instability (OR = 1.73, 95% CI, 1.12-2.67; p < 0.05), and low adherence to working remotely (OR = 1.65, 95% CI, 1.06-2.57; p < 0.05) were independently and significantly associated with poor sleep after controlling for the covariates. Conclusions One year into the COVID-19 pandemic, the poor sleep rates of HCWs remained high. These results emphasize the need to protect HCWs from work environment stress and financial concerns.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6de820aafb36d8e587515e26160db660",
  "timestamp": "2025-05-15T02:49:50.307105"
}