{
  "id": 3629,
  "title": "Analysis of Selected Basel III and IFRS Requirements in the Area of Provisioning",
  "abstract": "The financial crisis causes the increasing of risk impact on financial instruments and this influences directly the most important bank indicators - namely capital adequacy and liquidity. Prudent business practices requirements on banks keep increasing trend based on solving financial crisis in banking industry. The IFRS Advisor), Council based in London prepares overall requirements for area of valuation of financial instruments, their classification into portfolios, for assessing risks, what affects the need for provisioning and has a direct impact on profit. These requirements are updated according to the state and the progress of the financial crisis. The Basel Committee on Banking Supervision similarly to the IFRS Advisory Council develops overall requirements for risks assessment and determines the structure of items included in calculation of capital adequacy in relation to the state and the progress of the financial crisis. The paper is focused on evaluation of relationships between individual requirements during financial crisis. The paper evaluates the selected relationships among these requirements, which are identical in several procedures, but some of these requirements are not mutually consistent mainly in assessment and evaluation of risks in relation to provisioning. It points to the need for recognition of provisions for LIS/IFRS and for capital adequacy purposes and recommends options for unification of these requirements. Various methods of analysis, synthesis and comparison have been used in the paper.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6dedefe2a0fba210c4752d04f019aa65",
  "timestamp": "2025-05-15T02:28:29.307139"
}