{
  "id": 4021,
  "title": "Financial Risk Control and Audit of Supply Chain under the Information Technology Environment",
  "abstract": "With the continuous improvement of society's recognition of supply chain finance and the development of domestic enterprises, the scale of Chinese supply chain financial service market has become larger and larger, and the status of supply chain financial services has gradually become clear. This emerging financing method can solve the problem of financing difficulties for small- and medium-sized enterprises. Many commercial banks are involved, but there are also many risks. As a representative of industrial integration, how commercial banks manage risks and improve the financial service supply chain is the focus of the article's research. The article designs a set of risk management system based on machine learning and trains similar models to verify consumers by learning user behavior patterns. The system realizes the server-side authentication module and the intelligent terminal protection module and achieves the purpose of real-time protection of the intelligent terminal system. The system will adapt to mainstream Android and IOS on the market, including portable terminal devices and smart wearable devices. If it is found that the device has not been operated by the user, the user will be provided with corresponding feedback results, and a series of automatic protection operations such as device lock and system alarm will be provided. At the same time, we provide two modes of online detection and offline detection. The device only needs to have our cloud user model to authenticate users in an offline environment to ensure that systems in different environments can run. The article solves the imbalance between user data and negative samples and most unlabeled user data and designs a set of management learning methods to ensure user certainty. By cooperating with enterprises, we can learn and analyze this set of data in our system. The results show that the accuracy rates of effective operation and user static data are 93.77% and 95.57%, respectively.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e02a493a81ca063a149c806e853369c",
  "timestamp": "2025-05-15T02:32:27.444857"
}