{
  "id": 8219,
  "title": "Effect of an Evidence-based Inpatient Tobacco Dependence Treatment Service on 30-, 90-, and 180-Day Hospital Readmission Rates",
  "abstract": "Introduction: Smoking is a risk factor for hospitalization and interferes with patient care due to its effects on pulmonary function, wound healing, and interference with treatments and medications. Although benefits of stopping smoking are well-established, few hospitals provide tobacco dependence treatment services (TDTS) due to cost, lack of mandatory tobacco cessation standards and lack of evidence demonstrating clinical and financial benefits to hospitals and insurers for providing services. Methods: This study explored the effect of an inpatient TDTS on 30-, 90-, and 180-day hospital readmissions. To carry out this work, 3 secondary datasets were linked, which included clinical electronic health record data, tobacco cessation program data, and statewide health care utilization data. Odds ratios (ORs) were calculated using inverse propensity score-weighted logistic regression models, with program exposure as the primary independent variable and 30 (90 and 180)-day readmission rates as the dependent variable, and adjustment for putative covariates. Results: Odds of readmission were compared for patients who did and did not receive TDTS. At 30 days postdischarge, smokers exposed to the TDTS had a lower odds of readmission (OR=0.77, P=0.031). At 90 and 180 days, odds of readmission remained lower in the TDTS group (ORs = 0.87 and 0.86, respectively), but were not statistically significant. Discussion: Findings from the current study, which are supported by prior studies, provide evidence that delivery of TDTS is a strategy that may help to reduce hospital readmissions.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e03404c77d5ff261d4ee75273df9ed2",
  "timestamp": "2025-05-15T03:16:48.851864"
}