{
  "id": 7659,
  "title": "Heterogeneous impacts of oil prices on China's stock market: Based on a new decomposition method",
  "abstract": "Along with the growing dependence on oil-imports, China's stock market is susceptible to large oil price fluc-tuations. We revisit this issue by focusing on the heterogeneous effects of different oil price fluctuations in the post-crisis period. Both shocks and volatility in oil prices are divided into expected and unexpected parts. Because stock markets may also be affected by other factors, we apply the generalized additive outlier (GAO) method to solve the problem of missing variables and reduce the possibility of spurious regression. We have reached three new insights. First, expected oil price shocks have negative, while the unexpected shocks have positive effect on China's stock returns. Second, expected oil price volatility boosts the stock returns, whereas unexpected oil price volatility can depress the stock returns and amplify the stock volatility simultaneously. Third, last unexpected oil price volatility is positively associated with the stock returns while negatively associated with the stock volatility. This means there may be a rally in the stock market after the impacts of sudden oil price volatility hikes. These findings imply that financial skill training and an efficient risk-alert mechanism may both be helpful to balance the effects of unexpected oil price shocks and unexpected oil price volatility on China's stock market.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e045f37fdbafd3654392128a586c504",
  "timestamp": "2025-05-15T03:10:33.140950"
}