{
  "id": 4782,
  "title": "A dimension reduction assisted credit scoring method for big data with categorical features",
  "abstract": "In the past decade, financial institutions have invested significant efforts in the development of accurate analytical credit scoring models. The evidence suggests that even small improvements in the accuracy of existing credit-scoring models may optimize profits while effectively managing risk exposure. Despite continuing efforts, the majority of existing credit scoring models still include some judgment-based assumptions that are sometimes supported by the significant findings of previous studies but are not validated using the institution's internal data. We argue that current studies related to the development of credit scoring models have largely ignored recent developments in statistical methods for sufficient dimension reduction. To contribute to the field of financial innovation, this study proposes a Dimension Reduction Assisted Credit Scoring (DRA-CS) method via distance covariance-based sufficient dimension reduction (DCOV-SDR) in Majorization-Minimization (MM) algorithm. First, in the presence of a large number of variables, the DRA-CS method results in greater dimension reduction and better prediction accuracy than the other methods used for dimension reduction. Second, when the DRA-CS method is employed with logistic regression, it outperforms existing methods based on different variable selection techniques. This study argues that the DRA-CS method should be used by financial institutions as a financial innovation tool to analyze high-dimensional customer datasets and improve the accuracy of existing credit scoring methods.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e1a3b9fb259c3f8231eb986ff8ce4c5",
  "timestamp": "2025-05-15T02:41:00.836041"
}