{
  "id": 7888,
  "title": "Long-Term Effect of Hospital Pay for Performance on Mortality in England",
  "abstract": "BACKGROUND A pay-for-performance program based on the Hospital Quality Incentive Demonstration was introduced in all hospitals in the northwest region of England in 2008 and was associated with a short-term (18-month) reduction in mortality. We analyzed the long-term effects of this program, called Advancing Quality. METHODS We analyzed 30-day in-hospital mortality among 1,825,518 hospital admissions for eight conditions, three of which were covered by the financial-incentive program. The hospitals studied included the 24 hospitals in the northwest region that were participating in the program and 137 elsewhere in England that were not participating. We used difference-in-differences regression analysis to compare risk-adjusted mortality for an 18-month period before the program was introduced with subsequent mortality in the short term (the first 18 months of the program) and the longer term (the next 24 months). RESULTS Throughout the short-term and the long-term periods, the performance of hospitals in the incentive program continued to improve and mortality for the three conditions covered by the program continued to fall. However, the reduction in mortality among patients with these conditions was greater in the control hospitals (those not participating in the program) than in the hospitals that were participating in the program (by 0.7 percentage points; 95% confidence interval [CI], 0.3 to 1.2). By the end of the 42-month follow-up period, the reduced mortality in the participating hospitals was no longer significant (-0.1 percentage points; 95% CI, -0.6 to 0.3). From the short term to the longer term, the mortality for conditions not covered by the program fell more in the participating hospitals than in the control hospitals (by 1.2 percentage points; 95% CI, 0.4 to 2.0), raising the possibility of a positive spillover effect on care for conditions not covered by the program. CONCLUSIONS Short-term relative reductions in mortality for conditions linked to financial incentives in hospitals participating in a pay-for-performance program in England were not maintained.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e27147f850b8c8b735000485a9e8f25",
  "timestamp": "2025-05-15T03:13:04.924487"
}