{
  "id": 664,
  "title": "Kelly-Based Options Trading Strategies on Settlement Date via Supervised Learning Algorithms",
  "abstract": "Option is a well-known financial derivative that attracts attention from investors and scholars, due to its flexible investment strategies. In this paper, we sought to establish an option trading system on settlement dates with money management and machine learning to improve the performance and to control risk. First, we fixed the odds of the option, and applied a machine learning algorithm to predict the win rate. Then, we adopted the money management module of Kelly criterion to obtain the optimal bidding fraction. In addition, we adopted ensemble learning algorithm to enhance the predicting power. The result of the experiments shows that the random forest and SVM have more powerful prediction capabilities in our experiments. Even if the prediction is barely acceptable, the systems still obtain profits and steadily rising equity curves through money management, which significantly reduce drawdown risk. In addition, the ensemble system achieves the outstanding trading performance with a profit factor of 2.429 and a Sharpe ratio of 1.227. Overall, the proposed option trading strategy can generate positive profit, and the money management module can well control the risk, and the ensemble learning module can significantly enhance the trading performance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e393b34729460c817b32592fa3cd826",
  "timestamp": "2025-05-15T01:53:59.285300"
}