{
  "id": 7072,
  "title": "Supporting smallholder acacia farmers in Viet Nam to transition to sawlog production: Opportunities and challenges",
  "abstract": "Acacia plantations are a significant forestry resource in Viet Nam, with the majority of the area under smallholder ownership, typically with 1-5 ha per household. Currently most acacias are grown in short rotations and sold for export as woodchips. Short rotation plantations suit smallholder farmers as they can receive a return relatively quickly (within 4-5 years). However the country has a high reliance on imports of sawlogs, some of which could be substituted by growing acacias to sawlog size on longer (5-10 year) rotations. Thus the Vietnamese government has developed a strategy to encourage smallholder acacia farmers to convert to sawlog production from their acacia estate. Sawlog production could potentially give greater returns to growers but also requires enhanced silvicultural management, greater tolerance of risk and longer times for return on investment. We explored smallholder farmers' preferences for support programs if they are to adopt longer rotation plantations in two contrasting provinces: Thua Thien Hue in Central Viet Nam and Hoa Binh in North Viet Nam. We found that farmers are happy to embrace longer rotations if they could source finance, are able to handle larger sized logs and if they could see others also growing longer rotations. We also explored the effects of contrasting training styles on adoption of best management practices (BMPs) - either standard top-down extension training, or a more collaborative active-learning extension training approach. We found that a collaborative, activelearning approach led to greater adoption of BMPs, but also that the traditional approach to extension was almost as effective. There is significant demand amongst the growers to improve their silvicultural management, and they are very responsive to training and knowledge circulation amongst the community. Factors influencing farmers' adoption of acacia BMPs were also identified and they included intrinsic factors (such as farmers' goals and inspirations), extrinsic factors (such as farm location and satisfaction with acacias) as well as extension. Extrinsic factors (21.5%), intrinsic factors (7.0%) and extension (5.5%) explained a total of 34% of the variation in adoption behaviour at 9 months following training. Farmers in the study demonstrated that they had the capacity, ability and willingness to uptake BMPs but to encourage greater adoption, extension training should be complemented with other support incentives such as seedlings or fertiliser subsidies to bridge the financial gap that some poorer farmers face. Extending acacia rotations to 7 years carries additional risks to farmers and many farmers would require financial assistance to facilitate acceptance of these risks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e3b4a42b04ccfb9f4ae92ce22643299",
  "timestamp": "2025-05-15T03:05:03.375098"
}