{
  "id": 8054,
  "title": "Ocular Adverse Events Following Coronavirus Disease 2019 Infection: A Self-controlled Case Series Study from the Entire Korean Population",
  "abstract": "Purpose: This study aimed to assess the risk of ocular adverse events, including retinal artery occlusion (RAO), retinal vein occlusion (RVO), noninfectious uveitis (NIU), noninfectious scleritis (NIS), optic neuritis (ON), ischemic optic neuropathy (ION), and ocular motor cranial nerve palsy (OMCNP), after coronavirus disease 2019 (COVID-19) infection. Design: Population-based self-controlled case series (SCCS). Participants: The study included patients from the entire Korean population of 52 million who experienced incident RAO, RVO, anterior NIU, nonanterior NIU, NIS, ON, ION, or OMCNP between January 1, 2021, and October 29, 2022. Methods: This nationwide SCCS utilized data from the Korea National Health Insurance Service and the Korea Disease Control and Prevention Agency. The risk period after infection was defined as up to 24 weeks after COVID19 infection. Conditional Poisson regression was used to calculate the relative incidence rate ratios (IRRs) for RAO, RVO, anterior NIU, nonanterior NIU, NIS, ON, ION, and OMCNP during the designated risk periods. Main Outcome Measures: The IRRs for RAO, RVO, anterior NIU, nonanterior NIU, NIS, ON, ION, and OMCNP during the risk periods. Results: The study included 9336, 103 362, 201 010, 25 428, 23 744, 3026, 69 933, and 16 335 cases of incident RAO, RVO, anterior NIU, nonanterior NIU, NIS, ON, ION, and OMCNP, respectively. The IRRs (95% confidence interval) during the early risk period (1-8 weeks) were 0.94 (0.83-1.07), 1.01 (0.97-1.04), 1.00 (0.98-1.03), 0.96 (0.90-1.03), 1.00 (0.94-1.07), 0.97 (0.81-1.17), 0.97 (0.93-1.01), and 1.02 (0.94-1.11), respectively. In the late risk period (9-24 weeks), the IRRs were 1.02 (0.92-1.12), 1.01 (0.98-1.04), 1.01 (0.99-1.03), 1.02 (0.97-1.08), 1.02 (0.97-1.08), 0.99 (0.85-1.15), 1.02 (0.99-1.06), and 0.97 (0.90-1.03), respectively. Stratified analyses showed that in patients with a history of cerebro-cardiovascular disease, the risk of RAO increased during the late risk period, with an IRR (95% confidence interval) of 1.19 (1.02-1.40). Conclusions: The risk of incident RVO, anterior NIU, nonanterior NIU, NIS, ON, ION, or OMCNP did not increase after COVID-19 infection. The risk of incident RAO increased only in individuals with preexisting cardiocerebrovascular disease. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2025;5:100638 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e481a623641dcdbfed222d1da928ea2",
  "timestamp": "2025-05-15T03:14:37.405902"
}