{
  "id": 5301,
  "title": "Do corporate environmental protection efforts reduce firm-level operating risk? Evidence from a developing country",
  "abstract": "This study investigates the impact of corporate environmental protection efforts on firm-level operating risk. The importance of environmental protection has gained attention in recent years, as proliferation in ESG rating agencies has significantly increased. As suggested by stakeholder theory, the corporations for their survival are required to take care of the environment in which they operate. We used a sample of 245 non-financial publicly listed firms of developing economy, Pakistan, from 2007 to 2019, to examine whether firms that engage in environmental protection activities have lower operating risk than firms that do not. We identified four important dimensions based on previous literature, to develop a unique index for measuring the firms' environmental performance. These dimensions included voluntary standardization, product environmental compliance, process environmental compliance, and environmental social drives. Focused on downside operating risk in terms of firm operating income, we used binary codes to distinguish firms that are negatively deviating from their industrial average. Using logistic regression on our hand-collected environmental performance index data, this study finds that firms maintaining effective environmental protection activities are less likely to experience operational failure compared to peers who do not. This relationship holds true even after controlling for various firm-specific factors such as firm size, leverage, growth opportunity, and profitability. Our findings have implications for policymakers and corporate managers who seek to improve their firms' environmental and financial performance simultaneously. By highlighting the potential benefits of corporate environmental protection efforts, our study provides valuable insights for firms operating in emerging economies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e50a08e25c76b4a6d7a5bf712bca38f",
  "timestamp": "2025-05-15T02:46:16.274150"
}