{
  "id": 1017,
  "title": "Topological applications of multilayer perceptrons and support vector machines in financial decision support systems",
  "abstract": "The heart of this study is particularly on risk assessment of financial decision support systems (FDSSs), to advance the model performance and improve classification accuracy. To conquer the downsides of the classical models, statistical intelligence (SI) technologies, for example, multilayer perceptrons (MLPs) and support vector machines (SVMs), have been deliberated in FDSS applications. Recently, the prestigiousness of SI approaches has been confronted by the latest prediction learners. Therefore, to ensure the competitive performance of SI mechanisms, the current investigation scrutinizes the topological applications of MLPs and SVMs over eight different databases with equivalent combinations in credit scoring and bankruptcy predictions example sets. The experimental results reveal that MLP5-5 and MLP4-4, that is, the sigmoid activation function with five and four hidden layers, are the feasible topologies for the MLP algorithm, and on all databases in all performance criterions, SVM trained with the linear kernel function (SVM-1) achieves better prediction results. From the Baseline family, random forest learner brings significant improvements in financial decisions. Lastly, FDSSs are found to be correlated with the nature of databases and the performance criterions of the trained algorithms. The results of this study, however, have practical and managerial implications to make a range of financial and nonfinancial strategies. With these contributions, therefore, our study not only supplements earlier evidence but also enhances the predictive performance of SI algorithms for financial decision support applications.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e521d48cbb6db2c49149e5e6beed76a",
  "timestamp": "2025-05-15T01:58:08.439216"
}