{
  "id": 3406,
  "title": "Examining Systemic Risk using Google PageRank Algorithm: An Application to Indian Non-Bank Financial Companies (NBFCs) Crisis",
  "abstract": "In the recent financial crises, attention has shifted towards too-central-to-fail to recognize the sources of systemic risk. The NBFC Crisis of 2018-19 adversely affected other financial institutions and the real economy of India. The NBFCs crisis highlighted the role of smaller institutions in perpetuating and amplifying the crisis. Thus, the present study models the interconnection of NBFCs with the rest of financial institutions using a complex Granger-causality network based on returns data. The PageRank algorithm identifies the central and important nodes and ranks financial institutions in pre-crisis and crisis periods. The financial institutions are also ranked based on the maximum percentage loss suffered during the crises. Using non-parametric rank-based regression, the PageRank ranking of financial institutions in the pre-crises period (explanatory variable) is regressed with the ranking of financial institutions based on maximum percentage loss suffered by them during the crises period (dependent variable) along with Leverage and Size as control variables. We found that PageRank from pre-crisis can significantly identify most financial institutions that suffered loss during NBFCs crises even in the presence of control variables.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e537ce5e09d09a8dfd38913f663ef3c",
  "timestamp": "2025-05-15T02:25:40.234790"
}