{
  "id": 9032,
  "title": "Course and predictors of posttraumatic stress-related symptoms among family members of deceased ICU patients during the first year of bereavement",
  "abstract": "Background/ObjectiveDeath in intensive care units (ICUs) may increase bereaved family members' risk for posttraumatic stress disorder (PTSD). However, posttraumatic stress-related symptoms (hereafter as PTSD symptoms) and their precipitating factors were seldom examined among bereaved family members and primarily focused on associations between PTSD symptoms and patient/family characteristics. We aimed to investigate the course and predictors of clinically significant PTSD symptoms among family members of deceased ICU patients by focusing on modifiable quality indicators for end-of-life ICU care.MethodIn this longitudinal observational study, 319 family members of deceased ICU patients were consecutively recruited from medical ICUs from two Taiwanese medical centers. PTSD symptoms were assessed at 1, 3, 6, and 13 months post-loss using the Impact of Event Scale-Revised (IES-R). Family satisfaction with end-of-life care in ICUs was assessed at 1 month post-loss. End-of-life care received in ICUs was documented over the patient's ICU stay. Predictors for developing clinically significant PTSD symptoms (IES-R score >= 33) were identified by multivariate logistic regression with generalized estimating equation modeling.ResultsThe prevalence of clinically significant PTSD symptoms decreased significantly over time (from 11.0% at 1 month to 1.6% at 13 months post-loss). Longer ICU stays (adjusted odds ratio [95% confidence interval]=1.036 [1.006, 1.066]), financial insufficiency (3.166 [1.159, 8.647]), and reported use of pain medications (3.408 [1.230, 9.441]) by family members were associated with a higher likelihood of clinically significant PTSD symptoms among family members during bereavement. Stronger perceived social support (0.937 [0.911, 0.965]) and having a Do-Not-Resuscitate (DNR) order issued before the patient's death (0.073 [0.011, 0.490]) were associated with a lower likelihood of clinically significant PTSD symptoms. No significant association was observed for family members' satisfaction with end-of-life care (0.988 [0.944, 1.034]) or decision-making in ICUs (0.980 [0.944, 1.018]).ConclusionsThe likelihood of clinically significant PTSD symptoms among family members decreased significantly over the first bereavement year and was lower when a DNR order was issued before death. Enhancing social support and facilitating a DNR order may reduce the trauma of ICU death of a beloved for family members at risk for developing clinically significant PTSD symptoms.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e5c6791cc276e76265d45eb0e4b073a",
  "timestamp": "2025-05-15T03:24:54.893566"
}