{
  "id": 6083,
  "title": "Impact of CEO Characteristics on Capital Structure: Evidence from a Frontier Market",
  "abstract": "Manuscript type Research paper Research aims: This study examines the impact of CEO characteristics on the capital structure of non-financial listed companies in Sri Lanka Design/methodology/approach: This study employs multiple regression selecting a sample based on a data set from a panel of 123 mainboard listed companies which covers all the non-financial sectors of the Colombo Stock Exchange for an eight-year period from 2012 to 2019. Research findings: This study finds a significant positive relationship between male CEOs and capital structure. It suggests that male CEOs tend to employ more debt within the capital structure due to their aggressive nature and overconfidence. Similarly, this study finds a significant positive relationship between CEO's age and capital structure. The evidence provides that as they age, CEOs tend to have more experience, better risk management capabilities, and enhanced business sense to take proper financing decisions at the right time with more debt financing. Theoretical contribution/originality: Since there is no research conducted on CEO characteristics and capital structure in the Sri Lankan context, this study has made a significant contribution to the local literature and mitigates the gap in the frontier market literature. Practitioner/policy implications: The findings are helpful for the organisations when appointing key decision-makers to run the organisation and make strategic choices based on formulating corporate policies among debt and equity. Research limitation: The study has been limited to six CEO characteristics; there are other factors such as risk appetite levels that may have implications and the study has not focused on any impact towards real financing decisions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e64e1e31c16cb17f93c8625775990e8",
  "timestamp": "2025-05-15T02:54:38.795346"
}