{
  "id": 8842,
  "title": "Impact of corporate social responsibility on cost of debt in Scandinavian public companies",
  "abstract": "Research background: In recent decades, companies have paid increasing attention to corpo-rate social responsibility (CSR) , its related performance. Scandinavian countries lead the world in CSR and sustainability. The good CSR performance of Scandinavian companies has motivated studies on this phenomenon, particularly on the connection between a company's CSR and its performance. One of the most important performance indicators and value driv-ers is the cost of debt.Purpose of the article: This study assessed the impact of CSR on the cost of debt in Scandina-vian public companies.Methods: The research was divided into two stages. In the first stage, Scandinavian public companies were divided into two groups (with and without ESG (environmental, social, governance) disclosure scores) to reveal differences in the cost of debt. In the second stage, a fixed-effects regression model for balanced panel data sets was applied from 2011 to 2020 to assess the impact of ESG and its pillars on the cost of debt.Findings & value added: The results revealed that the cost of debt of companies in Scandina-vian countries with ESG disclosure scores was significantly lower. The ESG disclosure scores of these companies have increased significantly over the past 10 years. We found a positive impact of CSR on the cost of debt in Scandinavian public companies. The increase in ESG disclosure and pillar scores reduced the cost of debt. These findings are valuable from a scien-tific perspective. Scandinavian public companies with ESG scores have higher financial risk, but lower cost of debt. These results support the importance of investors' behavior, infor-mation asymmetry, and signaling. The findings have several implications for shareholders, managers and creditors. They suggest that creditors consider ESG disclosures when determin-ing a borrower's creditworthiness. Additionally, it is a message to regulators that the debt market values ESG disclosures.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e666ce05e3a93a35dea6270e20d3a0f",
  "timestamp": "2025-05-15T03:22:57.919508"
}