{
  "id": 8815,
  "title": "Factors associated with bereaved family surrogates' satisfaction with end-of-life care in intensive care units",
  "abstract": "Objectives: Family satisfaction with end-of-life care in the intensive care unit constitutes an important outcome for evaluating end-of-life care quality. Research on this topic focuses on linking end-of-life care processes to family-surrogate satisfaction with the patient's end-of-life care but has seldom examined patient- and family-surrogate-based factors. We aimed to comprehensively and simultaneously examine factors facilitating or deterring family satisfaction with end-of-life care in the intensive care unit from patient- and family-surrogate perspectives. Methods: For this secondary-analysis study, 278 Taiwanese family surrogates were surveyed one-month post-patient death using the Family Satisfaction in the Intensive Care Unit questionnaire (FS-ICU), which measures care and decision-making. Associations between family satisfaction with end-of-life care and patient and family characteristics, patient disease severity, and length of intensive care stay were examined by multivariate, multilevel linear regression models. Results: Female family surrogates were more satisfied with patients' end-of-life care than male family surrogates when patients had a higher APACHE II but a lower SOFA score. Adult-child surrogates had lower FS-ICU Care scores than other family surrogates. Higher satisfaction with ICU decision-making was associated with patients' higher APACHE II but lower SOFA scores, longer stay and family socio-demographics, including being unmarried, educational attainment above junior high school and reported financial sufficiency to make ends meet. Conclusion: Patient disease severity and family-surrogate characteristics are significantly associated with surrogates' satisfaction with patients' end-of-life care in the intensive care unit. Specific interventions should be tailored to the needs of high-risk family surrogates to increase their satisfaction with this care.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e6bbfcda121cb7154fc167db40d8f68",
  "timestamp": "2025-05-15T03:22:57.847193"
}