{
  "id": 4423,
  "title": "Financial Distress Prediction in an International Context: A Review and Empirical Analysis of Altman's Z-Score Model",
  "abstract": "This paper assesses the classification performance of the Z-Score model in predicting bankruptcy and other types of firm distress, with the goal of examining the model's usefulness for all parties, especially banks that operate internationally and need to assess the failure risk of firms. We analyze the performance of the Z-Score model for firms from 31 European and three non-European countries using different modifications of the original model. This study is the first to offer such a comprehensive international analysis. Except for the United States and China, the firms in the sample are primarily private, and include non-financial companies across all industrial sectors. We use the original Z-Score model developed by Altman, Corporate Financial Distress: A Complete Guide to Predicting, Avoiding, and Dealing with Bankruptcy (1983) for private and public manufacturing and non-manufacturing firms. While there is some evidence that Z-Score models of bankruptcy prediction have been outperformed by competing market-based or hazard models, in other studies, Z-Score models perform very well. Without a comprehensive international comparison, however, the results of competing models are difficult to generalize. This study offers evidence that the general Z-Score model works reasonably well for most countries (the prediction accuracy is approximately 0.75) and classification accuracy can be improved further (above 0.90) by using country-specific estimation that incorporates additional variables.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e76fda4db7ffebc12d89006fe795146",
  "timestamp": "2025-05-15T02:37:16.768213"
}