{
  "id": 7768,
  "title": "Differences in HIV disease progression by injecting drug use in HIV-infected persons in care",
  "abstract": "Background: In the United States and many Western countries, injecting drug use continues to be an important cause of HIV infection. This has important clinical and public health implications if injecting drug users (IDUs) have greater barriers to antiretroviral effectiveness than other risk groups. We assessed if there were differences between HIV-infected IDUs and non-IDU patients in the development of AIDS-defining illnesses (ADIs) from the time the patients started their first combination antiretroviral therapy (CART) regimen. Methods: We compared clinical outcomes for IDU patients (n 827) with those for non-TDU patients (n = 1314) after they started CART. We controlled for financial access, because all patients had access to CART through insurance or a drug assistance program. The incidence (number of ADI cases per 100 person-years) was compared for IDUs and non-IDUs from 1995 through 2002. Incidence ratios were calculated for IDUs compared with non-IDUs. Risk factors for development of ADIs were assessed using negative binomial regression. Results: From 1995-1996 to 2001-2002, there was a decline in ADI incidence among IDUs from 31.9 to 16.2 cases per 100 person-years of follow-up. Over the same time, there was a decline in ADI incidence among non-IDUs from 37.0 to 9.7 cases per 100 person-years. The incidence ratio (incidence among IDUs compared with that among non-IDUs) increased from 0.87 (95% confidence interval [CI], 0.65-1.15) to 1.67 (95% CI, 1.25-2.18) from 1995-1996 to 2001-2002. By negative binomial regression, the incidence ratio for ADIs among IDUs versus non-IDUs increased to 1.45 (95% CI, 1.2-1.75), after 1998, adjusting for differences in demographic, clinical, and treatment factors. Conclusions: The relative incidence of ADIs among IDUs with access to treatment increased similar to50% compared with non-IDUs since 1999. This suggests greater barriers to the effective use of CART for IDUs, resulting in a higher individual and public health burden of clinical HIV disease. It will be important to understand reasons for this growing difference and to implement appropriate interventions to improve the effective use of CART for IDUs.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e7fada4b9b680b30a1494e7fb4dab47",
  "timestamp": "2025-05-15T03:12:11.484306"
}