{
  "id": 3153,
  "title": "Examining the role of financial factors, resources and skills in predicting food security status among college students",
  "abstract": "The prevalence of food insecurity among college students has received little attention in academic literature, despite previous studies suggesting increased risk and potentially high rates of food insecurity among students. Additionally, the combined effects of financial and food management skills and resources have not been considered when examining student food security. A sample of 557 undergraduate students at a large, public university in the southeastern United States was surveyed to assess food security and its risk factors. Data were analysed based on sociodemographic characteristics, food security status, select financial factors, cooking self-efficacy and food management resources and skills. Prevalence of food insecurity among this sample of students was approximately 14%, comparable to national estimates. Results from probit regression analyses suggested that food security status was significantly associated with food resource adequacy. The model also highlighted the importance of several financial factors, including financial independence, familial financial support, receipt of financial or food assistance, budgeting behaviours, credit card ownership and exogenous shock. These data provide insights into the nature of food insecurity on a large college campus and fill a significant gap in the current literature by addressing relevant financial factors. The data are particularly salient due to two factors facing students at the sampled university during the period of study: (1) uncertain economic climate at the national and local level; and (2) the local area was recently affected by a significant natural disaster. Such data are useful to student affairs personnel who may wish to provide resources to assist students who are at risk for food insecurity.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e8675d9969e0370bd22a16321d879c8",
  "timestamp": "2025-05-15T02:22:56.814554"
}