{
  "id": 5898,
  "title": "The Economic and Financial Health of Lithuanian Logistics Companies",
  "abstract": "In recent decades, the importance of transport and logistics companies has increased considerably, especially for Lithuania, where this sector is on the rise and creating benefits for various users. Therefore, this study aims to analyse the economic-financial situation of transport and logistics companies operating in Lithuania, focusing mainly on their financial risk, probability of bankruptcy, and level of solvency. To achieve these results, 416 companies were analysed based on their data from 2022. The employed methodology included descriptive analysis, quartile ratio analysis, the use of Altman's Z-score model to predict bankruptcy, and, finally, logistic regression analysis to answer the hypotheses. The results show that the companies analysed in this study were highly profitable, with a high level of solvency and liquidity that did not compromise their continuity in the market. These results were confirmed by the Z-score analysis. In addition, it was observed that the age and size of the companies did not affect their survival on the market. This study presents results that are of great interest for the academic literature, as well as for the management of logistics companies. The originality of the study lies in its relevance and timeliness, presenting robust results for different stakeholders, such as policymakers or new entrepreneurs, among others.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6e9f278a036aa4cc50c1c440e8584a15",
  "timestamp": "2025-05-15T02:52:31.492962"
}