{
  "id": 413,
  "title": "RETRACTED: Financial risk assessment to improve the accuracy of financial prediction in the internet financial industry using data analytics models (Retracted Article)",
  "abstract": "A sound credit assessment mechanism has been explored for many years and is the key to internet finance development, and scholars divide credit assessment mechanisms into linear assessment and nonlinear assessment. The purpose is to explore the role of two important data analytics models including machine learning and deep learning in internet credit risk assessment and improve the accuracy of financial prediction. First, the problems in the current internet financial risk assessment are understood, and data of MSE (Micro small Enterprises) are chosen for analysis. Then, a feature extraction method based on machine learning is proposed to solve data redundancy and interference in enterprise credit risk assessment. Finally, to solve the data imbalance problem in the credit risk assessment system, a credit risk assessment system based on the deep learning DL algorithm is introduced, and the proposed credit risk assessment system is verified through a fusion algorithm in different models with specific enterprise data. The results show that the credit risk assessment model based on the machine learning algorithm optimizes the standard algorithm through the global optimal solution. The credit risk assessment model based on deep learning can effectively solve imbalanced data. The algorithm generalization is improved through layer-by-layer learning. Comparison analysis shows that the accuracy of the proposed fusion algorithm is 25% higher than that of the latest CNN (Convolutional Neural Network) algorithm. The results can provide a new research idea for the assessment of internet financial risk, which has important reference value for preventing financial systemic risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6eaf0bc8e9b0c6fe2f2a0bdbd564b20f",
  "timestamp": "2025-05-15T01:50:52.590558"
}