{
  "id": 8490,
  "title": "The epidemiology and global burden of autism spectrum disorders",
  "abstract": "Background. Autism spectrum disorders (ASDs) are persistent disabling neurodevelopmental disorders clinically evident from early childhood. For the first time, the burden of ASDs has been estimated for the Global Burden of Disease Study 2010 (GBD 2010). The aims of this study were to develop global and regional prevalence models and estimate the global burden of disease of ASDs. Method. A systematic review was conducted for epidemiological data (prevalence, incidence, remission and mortality risk) of autistic disorder and other ASDs. Data were pooled using a Bayesian meta-regression approach while adjusting for between-study variance to derive prevalence models. Burden was calculated in terms of years lived with disability (YLDs) and disability-adjusted life-years (DALYs), which are reported here by world region for 1990 and 2010. Results. In 2010 there were an estimated 52 million cases of ASDs, equating to a prevalence of 7.6 per 1000 or one in 132 persons. After accounting for methodological variations, there was no clear evidence of a change in prevalence for autistic disorder or other ASDs between 1990 and 2010. Worldwide, there was little regional variation in the prevalence of ASDs. Globally, autistic disorders accounted for more than 58 DALYs per 100000 population and other ASDs accounted for 53 DALYs per 100000. Conclusions. ASDs account for substantial health loss across the lifespan. Understanding the burden of ASDs is essential for effective policy making. An accurate epidemiological description of ASDs is needed to inform public health policy and to plan for education, housing and financial support services.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6eb710a26030503571d2f0d7b0af6d77",
  "timestamp": "2025-05-15T03:19:21.338002"
}