{
  "id": 7578,
  "title": "Factors associated with hostility among people living with HIV/AIDS in Northeast China: a cross-sectional study",
  "abstract": "Background Hostility can result in negative outcomes in people living with HIV/AIDS (PLWHA); however, previous research on this topic is far from adequate. To contribute to existing knowledge on this aspect of PLWHA, the current study examined the prevalence of hostility and its potential influencing factors among PLWHA. Methods A cross-sectional questionnaire survey was undertaken on 218 HIV patients in Heilongjiang Province of China between March and August in 2013. A multiple logistic regression analysis was performed to identify factors associated with hostility. Results The prevalence of hostility was 17.0% among the participants. The three most alarming types of hostility included desiring to kill the person who infected them, blaming the infection on the society, and abandoning themselves to despair. A multiple logistic regression model identified that depression (OR = 3.845, 95% CI = 1.309-9.229), perceived stigma (OR = 3.281, 95% CI = 1.109-7.711), and fear of dying (OR = 2.710, 95% CI = 1.068-6.881) were the risk factors for hostility, while higher levels of trust-in-doctor (OR = 0.176, 95% CI = 0.060-0.517) and per capita household income (OR = 0.344, 95% CI = 0.119-0.991) were protective factors. Conclusions Our findings highlight the prominent influence of psychological, healthcare, and social factors on hostility among PLWHA. Interventions specifically targeted to reduce hostility should be provided, including incorporating psychological service into HIV management guidelines, enhancing PLWHA's trust-in-doctor, establishing comprehensive services for PLWHA, reducing the social stigma against PLWHA, and paying more attention to PLWHA with financial problems. These interventions may improve the management and control of HIV/AIDS.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6eb72a7e7c4e09dc3d88fd5031bc1179",
  "timestamp": "2025-05-15T03:10:05.534011"
}