{
  "id": 8732,
  "title": "Dietary metabolite profiling brings new insight into the relationship between nutrition and metabolic risk: An IMI DIRECT study",
  "abstract": "Background: Dietary advice remains the cornerstone of prevention and management of type 2 diabetes (T2D). However, understanding the efficacy of dietary interventions is confounded by the challenges inherent in assessing free living diet. Here we profiled dietary metabolites to investigate glycaemic deterioration and cardiometabolic risk in people at risk of or living with T2D. Methods: We analysed data from plasma collected at baseline and 18-month follow-up in individuals from the Innovative Medicines Initiative (IMI) Diabetes Research on Patient Stratification (DIRECT) cohort 1 n = 403 individuals with normal or impaired glucose regulation (prediabetic) and cohort 2 n = 458 individuals with new onset of T2D. A dietary metabolite profile model (T-pred) was constructed using multivariable regression of 113 plasma metabolites obtained from targeted metabolomics assays. The continuous T-pred score was used to explore the relationships between diet, glycaemic deterioration and cardio-metabolic risk via multiple linear regression models. Findings: A higher T-pred score was associated with healthier diets high in wholegrain (beta=3.36 g, 95% CI 0.31, 6.40 and beta=2.82 g, 95% CI 0.06, 5.57) and lower energy intake (beta=-75.53 kcal, 95% CI -144.71, -2.35 and beta=-122.51 kcal, 95% CI -186.56, -38.46), and saturated fat (beta=-0.92 g, 95% CI -1.56, -0.28 and beta=-0.98 g, 95% CI -1.53, -0.42 g), respectively for cohort 1 and 2. In both cohorts a higher T-pred score was also associated with lower total body adiposity and favourable lipid profiles HDL-cholesterol (beta=0.07 mmol/L, 95% CI 0.03, 0.1), (beta=0.08 mmol/L, 95% CI 0.04, 0.1), and triglycerides (beta=-0.1 mmol/L, 95% CI -0.2, -0.03), (beta=-0.2 mmol/L, 95% CI -0.3, -0.09), respectively for cohort 1 and 2. In cohort 2, the T-pred score was negatively associated with liver fat (beta=-0.74%, 95% CI -0.67, -0.81), and lower fasting concentrations of HbA1c (beta=-0.9 mmol/mol, 95% CI -1.5, -0.1), glucose (beta=-0.2 mmol/L, 95% CI -0.4, -0.05) and insulin (beta=-11.0 pmol/mol, 95% CI -19.5, -2.6). Longitudinal analysis showed at 18-month follow up a higher T-pred score was also associated lower total body adiposity in both cohorts and lower fasting glucose (beta=-0.2 mmol/L, 95% CI -0.3, -0.01) and insulin (beta=-9.2 pmol/mol, 95% CI -17.9, -0.4) concentrations in cohort 2. Interpretation: Plasma dietary metabolite profiling provides objective measures of diet intake, showing a relationship to glycaemic deterioration and cardiometabolic health. Funding: This work was supported by the Innovative Medicines Initiative Joint Undertaking under grant agreement no. 115,317 (DIRECT), resources of which are composed of financial contribution from the European Union's Seventh Framework Programme (FP7/2007-2013) and EFPIA companies. Crown Copyright (c) 2020 Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license. (http://creativecommons.org/licenses/by-nc-nd/4.0/)",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ed708d85e4cda0791d35ab2f6d63544",
  "timestamp": "2025-05-15T03:21:56.612007"
}