{
  "id": 6160,
  "title": "Forgone summertime comfort as a function of avoided electricity use",
  "abstract": "Broadly, energy poverty is defined as insufficient energy access. One often missed sign of energy poverty is an inability to maintain a safe and comfortable indoor temperature. We add to the literature by quantifying the cooling slope gap (i.e., amount of electricity households forgo over the cooling season). We first map a household's electricity consumption across outdoor temperatures using a five-parameter regression model. Next, we identify the household's cooling slope as how much additional electricity they consume per 1 degrees F increase in outdoor temperature once they start using their air conditioning systems. Using these slopes, we quantify the cooling slope gap in our study region (Arizona). We find that households making less than $15,000 limit their electricity consumption for cooling by 1.03 kWh per 1 degrees F increase compared to high-income households. For households with the same air conditioning count and efficiency, the cooling slope gap is 0.52 kWh/ degrees F on average, with a maximum of 0.84 kWh/degrees F. This implies that these households are continuously using coping strategies throughout the cooling season to reduce financial energy poverty but may be putting themselves a heat-illness risk. This finding helps energy poverty mitigation efforts by identifying who is potentially experiencing financial instability or lacks cooling infrastructure.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6edaeaf80ce3e9670073bdae584abc96",
  "timestamp": "2025-05-15T02:55:12.999822"
}