{
  "id": 3595,
  "title": "Unpacking the black box of systemic risks in banking: How causal loop modeling helps overcome rigid risk sharing and categorization",
  "abstract": "Purpose Systemic risks affect financial market participants in many ways. However, the literature insists firmly that they are and, in fact, should be of little concern to (private) banks (as opposed to regulators). The purpose of this paper is to argue for the relevance of systemic risks for private banks as opposed to regulators only by making use of causal loop models as being traditionally used in the discipline of systems dynamics. In contrast to the starting point for all common risk-management frameworks in banks, which is the classification of risks into risk categories, the authors show that risk has been compartmentalized too much and provide a strong case for a really holistic approach. Design/methodology/approach Systems thinking, causal loop models and conceptual approach. Findings Relevance of systemic risks for private banks as opposed to regulators only. In contrast to the starting point for all common risk-management frameworks in banks, which is the classification of risks into risk categories, the authors show that risk has been compartmentalized too much and provide a strong case for a really holistic approach, which stems from using explanatory models such as causal loop diagrams. On top of that more explanatory models ought to be used for risk management purposes while banks currently rely too much on statistical-descriptive approaches. Originality/value Integration of systems thinking into risk management, which is novel: in contrast to the starting point for all common risk-management frameworks in banks, which is the classification of risks into risk categories, the authors show that risk has been compartmentalized too much and provide a strong case for a really holistic approach.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6edf8b296a792bf5251582f67dfe396e",
  "timestamp": "2025-05-15T02:27:54.089902"
}