{
  "id": 7961,
  "title": "A multiple regression model for selecting audit team members",
  "abstract": "The optimization of the audit process has always been a priority for audit academics and professionals. Following a review of the audit literature on this topic, we conclude there is a consensus among authors that one of the auditor's primary concerns is to optimize the allocation of resources for audit missions while keeping the audit risk at an acceptable level. This paper focuses on one of the key issues identified by various authors regarding the optimization of the audit process: selecting the m of the audit team. All audit firms are aware that the human resource is their most important asset and recognize the importance of finding the balance between the skills of audit team members and the complexity of audit engagements. The main purpose of this optimization process is to help auditors not taking unnecessary risks avoid underauditing and to keep costs to a competitive level avoid over- auditing. We propose a multiple regression model for determining the optimum number of hours to be involved on audit engagements depending on several client related parameters e. g. financial performance indicators, client size, complexity of client operations, etc.. Further, we examine the possibility of using the model for creating an expert system that would assist in selecting the right mix of audit team members depending on their experience and skills.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ee54d1255edf6539d356a5c3b413cf6",
  "timestamp": "2025-05-15T03:13:30.752021"
}