{
  "id": 8887,
  "title": "Comorbidity in Dementia Diseases and Associated Health Care Resources Utilization and Cost",
  "abstract": "Background: People with dementia (PwD) suffer from coexisting medical conditions, creating complex clinical challenges and increasing the risk of poor outcomes, which could be associated with high healthcare cost. Objective: To describe the prevalence of comorbidity in PwD and to analyze the association between comorbidity in dementia diseases and healthcare costs from a payer's perspective. Methods: This cross-sectional analysis was based on n = 362 PwD of the DelpHi-MV trial (Dementia: Life-and person-centered help in Mecklenburg-Western Pomerania). Comorbidity was assessed using the Charlson comorbidity index (CCI) and was categorized into low, high, and very high comorbidity. Healthcare resource utilization and unit costs were used to calculate costs. Multivariable regression models were applied to analyze the association between comorbidity and costs. Results: Comorbidity was highly prevalent in the sample. 47% of PwD had a very high, 37% a high, and 16% a low comorbidity in addition to dementia. The most prevalent co-existing comorbidity were diabetes mellitus (42%), peripheral vascular disease (28%) and cerebrovascular disease (25%). Total costs significantly increased by 528(sic) (SE = 214, CI95 = 109-947, p = 0.014) with each further comorbidity, especially due to higher cost for medication and medical aids. Compared with a low comorbidity, a very high comorbidity was significantly associated with 818(sic) (SE = 168, CI95 = 489-1147, p < 0.001) higher medication costs and 336(sic) (SE = 161, CI95 = 20-652, p = 0.037) higher cost for medical aids. There were no significant association between a higher comorbidity and cost for formal care services. Conclusions: Comorbidity in PwD represents a substantial financial burden on healthcare payers and is a challenge for patients, healthcare providers, and the health systems. Innovative approaches are needed to achieve a patient-oriented management of treatment and care in comorbid PwD to reduce long-term costs.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ef658ea10ad0079e601581df0f451a7",
  "timestamp": "2025-05-15T03:23:27.827170"
}