{
  "id": 301,
  "title": "Loan Default Prediction Using Artificial Intelligence for the Borrow - Lend Collaboration",
  "abstract": "In the lending industry, such as banks or finance companies, investors provide loans to borrowers in exchange for the promise of repayment with interest. This two-way collaboration has many potential risks that need to be assessed. If the borrower repays the loan, then the lender would make a profit from the interest. However, if the borrower fails to repay the loan, then the lender loses money. Therefore, lenders face predicting the risk of a borrower being unable to repay a loan at any step of the credit process. Many financial institutes calculate FICO scores of a customer based on some factors such as the Payment History (35%), Amounts owed (30%), Length of credit history (15%), Credit mix (10%), and New credit (10% of the total point) of the customer, that score qualifies how risk customers are, how repayment ability of the customer. FICO score (Fair Isaac Corporation) is a traditional approach used broadly in finance fields to estimate risks and give a worthy credit amount to the customer. In this study, a new way is to use Artificial intelligence to predict the above problems. It bases on credit information and more personal information of the customers to predict its repayment ability. The data collected from VietCredit Finances used for training several Machine Learning models to determine if the borrower can repay its loan. Some linear, nonlinear models involved are Logistic Regression, Linear Discriminant Analysis, K Nearest Neighbors, Decision Tree, Naive Bayes, Support Vector Machine. The algorithm turning and Boosting and Bagging ensemble methods were also used to determine the best model. As a result, the Gradient Boosting model was the outperform and optimal predictive model (PR-AUC metric = 0.957).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f054b79c024f7789c78ed05ddb9286d",
  "timestamp": "2025-05-15T01:49:04.674699"
}