{
  "id": 334,
  "title": "Complex nonlinear neural network prediction with IOWA layer",
  "abstract": "Neural network methods are widely used in business problems for prediction, clustering, and risk management to improving customer satisfaction and business outcome. The ability of a neural network to learn complex nonlinear relationship is due to its architecture that uses weight parameters to transform input data within the hidden layers. Such methods perform well in many situations where the ordering of inputs is simple. However, for a complex reordering of a decision-maker, the process is not enough to get an optimal prediction result. Moreover, existing machine learning algorithms cannot reduce computational complexity by reducing data size without losing any information. This paper proposes an induced ordered weighted averaging (IOWA) operator for the artificial neural network IOWA-ANN. The operator reorders the data according to the order-inducing variable. The proposed sorting mechanism in the neural network can handle a complex nonlinear relationship of a dataset, which results in reduced computational complexities. The proposed approach deals with the complexity of the neuron, collects the data and allows a degree of customisation of the structure. The application further extended to IGOWA and Quasi-IOWA operators. We present a numerical example in a financial decision-making process to demonstrate the approach's effectiveness in handling complex situations. This paper opens a new research area for various complex nonlinear predictions where the dataset is big enough, such as cloud QoS and IoT sensors data. The approach can be used with different machine learning, neural networks or hybrid fuzzy neural methods with other extensions of the OWA operator.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f13ce01efa381c96db56c001afb2917",
  "timestamp": "2025-05-15T01:49:41.025945"
}