{
  "id": 6413,
  "title": "Study on the Chinese Commercial Health Insurance Developing Routine",
  "abstract": "Health insurance is a special classification. It contains both insurance and medicine technology. The insurance object concerns health care risk and relative financial losses based on diseases, medical expenses, health services etc. Thus, it's difficult to identify and prevent. It is also influenced by government's policy and guide. Compared to life insurance and P&C insurance, it is different among such areas like data requirement, pricing progress, claim handling, and distribution channel. All of them limited the profit margin of health insurance and make it unstable. Due to above reasons market rules always inefficient. In western countries, it is found that government paid enough attention on the properties public goods of health insurance. In some special periods those governments want to be trusted by majority citizens in order to avoid riots. Some social welfare experts do not agree to use financial solution to cover health risk. However, they prefer use social security instead of health insurance. In America, commercial medicine system is the main solution to cover health care risk, but government also play important role in health insurance operating. In this circumstance, market rule can not be absolutely applied. The Chinese health insurance's developing routine and the future are not coherent answer both in theory and practice. This study firstly find some clues through overseas' experience. Secondly, it contrasts the political, economy, culture and social factors along the routine of industrialization, urbanization, and globalization and with the market mechanic reform in china. Meanwhile, it is referring the government's health care policy and analyzing the basic elements and potential ways to help health insurance developing well. This study shows public-private joint is the best way. In public point of view, third party administration (TPA) is the best choice. In private viewpoint, empowering operation is essential. To health insurance product design, company should develop product differently according to the properties public goods. In another words, if the properties public goods become dramatic, it will depend on the government. If the properties public goods become weaker, it could be operated by market rules. To succeed, insurer should integrate the resources in health care provider to develop product, cooperating with health care provider is a key factor, which can not be jumped away.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f293bdff71834c3334bcc617a2bd251",
  "timestamp": "2025-05-15T02:58:05.571053"
}