{
  "id": 2831,
  "title": "Using parametric classification trees for model selection with applications to financial risk management",
  "abstract": "We describe two parametric classification tree methods, which allow formal selection of a member of a class of generalised distributions. In the paper we consider generalised Beta distributions for non-negative random variables and the generalised skew-Student distribution for random variables distributed on the real line. We introduce a class of symmetric generalised multivariate Student distributions, members of which may also be selected using the classification trees. We present two versions of the parametric classification tree: specific to general and general to specific. We apply the classification methods to daily returns on stocks from a selection of 15 major, mid-cap and emerging markets. The results show that the majority of return distributions follow Student's t, but that a non-negligible minority follow a symmetric generalised Student distribution. We confirm a well-known stylised fact about skewness: it tends not to be persistent. By contrast, kurtosis is persistent. Using the symmetric generalised multivariate Student distribution, we present a risk management study based on efficient portfolios constructed from UKFTSE250 stocks and specifically concerned with the computation of value at risk. The case study demonstrates that the model selection procedures based on the classification trees lead to more accurate computation of VaR than those based on the normal distribution or on non-parametric approaches. The study also shows that the normal distribution may be used for VaR computations for larger portfolios when the holding period is longer. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f2a3da6069c77c72ada83cb11aacd0e",
  "timestamp": "2025-05-15T02:19:46.636309"
}