{
  "id": 8217,
  "title": "Compliance determinants of anti-money laundering regime among professional accountants in Malaysia",
  "abstract": "Purpose Money laundering offences occur worldwide, with recent discussions involving issues related to the low levels of compliance among professional accountants towards the anti-money laundering (AML) regime. Under the regime, professional accountants are required to implement compliance programs (Know Your Customer, Clients Due Diligent, Record Keeping) and to submit any suspicious transaction report encounters to the authorities. Due to the lack of research in this sector, this study aims to examine the compliance determinants towards AML regimes among professional accountants in Malaysia. Design/methodology/approach Premised on protection motivation theory, a questionnaire was developed and distributed among 1,100 professional accountants. Of which 275 questionnaires were returned and subjected to regression analysis. Findings Based on the findings, perceived risk of non-compliance and awareness of Anti-Money Laundering Act 2001 and Financial Action Task Force standard were significantly related to the level of compliance towards the AML regimes. Meanwhile, compliance cost did not influence the compliance behaviour of professional accountants. Moreover, the findings demonstrated that awareness programs among the reporting institutions should be enhanced, specifically the professional accountants. Practical implications This study recommends the professional bodies particularly professional accountants in Malaysia to establish a blueprint as a guideline for money laundering reporting. Originality/value This is one of the pioneer studies looking into AML compliance determinants among the professional accountants in Malaysia. This study will provide insights on the current practices and recommend ways to improve the current AML reporting practices among the professional accountants.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f2c52c4984c77c25b28fde14bb6dd61",
  "timestamp": "2025-05-15T03:16:48.848363"
}