{
  "id": 5072,
  "title": "Research methods on the role of financial inclusion, energy efficiency and energy R&D: Evidence from G7 economies",
  "abstract": "Countries around the globe are rapidly targeting energy efficiency goal achievement due to the unproductive and inefficient use of traditional energy sources. Several factors are discovered that are critical for energy efficiency in the region. Still, there are many economic, financial, energy, and research and development factors that could influence energy efficiency and remained ignored in the scholarly research, which is important from economic growth as well as environmental sustainability perspective. This research contributes to the existing literature by providing novel factors affecting energy efficiency in the developed nations. Specifically, the current study investigates the influence of financial inclusion, energy R&D, political-economic-financial risk index, and the energy-related inflation on the energy efficiency of G7 economies covering the period from 2004 to 2020. This study employed the slope heterogeneity and cross-section dependence test, which led to using the second-generation unit root test. For empirical estimations, the current study utilizes the panel Quantile regression, and the outcomes reveal that all the considered variables positively influence the energy efficiency in the region. However, the influence of these variables increases except for the energy-related inflation when moving from lower quantile Q(0.25) to medium Q(0.50) to higher quantile Q(0.75), respectively. The estimated results are found robust, confirmed by the FMOLS estimator. Based on the empirical findings, it is recommended that financial inclusion and energy-related research and development be enhanced to achieve the region's energy efficiency.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f772be37a3bc266e693f45e22d8dd18",
  "timestamp": "2025-05-15T02:44:10.981264"
}