{
  "id": 4188,
  "title": "How financial hardship is associated with the onset of mental health problems over time",
  "abstract": "Poor mental health has been consistently linked with the experience of financial hardship and poverty. However, the temporal association between these factors must be clarified before hardship alleviation can be considered as an effective mental health promotion and prevention strategy. We examined whether the longitudinal associations between financial hardship and mental health problems are best explained by an individual's current or prior experience of hardship, or their underlying vulnerability. We analysed nine waves (years: 2001-2010) of nationally representative panel data from the Household, Income, and Labour Dynamics in Australia survey (n = 11,134). Two components of financial hardship (deprivation and cash-flow problems) and income poverty were coded into time-varying and time-invariant variables reflecting the contemporaneous experience of hardship (i.e., current), the prior experience of hardship (lagged/12 months), and any experience of hardship during the study period (vulnerability). Multilevel, mixed-effect logistic regression models tested the associations between these measures and mental health. Respondents who reported deprivation and cash-flow problems had greater risk of mental health problems than those who did not. Individuals vulnerable to hardship had greater risk of mental health problems, even at the times they did not report hardship. However, their risk of mental health problems was greater on occasions when they did experience hardship. The results are consistent with the argument that economic and social programmes that address and prevent hardship may promote community mental health.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f80233e29d228546305faa34d318c0d",
  "timestamp": "2025-05-15T02:34:13.433915"
}