{
  "id": 3964,
  "title": "A data-driven prediction approach for sports team performance and its application to National Basketball Association",
  "abstract": "Performance prediction is an issue of vital importance in many real managerial applications. This paper will propose a prediction approach for sports team performance based on data envelopment analysis (DEA) methodology and data-driven technique. The proposed approach includes two steps: The first one conducts a multivariate logistic regression analysis to examine the relationship between the winning probability and game outcomes at the team-level. The other one addresses a DEA-based player portfolio efficiency analysis to optimally choose players and plan the playing time among players in the court. The second step aims to use players' and team's historical data to train the future and obtain the most promising outcomes in terms of their average inefficiency status. Finally, we apply the proposed performance prediction approach to National Basketball Association and take Golden State Warriors as an example to illustrate its usefulness and efficacy. We obtain the prediction results for the 2015-16 regular season based on a four-season dataset from the 2011-12 season to the 2014-15 season. Further, we carry out multiple experiments to provide deeper discussion and analysis on according prediction results. It shows that the DEA-based data-driven approach can predict the sports team performance very well and can also provide interesting insights into the performance prediction problem. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f93a4742416a795401a24ac2558cf6f",
  "timestamp": "2025-05-15T01:22:39.374256"
}