{
  "id": 8115,
  "title": "The potential of virtual reality to assess functional communication in aphasia",
  "abstract": "Speech-language pathologists (SLPs) who work with adults with cognitive-linguistic impairments, including aphasia, have long needed an assessment tool that predicts ability to function in the real world. In this article, it is argued that virtual reality (VR)-supported approaches can address this need. Using models of disability such as the International Classification of Functioning, Disability and Health (ICF) and the Disability Creation Process model, a case is made for using VR to reconstruct daily communicative events, thereby capturing situations of life events. A case is also made for using virtual environments to systematically assess the impact of environmental factors that can be enablers or obstacles to successful functional communication. Before embarking on tool development, opinions of clinical SLPs were sought using a discussion group format. The Communication Abilities of Daily Living (CADL) test was proposed as an example to follow for the reconstruction of daily communication events. Clinicians were asked to discuss scenes that might be amenable to VR, while considering practical clinical needs. There was a clear interest in the development of a VR tool with a preference to assess functions that were not easily observable in clinic (e.g., financial transactions, transportation, and safety in contexts of risk). Discussants stressed the importance of developing a tool for different target populations, as well as technical features such as being able to regulate speed and level of difficulty. The potential use of VR tools for both assessment and therapy is discussed. It is argued that VR will offer clinicians the opportunity to assess functions not possible with paper-and-pencil tests.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f9431c0ea0abc856aa31774536953d5",
  "timestamp": "2025-05-15T03:15:38.335391"
}