{
  "id": 8818,
  "title": "Factors that determine catastrophic expenditure for tuberculosis care: a patient survey in China",
  "abstract": "Background: Tuberculosis (TB) often causes catastrophic economic effects on both the individual suffering the disease and their households. A number of studies have analyzed patient and household expenditure on TB care, but there does not appear to be any that have assessed the incidence, intensity and determinants of catastrophic health expenditure (CHE) relating to TB care in China. That will be the objective of this paper. Methods: The data used for this study were derived from the baseline survey of the China Government - Gates Foundation TB Phase II program. Our analysis included 747 TB cases. Catastrophic health expenditure for TB care was estimated using two approaches, with households defined as experiencing CHE if their annual expenditure on TB care: (a) exceeded 10 % of total household income; and (b) exceeded 40 % of their non-food expenditure (capacity to pay). Chi-square tests were used to identify associated factors and logistic regression analysis to identify the determinants of CHE. Results: The incidence of CHE was 66.8 % using the household income measure and 54.7 % using non-food expenditure (capacity to pay). An inverse association was observed between CHE rates and household income level. Significant determinants of CHE were: age, household size, employment status, health insurance status, patient income as a percentage of total household income, hospitalization and status as a minimum living security household. Factors including gender, marital status and type of TB case had no significant associations with CHE. Conclusions: Catastrophic health expenditure incidence from TB care is high in China. An integrated policy expanding the free treatment package and ensuring universal coverage, especially the height of UHC for TB patients, is needed. Financial and social protection interventions are essential for identified at-risk groups.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f9433e79d71b888e51db8e3fff1e58f",
  "timestamp": "2025-05-15T03:22:57.853690"
}