{
  "id": 2609,
  "title": "Spatial-Temporal Evolution and Risk Assessment of Land Finance: Evidence from China",
  "abstract": "Land finance is a special land financing mode in China under the nationalization of urban land since 1954. The policy authorizes local governments to collect fiscal revenue from land grant premiums and land taxes. As China is experiencing the social and economic transformation, heavily replying on land finance starts causing financial sustainable problems. Based on the spatial panel data of 30 provinces in China in the last two decades, we analyzed the spatial-temporal evolution of land finance. We found that the spatial variation of land finance declined during the period of study and decreased from east to west. The results revealed that land finance had significant positive spatial autocorrelation and robust spatial clustering characteristics. In addition, the spatial distribution of land finance was consistent with the population-based Hu Line. We also assessed land finance risks via a four-dimensional risk matrix through spatial panel regression (SPR). The spatial spillover effects suggested that there is inter-provincial imitation and collaboration but no competition. Our forecast indicates that most provinces will be at a relatively low risk level in the next decade except some southwest provinces. Based on the findings, we highlight the policy implications to mitigate risks and maintain sustainable land finance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6f9d6583ae7b328cb95558b19d5437d1",
  "timestamp": "2025-05-15T02:17:01.809776"
}