{
  "id": 9453,
  "title": "Perinatal maternal suicide: How to prevent?",
  "abstract": "The sixth report of the National Confidential Survey on Maternal Deaths provides insights into the frequency, risk factors, causes, adequacy of care, and preventability of maternal deaths occurring in 2013-2015 in France. The method developed ensures an exhaustive identification and a confidential analysis of maternal deaths. It was organized in three steps. 1) All deaths occurring during pregnancy or up to 1 year after its end, whatever the cause or mode of termination, being considered 2) A pair of volunteer assessors (midwives, gyneco-obstetricians, anesthesiologists, psychiatrists) was in charge of collecting the information (history of the woman, course of her pregnancy, circumstances of the event that led to the death and management); 3) Review and classification of deaths by the National Committee of Experts on Maternal Mortality which made a collective judgment on the cause of death, on the ade-quacy of the care provided, and on what could been done to avoid the death depending on the existence of circumstances that could have prevented the fatal outcome. The operation of the committee has been enriched by new resources to further explore these cases. Specifically, a module of the survey question-naire, the recruitment of psychiatrists whose contribution allows relevant documentation of the suicides, and the participation of a psychiatrist as an associate expert for the analysis of the appropriateness of the management and the variable determining factors of these cases. Suicide becomes one of the two main causes of maternal mortality, (the other cause being cardiovascular pathologies), with 35 suicides on the triennium among the 262 maternal deaths, that is to say 13.4 % of maternal deaths, about 1 per month. In this population, the average age of women who died by suicide was 31.4 years. The majority of the women were born in France, 68 % were prima parous, and in 9 % of cases suicide followed a twin pregnancy. Psy-chiatric history was known in 33.3 % of the suicidal mothers, and 30.3 % had a history of psychiatric care that was unknown to the maternity team.43 % of the women had psychosocial vulnerability factors, a history of violence, and eviction from the home and/or financial difficulties. In 23 % of the cases, the time of occurrence of these suicides was within the first 42 days postpartum, and in 77 % between 43 days and one year after birth with a median delay of 126 days. Only one suicide occurred during pregnancy. Maternal suicides were mostly violent deaths. Suboptimal care was present in 72 % of cases, where 91 % of potentially preventable deaths related to a lack of multidisciplinary management and/or inadequate interaction between the patient and the health care system. Among these potentially avoidable deaths, we were able to distinguish: women whose psychiatric pathology was known and for whom multidisci-plinary management was not optimal, and women whose psychiatric pathology was not known or was not present - for whom it was rather a matter of a failure to detect and identify the signs, particularly by obstetric care providers or general emergency services. Based on the analysis of the cases, strong messages were identified, with the aim of optimizing management: - The screening by structured questioning of psychiatric history from the moment of registration in the maternity ward, repeated at each consulta-tion throughout the pregnancy. - The reassessment of the psychological and somatic state through an early postnatal interview at one month; - The identification of warning symptoms, with screening tools for depression. If necessary, a further recourse to the psychologist and/or psychiatrist of the maternity hospital, organisation of a home hospitalization, and a private midwife to provide a link in the pre-and postpartum period. This, in addition to the earliest possible care in the PMI (Maternal and Infantile Pro-tection, of the French social care system), appointments with mental health professionals,and the link with the attending physician; - The implementation of a coordinated care pathway in case of a known psychiatric pathology with pre conception counselling. This includes a multidisciplinary collaboration, an adaptation of psychotropic treatment, management of comorbidities referral to specialized perinatal psychopathology teams, prenatal meeting with the pediatrician of the maternity hospital, anticipation of the birth, postpartum and discharge options, liaison sheet established for the organization of the delivery and postpartum, and a regular written transmissions between the intervening parties throughout the care; - The generalization of medico-psycho-social staffs, in maternity wards, for all situations identified as at risk. In addition to the need for training and increased awareness on psychological issues during the perinatal period and on the different pathologies encountered by adult mental health professionals and front-line workers, it is necessary to encourage the development of resources in the country. Par-ticularly, joint child psychiatrist-adult psychiatrist consultations at the territorial level, responsible for being resource contacts for maternity wards and local care professionals, as well as the promotion of case pathway referrals.(c) 2022 L'Encephale, Paris.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fafbb9b07feac990638c01aec2773d0",
  "timestamp": "2025-05-15T03:28:46.386106"
}