{
  "id": 23,
  "title": "STUDY OF PERSONAL CREDIT RISK ASSESSMENT BASED ON SUPPORT VECTOR MACHINE ENSEMBLE",
  "abstract": "Credit risk assessment, essentially a classification problem, plays an important role in bank credit risk management. Hence, how to assess credit risks in commercial banks effectively becomes an important issue in the financial field. In recent years, a number of studies have provided the discipline within sights into the practice of credit risk management. Credit risk: assessment, a classification problem in nature, is a basic task in credit risk management of commercial banks whose purpose is to analyze the credit risk of banks so as to offer a decision-making ground for loan business. Support vector machine (SVM) ensemble has been proposed to improve classification performance recently. However, ensemble strategies currently used can not evaluate the output importance degrees of component SVM classifiers when combining component predictions to the final decision. To overcome this shortcoming, we propose a method of support vector machine (SVM) ensemble based on fuzzy integral to discriminate good creditors from bad ones. Compared the experiment results of SVM ensemble with that of single SVM and the neural network ensemble, the proposed method outperforms the single SVM and the neural network ensemble in terms of classification accuracy. Our experiments show that the proposed method, stable, highly accurate, strong robust and feasible, can provide a sound credit assessment system.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fb1e2b0bb1fc6f8abead3ca94c204b2",
  "timestamp": "2025-05-15T01:46:03.778732"
}