{
  "id": 7842,
  "title": "The relationship between non-audit fees and audit quality: dealing with the endogeneity issue",
  "abstract": "Purpose - The purpose of this paper is to explore whether the provision of non-audit services (NAS) by public accounting firms undermines audit quality. The study addresses this question by testing for an association between the provision of consulting services and auditor independence in listed companies. Design/methodology/approach - The authors study if the magnitude of non-audit fees explains variations in earnings management by looking at the joint determination of non-audit fees, audit fees, and abnormal accruals using the SURE-regression estimation method. Findings - Evidence from tested models suggests that audit services quality is uncompromised by the provision of NAS. In other words, high non-audit fees do not necessarily result in poor quality financial reporting. Research limitations/implications - A different research methodology and a different sample (e.g. non-listed companies) may lead to differing results. As the paper analyses only one country, generalizability of the results might be a limitation. There is no need to increase legal restrictions on the provision of consulting services by public accounting firms in order to better safeguard audit quality. Practical implications - Consulting clients may be more confident to hire both audit and NAS with the same firm and can make a case before the general Shareholders' meeting. By providing both audit and NAS, consulting firms obtain knowledge spillovers and synergies while appealing highly qualified professionals. Originality/value - The use of simultaneous equations (SURE-regression) to establish the auditor-client relation allows us to better model theoretical relations between audit fees, non-audit fees, and abnormal accruals. Likewise, joint modeling takes account of correlations between the error terms of the individual models, yielding more efficient estimates than ordinary least squares. Performing this analysis in a non-Anglo-American country with low litigation risk is also a valuable contribution to extant literature.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fb18b549e40ae074100a716a83bbf77",
  "timestamp": "2025-05-15T03:12:36.514743"
}