{
  "id": 965,
  "title": "Reinfection of farm dogs following praziquantel treatment in an endemic region of cystic echinococcosis in southeastern Iran",
  "abstract": "Cystic Echinococcosis (CE) as a prevalent tapeworm infection of human and herbivorous animals worldwide, is caused by accidental ingestion of Echinococcus granulosus eggs excreted from infected dogs. CE is endemic in the Middle East and North Africa, and is considered as an important parasitic zoonosis in Iran. It is transmitted between dogs as the primary definitive host and different livestock species as the intermediate hosts. One of the most important measures for CE control is dog deworming with praziquantel. Due to the frequent reinfection of dogs, intensive deworming campaigns are critical for breaking CE transmission. Dog reinfection rate could be used as an indicator of the intensity of local CE transmission in endemic areas. However, our knowledge on the extent of reinfection in the endemic regions is poor. The purpose of the present study was to determine E. granulosus reinfection rate after praziquantel administration in a population of owned dogs in Kerman, Iran. A cohort of 150 owned dogs was recruited, with stool samples collected before praziquantel administration as a single oral dose of 5 mg/kg. The re-samplings of the owned dogs were performed at 2, 5 and 12 months following initial praziquantel administration. Stool samples were examined microscopically using Willis flotation method. Genomic DNA was extracted, and E. granulosus sensu lato-specific primers were used to PCR-amplify a 133-bp fragment of a repeat unit of the parasite genome. Survival analysis was performed using Kaplan-Meier method to calculate cumulative survival rates, which is used here to capture reinfection dynamics, and monthly incidence of infection, capturing also the spatial distribution of disease risk. Results of survival analysis showed 8, 12 and 17% total reinfection rates in 2, 5 and 12 months following initial praziquantel administration, respectively, indicating that 92, 88 and 83% of the dogs had no detectable infection in that same time periods. The monthly incidence of reinfection in total owned dog population was estimated at 1.5% (95% CI 1.0-2.1). The results showed that the prevalence of echinococcosis in owned dogs, using copro-PCR assay was 42.6%. However, using conventional microscopy, 8% of fecal samples were positive for taeniid eggs. Our results suggest that regular treatment of the dog population with praziquantel every 60 days is ideal, however the frequency of dog dosing faces major logistics and cost challenges, threatening the sustainability of control programs. Understanding the nature and extent of dog reinfection in the endemic areas is essential for successful implementation of control programs and understanding patterns of CE transmission. Cystic echinococcosis (CE), caused by the small tapeworm of dogs, Echinococcus granulosus, is considered as a prevalent zoonotic infection of human and livestock worldwide. Dogs play a crucial role in the parasite life cycle, serving as definitive hosts for the tapeworm and contributing to the transmission of the disease to humans and other livestock.Praziquantel (PZQ) dosing of dogs is proposed as one of the main elements of CE control programs. Frequent PZQ dosing is required because of reinfection of farm dogs following feeding offal to them and this presents major logistic and financial problems. The frequency of PZQ dosing is dependent on the rate of dog reinfection in each endemic region. We explored the significance of farm dogs reinfection in an endemic area in southeastern Iran, to provide better understanding of CE transmission and developing effective control programs.We monitored a cohort of 150 dogs previously treated for cystic echinococcosis by praziquantel. We showed that the prevalence of echinococcosis in the farm dogs, using PCR assay was 42.6% before praziquantel administration. To our surprise, a significant proportion of these dogs, approximately 17%, experienced reinfection with E. granulosus, 12 months following initial praziquantel administration. This finding was both alarming and informative. Our study emphasized the importance of responsible dog ownership behavior and proper disposal of livestock offal in endemic areas.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fbd97ef2bbc33f910827152baa1d971",
  "timestamp": "2025-05-15T01:44:35.613638"
}