{
  "id": 3972,
  "title": "Land tenure security and adoption of modern rice technology in Odisha, Eastern India: Revisiting Besley's hypothesis",
  "abstract": "This paper examines the Besley's hypothesis in agriculture of Odisha, Eastern India which says that land tenure security induces farm investment, i.e., adoption of improved/modern rice technology. A simple portfolio model has been developed which incorporates three different specifications of tenurial status that defines land tenure security. The model hypothesizes a positive effect of secured land tenure on technology adoption. Empirical estimations of that hypothesis with the help of tobit regression confirm that secured land tenure significantly augments both probability as well as intensity of adoption. In the first specification, it is observed that the owner operators, whose tenurial rights are more secured, are more likely to adopt MVs than the tenant cultivators (both partial tenants and pure tenants). In the second specification, tenants having long duration tenure are assumed to be relatively secured and they are found to be better adopters of MVs as compared to others. In the third specification, where fixed renters are assumed to be relatively secured tenants are not found to be significantly different from share croppers so far as adoption of MVs is concerned. The empirical evidences support Besley's 'security effect' hypothesis that secured land tenure enhances adoption of improved technology. The policy implication of the study suggests lifting of the legal ban on tenancy in the agriculture of Odisha and bringing a reform in the agricultural tenancy system.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fcb0dc6e9011eb1fc89f5d1eccd845f",
  "timestamp": "2025-05-15T01:22:39.411453"
}