{
  "id": 4167,
  "title": "Vaccine Uptake and Intentions: Insights from a Texas Survey on Factors Influencing COVID-19 Vaccination Decisions",
  "abstract": "The effectiveness of COVID-19 vaccines depends on widespread vaccine uptake. Employing a telephone-administered weighted survey with 19,502 participants, we examined the determinants of COVID-19 vaccine acceptance among adults in Texas. We used multiple regression analysis with LASSO-selected variables to identify factors associated with COVID-19 vaccine uptake and intentions to receive the vaccine among the unvaccinated. The prevalence of unvaccinated individuals (22%) was higher among those aged 18-39, males, White respondents, English speakers, uninsured individuals, those facing financial challenges, and individuals expressing no concern about contracting the illness. In a fully adjusted regression model, higher odds of being unvaccinated were observed among males (aOR 1.11), the uninsured (aOR 1.38), smokers (aOR 1.56), and those facing financial struggles (aOR 1.62). Conversely, Asians, Blacks, and Hispanics were less likely to be unvaccinated compared to Whites. Among the unvaccinated, factors associated with stronger intent to receive the vaccine included age (over 65 years), Black and Hispanic ethnicity, and perceived risk of infection. Hispanic individuals, the uninsured, those covered by public insurance, and those facing financial challenges were more likely to encounter barriers to vaccine receipt. These findings underscore the importance of devising tailored strategies, emphasizing nuanced approaches that account for demographic, socioeconomic, and attitudinal factors in vaccine distribution and public health interventions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6fd104a191a35f18ff9c132a2f43f873",
  "timestamp": "2025-05-15T02:34:13.310756"
}