{
  "id": 6223,
  "title": "Anxiety and depressive symptoms in pregnant women during the COVID-19 pandemic in the Czech Republic-Broader sociodemographic causes, connections and implications",
  "abstract": "IntroductionOur study (part of multicentric MindCOVID) investigates risk factors for anxiety and depression among pregnant women during the COVID-19 pandemic in the Czech Republic. Material and methodsThe study used a prospective cross-sectional design. Data was collected using an online self-administered questionnaire. Standardized scales, general anxiety disorder (GAD)-7 and patient health questionnaire (PHQ)-9 were administered online. Multivariate regression analysis was employed to evaluate the relationship between sociodemographic, medical and psychological variables. ResultsThe Czech sample included 1830 pregnant women. An increase of depressive and anxiety symptoms measured by PHQ-9 and GAD-7 in pregnant women during the COVID-19 pandemic was associated with unfavorable financial situation, low social and family support, psychological and medical problems before and during pregnancy and infertility treatment. Fear of being infected and adverse effect of COVID-19, feeling of burden related to restrictions during delivery and organization of delivery and feeling of burden related to finances were associated with worse anxiety and depressive symptoms. ConclusionsSocial and emotional support and lack of financial worries are protective factors against mood disorders in pregnant women in relation to COVID-19 pandemic. In addition, adequate information about organization of delivery and additional support from healthcare professionals during the delivery are needed. Our findings can be used for preventive interventions, given that repeated pandemics in the future are anticipated.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6feaa224766054e965969ed9e99c7124",
  "timestamp": "2025-05-15T02:56:10.590029"
}