{
  "id": 4167,
  "title": "Economic growth and income inequality: a non-linear econometrics analysis of the SADC region, 1990-2015",
  "abstract": "Purpose The authors investigate the growth-inequality relationship, using panel data from 13 Southern African Development Community (SADC) countries over the period 1990-2015, to test the validity of the Kuznets and Tribble theories. Furthermore, the authors seek to determine the threshold level at which excessive growth hampers inequality. Design/methodology/approach The panel smooth transition regression (PSTR) model has several stages. The authors applied the Lagrange multiplier (LM) test to find the appropriate transition variable amongst all candidate variables, to assess the linearity between economic growth and income inequality and to find the sequence for selecting the order m of the transition function. The authors then estimated the PSTR model, but before facilitating the results, the authors first used the wild cluster bootstrap (WCB)-LM-type test to assess the appropriateness of the selected transition. Findings The authors found that at lower growth, income inequality tends to be lower, while if growth increases above US$8,969, inequality tends to increase in the SADC region. The findings combine into a U-shaped relationship, contradicting the Kuznets and Tribble theories. Originality/value The contribution of this paper is that it becomes the first to provide the threshold level at which excessive growth increases inequality in the selected countries. This study proposes that policymakers should focus on activities aimed at stimulating growth, in other words, activities such as spending more on infrastructure, drawing up a suitable investment portfolio and spending on technological investment for countries that are below US$8,969. An improvement in these activities will create job opportunities, which in turn will add to economic growth and thus lead to lower income inequality and better social cohesion.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ff412940d075875794417dbd561e07d",
  "timestamp": "2025-05-15T01:24:25.390033"
}