{
  "id": 3683,
  "title": "Pruning Pareto optimal solutions for multi-objective portfolio asset management",
  "abstract": "Budget allocation problems in portfolio management are inherently multi-objective as they entail different types of assets of which performance metrics are not directly comparable. Existing asset management methods that either consolidate multiple goals to form a single objective ( a priori ) or populate a Pareto optimal set ( a posteriori ) may not be sufficient because a decision maker (DM) may not possess comprehensive knowledge of the problem domain. Moreover, current techniques often present a Pareto optimal set with too many options, making it counter-productive. In order to provide the DM with a diverse yet compact solution set, this paper proposes a three-step approach. In the first step, we employ different approximation functions to capture investment-performance relationships at the asset-type level. These simplified relationships are then used as inputs for the multi-objective optimisation model in the second step. In the final step, Pareto optimal solutions generated by a selected evolutionary algorithm are pruned by a clustering method. To measure the spread of representative solutions over the Pareto front, we present two novel indicators based on average Euclidean distance and cosine similarity between original Pareto solutions and representative solutions. Through numerical examples, we demonstrate that this approach can provide a set of representative solutions that maintain high integrity of the original Pareto front. We also put forward suggestions on choosing appropriate approximation functions, pruning methods, and indicators. (c) 2021 The Author(s). Published by Elsevier B.V. This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ )",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "6ff843500cc891c421db6e1493a8de01",
  "timestamp": "2025-05-15T01:19:26.274239"
}