{
  "id": 8806,
  "title": "Mental health of international migrant workers amidst large-scale dormitory outbreaks of COVID-19: A population survey in Singapore",
  "abstract": "Introduction: Worldwide, COVID-19 clusters have emerged within communities of international migrant workers operating in high-density work and living environments. Despite their increased vulnerability, no study has documented the mental health burden of COVID-19 amongst these groups. To address this gap, we conducted a survey of migrant workers involved in large-scale dormitory outbreaks within Singapore. Methods: Between 22 June to 11 October 2020, questionnaires were distributed to 1011 migrant workers undergoing extended movement restrictions. Mental health symptoms were measured using the 21-item Depression, Anxiety and Stress Scale (DASS-21). As covariates, we assessed participants' socio-demographics, quarantine status, COVID-19 health concerns, financial stability, and exposure to news and misinformation. Linear regression models were fitted to identify factors associated with DASS-21 scores. Results: Complete movement restrictions were associated with increased depression and stress symptoms, while being diagnosed with COVID-19 was associated with increased anxiety. Participants who harboured fears about their health or job, perceived their health to be poorer, or had greater exposure to COVID-19 rumours reported higher depression, anxiety, and stress levels. Across the cohort, rates of severe or extremely severe depression (3.1%, 95% CI: 2.1-4.3%), anxiety (4.1%, 95% CI: 2.9-5.5%), and stress (1.3%, 95% CI: 0.7-2.2%) were similar to those observed in the general population for the host country (Singapore). Conclusions: As the first mental health survey of low-waged migrant workers during the pandemic, our findings provide a basis to identify and support at-risk individuals. This is critical as migrant workers often have limited access to healthcare services. At the same time, we documented resilience within the cohort as a whole.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7004e77bd091deed1137ffecd62ccd0b",
  "timestamp": "2025-05-15T03:22:26.119617"
}