{
  "id": 2115,
  "title": "Option pricing under sub-mixed fractional Brownian motion based on time-varying implied volatility using intelligent algorithms",
  "abstract": "Against the background of the current complex international geopolitical situation and more intense trade frictions, the volatility of financial assets has important research significance as a basis for risk analysis and option pricing. First, considering the characteristics of financial assets-such as long dependence-the pricing model can become complicated, making it difficult to calculate the implied volatility directly. Establishing the loss function between the trading data and modeled value, the implied volatility at different moments solved using the global optimal double annealing algorithm was found to differ from the generalized autoregressive conditional heteroskedasticity (GARCH) volatility and historical volatility. Second, the implied volatility considering people's future expectations of financial assets was predicted using the previously known implied volatility via deep learning methods. The empirical results showed that the implied volatilities predicted using the long short-term memory (LSTM) and one-dimensional convolutional neural network (1D-CNN) methods performed well for option pricing. Moreover, the fractal option-pricing models outperformed the traditional Black-Scholes (B-S) pricing model. Finally, based on the accumulated local effect (ALE) algorithm-which can quantify the impact analysis of different volatilities on pricing models-it was found that the predicted implied volatility using artificial intelligence algorithms was more relevant to the truth. A combination of traditional mathematical models and emerging intelligent algorithms are promoted in this study, providing a reference for investors and risk managers and contributing to the continued development of financial markets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "701549021a18e61631d9fe52d0f9c70a",
  "timestamp": "2025-05-15T02:11:40.476909"
}