{
  "id": 9350,
  "title": "The usefulness of PIN as a measurement for private-information risk in Korean stock markets",
  "abstract": "PIN, defined by Easley and O'Hara as the probability of information-based trading, has been used as a proxy for private-information risk on individual stocks for various fields of financial studies in the U.S. In this paper, we examine whether PIN is useful in understanding the cross-sectional relationship between stock returns and private-information risk in the Korean stock markets. Our analysis results indicate that the PIN is not useful; therefore, we further examine to find out possible reasons for this and alternative ways to measures private-information risk on individual stocks. Our analyses are as follows. Using the method presented in Easley, Hvidkjaer, and O'Hara (2002, hereafter EHO), we estimate PIN using intraday transaction data on individual stocks. Then, we analyze the cross-sectional relationship between the estimated PIN and excess returns using two methods. The first method analyzes the fifteen portfolios formed by firm size and PIN. The second method uses an asset pricing model with beta, size, book-to-market ratio, and PIN as explanatory variables. Then, a regression analysis is conducted using the Fama and French (1992) method. To confirm the robustness of our tests, we estimate PIN for a period of six-months prior and that of three-months prior against the returns in the current period. Based on criticism against the EHO model by Duarte and Young (2007, hereafter DY), we calculate the correlations between the number of buyer-initiated trades and that of seller-initiated trades in the Korea Exchange (KRX). Then, we compare them with the correlations inherent in the EHO and DY (2007) models. We estimate adjusted PIN (AdjPIN) using intraday transaction data on individual stocks and conduct the same cross-sectional analyses as we have done with the PIN. The sample period of the data is from January 1997 to December 2005. The sample stocks are common stocks listed on the Securities Market Division of the KRX which have been traded during more than 60 days a year. We obtain the following results. First, the cross-sectional relationship between PIN and portfolio excess returns is economically insignificant when we analyze the relationship using PIN estimated from last year's data and the firm size measured by market capitalization at the end of the previous year. In contrast, AdjPIN generally has an economically significant relationship with portfolio excess returns. Second, reducing the estimation interval for PIN to a quarter does not help in explaining portfolio returns. Only when we analyze the relationship between PIN in the current period and current portfolio returns, then do we understand their relationship being positive and statistically significant. This indicates that generally the PIN does not explain portfolio returns, but only useful for detecting the private-information risk that occurs during an extremely short period of time. Third, the KRX data reflects positive correlations between buyer-initiated trade and seller-initiated trade. However, the EHO-PIN model reflects negative ones, whereas the DY-AdjPIN model shows the same positive correlations as the real world results from using KRX data. This indicates that the EHO model should be revised in order to explain the empirically stylized facts found in both the KRX and US exchanges. Fourth, in contrast to PIN, the relationship between AdjPIN and portfolio excess returns is statistically significant at a 1% level from cross-sectional regressions. Although the AdjPIN does not explain the stock returns in NYSE and AMEX in DY (2007), it does seem to do so in the KRX; a difference of 10 percentage points in AdjPIN between two stocks amounts to the difference in required rate of returns of 1.20 percent per month.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7019920ff40baab0dee0b4eba038d3c3",
  "timestamp": "2025-05-15T03:27:53.393628"
}