{
  "id": 6036,
  "title": "The association between perceived discrimination in midlife and peripheral neuropathy in a population-based cohort of women: the Study of Women's Health Across the Nation",
  "abstract": "Purpose: Peripheral neuropathy (PN) is a highly prevalent condition with serious sequelae. Many studies of the condition have been restricted to populations with diabetes, limiting evidence of potential contributing risk factors including salient psychosocial risk factors such as discrimination. Methods: The longitudinal Study of Women's Health Across the Nation was used to assess the relationship between perceived discrimination and prevalent PN in 1718 ethnically diverse midlife women. We used multivariable logistic regression to determine the association between perceived discrimination (Detroit Area Study Everyday Discrimination Scale) and PN (symptom questionnaire and monofilament testing) and conducted an assessment of the mediating effects of body mass index (BMI). Results: The prevalence of PN was 26.1% in the total sample and 40.9% among women with diabetes. Women who reported perceived discrimination had 29% higher odds of PN compared with women who did not report perceived discrimination (95% confidence interval, 1.01-1.66). Approximately 30% of the total effect of discrimination on PN was mediated indirectly by BMI. Conclusions: More research is needed to determine the contributing factors to nondiabetic PN. Our findings reaffirm the impact of financial strain, BMI, and diabetes as significant correlates of PN and highlight discrimination as an important risk factor. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "702176aa927f862186d2262f6a0547a1",
  "timestamp": "2025-05-15T02:54:03.426753"
}