{
  "id": 3885,
  "title": "Do US states' responses to COVID-19 restore investor sentiment? Evidence from S&P 500 financial institutions",
  "abstract": "This paper specifically investigates the effects of US government emergency actions on the investor sentiment-financial institution stock returns relationship. Despite attempts by many studies, the literature still provides no answers concerning this nexus. Using a new firm-specific Twitter investor sentiment (TS) metric and performing a panel smooth transition regression for daily data on 66 S&P 500 financial institutions from January 1 to December 31, 2020, we find that TS acts asymmetrically, nonlinearly, and time varyingly according to the pandemic situation and US states' responses to COVID-19. In other words, we uncover the nexus between TS and financial institution stock returns and determine that it changes with US states' reactions to COVID-19. With a permissive government response (the first regime), TS does not impact financial institution stock returns; however, when moving to a strict government response (the overall government response index exceeds the 63.59 threshold), this positive effect becomes significant in the second regime. Moreover, the results show that the slope of the transition function is high, indicating an abrupt rather than a smooth transition between the first and second regimes. The results are robust and have important policy implications for policymakers, investment analysts, and portfolio managers.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "702a4515ccd2309813742d8821f22298",
  "timestamp": "2025-05-15T01:21:41.420401"
}