{
  "id": 8767,
  "title": "Students with Food Insecurity Are More Likely to Screen Positive for an Eating Disorder at a Large, Public University in the Midwest",
  "abstract": "Background College students experience a disproportionately high prevalence of both food insecurity and eating disorders. Food insecurity is associated with stress, irregular eating patterns, weight change, depression, and body dissatisfaction, making it a possible risk factor for the onset of eating disorders. However, the association between food insecurity and eating disorders among college students is not well understood. Objective This study explored the relation between food insecurity and screening positive for an eating disorder among students attending a large, public Midwestern university. Design Cross-sectional data were collected using an online survey administered from March through June 2018. Participants/setting Participants were recruited from a random sample of 2,000 students, with oversampling from the following groups: racial/ethnic minorities, first-generation students, and students from lower-income households. Of those sampled, 851 students (43%) responded. The final analytic sample comprised 804 students after excluding those with missing data. Main outcome measure The validated 5-item Sick, Control, One stone, Fat, Food (SCOFF) questionnaire was used to screen for the presence of an eating disorder. Statistical analyses performed Poisson regression was used to model prevalence ratios for positive SCOFF screens ( 2 affirmative responses) by levels of food security (ie, high, marginal, low, or very low). Models were adjusted for sex, age, race/ethnicity, degree type, financial aid, and first-generation student status. Results Compared to students with high food security, a higher prevalence of positive SCOFF screens was found among students with marginal food security (prevalence ratio [PR], 1.83, 95% CI 1.26 to 2.65; P = 0.001), low food security (PR 1.72, 95% CI 1.16 to 2.54; P = 0.007), and very low food security (PR 2.83, 95% CI 2.01 to 3.97; P < .0001). Conclusions Students with food insecurity at any level were more likely to screen positive for an eating disorder via the SCOFF questionnaire. Prospective studies are needed to determine whether food insecurity is a risk factor for the onset of eating disorders among college students. J Acad Nutr Diet. 2021;121(6):1115-1124.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70464521657e2dabc80fc1112f9c6bf9",
  "timestamp": "2025-05-15T03:22:25.972483"
}