{
  "id": 6068,
  "title": "Social Risk and Acute Health Care Utilization Among Insured Adults",
  "abstract": "Importance Millions of Americans are impacted by adverse social risk factors such as financial strain, housing instability, and food insecurity. A better understanding of if and how these factors are associated with acute care utilization is needed. Objective To examine the association between exposure to social risk factors and emergency department (ED) visits and hospitalizations among a sample of insured adults. Design, Setting, and Participants This cohort study used US health data from a national initiative that employed a multistage, stratified sampling framework across 8 regional markets of an integrated health care delivery system. Eligible participants were insured adults who responded to health surveys. Population-based samples were taken proportionate to the sex and age distribution of each market. Exposures Validated survey questions captured social risk exposure (positive screening for financial strain, housing instability, and/or food insecurity) during the past year; across 2 survey waves (2020, 2022). Self-reported social risk was categorized into mutually exclusive risk levels, social risk vs no social risk. Main Outcomes and Measures Primary outcome was acute health care utilization defined as time to the first event (ED visit, hospitalization) observed following the first survey completion (January 2020 to July 2023). Weighted Cox proportional hazards regression examined the association between social risk and subsequent care utilization, adjusting for demographic and clinical covariates. Results The analytic cohort included 9785 survey respondents. The weighted cohort data (mean age, 48.4 years [95% CI, 47.9-48.9 years]) included 54.1% female respondents (95% CI, 52.3%-55.9%); 14.6% of the sample were Asian (95% CI, 13.3%-16.0%), 8.1% Black (95% CI, 7.3%-9.1%), 27.1% Hispanic (95% CI, 25.5%-28.8%), and 43.6% non-Hispanic White (95% CI, 41.2%-44.7%); and 50.3% reported exposure to 1 or more social risk factor. During the follow-up period (median [IQR], 3.48 [3.01-3.50] years), 25.4% (95% CI, 22.9%-28.1%) and 10.3% (95% CI, 8.9%-11.9%) of the cohort experienced an ED visit and hospitalization, respectively. Utilization rates varied by level of social risk exposure. Respondents who reported any social risk had a 21% higher risk of an ED visit compared with those with no social risk exposure (adjusted hazard ratio [HR], 1.21 [95% CI, 1.03-1.41]). Social risk was not associated with hospitalizations (adjusted HR, 1.05 [95% CI, 0.84-1.32]). Conclusions and Relevance In this cohort of 9785 adults, the significant association between social risk and time to first ED event warrants future study to determine if improved social risk are associated with lower ED utilization.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "704c1a14d9a32bbb98f359a99da8ec90",
  "timestamp": "2025-05-15T02:54:38.736946"
}