{
  "id": 7451,
  "title": "Earnings and work loss after colon and rectal cancer: a Swedish nationwide matched cohort study",
  "abstract": "Background Colorectal cancer is common and prognosis is improving. The conditions of survivors of treatment, including financial consequences, are thus important. The aim of this study was to quantify loss of earnings and work loss in working-age patients with colon and rectal cancer relative to matched comparators. Methods The study utilised data from the CRCBaSe database that is generated from the nationwide Swedish ColoRectal Cancer Register and includes data from several Swedish nationwide registers. The study period was 1995-2020 for rectal cancer patients and 2007-2020 for colon cancer patients. A retrospective population-based nationwide cohort study on earnings, disposable income, and work loss, in survivors of stage I-III colorectal cancer treatment was undertaken. Median regression was used to analyse earnings and disposable income, and logistic regression to analyse the probability of work loss. Findings A cohort of 8863 colorectal cancer survivors diagnosed before 2017 and 52,514 comparators matched on birth year, legal sex, and county of residence, was analysed. There was a clear reduction in earnings between the calendar year prior to and the calendar year after diagnosis, from 31,319 to 23,924 for colon cancer patients and from 32,636 to 22,647 for rectal cancer patients, and earnings never fully recovered during the 5-year follow-up. Disposable income was practically unaltered. The probability of work loss increased in the calendar year of diagnosis, from 29.8% to 25.3% the previous year to 83.3% and 84.4% for colon and rectal cancer patients respectively, and never fully recovered. The probability of work loss was similar between colon and rectal cancer survivors, but was higher among patients with rectal cancer who had received neoadjuvant therapy. Interpretation This study shows that despite an extensive welfare system providing maintained disposable income, there is a financial burden in the form of increased risk of work loss and a reduction in earnings among survivors of colorectal cancer. Funding The study was supported by the Swedish Cancer Society, the Swedish Cancer and Allergy Foundation, and the Stockholm Cancer Society, and supported by grants provided by the Regional Agreement on Medical Training and Clinical Research (ALF) between the Stockholm County Council and Karolinska Institutet. Copyright (c) 2024 The Author(s). Published by Elsevier Ltd. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7050174517c09d5cc4d16efe7233bb28",
  "timestamp": "2025-05-15T03:08:37.964411"
}