{
  "id": 2477,
  "title": "The impacts of innovative and competitive abilities of SMEs on their different financial risk concerns: System approach",
  "abstract": "Research background: The lack of financial resources of small and medium enterprises (SMEs) make them face high financial risk. Their entrepreneurial abilities that belong to Re-source-based View (RBV), such as innovativeness and competitiveness, might reduce SMEs' financial risk because those entrepreneurial abilities increase the financial performance of businesses.Purpose of the article: This paper aims to investigate the effects of the innovativeness and competitiveness of SMEs on their financial concerns based on financial risk, including bank-ruptcy, financial performance, and financial risk management.Methods: The authors use a method of data analysis and synthesis, including advanced knowledge and digital processing of background studies. This paper examines 1221 SMEs from the Czech Republic, Slovakia, and Hungary. Those firms are chosen by random sam-pling method from Cribis and the Budapest Chamber of Commerce databases. Then the re-searchers directed an online questionnaire to collect the research data from the randomly selected firms. The researchers use Ordinal Logistic Regression Test for analysis purposes.Findings & value added: This paper's results indicate that SMEs' competitiveness does not impact SMEs' bankruptcy prediction, financial performance, or financial risk management. On the other hand, while more innovative SMEs are less likely to face bankruptcy issues than less innovative SMEs, less innovative SMEs indicate better financial performance than their more innovative counterparts. Since this paper focuses on the influences of intangible assets of SMEs (such as characteristics based on RBV and Entrepreneurial Orientation) on their tangible assets (financial performance etc.) and puts emphasis on this fact from an International per-spective, this paper makes a significant contribution to the literature. Furthermore, analyzing multiple relationships between SMEs' different entrepreneurial characteristics and various financial risk concerns is another important fact that might draw prospective readers' atten-tion.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7052dd4828f3c8fea722fb354207e560",
  "timestamp": "2025-05-15T02:15:59.825100"
}