{
  "id": 229,
  "title": "A New Method and Model for the Estimation of Residual Value of Agricultural Tractors",
  "abstract": "The residual value of a tractor affects the cost of ownership. As there is not much transactional information available for used tractors, nor is there a history of new tractor prices, existing studies struggle to forecast the residual value of agricultural tractors. This is made even more challenging by the emission-regulation-related tractor price increase, low inflation in recent decades, and the complexity of the portfolio offerings from manufacturers. Using the new equivalent tractors, grouped by families of similar characteristics, bypasses these challenges and enables us to obtain larger data sets. These large data sets can be forecasted using transparent linear power regressions that offer the lowest root mean squared error (RMSE = 1.5574) and the highest combined, adjusted coefficient of determination (RSqAdj = 0.8457), outperforming all previously tested studies as well as the ensemble, Gaussian process regression, kernel, linear regression, neural network, support vector machine, and decision tree models. The accessibility of the public information required, as well as its processing using mainstream software through a model that is simple to use, yet robust, enables any stakeholder (manufacturers, sellers, financers, insurers, and, most of all, users) to reliably determine the residual value of an agricultural tractor, empowering them to make fact-based, cost-of-ownership-optimized decisions.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70571cf0c67c26ea50279565ca992c8f",
  "timestamp": "2025-05-15T00:40:34.214833"
}