{
  "id": 5692,
  "title": "The Association Between Household Financial Burden and Patient Mobility and Their Impact on Loss to Follow-Up Among Multidrug-Resistant Tuberculosis Patients in Guizhou, China",
  "abstract": "Purpose: We aimed to assess the household financial burden due to multidrug-resistant tuberculosis (MDR-TB) treatment and its predictors, examine its association with patient mobility, and test their impact on patient loss to follow-up (LTFU). Methods: A cross-sectional study combining follow-up data collection was conducted at the largest designated MDR-TB hospital in Guizhou. Data were collected from medical records and questionnaires. Household financial burden was measured by the incidence of 2 indicators: catastrophic total costs (CTC) and catastrophic health expenditure (CHE). Mobility was classified as mover or non-mover after the patient's address was verified twice. A multivariate logistic regression model was used to identify associations between variables. Model I and Model II were separated by CHE and CTC. Results: Out of 180 households, the incidence of CHE and CTC was 51.7% and 80.6%, respectively. Families with low income and patients who were primary income earners were significantly associated with catastrophic costs. 42.8% of patients were movers. Patients from households with CHE (ORadj=2.2, 95% CI: 1.1-4.1) or with CTC (ORadj=2.6, 95% CI: 1.1-6.3) were more likely to move. Finding a job against financial difficulty (58.4%) was the top reason for movers. 20.0% of patients experienced LTFU. Patients from households with catastrophic payments (CHE: ORadj=4.1, 95% CI 1.6-10.5 in Model I; CTC: ORadj=4.8, 95% CI 1.0-22.9 in Model II), patients who were movers (ORadj=6.1, 95% CI 2.5-14.8 in Model I; ORadj=7.4, 95% CI 3.0-18.7 in Model II) and primary income earners (ORadj=2.5, 95% CI: 1.0-5.9 in Model I; ORadj=2.7, 95% CI 1.1-6.6 in Model II) had an increased risk of LTFU. Conclusion: There is a significant association between household financial burden due to MDR-TB treatment and patient mobility in Guizhou. They impact patients' treatment adherence and cause LTFU. Being a primary breadwinner increases the risk for catastrophic household payments and LTFU.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "705bd5cd0d187f982a4e1d67ead6071c",
  "timestamp": "2025-05-15T02:50:21.302448"
}