{
  "id": 434,
  "title": "Estimating assortment size effects on platforms: Leveraging imperfect geographic targeting for causal inference",
  "abstract": "Customers of two-sided platforms may succumb to choice overload due to the frequently overwhelming assortment in such markets. We investigate the effect of assortment size on consumers' purchase probability using a unique click-stream dataset from a large peer-to-peer meal delivery platform. To resolve the key endogeneity challenge that assortment size may be larger in areas where consumers experience greater utility from purchase, we introduce a novel causal inference strategy that exploits a common but imperfect geographic targeting tool employed by the platform: limiting kitchens to a set of fixed delivery radii. We argue and show through simulation exercises that true assortment size effects on purchase probability can be estimated when we employ clustering algorithms to recover and account for neighborhoods that may be targeted by suppliers. Applying our causal inference strategy to the home-cooked delivery setting, we find that purchase rate effects of assortment size are rapidly diminishing. In fact, our findings suggest that up to 18% of active users experience choice overload. These effects persist despite accounting for potential pricing, assortment variety, and personalization confounds and are robust to nonparametric specifications and accounting for unobserved heterogeneity in assortment effects. We further document the novel moderating role of new-to-user and off-platform options on assortment size effects.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70981051ec352441ed3f06a2bc1b64cd",
  "timestamp": "2025-05-15T01:31:50.772659"
}