{
  "id": 5413,
  "title": "The Impact of Medicare Coverage on Downstream Financial Outcomes for Adults Who Undergo Surgery",
  "abstract": "Objective: To evaluate the effects of gaining access to Medicare on key financial outcomes for surgical patients. Summary Background Data: Surgical care poses a significant financial burden, especially among patients with insufficient financial risk protection. Medicare may mitigate the risk of these adverse circumstances, but the impact of Medicare eligibility on surgical patients remains poorly understood. Methods: Regression discontinuity analysis of national, cross-sectional survey and cost data from the 2008 to 2018 National Health Interview Survey and Medical Expenditure Panel Survey. Patients were between the ages of 57 to 72 with surgery in the past 12 months. The primary outcomes were the presence of medical debt, delay/deferment of care due to cost, total annual out-of-pocket costs, and experiencing catastrophic health expenditures. Results: Among 45,982,243 National Health Interview Survey patients, Medicare eligibility was associated with a 6.6 percentage-point decrease (95% confidence interval [CI]: -9.0% to -4.3) in being uninsured (>99% relative reduction), 7.6 percentage-point decrease (24% relative reduction) in having medical debt (95%CI: -14.1% to -1.1%), and 4.9 percentage-point decrease (95%CI: -9.4% to -0.4%) in deferrals/delays in medical care due to cost (28% relative reduction). Among 33,084,967 Medical Expenditure Panel Survey patients, annual out-of-pocket spending decreased by $1199 per patient (95%CI: -$1633 to -$765), a 33% relative reduction, and catastrophic health expenditures decreased by 7.3 percentage points (95%CI: -13.6% to -0.1%), a 55% relative reduction. Conclusions: Medicare may reduce the economic burden of healthcare spending and delays in care for older adult surgical patients. These findings have important implications for policy discussions regarding changing insurance eligibility thresholds for the older adult population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70adf98204caa1a82dc2f6271f17cac1",
  "timestamp": "2025-05-15T02:47:42.861900"
}