{
  "id": 6303,
  "title": "Frequency and correlates of unintended pregnancy risk perceptions",
  "abstract": "Objectives: This study is to assess frequency and correlates of women's reports of unintended pregnancy risk in the general population in France. Study design: Data are drawn from the FECOND survey, a national probability survey on sexual and reproductive health conducted in France in 2010. We identified 2969 women ages 15-49 years who had heterosexual intercourse in the 4 weeks prior to the survey and who were at potential risk of unintended pregnancy. We evaluate women's reports of unintended pregnancy risk in the last 4 weeks and identify correlates of such reports using logistic regression modeling. Results: Fifteen percent of women thought that they could have become pregnant in the last 4 weeks without wanting to do so. Reports of unintended pregnancy risk were higher among women in very difficult financial situations (OR=1.87 [1.32-2.65]) and foreign-born women (OR=1.53 [1.03-2.29]). Exposure in the form of contraceptive practices and errors in use of contraception were the strongest correlates of women's reports of unintended pregnancy risk, yet among the 9.8% of women who reported inconsistent use of contraception or unprotected intercourse in the last 4 weeks, 63% did not think they could have become pregnant unintentionally. Conclusions: Significant discrepancies between pregnancy exposure and women's report of unintended pregnancy risk call for better SRH educational programs to improve pregnancy awareness in the general population. On the other hand, targeted interventions toward women who report being at risk of unintended pregnancy may contribute toward reducing unintended pregnancies given the frequency of such events. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70b096cf118afe14e19e48a1378a3624",
  "timestamp": "2025-05-15T02:56:37.515679"
}