{
  "id": 4278,
  "title": "Chronic kidney disease: detect, diagnose, disclose-a UK primary care perspective of barriers and enablers to effective kidney care",
  "abstract": "Chronic kidney disease (CKD) is a global public health problem with major human and economic consequences. Despite advances in clinical guidelines, classification systems and evidence-based treatments, CKD remains underdiagnosed and undertreated and is predicted to be the fifth leading cause of death globally by 2040. This review aims to identify barriers and enablers to the effective detection, diagnosis, disclosure and management of CKD since the introduction of the Kidney Disease Outcomes Quality Initiative (KDOQI) classification in 2002, advocating for a renewed approach in response to updated Kidney Disease: Improving Global Outcomes (KDIGO) 2024 clinical guidelines. The last two decades of improvements in CKD care in the UK are underpinned by international adoption of the KDIGO classification system, mixed adoption of evidence-based treatments and research informed clinical guidelines and policy. Interpretation of evidence within clinical and academic communities has stimulated significant debate of how best to implement such evidence which has frequently fuelled and frustratingly forestalled progress in CKD care. Key enablers of effective CKD care include clinical classification systems (KDIGO), evidence-based treatments, electronic health record tools, financially incentivised care, medical education and policy changes. Barriers to effective CKD care are extensive; key barriers include clinician concerns regarding overdiagnosis, a lack of financially incentivised care in primary care, complex clinical guidelines, managing CKD in the context of multimorbidity, bureaucratic burden in primary care, underutilisation of sodium-glucose co-transporter-2 inhibitor (SGLT2i) medications, insufficient medical education in CKD, and most recently - a sustained disruption to routine CKD care during and after the COVID-19 pandemic. Future CKD care in UK primary care must be informed by lessons of the last two decades. Making step change, over incremental improvements in CKD care at scale requires a renewed approach that addresses key barriers to detection, diagnosis, disclosure and management across traditional boundaries of healthcare, social care, and public health. Improved coding accuracy in primary care, increased use of SGLT2i medications, and risk-based care offer promising, cost-effective avenues to improve patient and population-level kidney health. Financial incentives generally improve achievement of care quality indicators - a review of financial and non-financial incentives in CKD care is urgently needed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70b227c5fa8b086d86accc1abd45981e",
  "timestamp": "2025-05-15T02:35:26.256068"
}