{
  "id": 8064,
  "title": "High occurrence of food insecurity in young people attending a youth mental health service in regional Australia",
  "abstract": "Aim Despite the relationship between food insecurity and poor mental health, food insecurity in young people attending mental health services in Australia remains understudied. This study aimed to determine the occurrence and predictors of food insecurity, and the relationship with dietary factors in young people attending a mental health service. Methods A cross-sectional online survey was conducted in a sample of young people (15-25 years) who attended a mental health service in Launceston, Australia. The survey utilised a single-item food insecurity screening tool and eight demographic, health and service use questions. Five questions determined self-reported intake of fruit, vegetables, breakfast, water, sugar-sweetened beverages and takeaway foods. Binary logistic regression determined predictors of food insecurity. Cross-tabulations determined differences in dietary intake according to food security. Results Of survey respondents (n = 48; 68% female), 40% (n = 19) were food insecure. Respondents living out of home or in unstable accommodation were at significantly higher risk of food insecurity (odds ratio [OR]: 4.43; SE: 0.696; 95% CI: 1.13-17.34; p = 0.032) compared to those living with their parents. Those receiving government financial assistance (OR: 5.00; SE: 0.676; 95% CI: 1.33-18.81; p = 0.017) were also at significantly higher risk of food insecurity. Regardless of food security status, self-reported intake of fruits, vegetables and breakfast were low, and respondents regularly consumed takeaway foods and sugar-sweetened beverages. Conclusions There was a high occurrence of food insecurity and poor dietary intake in young people attending a youth mental health service demonstrating that initiatives to support access to healthy food in this group should be a priority, with potential benefits for mental health outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70c13a8dd1ffc8c20d2b6d9980b8a60e",
  "timestamp": "2025-05-15T03:15:09.292935"
}