{
  "id": 9117,
  "title": "Mental health of older people with mild and moderate intellectual disability in Australia",
  "abstract": "Background The progressive increase in life expectancy of people with intellectual disability (ID) has resulted in enhanced survival into old age and has also seen a growth in research on both lifelong and emerging ageing-related health issues. Health issues amongst provider-supported adults have been previously studied, but these studies have not always included older community-dwelling adults with ID. Methods A study examining the extent of mental health of 391 community-dwelling adults with ID age 60 and older in both metropolitan and rural areas of two East Coast Australian states was undertaken using a cross-sectional survey. Examined were a range of demographic (age, sex, living arrangements, employment and socio-economic status) and life (co-morbidities, adverse life events and social support) factors. Data were parsed by two age groupings (60-65: n = 234 and >65: n = 157). Results Findings revealed that older community-dwelling adults with ID have many of the same mental health disorders as do other ageing people, with the exception of significant psychiatric disorders often associated with older age. Over a third (35%: n = 137) reported some one or more mental health disorders. Age, sex, location (rural or urban), financial hardship, social support or type of living arrangement were not statistically significant as risk factors for poor mental health. However, employment status was a clear predictor. Stepwise regression models showed a strong association between mental ill-health and adverse life events and between mental ill-health and multiple physical co-morbidities. Conclusions The cross-sectional nature of the study limits causal inference. The cumulative effect of chronic health conditions and adverse life events cannot be prevented retrospectively. However, greater awareness amongst both health professionals and care staff that older adults with ID have a high likelihood of significant and/or repeated traumas and need better health care to limit physical co-morbidity may assist in providing support that is better tailored to individual needs in older age to reduce the burden of mental ill-health.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70c8b1f28d10aade855d3bfcf3b45a4f",
  "timestamp": "2025-05-15T03:25:54.538974"
}