{
  "id": 2937,
  "title": "How venture capitalists evaluate young innovative company patent portfolios: empirical evidence from Europe",
  "abstract": "Purpose This paper analyzes the importance given by venture capital (VC) firms to the different characteristics of the patent portfolio of a young innovative company (YIC). In an attempt to go beyond previous studies, the authors argue that not only is the size of a technological portfolio significant but also its nature. It is also examined whether the correlation between patents and VC financing varies across different industrial sectors and over different rounds of VC investments. Design/methodology/approach The empirical analysis has focused on a sample of 1,096 European YICs between the years 2010 and 2014. Target companies were identified in the monthly bulletins of Go4Venture, which reported the largest European deals and gathered information on the amount of VC financing. Additional data was derived from FinSMEs and crunchbase. Industrial sectors were differentiated according to their ability to appropriate the returns of innovation by relying on patent protection mechanisms. A multivariate regression framework at the patent family level was adopted to investigate empirical associations between the amount of VC financing and the characteristics of a YIC's patent portfolio. Findings The results confirm the positive value of patents. Both the size and the characteristics of a YIC patent portfolio have been found to be positively associated with the total amount of VC financing. Additionally, the correlation between a YIC patent portfolio and VC investment varies across industries and over rounds of funding. Although the number of patents is positively correlated with VC investments in sectors with strong Intellectual Property (IP) regimes, the same does not apply to sectors characterized by lower patent intensity, where qualitative metrics seem to have a stronger correlation. Significant differences have also been found for the different rounds of VC investments. Research limitations/implications The limitations of this paper are related to data availability. Empirical associations have been investigated, but causal effects cannot be ascertained in this framework. The authors focused on a sample of firms that received VC funding. Several transactions were excluded, due to a lack of specifications pertaining to the round series. Furthermore, a number of potential drivers of the financed amounts, such as variables related to the founder or the management team, have not been considered in this study. Practical implications For firms operating in sectors with weak IP regimes, patents are positively associated with attracting equity capital, if they are the output of R&D collaborations and have higher technical merit. In industries where patent intensity is higher, patent portfolio size matters more than quality. This suggests that VC investors award innovation quality to cases in which patenting is less frequent. Since the results indicate that positive associations between patenting and VC financing are more significant in later stages, managers should plan their patenting strategy in advance to reap the related benefits, and then collect the premium at later VC stages. Originality/value In this paper, the importance given by VC firms to different characteristics of a YIC patent portfolio has been analyzed in terms of size, quality, and complexity. While previous empirical analyses mainly focused on a single sector, the authors have examined whether the relevance of patents for VC financing decisions varies across industries and over different rounds of investment. The geographical coverage of the sample is another novelty of the paper. Previous works focused on a limited number of countries, whereas this research has considered firms operating in several European countries.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70d080ba9c99e4d52d27ba887709a175",
  "timestamp": "2025-05-15T01:11:48.492410"
}