{
  "id": 4125,
  "title": "Overconfidence heuristic-driven bias in investment decision-making and performance: mediating effects of risk perception and moderating effects of financial literacy",
  "abstract": "Purpose This paper aims to show how overconfidence influences the decisions and performance of individual investors trading on the Pakistan Stock Exchange (PSX), with the mediating role of risk perception and moderating role of financial literacy. Design/methodology/approach The deductive approach was used, as the research is based on the theoretical framework of behavioural finance. A questionnaire and cross-sectional design were employed for data collection from the sample of 183 individual investors trading on the PSX. Hypotheses were tested through correlation and regression analysis. The Baron and Kenny method was used to test the mediation effect of risk perception and the moderation effect of financial literacy. The results of mediation and moderation were also authenticated through the PROCESS and structural equation modelling (SEM) technique. Findings The results suggest that risk perception fully mediates the relationships between the overconfidence heuristic on the one hand, and investment decisions and performance on the other. At the same time, financial literacy appears to moderate these relationships. The results suggest that overconfidence can impair the quality of investment decisions and performance, while financial literacy and risk perception can improve their quality. Practical implications The paper encourages investors to base decisions on their financial capability and experience levels and to avoid relying on heuristics or their sentiments when making investments. It provides awareness and understanding of heuristic biases in investment management, which could be very useful for decision makers and professionals in financial institutions, such as portfolio managers and traders in commercial banks, investment banks and mutual funds. This paper helps investors to select better investment tools and avoid repeating the expensive errors that occur due to heuristic biases. They can improve their performance by recognizing their biases and errors of judgment, to which we are all prone, resulting in better investment decisions and a more efficient market. The paper also highlights the importance on relying on professional knowledge, giving it greater weight than feelings and biases. Originality/value The current study is the first to focus on links between overconfidence, financial literacy, risk perception and individual investors' decisions and performance. This article enhanced the understanding of the role that heuristic-driven bias plays in the investment management, and more importantly, it went some way towards enhancing understanding of behavioural aspects and their influence on the investment decision-making and performance in an emerging market. It also adds to the literature in the area of behavioural finance specifically the role of heuristics in investment strategies; this field is in its initial stage, even in developed countries, while, in developing countries, little work has been done.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70f9b29e36f7c8b84a3611b9c8ed8d13",
  "timestamp": "2025-05-15T02:33:42.015312"
}