{
  "id": 5376,
  "title": "Climate risk and split ratings: evidence from Korea",
  "abstract": "This study examines the effects of climate risk on split ratings. Numerous studies have examined the correlation between financial reporting quality and split ratings. However, few studies have explored the effect of business ethics on split ratings. Thus, this study focuses particularly on environmental factors within the broader context of Environmental, Social, and Governance (ESG), that have recently attracted significant attention. We conducted a multiple regression analysis of the impact of climate risk on split ratings using a dataset of companies listed on the Korea Exchange. The analysis indicates that climate risk, which encompasses a firm's greenhouse gas emissions and energy consumption, contributes to the split ratings of corporate bonds. This observation implies that heightened exposure to climate risk amplifies the likelihood of split ratings owing to diminished accounting transparency resulting from practices such as earnings management and a decline in the quality of disclosures. This study not only expands the understanding of the determinants of split ratings theoretically, but also offers investors empirically supported insights into the relevance of considering climate risk in their investment and credit decisions. Furthermore, this suggests the necessity for government policymakers to establish a monitoring system aimed at alleviating potential information asymmetry issues for firms facing elevated climate risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "70fb91ac95073c609e88b4a0d7f728cf",
  "timestamp": "2025-05-15T02:47:13.933093"
}