{
  "id": 8831,
  "title": "Prevalence and Correlates of Physical Inactivity in Community-Dwelling Older Adults in Ireland",
  "abstract": "The public health challenges associated with rapid population ageing are likely to be exacerbated by poor physical activity levels. The purpose of this study was to identify correlates of physical inactivity in a population-representative sample of older adults in Ireland. This paper reports a secondary analysis of data from 4892 adults aged 60+ from the Irish Longitudinal Study on Ageing (TILDA). TILDA includes an assessment of the mental and physical health, and social and financial circumstances of participants assessed in a home interview and self-completion questionnaire. Chi squared statistics and forced entry logistic regression were used to identify factors associated with physical inactivity. Females were over twice as likely to be inactive as their male counterparts (Odds Ratio 2.2). Increasing old age was associated with inactivity among males and females. Those who reported above secondary level education, no reported falls in the last year and no fear of falling were less likely to be physically inactive. While older adults who noted poor/fair self-reported health, that they did not look after grandchildren, did not own a car or did not attend a course were also more likely to be inactive than those who reported positively for these items. Gender displayed a strong but often contrasting influence on factors that affect physical activity among older adults. Among females, living alone or in a rural area, retirement, fair/poor emotional health and activity being limited by illness were all significantly associated with inactivity. While cohabiting, being employed and residing in an urban area were related to low levels of activity in males. Our findings identify specific groups of the older Irish population who may be at particular risk of physical inactivity and thereby the associated physiological and psychological hazards. These results can support the development of tailored interventions to promote healthy ageing.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71249402b4849fe8d21197ed8c0c230b",
  "timestamp": "2025-05-15T03:22:57.896367"
}