{
  "id": 901,
  "title": "Design of Underground Space Intelligent Disaster Prevention System Based on Multisource Data Deep Learning",
  "abstract": "With the rapid development of national economy, the population to big cities gathered themselves together, and especially the first-line cities, lead to city continuously extend outward, city scale is more and more big, the surface space is completely unable to meet the needs of urban development and transportation, the demand such as life, development, and use of underground space has become the important way of solving the urban development diameter. With the vigorous development of underground space, many disaster problems, such as fire and flood, have also appeared in many places, which have brought huge human and financial losses to the society. In order to solve the problem of disaster in underground space, this paper summarizes the main disasters, and urban underground space analysis of the different degrees of the risk of disasters; the emergency toughness of disaster prevention concept, combined with intelligent technology application in urban underground space disaster warning and decision-making, according to the requirement of the underground space of disaster prevention wisdom, put forward to underground space disaster, disaster prevention expert database, such as multisource data fusion. Deep learning is used to realize the linkage of disaster rescue and recovery, and an intelligent disaster prevention system based on deep learning of multisource data is established. The results show that the urban underground space disasters mainly include fire, explosion, earthquake, flood, toxic, and combustible gas. Combining with the overlapping characteristics of different disasters and the inability to define the boundaries, the theory of emergency resilience disaster prevention provides effective suggestions and measures for the decision-making and treatment of underground space fires. The intelligent comprehensive disaster prevention system of urban underground space is established from the three aspects of predisaster prevention, rescue in disaster, and reconstruction after disaster, so as to realize the full coverage of intelligent disaster prevention in the whole life cycle of underground space and provide data support for integrated decision-making of disaster prevention and reduction. The research results have important guiding significance for digitization, informationization, and intelligent construction of sudden disaster decision-making in underground space.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7127ca9dbc08ff5c518c5dd0fff0cdee",
  "timestamp": "2025-05-15T01:43:54.679838"
}