{
  "id": 9171,
  "title": "Dynamic Crop Information System Design and Implementation Based on 3s Technology in Shaanxi Province",
  "abstract": "By using 3s technology, the dynamic crop information system can be developed to meet the needs of sharing the agriculture information in Shaanxi Province. The dynamic crop information system can realize the query of crop information attribute and space, and the automatic acquirement, dynamic distribution and classification analysis of crop information. In this way, the whole process of real-time management of agricultural product with information and visualization can be carried out, which is to improve the level of agriculture information management automation in Shaanxi Province. The main agricultural products in Shaanxi Province consist of two categories, the food crops and the economic crops. The former includes wheat, corn, rice, potato and soybean etc., and the latter includes rape, apple, and pear and so on. Crop production plays an important role in the traditional agriculture in Shaanxi Province. The price of agricultural products has witnessed great fluctuations these days. On the one hand, the price of agricultural products in urban area is very high. On the other hand, the agricultural product is unsalable in some places, which brings great financial losses to those farmers. How to efficiently make use of the land resources, how to ensure the price of agricultural products, how to stabilize the agricultural product, and how to improve comprehensive production capacity, anti-risk ability and the market competition ability of the agricultural product are the urgent problems to be solved. This study adopts the method of combining the GPS, RS and GIS to extract and classify the earth surface information, by which the crop information system can be established. This system can offer the basis for management and masses of users to realize the automatic extraction of agricultural cultivation information. At present, remote sensing technology has been widely used in agriculture, forestry, geology, ocean, meteorology, hydrology, military, environmental protection and many other fields. In terms of agricultural production, remote sensing technology can provide objective, timely and accurate information with great variety of crop ecological environment and crop growth. It is the important source to obtain the field data for precision agriculture",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "712eeb5951fe62e553d799b43b8d03e9",
  "timestamp": "2025-05-15T03:26:25.905691"
}