{
  "id": 4955,
  "title": "Managerial ability and corporate risk-taking in an emerging economy",
  "abstract": "Purpose The existing literature, generally based on US data, provides little evidence that supports whether managerial ability directly links to corporate risk-taking. Hence, this study aims to expand the limited extent by investigating the impact of managerial ability on risk-taking across Saudi firms. Design/methodology/approach This study mainly uses a panel fixed-effects model, including firm-year and firm-industry, to analyse a sample of Saudi non-financial firms from the period 2008 - 2018. In the empirical analysis, the managerial ability is lagged by one year to mitigate endogeneity concerns that may arise from reverse causality. To avoid omitted variables bias, this study includes several firm-level control variables. Findings The empirical results show that the relationships between managerial ability and firm risk-taking measures are negative and statistically significant with the standard deviation of return on assets (sROA) and leverage; positive and statistically significant with the Z-score. These results indicate that firms managed by high-ability executives have the propensities to take less risk. The main results remain robust to additional sensitivity analyses including an alternative measure for managerial ability, an alternative proxy for risk-taking using logistic regression analysis, using financial crises as dummy variables, and using a cross-lagged panel model with fixed effects for endogeneity concerns. Practical implications When evaluating firms, all market and society participants including researchers, regulators, supervisors, policymakers, and boards ought to pay close attention to managerial ability as one of the main factors affecting risk-taking. Originality/value Previously, closely related studies, focussing on the US market, mainly find that managers with high ability are receptive to risk-taking. This paper offers further international insight into the relevant literature by providing evidence that capable managers are inclined to take low risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "714cc493df0c59d56544474b74f36622",
  "timestamp": "2025-05-15T02:42:36.288018"
}