{
  "id": 709,
  "title": "A hybrid model based on iTransformer for risk warning of crude oil price fluctuations",
  "abstract": "In order to reduce the unpredictability of crude oil price fluctuations caused by its increasingly prominent financial and geopolitical attributes, and to minimize its negative impact on the world economy, further research on risk warning models for crude oil price fluctuations is urgently needed. To improve the accuracy of early warning, a multi-factor prediction based risk warning method for crude oil price fluctuations is proposed. This method includes three main steps: (1) Risk factor analysis, which systematically identifies the risk factors of crude oil prices from socio-economic, market, production, and environmental aspects, uses Random Forest algorithm to screen key factors, and predicts future trends through LSTM model; (2) Prediction of crude oil prices, which constructs a prediction model for crude oil prices based on the iTransformer algorithm; (3) Fluctuation risk warning, based on historical volatility, constructs a crude oil price fluctuation risk warning mechanism, and analyzes the warning results. This article takes the historical data of WTI crude oil futures closing prices and risk factors as samples, and the model error comparison results confirm that the warning mechanism has significant superiority in accuracy, which can provide scientific and accurate reference basis for government intervention policies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "715de861fd94ca087173864e904d27e9",
  "timestamp": "2025-05-15T01:41:29.946498"
}