{
  "id": 1373,
  "title": "Faith-based and sin portfolios An empirical inquiry into norm-neglect vs norm-conforming investor behavior",
  "abstract": "Purpose-The purpose of this paper is to investigate relative portfolio performance between sin stock returns and faith-based returns. Design/methodology/approach-Similar to Hong and Kacperczyk, Jensen's alpha was utilized to conduct tests along with three asset-pricing models and rolling regression technique to reveal that faith-based and sin betas move in opposite directions during most of the sample period. Findings-Norm-neglect was found, in that Jensen's alpha is positive and significant for the sin portfolio. Further, evidence in favor of norm-conforming investor behavior was found, where Jensen's alpha is negative and significant for the faith-based portfolio. These findings provide evidence that the sin portfolio outperforms the faith-based portfolio relative to the market. A rolling regression technique reveals that faith-based and sin betas tend to move in opposite directions during most of the sample period. The evidence suggests that faith-based beta has an average estimated beta of one, mimicking the market. The sin portfolio, however, has an average estimated beta of one-half. Finally, the reward-to-risk measure, Sharpe ratio, is statistically higher for the sin portfolio relative to the faith-based portfolio. Originality/ value-This paper contributes to the literature in the following distinct ways. First, three asset-pricing models are estimated to examine Jensen's alpha for sin and faith-based portfolios. Second, a rolling regression procedure is used to examine the dynamic behavior relative to the market of the sin and faith-based portfolios. Third, use is made of the Jobson and Korkie test, which allows for statistical comparisons of Sharpe ratios. Lastly, daily instead of monthly data and a different sample period are used to examine the research questions posed in this study.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "715e0a253f8f471e3ffe005dc93744f8",
  "timestamp": "2025-05-15T00:54:56.518738"
}