{
  "id": 1141,
  "title": "Credit risk assessment of automobile loans using machine learning-based SHapley Additive exPlanations approach",
  "abstract": "In recent years, artificial intelligence, especially machine learning methods, have been increasingly applied to the accurate prediction of various loan risks. However, the integration of these models into legal frameworks and technology deployment is hindered due to their so-called black-box nature. This paper aims to explore the credit risk assessment of automobile loans using machine learning-based SHapley Additive exPlanations approach. It examines the automobile loan data from a specific Chinese automobile finance company, applying a logistic regression model as the foundation, and integrates the eXtreme Gradient Boosting with SHapley Additive exPlanations approach to interpret the predictive outcomes. The SHapley Additive exPlanations approach effectively quantifies the contributions of individual features to the predictions, highlighting key features such as credit level, credit score, and disbursed_amount (the amount of loans disbursed) that significantly influence automobile loan risk. The contribution values of these key features to the model prediction results are found to be 0.67, 0.337, and 0.34, respectively. Moreover, the SHapley Additive exPlanations approach not only enhances the interpretability of the model, but also optimizes the accuracy and efficiency of automobile loan risk assessment. This study provides a robust tool for financial institutions, aiding in the reduction of loan risks and fostering the healthy growth of the automobile loan market. The findings are particularly significant in addressing the high delinquency rates of automobile loans in China and offer new perspectives and methodologies for future risk assessment research.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "715e8f43ff3d04f17820fad93e5e6b7c",
  "timestamp": "2025-05-15T01:59:21.637985"
}