{
  "id": 3136,
  "title": "Dynamics of network structure in cryptocurrency markets during abrupt changes in Bitcoin price",
  "abstract": "Network modeling is a powerful approach to study agent interactions that can provide insights into dynamics and behaviors of complex systems. Cryptocurrency market stability can be assessed by analyzing changes in network structures, where cryptocurrencies serve as nodes in the network, and the network's weights of connectivity represent the strength of their relationships. This study examines the roles of weighting methods - correlation, mutual information, and Fisher information distance (FID) - in constructing cryptocurrency networks, and how they perform when abrupt changes occur in the Bitcoin price. Each weighting method offers unique insights into cryptocurrency relationships. Results show that sudden Bitcoin price shifts impact the cryptocurrency network's structures, including characteristic path length, hubs, and minimum spanning trees, providing insights into market stability and clustering behaviors. Additionally, the Granger causality test reveals that the Bitcoin's returns drive the cryptocurrency network's connectivity and structure changes. However, the converse is not true, suggesting that the collective behaviors of cryptocurrencies are strongly influenced by the BTC price movement, but not vice versa. The study highlights weighting methods as valuable tools for network analysis and portfolio management using minimum spanning trees.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "718a91606e71de7be28672f5d955244b",
  "timestamp": "2025-05-15T01:13:45.312859"
}