{
  "id": 7430,
  "title": "Social Network Characteristics and HIV Sexual Risk Behavior among Urban African American Women",
  "abstract": "HIV/AIDS has emerged as a significant health threat for African American women with well-documented disparities. The purpose of this study was to assess the association between social network characteristics and high-risk sexual behaviors among a sample of urban African American women at risk of heterosexually acquired HIV/STIs. We performed a cross-sectional study of baseline data collected from the CHAT study, a randomized HIV-prevention trial targeting urban HIV-at-risk women in Baltimore, MD. Our primary outcomes were risky sexual behaviors defined as either (a) two or more sexual partners or (b) having a risky sex partner within the past 90 days. Bivariable and multivariable logistic regression examining the associations between individual and social network factors and our two outcomes of interest were conducted. The study population included 513 sexually active African American women with a mean age of 41.1 years. High levels of unemployment (89.5%), depressive symptoms (60.0%), and drug use (68.8%) were present among this high-risk urban cohort. Controlling for individual factors including participant drug use, age, and depression, having two or more sex partners within the past 90 days was associated with having a larger personal network (OR=1.11; 95% CI, 1.06 and 1.17); more network members who pitched in to help (OR=1.22; 95% CI, 1.04 and 1.44), provided financial support (OR=1.33; 95% CI, 1.11 and 1.60), or used heroin or cocaine (OR=1.26; 95% CI, 1.14 and 1.40). Having a risky sexual partner within the past 90 days was associated with having a larger social network (OR= 1.06; 95% CI, 1.00 and 1.12) and having more social networks who used heroin or cocaine (OR=1.30; 95% CI, 1.14 and 1.49). In summary, social network characteristics are associated with HIV sexual risk behaviors among African American urban women. Social-network-based interventions that promote norms pertaining to HIV risk reduction and provide social support are needed for African American women at risk of heterosexually acquired HIV/STIs.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "718f5e284c69cc2437c6d29cad355315",
  "timestamp": "2025-05-15T03:08:37.795851"
}