{
  "id": 8201,
  "title": "Impact of parental socioeconomic factors on childhood cancer mortality: a population-based registry study",
  "abstract": "Introduction: Parental socioeconomic status has been proposed to have an influence on childhood cancer mortality even in high-income countries. Our study investigated the influence of parental socioeconomic factors on childhood cancer mortality. Material and methods: We identified 4437 patients diagnosed with cancer under the age of 20 from 1990 to 2009 and their parents from the Finnish cancer and central population registers. Information on death from primary cancer during five-year follow-up and parental socioeconomic factors was obtained from Statistics Finland. Poisson regression modeling was used to estimate hazard ratios (HRs) for factors related to cause-specific mortality and recursive tree based survival analysis to identify important risk factors and interactions. Results: Mortality was lower in the highest quartile of combined parental disposable income (HR 0.68, CI 95% 0.52-0.89) compared to the lowest quartile. In the most recent diagnostic period from 2000 to 2009, highest attained education of either parent being post-secondary predicted lower mortality (HR 0.73, CI 95% 0.60-0.88) compared to parents who had attained primary or lower education. Conclusion: Despite high quality public health care and comprehensive social security, both high parental income and education were associated with lower mortality after childhood cancer. Lower health literacy and financial pressures limiting treatment adherence may explain higher mortality in children with less educated parents and parents with lower income. Motivation and support during treatment and follow-up period is needed concerning the families of these patients.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7191d69877b047b5240d00455c7fa6d8",
  "timestamp": "2025-05-15T03:16:17.438625"
}