{
  "id": 6960,
  "title": "Impact of Surgeon and Hospital Volume on Short-Term Outcomes and Cost of Oropharyngeal Cancer Surgical Care",
  "abstract": "Objective: To evaluate the impact of surgeon and hospital case volume and other related variables on short-term outcomes after surgery for oropharyngeal cancer. Methods: The Maryland Health Service Cost Review Commission database was queried for oropharyngeal cancer surgical case volumes from 1990 to 2009. Multivariable regression models were used to identify significant associations between surgeon and hospital case volume, as well as independent variables predictive of in-hospital death, postoperative wound complications, length of hospitalization, and hospital-related cost of care. Results: Overall, 1,534 oropharyngeal cancer surgeries were performed during the study period. Complete financial data was available for 1,482 oropharyngeal cancer surgeries, performed by 233 surgeons at 36 hospitals. The only independently significant factors associated with the risk of in-hospital death were an APR-DRG mortality risk score of 4 (odds ratio [OR] = 14.0, P<.001) and total glossectomy (OR = 5.6, P=.020). Wound fistula or dehiscence was associated with an increased mortality risk score (OR = 5.9, P<.001), total glossectomy (OR = 6.9, P<.001), mandibulectomy (OR = 3.4, P<.001), and flap reconstruction (OR = 2.1, P=.038). Increased mortality risk score, total glossectomy, pharyngectomy, mandibulectomy, flap reconstruction, neck dissection, and Black race were associated with an increased length of stay and hospital-related costs. After controlling for all other variables, a statistically significant negative correlation was observed between surgery at a high-volume hospital and length of hospitalization and hospital-related costs. Conclusions: After controlling for other factors, high-volume hospital care is associated with a shorter length of hospitalization and lower hospital-related cost of care for oropharyngeal cancer surgery.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71b06322e2607e02d8a85f0edbd23ddb",
  "timestamp": "2025-05-15T03:03:13.553311"
}