{
  "id": 3077,
  "title": "How the COVID-19 pandemic changed Italians' financial risk tolerance",
  "abstract": "PurposeThis research aims to investigate the impact of exogenous shocks on individuals' risk tolerance, particularly when originating outside the economic or financial sphere. Focusing on Italy as the first Western country affected by COVID-19, this paper explores whether the pandemic led to a decrease in Italians' financial risk tolerance (FRT).Design/methodology/approachThis study used a two-stage approach for data analysis. Initial examination of key variables used linear regression (ordinary least square [OLS]) with robust errors. Subsequently, a system of structural equations (structural equation model [SEM]) was used for a more nuanced exploration of hypothetical relationships between constructs and their observed indicators. SEM addressed reliability issues inherent in OLS, offering a robust analysis of structural models based on specified hypotheses. To assess the impact of COVID-19 on Italians' FRT, the Grable and Lytton Risk Tolerance Scale was used, measuring changes through a scored questionnaire with values ranging from 1 (greater risk aversion) to 4 (greater risk propensity).FindingsThis study used three distinct OLS regression models to analyze the impact of COVID-19 on Italians' FRT, considering mortality, infection and stringency rates. Findings revealed that older individuals exhibited lower risk tolerance across FRT dimensions, consistent with previous research. Men were more risk-prone, aligning with gender-related financial literacy disparities. Married respondents tended to be less risk-tolerant, supporting the idea that marital status influences risk attitude. Education level showed a slightly negative impact on investment risk. Professional instability, lower income and stock market inexperience were associated with lower risk tolerance. Notably, the COVID-19 pandemic had a significant positive effect, making respondents more risk-averse. SEM methodology was used to examine the moderating effects of COVID-19 proxies on FRT changes.Originality/valueThis research brings a novel perspective to the ongoing debate on exogenous shocks' impact on individuals' risk tolerance, particularly when originating outside the economic or financial domain. Focusing on Italy, the first Western country hit by COVID-19, this study uniquely investigates the pandemic's effect on Italians' FRT. With a large and representative sample, the findings contribute significantly to the literature on risk attitude, shedding light on the pandemic's impact. This study's originality lies in providing reliable evidence with policy implications, emphasizing the imperative for government intervention in addressing both health and economic issues in the wake of such external shocks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71d128c381c89dbeb42720433f546311",
  "timestamp": "2025-05-15T02:22:25.080252"
}