{
  "id": 249,
  "title": "A Study on the Impact of Corporate Financial Accounting Management System on Corporate Innovation Under Sustainable Development Strategy",
  "abstract": "In the complex and changeable macro-economy, the sustainable development of enterprises is closely related to their ability to resist risks. To analyze the influencing factors of listed enterprises' anti risk ability, this study constructs an indicator system of influencing variables through principal component analysis. The financial risk early warning method based on improved RBF neural network is constructed. Afterwards, the relevance of the indicator system was confirmed by the Kaiser-Meyer-Olkin (KMO) test. And in simulation experiments, it compared the classification performance of the BP neural network and the improved RBF model combined with the clustering algorithm. In the training dataset, the classification accuracy of the BP neural network was 79.6% while that of the improved RBF model was as high as 93.6%. In the 30 test datasets, the BP neural network appeared to have seven false positives. In the 30 test datasets, the BP neural network produced seven false judgments, while the proposed method only had three judgment errors. Several experiments showed that the BGD-RBF financial risk early warning model effectively maintained a high performance in the classification accuracy of enterprise financial status. It is more reliable than the traditional BP neural network method.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71d904b1e83dfaf340f81fd1e9bc0d3f",
  "timestamp": "2025-05-15T01:48:30.789869"
}