{
  "id": 3189,
  "title": "Randomness, Informational Entropy, and Volatility Interdependencies among the Major World Markets: The Role of the COVID-19 Pandemic",
  "abstract": "The main purpose of our paper is to evaluate the impact of the COVID-19 pandemic on randomness in volatility series of world major markets and to examine its effect on their interconnections. The data set includes equity (Bitcoin and Standard and Poor's 500), precious metals (Gold and Silver), and energy markets (West Texas Instruments, Brent, and Gas). The generalized autoregressive conditional heteroskedasticity model is applied to the return series. The wavelet packet Shannon entropy is calculated from the estimated volatility series to assess randomness. Hierarchical clustering is employed to examine interconnections between volatilities. We found that (i) randomness in volatility of the S&P500 and in the volatility of precious metals were the most affected by the COVID-19 pandemic, while (ii) randomness in energy markets was less affected by the pandemic than equity and precious metal markets. Additionally, (iii) we showed an apparent emergence of three volatility clusters: precious metals (Gold and Silver), energy (Brent and Gas), and Bitcoin and WTI, and (iv) the S&P500 volatility represents a unique cluster, while (v) the S&P500 market volatility was not connected to the volatility of Bitcoin, energy, and precious metal markets before the pandemic. Moreover, (vi) the S&P500 market volatility became connected to volatility in energy markets and volatility in Bitcoin during the pandemic, and (vii) the volatility in precious metals is less connected to volatility in energy markets and to volatility in Bitcoin market during the pandemic. It is concluded that (i) investors may diversify their portfolios across single constituents of clusters, (ii) investing in energy markets during the pandemic period is appealing because of lower randomness in their respective volatilities, and that (iii) constructing a diversified portfolio would not be challenging as clustering structures are fairly stable across periods.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71ea8aa9630978ddd096a2e413457edb",
  "timestamp": "2025-05-15T01:14:16.327539"
}