{
  "id": 3335,
  "title": "Developing Image-Based Classification Techniques to Analyse Customer Behaviour",
  "abstract": "Banks, investment firms and other financial service providers are required to safeguard customers from unsuitable financial products under Know Your Customer (KYC) regulation, such as FCA Sect. 5.2. Recent work has proposed to model a customer's risk profile as a heatmap, which can be used to calculate a risk score by classifying the image via a CNN and extracting geometric features from it using contour detection. This provides an interpretable approach to analysing customer spending behaviour. However, there is a lack of comparative evaluation in the literature of alternative classification techniques to the heatmap representation, which is the focus of our paper. The heatmap model evaluated by this study achieved an F1 score of 94.6% when classifying heatmap geometry, far outperforming other configurations, including state-of-the-art algorithms typically employed for TSC such as HIVE-COTE, as well as alternative image-transform techniques such as Gramian angular fields. Our experiments used a transactional dataset produced by Lloyds Banking Group, a major UK retail bank, via agent-based modelling (ABM). This data was computer generated and at no point was real transactional data shared. This study shows that a grouped CNN model paired with the heatmap representation is superior to conventional time series classification and image-transform methods at classifying customer spending.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "71ffaa089cc955a5aeb34675e1c81f6d",
  "timestamp": "2025-05-15T02:25:13.703552"
}