{
  "id": 5407,
  "title": "Financial impact of electric scooters: a review of injuries over 27 months at an urban level 1 trauma center (cost of e-scooter injuries at an urban level 1 trauma center)",
  "abstract": "Background Electric scooters (e-scooters) have become a widespread method of transportation due to convenience and affordability. However, the financial impact of medical care for sustained injuries is currently unknown. The purpose of this study is to characterize total billing charges associated with medical care of e-scooter injuries. Methods A retrospective review of patients with e-scooter injuries presenting to the trauma bay, emergency department or outpatient clinics at an urban level 1 trauma center was conducted from November 2017 to March 2020. Demographic and clinical data were collected. Primary outcomes of interest were total billing charges and billing to insurance (hospital and professional). Multivariable models were used to identify preventable risk factors associated with higher total billing charges. Results A total of 63 patients were identified consisting of 42 (66.7%) males, average age 40.19 (SD 13.29) years and 3.2% rate of helmet use. Patients sustained orthopedic (29%, n=18), facial (48%, n=30) and cranial (23%, n=15) injuries. The average total billing charges for e-scooter clinical encounters was $95 710 (SD $138 215). Average billing to insurance was $86 376 (SD $125 438) for hospital charges and $9 334 (SD $14 711) for professional charges. There were no significant differences in charges between injury categories. On multivariable regression, modifiable risk factors independently associated with higher total billing charges included any intoxication prior to injury ($231 377 increase, p=0.02), intracranial bleeds ($75 528, p=0.04) and TBI ($360 898, p=0.006). Discussion Many patients sustain high-energy injuries during e-scooter accidents with significant medical and financial consequences. Further studies may continue expanding the financial impact of e-scooter injuries on both patients and the healthcare system.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72132a15527d82b4474d4b204439c448",
  "timestamp": "2025-05-15T02:47:14.111023"
}