{
  "id": 9114,
  "title": "Do causes of stress differ in their association with problem drinking by sex in Korean adolescents?",
  "abstract": "Background: Previous studies have focused mainly on whether stress causes present drinking or excessive drinking. However, few studies have been conducted on the relationship between stress and problem drinking in adolescents. The objective of this study was to examine the stress level and the cause of stress related to problem drinking behavior according to sex among Korean youth. Method: Data for this study were pooled from cross-sectional data collected annually from 2007 through 2012 from the Korea Youth Risk Behavior Web-based Survey. A representative sample of 442,113 students from 800 randomly selected middle and high schools in Korea were included. Multiple logistic regression models were used in the analysis. Results: Both male and female students with extremely high stress were more likely to engage in problem drinking than were students with no stress (odds ratios [OR], 1.73 in males and 1.41 in females). The major causes of stress in male students that were associated with problem drinking were conflict with a teacher, trouble with parents, and peer relationships (ORs, 2.47,1.72, and 1.71, respectively), whereas there are no statistically significant association between causes of stress and problem drinking among female students. Considering stress level, Male students with extremely high stress level were associated with problem drinking regardless of causes of stress, while Female students who felt extremely high levels of stress were more likely to engage in problem drinking due to stress from a conflict with parents, peer relationships, appearance, and financial difficulty (ORs, 1.53, 1.53, 1.46, and 1.47, respectively). Conclusion: Adolescents who engage in problem drinking may be affected by different causes of stress according to sex. Thus, appropriate approaches that reflect sex differences will be helpful to alleviate problem drinking in adolescents and educational authorities need to arrange more effective education program for drinking given positive associations between drinking education and problem drinking. (C) 2016 Published by Elsevier Ltd.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7216851e174149910b6c6f52d620705d",
  "timestamp": "2025-05-15T03:25:54.526966"
}