{
  "id": 776,
  "title": "Intelligent decision making and risk management in stock index futures markets under the influence of global geopolitical volatility☆",
  "abstract": "In the context of escalating global geopolitical turmoil, geopolitical risks have increasingly significant impacts on financial markets, particularly intensifying market volatility in China's stock market, which is dominated by individual investors. These risks present substantial challenges for investors and policymakers. Existing research often treats the stock market as a static entity, lacking integration with quantitative decision-making, and relies on traditional methods that may not capture the complexities of market dynamics. This study aims to innovate trading strategies and risk management methods in the stock index futures market to effectively respond to the unknown risks brought about by geopolitical fluctuations. Firstly, we propose an innovative data-driven market state division strategy. By analyzing market data to quantitatively derive cyclical parameters of market states, we effectively reduce the market risks that may arise from subjective choices inherent in traditional methods. Secondly, we design a real-time trading system that combines the Geopolitical Risk Index with commonly used trend and oscillation indicators in the stock market. This system can identify and adapt to the market's changing trends, achieving precise grasp of market dynamics and flexible application of trading strategies. Additionally, we extend the traditional one-dimensional time trend analysis to a multidimensional data-driven perspective by utilizing Convolutional Neural Networks to automatically identify more diverse market features. To enhance the training effectiveness, generalization ability, and robustness of deep learning models, we introduce image augmentation strategies. By repeatedly emphasizing specific features without increasing training complexity, we enhance the model's ability to learn high-level representations, significantly improving overall performance. Through these innovative methods, this study not only deepens the understanding of the relationship between geopolitical risks and financial market dynamics but also provides more precise and scientific data support for financial market decision-making. It lays a solid foundation for the development of risk management and trading strategies in future high-volatility environments.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "721cd76531cba88ab3e87094736a7925",
  "timestamp": "2025-05-15T01:42:44.409902"
}