{
  "id": 6078,
  "title": "Does Country Risk Influence Foreign Direct Investment Inflows? A Case of the Visegrad Four",
  "abstract": "The determinants of FDI inflows have been a subject of unremitting debate in the economic literature over the years. However, the role of country risk has received inadequate attention, especially in the context of the Visegrad countries, which comprise the Czech Republic, Hungary, Poland and Slovakia. Hence, this study examined whether country risk matters for FDI inflows into the Visegrad Four for the period 1991-2020. This study accounted for cross-sectional dependency, structural breaks and heterogeneous slopes in the panel of the four countries by employing the dynamic common correlated effect estimator. Additionally, country-wise fully modified least-squares regression was conducted for each country to test the robustness of the estimates. The empirical results revealed that country risk matters for the FDI inflows into the Visegrad countries, as it has a negative effect on the FDI inflows. Furthermore, both the overall panel and country-wise regressions established that economic and political risks are essential determinants of the FDI inflows, as both have a negative relationship with the FDI inflows. However, financial risk had weak and mixed impacts on the FDI inflows in the overall panel and country-wise regressions, respectively. These research outcomes highlight the need for appropriate macroeconomic and government authorities in the Visegrad economies to enhance the market capabilities of their economies by improving and upholding the social, institutional, corporate and macroeconomic structures, and as a way of achieving better country risk attributes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "722dff6d92d296cd3fc8eb57ca6078b7",
  "timestamp": "2025-05-15T02:54:38.765386"
}