{
  "id": 8274,
  "title": "How Competent are Adolescent Bullying Perpetrators and Victims in Mastering Normative Developmental Tasks in Early Adulthood?",
  "abstract": "A substantive body of literature suggests that those involved in bullying as perpetrators but particularly victims are at greater risk for psychological maladjustment. In comparison, relatively little is known about associations between bullying-victimization and perpetration and mastery of early adult tasks in domains including romantic relationships, education, work, financial competence, and conduct. These links were tested using data from two Dutch cohorts (RADAR-young, n = 497, 43% girls; TRAILS, n = 2230, 51% girls) who reported on victimization and perpetration at age 11 (TRAILS) and 13 (RADAR-young) and mastery of developmental tasks in early adulthood. Unadjusted regression analyses suggested for both cohorts that perpetrators were less likely to abide the law and more likely to smoke. Victims in TRAILS were less competent in the domains of education, work, and finances, and more likely to smoke in RADAR-young. Adjusting for childhood demographics and child intelligence and including psychopathology in the prediction models substantially reduced the strength of associations between bullying involvement and later outcomes in both cohorts; although association were retained between victimization and welfare dependence and perpetration and crime involvement in TRAILS. Parental support did not buffer associations in either sample and neither were gender differences detected. Overall, findings underline that negative outcomes of bullying are not only a concern for victims but also for their perpetrators although involvement in bullying is not a stable predictor of mastery of developmental tasks when childhood demographics, child intelligence, and psychopathology are taken into account.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "724474c4c8d1db0cc02dfe16b7697b93",
  "timestamp": "2025-05-15T03:17:21.460978"
}