{
  "id": 4219,
  "title": "Gender diversity in corporate boardrooms and risk disclosure: Indian evidence",
  "abstract": "Purpose The study aims to pervade the gap in the domain of risk disclosure and gender diversity, which is comparatively uncharted. Gender diversity being a crucial element of corporate governance can deepen understanding on the issue in the backdrop of a developing country such as India, so this study aims to investigate the relationship between gender diversity on board and corporate risk disclosure. Design/methodology/approach Four measures of gender diversity, i.e. BLAU index, SHANNON index, proportion of women directors on board and female dummies, have been deployed to measure gender diversity. The empirical analysis is premised on a sample of S&P BSE 100 index pertaining to the 2018-2019 financial year; which eventually gets reduced to 70 non-financial firms after eliminating 30 financial firms. To examine the impact of gender diversity on corporate risk disclosure, hierarchical regression has been used. Additionally, two-stage least square regression analysis has been performed for checking the endogeneity issues in data and validating the findings of the study. Findings The main findings unveil that gender diversity positively impacts corporate risk disclosure. Confirming the agency theory and resource dependency theory, its alternative measures like BLAU index, SHANNON index, proportion of women directors and female dummy divulged to positively impact corporate risk disclosure. When women dummy has been used, analysis unmasked that firms electing more than one female director on board has a higher positive impact on corporate risk disclosure as compared to firms engaging only one women director on board. Research limitations/implications The study is undertaken in the Indian settings, which has its own set of legislative laws, whereas there is need to reaffirm the relationship applying cross-country analysis. Furthermore, there is huge hollowness in the domain of gender diversity and risk disclosure that calls for empirical evidence to unearth futuristic vision. Practical implications The research presents managerial implications for the managers to promote gender egalitarianism by electing higher quantum of women directors on board to achieve global standards of maintaining higher risk disclosure. Adequate risk disclosure on a gender-diverse board further assures the investors that their interest will remain intact in the organization that meets legal requirements by embracing gender equality in employment. A woman in the boardrooms incarnates transparency through divulgence of risk information, which suffices the informational needs of investors. In addition, the findings insists the regulators towards staunch enforcement of effective corporate governance practice through increasing the proportion of women directors on board as they assist in dispelling risk disclosure, which will avert sceptical ambitions of managers and deconstruct their stereotype attitude towards women. Originality/value This study is a novel contribution in expanding the risk disclosure literature by analyzing the unexplored impact of gender diversity on the extent of corporate risk disclosures in India.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "725687bbfc3a5cfe965533348888cd82",
  "timestamp": "2025-05-15T02:34:48.879169"
}