{
  "id": 3682,
  "title": "A Matter of Principle: Accounting Reports Convey Both Cash-Flow News and Discount-Rate News",
  "abstract": "This paper modifies the standard returns-earnings regression in accounting research to show that financial reports convey both cash-flow news and discount-rate (expected-return) news. The paper points to the realization principle, associated as it is with the resolution of risk, as the accounting feature that conveys expected-return news. The modified returns-earnings regressions indicate that the information so conveyed pertains to priced risk. In corroboration, the paper also shows that the identified expected-return news forecasts changes in both stock return betas and earnings betas, and expected-return news predicts future returns, whereas cash-flow news does not. The analysis yields a number of additional insights: financial statements distinguish expected-return news associated with operations from that associated with financing activities; given accounting information, there is not much news in dividends; and, in comparing the information content of earnings versus cash flows, cash flows largely convey expected-return news rather than cash-flow news. In sum, the paper shows that the objective of the Financial Accounting Standards Board and International Accounting Standards Board to provide information about the amount and uncertainty of future cash flows is (as least, partially) satisfied by accounting principles underlying current financial reporting.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "725f7beca66098d7665da3d40302eedf",
  "timestamp": "2025-05-15T02:29:00.105750"
}