{
  "id": 4323,
  "title": "Application of a hyperspectral camera for in situ plasma-material interaction studies at the linear plasma device PSI-2",
  "abstract": "A hyperspectral camera (HSC-type Specim IQ) has been applied at the linear plasma device PSI-2 under steady-state conditions. The camera has the capacity of hyperspectral imaging (HSI) with the dimension of a data array 512 x 512 x 204 (x, y,lambda) covering the spectral span from 400 to 1000 nm with moderate average spectral resolution (FWHM similar to 7 nm). After radiometric calibration and background/continuum emission subtraction, two main applications of the camera, (i) plasma diagnostics in helium (He) plasmas and (ii) plasma-material interaction studies with tungsten (W) targets in neon (Ne) plasmas, have been carried out. The measurements were complemented by a movable Langmuir double probe system (LP) measuring electron temperature (T-e) and electron density (n(e)) in radial direction r and a fiber-coupled crossdispersion spectrometer with high spectral resolution (Spectrelle) recording neutral He, W, and Ne emission lines over the full plasma column. (i) Two-dimensional (2D) imaging of Te and ne radial profiles in axial direction z of the He plasma column were for the first time obtained by the regression analysis of Te and ne (from LP) and six He I line ratios (from HSC). The spatially resolved plasma parameters covered in these studies range between T-e similar to 0.8-13.4 eV and n(e) similar to 0.2 x 10(18)-3.9 x 10(18) m(-3) and permit a reconstruction of the plasma conditions in PSI-2 in 2D without LP perturbation. (ii) W sputtering was studied in situ in Ne plasmas exposing W target samples (negatively biased at 100 V) under perpendicular Ne plasma impact. Simultaneously, the 2D distributions of W (W I line at 429.5 nm) in front of the target and the 2D Ne plasma distribution (Ne I line at 703.2 nm) were recorded with complete spectral separation as confirmed by the Spectrelle spectrometer. This permits the simultaneous measurement of the neutralWpenetration and its angular distribution induced in the sputtering process and of the impinging plasma distribution. The HSI technique offers, despite a few technical drawbacks, such as the moderate spectral resolution and poor time resolution, a new possibility to distinguish multiple emission lines from plasma and impurities and complements the portfolio of existing Optical Emission Spectroscopy techniques, providing a good compromise regarding spectral, spatial, and temporal resolution.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72697148dc762fd6c42ce6066dbe03c0",
  "timestamp": "2025-05-15T01:25:50.577705"
}