{
  "id": 3399,
  "title": "Upper Echelon Theory Revisited: The relationship between CEO Personal Characteristics and Financial Leverage Decision",
  "abstract": "From the upper echelons perspective, we investigate the financial leverage decision of publicly listed companies in Bursa Malaysia for the period from 2002 to 2011. Using pooled OLS and fixed-effect regressions, we examine the impacts of CEO personal characteristics on financial leverage. Our measures of CEO personal characteristics such as CEO overconfidence based on CEO profile photo, CEO age, and CEO prior experience are significantly and negatively related to leverage. However, CEO education level and CEO tenure are significantly and positively related to leverage. Furthermore, we partition our sample of companies based on CEO age and CEO education level. In the CEO-age group, we find that female CEOs are greater risk takers as compared to male CEOs in Malaysia. With respect to CEO education level, we show that younger CEOs, female CEOs, and longer-serving CEOs are risk takers and more aggressive. This paper contributes to the debate of the UET as well as determinants of leverage decision from several dimensions. First, this is the first study that investigates the impacts of CEO personal characteristics on financial leverage of Malaysian firms. Second, we make the first attempt by classifying CEO certain characteristic (age and educational level) into groups to make a further comparison on the impact of CEO personal characteristics on financial leverage. Third, this study uses a larger data sample and a longer study period than the previous studies in the literature. Fourth, the paper also makes a methodological contribution. This study employs different methods (pooled OLS regression and fixed effects panel regression) for the analysis. It is hoped that the result of this paper can fill the gap of the literature on the relationship between CEO personal characteristics and financial leverage as explained by Upper Echelon Theory. (C) 2015 The Authors. Published by Elsevier Ltd.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72693f32bfec9bc90b5b02af04d50500",
  "timestamp": "2025-05-15T02:25:40.224002"
}