{
  "id": 6666,
  "title": "Older Adults' Likelihood of Participating in Home-Based Cognitive Assessment",
  "abstract": "Introduction: Timely detection of cognitive impairment among older adults has shown to lead to better health and financial outcomes but is hampered by psychological, financial, and physical barriers to participation in cognitive assessment. Home-based cognitive assessment (HBCA) could help overcome some of these barriers. This study aimed to examine older adults' likelihood of participation in HBCA and identify factors predicting this likelihood. Materials and Methods: A cross-sectional online survey distributed through Amazon Mechanical Turk, was used to collect data from adults aged 50 years or older residing in the USA The survey was designed to gauge attitudes toward technology and cognitive assessment and to measure psychological variables including subjective cognitive decline (SCD), depression, and anxiety. Information on income and geographic location (rural vs. suburban and urban) was also collected. Univariate and hierarchical regression analyses were conducted to examine the contributions of these variables to a composite measure of likelihood of participation in HBCA. Results: Complete data were obtained on n = 483 (age 50-79). Approximately, two-thirds of respondents described themselves as likely or very likely to participate in HBCA. In univariate analyses, younger age, higher income, higher technology assessment acceptance scores, and higher SCD burden were associated with higher likelihood of participation. Hierarchical regression revealed significant stepwise increments in explained variance: demographic variables 4.1%, technology acceptance 25.2%, assessment acceptance 15.4%, and SCD burden 1.6%. The contribution of SCD was moderated by sex and found for women but not for men. Discussion/Conclusion: A large proportion of adults aged 50 and above described themselves likely to participate in HBCA. Middle-aged, technology-savvy, higher income adults expressed the most positive attitudes toward this type of service. Of interest is that HBCA may be particularly acceptable among older women with SCD, a group known to be at risk of cognitive decline. Our findings support the expansion of cognitive assessment services to the home setting.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "727892141ba3c0385d55c6cf67ab6bce",
  "timestamp": "2025-05-15T03:00:35.320884"
}