{
  "id": 8037,
  "title": "Improved access to comprehensive emergency obstetric care and its effect on institutional maternal mortality in rural Mali",
  "abstract": "Objective To evaluate the effect of a national referral system that aims to reduce maternal mortality rates through improving access to and the quality of emergency obstetric care in rural Mali (sub-Saharan Africa). Methods A maternity referral system that included basic and comprehensive emergency obstetric care, transportation to obstetric health services and community cost-sharing schemes was implemented in six rural health districts in Kayes region between December 2002 and November 2005. In an uncontrolled before and after study, we recorded all obstetric emergencies, major obstetric interventions and maternal deaths during a 4-year observation period (1 January 2003 to 30 November 2006): the year prior to the intervention (P-1); the year of the intervention (PO), and 1 and 2 years after the intervention (P1 and P2, respectively). The primary outcome was the risk of death among obstetric emergency patients, calculated with crude case fatality rates and crude odds ratios. Analyses were adjusted for confounding variables using logistic regression. Findings The number of women receiving emergency obstetric care doubled between P-1 and P2, and the rate of major obstetric interventions (mainly Caesarean sections) performed for absolute maternal indications increased from 0.13% in P-1 to 0.46% in P2. In women treated for an obstetric emergency, the risk of death 2 years after implementing the intervention was half the risk recorded before the intervention (odds ratio, OR: 0.48; 95% confidence interval, Cl: 0.30-0.76). Maternal mortality rates decreased more among women referred for emergency obstetric care than among those who presented to the district health Centre without referral. Nearly half (47.5%) of the reduction in deaths was attributable to fewer deaths from haemorrhage. Conclusion The intervention showed rapid-effects due to the availability of major obstetric interventions in district health centres, reduced transport time to such centres for treatment, and reduced financial barriers to care. Our results show that national programmes can be implemented in low-income countries without major external funding and that they can rapidly improve the coverage of obstetric services and significantly reduce the risk of death associated with obstetric complications.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7284acf9703bd42abd2a3f37c8e3a617",
  "timestamp": "2025-05-15T03:14:37.344978"
}