{
  "id": 881,
  "title": "Demographic and Metabolic Risk Factors Associated with Development of Diabetic Macular Edema among Persons with Diabetes Mellitus",
  "abstract": "Purpose: Diabetic macular edema (DME), a leading cause of visual impairment, can occur regardless of diabetic retinopathy (DR) stage. Poor metabolic control is hypothesized to contribute to DME development, although large-scale studies have yet to identify such an association. This study aims to determine whether measurable markers of dysmetabolism are associated with DME development in persons with diabetes. Design: Retrospective cohort study. Participants: Using data from the Sight Outcomes Research Collaborative (SOURCE) repository, patients with diabetes mellitus and no preexisting DME were identified and followed over time to see what factors associated with DME development. Methods: Cox proportional hazard modeling was used to assess the relationship between demographic variables, diabetes type, smoking history, baseline DR status, blood pressure (BP), lipid profile, body mass index (BMI), hemoglobin A1C (HbA1C), and new onset of DME. Main Outcome Measures: Adjusted hazard ratio (HR) of developing DME with 95% confidence intervals (CIs). Results: Of 47 509 eligible patients from 10 SOURCE sites (mean age 63 +/- 12 years, 58% female sex, 48% White race), 3633 (7.6%) developed DME in the study period. The mean +/- standard deviation time to DME was 875 +/- 684 days (w2.4 years) with those with baseline nonproliferative DR (HR 3.67, 95% CI: 3.41-3.95) and proliferative DR (HR 5.19, 95% CI: 4.61-5.85) more likely to develop DME. There was no difference in DME risk between type 1 and type 2 patients; however, Black race was associated with a 40% increase in DME risk (HR 1.40, 95% CI: 1.30-1.51). Every 1 unit increase in HbA1C had a 15% increased risk of DME (HR 1.15, 95% CI: 1.13-1.17), and each 10 mmHg increase in systolic BP was associated with a 6% increased DME risk (HR 1.06, 95% CI: 1.02-1.09). No association was identified between DME development and BMI, triglyceride levels, or high-density lipoprotein levels. Conclusions: These findings suggest that in patients with diabetes modifiable risk factors such as elevated HbA1C and BP confer a higher risk of DME development; however, other modifiable systemic markers of dysmetabolism such as obesity and dyslipidemia did not. Further work is needed to identify the underlying contributions of race in DME. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "728ab4a5da6013946e787698703927c7",
  "timestamp": "2025-05-15T01:43:54.573781"
}