{
  "id": 7953,
  "title": "The Efficiency of Human Resources Management During the Disruption and Pandemic Era: An Empirical Study of Indonesian Islamic Banks",
  "abstract": "Human resources are the main factor ensuring the efficiency of the company, especially in the middle of the disruption era and the Covid-19 pandemic. This research adopts the human resource efficiency approach to measure the performance of Indonesian Islamic banks that interact with each other within contextual issues of mega-merger policy in 2020. Samples were taken from twelve full-fledged Indonesian Islamic Banks from 2014 to 2019. The efficiency frontier analysis results show that most Islamic banks within the period of research are operating more on variable returns to scale basis, and only one bank has consistently been able to increase the output of financial intermediation performance proportionally for each additional input of human resources cost. The pooled regression test results on the three bank performance models show that allocation of human resource funds in Islamic banks tends to have more effect on increasing operational profits rather than the distribution of funds to the public through financing mechanisms or investment in Islamic securities. Based on verified models, more innovation in training employees and investing in training costs are needed for employees to have a deeper understanding of the nature of risk-profit of financing and investment activities of Sharia/Islamic banks. Highly skilled employees ensure the future promising performance of Islamic banks to deal with new global-normal.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "728e918cd8794810dbc1e7d4a4b85c83",
  "timestamp": "2025-05-15T03:13:30.715042"
}