{
  "id": 3898,
  "title": "Homecoming of soldiers who are citizens: Re-employment and financial status of returning Army National Guard soldiers from Operations Iraqi Freedom (OIF) and Enduring Freedom (OEF)",
  "abstract": "This study examined civilian employment among Army National Guard soldiers who had recently returned from Operations Iraqi Freedom (OIF) and Enduring Freedom (OEF). Of specific interest were relationships of re-employment and financial difficulties to several conditions, such as amount of social support during and after deployment, combat exposure, negative feelings during and after deployment, and postdeployment adjustment symptoms. Survey data from the Army's Reintegration Unit Risk Inventory were used (4,546 soldiers in 50 units who were deployed during 2010). Few soldiers reported financial difficulties during deployment (7.1% of the sample) and after having returned (11.8%). Of those who reported postdeployment financial difficulties, nearly one-half had reported such difficulties during deployment, and not having resumed the predeployment job was associated with more postdeployment financial difficulties. Logistic regression analyses showed the relative contribution of the study variables to changed financial status, from deployment to postdeployment. Reported deployment support (e.g., trust in the unit chain-of-command and available support) was associated with decreased financial difficulties. In contrast, increased financial difficulties were associated with having seen others wounded or killed in combat. Other postdeployment experiences, such as feelings of anger and frustration and available support, were associated with increased financial difficulties, in addition to alcohol use, trouble sleeping and suicidal thoughts. Implications of results for policy and practice to lessen financial hardships and job loss associated with deployment are discussed.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7296bc8d55dd3cef0bfb9fbc1955bd76",
  "timestamp": "2025-05-15T02:30:58.381756"
}