{
  "id": 8179,
  "title": "Associations of Cigarette Smoking But Not Serum Fatty Acids with Age-related Macular Degeneration in a Japanese Population",
  "abstract": "Purpose: To assess modifiable environmental risk factors and protective factors for age-related macular degeneration (AMD) in a native Japanese population. Design: A case-control study. Participants: We included 422 case-control samples composed of 279 consecutive AMD cases and 143 controls. Methods: Information regarding systemic conditions and lifestyle were documented in each subject by standardized questionnaire including age, gender, smoking history, body mass index (BMI), and history of cardiovascular disease, hypertension, and diabetes. Serum fatty acids profiles were analyzed by gas chromatography performed on blood samples taken from each study participant. Logistic regression and multiple comparison analyses were utilized in this study. Main Outcome Measures: Population-specific information assessing systemic conditions, lifestyle, and serum fatty acid profiles. Results: Among environmental factors analyzed cigarette smoking showed the most significant association with development of all AMD (P<0.00001; odds ratio [OR], 4.06; 95% confidence interval [CI], 2.22-7.43), typical neovascular AMD (P<0.0001, OR, 4.59; 95% CI, 2.29-9.18), and polypoidal choroidal vasculopathy (P<0.001; OR, 4.87; 95% CI, 1.96-12.1). Hypertension and BMI showed a mild association with AMD. Although male prevalence was significantly higher in all case groups than in controls with conventional Scheffe correction, there was no association of gender with AMD development when logistic regression analysis was used to adjust for cigarette smoking. There was no difference in fatty acid profiles, except for a mild association of eicosapentaenoic acid concentration in the all AMD group. Conclusions: In the Japanese population studied, cigarette smoking influenced the risk of AMD but fractionated serum fatty acid levels did not. Although prior reports indicate a male predominance in Japanese patients with AMD, this study demonstrates that cigarette smoking accounts for this confounding bias. In addition, our population-specific data do not demonstrate significant differences in serum fatty acid composition, including omega-3 and omega-6 long chain polyunsaturated fatty acids, in Japanese patients with and without AMD. These results are consistent with the high proportion of smokers in aged Japanese men and the high fish oil intake in this population. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2011; 118: 1082-1088 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72a18b07dc6d51a32ababc93aed06559",
  "timestamp": "2025-05-15T03:16:17.373886"
}