{
  "id": 761,
  "title": "A Study on Early Warning of Financial Indicators of Listed Companies Based on Random Forest",
  "abstract": "Financial crises can have a negative impact on business operations, and in serious cases, they directly affect the survival and growth of a company. Therefore, the study of financial early warning based on financial indicators is particularly important. However, there are still some shortcomings in the current research on financial early warning, for example, it still evaluates the scoring method or only uses a single model to participate in the construction of financial early warning algorithm. In view of the above problems, this study will mainly use the random forest method combined with the decision tree algorithm to study the financial early warning problem of listed companies in China. Firstly, this paper uses the literature review method to analyse the relevant literature and generate the financial indicator system for this study. Subsequently, by collecting the financial data of A-share listed companies in China from 2013 to 2018 as the research object, the importance ranking of financial indicators was generated by using random forest modelling after data preprocessing. On this basis, CART decision tree modelling was applied to generate financial indicator early warning determination rules and analyse them. The results of the study show the importance ranking of financial indicators and the six financial warning rules based on the CART decision tree. Through this research, it is expected to achieve the objective of providing early warning for the risk of financial crisis and to provide constructive financial warning solutions for relevant stakeholders.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72a660917eed9330fb4fa872ad11130b",
  "timestamp": "2025-05-15T01:54:34.188596"
}