{
  "id": 8962,
  "title": "Patterns and predictive factors of loss of the independence trajectory among community-dwelling older adults",
  "abstract": "BackgroundIndependence is related to the aging process. Loss of independence is defined as the inability to make decisions and participate in activities of daily living (ADLs). Independence is related to physical, psychological, biological, and socioeconomic factors. An enhanced understanding of older people's independence trajectories and associated risk factors would enable the develop early intervention strategies.MethodsIndependence trajectory analysis was performed on patients identified in the Unite de Prevention de Suivi et d'Analyse du Vieillissement (UPSAV) database. UPSAV cohort is a prospective observational study. Participants were 221 community-dwelling persons aged >= 75years followed for 24months between July 2011-November 2013 and benefits from a prevention strategy. Data were collected prospectively using a questionnaire. Independence was assessed using the Functional Autonomy Measurement System (Systeme de Mesure de l'Autonomie Fonctionnelle (SMAF)). Group-based trajectory modeling (GBTM) was performed to identify independence trajectories, and the results were compared with those of k-means and hierarchical ascending classifications. A multinomial logistic regression was performed to identify predictive factors of the independence trajectory.ResultsThree distinct trajectories of independence were identified including a Stable functional autonomy (SFA) trajectory (53% of patients), a Stable then decline functional autonomy decline (SDFA) trajectory (33% of patients) and a Constantly functional autonomy decline (CFAD) trajectory (14% of patients). Not being a member of an association, and previous fall were significantly associated of a SDFA trajectory (P<0.01). Absence of financial and human assistance, no hobbies, and cognitive disorder were significantly associated with a CFAD trajectory (P<0.01). Previous occupation and multiple pathologies were predictive factors of both declining trajectories SDFA and CFAD.ConclusionsCommunity-living older persons exhibit distinct independence trajectories and the predictive factors. The evidence from this study suggests that the prevention and screening for the loss of independence of the older adults should be anticipated to maintaining autonomy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "72be66882cbd5a8e2eca05a1195ab558",
  "timestamp": "2025-05-15T03:23:56.204216"
}