{
  "id": 4804,
  "title": "Impact of gender diversity in boardroom on risk-return profile of Indian corporates",
  "abstract": "Purpose The existing literature point that the presence of women directors in a firm reduces its risk. However, the relation between boardroom gender diversity and a firm's return is widely disputed leading to no concrete answer. Some studies mention that women directors have a positive impact on firm performance, whereas, on the other hand, some findings suggest that women directors reduce financial performance. This paper aims to study the relationship of firm risk and return with boardroom gender diversity and the net impact on firm performance in the Indian context. This study uses not only traditional measures of risk and return but also the third measure of risk-adjusted returns to postulate its findings. Design/methodology/approach Based upon the data of the top 100 of the Bombay Stock Exchange-500 firms for the period FY 2009-2010 to FY 2018-2019, this study applied fixed effect panel regression and random effects Tobit regression to examine the effect of board gender diversity on firm performance. Findings The study concludes that firms with women directors on board have lower risk and lower returns. It also results in a higher risk-adjusted return, creating a positive impact on a firm's performance. Originality/value The paper contributes to the existing literature on corporate governance by considering return, risk and risk-adjusted returns in single research to have a holistic measure of firm performance. It provides empirical evidence from one of the largest emerging economies, India where the female director and independent female director have been introduced recently.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7306956614889da64907a56b95babd79",
  "timestamp": "2025-05-15T02:41:00.906599"
}