{
  "id": 5397,
  "title": "Exploring the determinants of distress health financing in Cambodia",
  "abstract": "Borrowing is a common coping strategy for households to meet healthcare costs in countries where social health protection is limited or non-existent. Borrowing with interest, hereinafter termed distress health financing or distress financing, can push households into heavy indebtedness and exacerbate the financial consequences of healthcare costs. We investigated distress health financing practices and associated factors among Cambodian households, using primary data from a nationally representative household survey of 5000 households. Multivariate logistic regression was used to determine factors associated with distress health financing. Results showed that 28.1% of households consuming healthcare borrowed to pay for that healthcare with 55% of these subjected to distress financing. The median loan was US$125 (US$200 for loans with interest and US$75 for loans without interest). Approximately 50.6% of healthcare-related loans were to pay for the costs of outpatient care in the past month, 45.8% for inpatient care and 3.6% for preventive care in the past 12months. While the average period to pay off the loan was 8months, 78% of households were still indebted from loans taken over 12months before the survey. Distress financing is strongly associated with household poverty-the poorer the household the more likely it is to borrow, fall into debt and unable to pay off the debt-even for members of the health equity funds, a national scheme designed to improve financial access to health services for the poor. Other determinants of distress financing were household size, use of inpatient care and outpatient consultations with private providers or with both private and public providers. In order to ensure effective financial risk protection, Cambodia should establish a more comprehensive and effective social health protection scheme that provides maximum population coverage and prioritizes services for populations at risk of distress financing, especially poorer and larger households.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "732a7492944d2411b34c538f09a1c8cc",
  "timestamp": "2025-05-15T02:47:14.032921"
}