{
  "id": 814,
  "title": "A radial basis neural network-based approach to agricultural financial management",
  "abstract": "Agricultural industrialization is a one of the major reforms in the process of agricultural development and requires both theoretical and practical guidance. However, the current theoretical research on financial support for the development of agricultural industrialization is insufficient, which to a certain extent seriously affects the development speed of agricultural industrialization. The purpose of the current study is to solve the financing difficulties of agricultural enterprises with the assistance of radial base neural network model, improve the overall ability of enterprises and effectively evaluate enterprise risks. This paper presents an in-depth research analysis on the management of agricultural finance using an improved radial basis neural network. A neural network is a nonlinear mathematical model that simulates a biological neural network and performs information processing, which integrates knowledge from various fields such as neuroscience, computer science, artificial intelligence, and others sciences. A neural network is a non-linear mathematical model that simulates a biological neural network and performs information processing. A neural network is applied to predict the financial crisis of enterprises with high accuracy. In this paper, the financial performance of 129 sample enterprises were selected for the empirical study of the financial risk early warning model. Among them, 269 cases are used as training samples to construct the neural network model and 116 cases were used as test samples. In terms of variable selection, a total of 38 financial and non-financial indicators reflecting various financial and non-financial indicators such as company profitability, growth capacity, operating capacity, solvency, cash flow capacity, and corporate governance level were selected as basic early warning indicators, considering the operational characteristics and governance status of agriculture. The descriptive analysis, correlation analysis, rough set screening, and neural network model construction were conducted by SPSS software and ROSETTA software for information technology listed companies based on financial and non-financial indicators to explore the financial early warning indicators suitable for agriculture.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "733346f6a9ec08b425cc4129f2913547",
  "timestamp": "2025-05-15T01:55:41.531818"
}