{
  "id": 5426,
  "title": "IMPACT OF FINANCIAL FAIR PLAY ON AUDIT FEES: AN ANALYSIS OF SPANISH FOOTBALL CLUBS",
  "abstract": "Financial Fair Play (FPF) is not a new tool. The idea of having a set of rules and measures for financial control of football clubs was born in 1962, in Germany, when the Fu beta ball-Bundesliga, the national club league, was created. The league regulations stated that all participating clubs should present financial balance in their activity, monitored by the league through the adoption of economic and financial indexes. In Europe, the FPF came into force in 2011. After adjustments, with measures and punishments applied in the European scenario, combating excessive expenses, the regulation will start operating in Brazil from 2020 on Series A (main), with the implementation of the first items, and Series B (access), as a guide. According to the Brazilian Football Confederation (CBF), the model will be inserted gradually over four years. In this context, the purpose of this article is to analyze whether the Fair Play Financial (FPF) regulations established by the Union of European Football Associations (UEFA) influenced the audit fees charged to football clubs. In addition, it explores the determinants of audit fees, a fact that could anticipate the effects on Brazilian football clubs. A t test was used for two samples with equal variances to determine if there are significant differences. Then, a panel data regression with fixed effects from the clubs was performed to estimate the determinants of the audit fees in the football clubs. The findings revealed an increase in fees after the implementation of FPF regulations. In addition, the audit fees were explained by the presence of foreign investors, whether the audit firm was one of the Big Four and whether the auditor was a female. The change in regulation had a significant impact on the audit fees charged by auditors for their services. However, this increase could be offset in the coming years, due to the improved financial situation of the clubs; therefore, the risk of auditors decreases and audit fees for subsequent years could be reduced.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "734d652d571a13c4368fb8be1582041b",
  "timestamp": "2025-05-15T02:47:42.930662"
}