{
  "id": 7481,
  "title": "Work and Retirement Among Women: The Health and Employment After Fifty Study",
  "abstract": "Background: Women increasingly work beyond age 50+ but their occupational health is under-researched. Aims To investigate what jobs older contemporary women do, when they exit their jobs and what factors predict job exit. Methods: Data came from the Health and Employment After Fifty cohort, which recruited women aged 50-64 at baseline in 2013-14 and has followed them up annually collecting: demographic, lifestyle and work information. Exits from employment were mapped longitudinally over five follow-ups. Time-to-first event Cox regression analyses were used to identify risk factors for job exit. Results: At baseline, 4436 women participated, 64% of whom were working. The proportions of women working at 50-54, 55-60 and over 60 years were 86%, 79% and 38%, respectively. Amongst all women, after adjustment for age, managing comfortably financially and not coping with the mental demands of the job were associated with exit. Risk factors for job exit differed in the age bands: 50-54; 55-59 and >60 years, reflecting socio-economic status, markers of health (musculoskeletal pain and poor self-rated health) and work factors (under-appreciation, job dissatisfaction, temporary/permanent contracts, coping with work's physical demands). Conclusions: Factors contributing to exit from work among older women differ by age group, after controlling for perceived financial position, age and mental demands of the job. A number of work characteristics predict job exit and suggest that employers can play an important role in supporting women to continue working until older ages. Identification and treatment of musculoskeletal pain could also enable work amongst older women.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "736236cb26bdf74f14664a9b0f03b15f",
  "timestamp": "2025-05-15T03:09:07.262056"
}