{
  "id": 542,
  "title": "Design and progress of a factorial trial testing the effect of spironolactone and inorganic nitrate on arterial function in people at risk of or with type 2 diabetes",
  "abstract": "Background: Arterial stiffness (AS), as pulse wave velocity (PWV), is a powerful independent predictor of cardiovascular events and commonly complicates type 2 diabetes (T2D). This trial aims to test if AS, measured by the VaSera machine as cardio-ankle vascular index (CAVI) and by Arteriograph measuring central PWV, can be reduced by spironolactone and/or inorganic nitrate from beetroot juice independently of blood pressure (BP) in those with or at risk of T2D. Methods: A factorial design, double blind, randomised controlled trial in 18-80 year old men and women clinically diagnosed with T2D or at risk of it (body mass index (BMI) >= 27 kg m(-2), positive family history or glucose intolerance). The study lasts up to 36 weeks with daily intervention of either <= 50 mg spironolactone (intervention) or <= 16 mg doxazosin (control), and beetroot juice with <= 400 mg (9 mmol) inorganic nitrate (intervention) or placebo beetroot juice, 0 mg nitrate (control). Non-invasive AS measurements are carried out at baseline and then at 12-week intervals thereafter. Results: To date, 95 participants have been consented and screened, 19 of these were not suitable or not willing to participate so that 73 have been randomised with 9 participants screened as eligible and awaiting randomisation. 53 participants have completed the study. Mean baseline and follow up measures of cardiac-ankle and cardiac-aortic bifurcation PWV and BP have been straightforward. Conclusion: This is a proof-of-principle trial to alter AS independent of BP in a patient sample at high cardiovascular risk. Clinical trial registration information: UK Clinical Research Network Portfolio Database: 25003627. (C) 2015 Association for Research into Arterial Structure and Physiology. Published by Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "736a7b10eadb7794adec84f47c692837",
  "timestamp": "2025-05-15T00:37:01.877129"
}