{
  "id": 3910,
  "title": "Correlation structure and dynamics of international real estate securities markets: A network perspective",
  "abstract": "In this paper, we investigate the correlation structure and dynamics of international real estate securities markets by using daily returns of 20 national markets during the period 2006-2012 from a network perspective. We construct the minimum spanning tree (MST), the hierarchical tree (HT), and the planar maximally filtered graph (PMFG) obtained from the correlation matrix computed by the daily returns during the investigated period, and analyze the corresponding clustering structure, hierarchical structure, and community structure. We also build the time-varying MST and PMFG networks by a rolling window to examine the dynamics of correlation structure. The empirical results show that (1) the distribution of correlation coefficients is asymmetric, fat-tailed, and non-Gaussian. (2) The distributions of the influence-strength of the MST and PMFG networks obey a power-law. (3) Two clusters (i.e., the European and Asia-Pacific clusters) are found in the MST network, three hierarchical clusters (i.e., two like in the MST and the North American cluster) in the HT, and three communities in the PMFG network, which shows that national markets are linked together according to their geographical distributions. (4) The descriptive statistics of correlation coefficients and distances of the MSTs and PMFGs are time-varying; especially during periods of crisis they have a large fluctuation. (5) A huge number of linkages between national markets survive from one time to the next, and the long-term stability of the correlation structure in international real estate securities markets descends as time goes on. Our obtained results are new insights in international real estate securities markets and have wide applications for investment portfolio and risk management. (C) 2015 Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "736b0971126bbbc7fcc3f521e720cb00",
  "timestamp": "2025-05-15T01:22:11.837543"
}