{
  "id": 9306,
  "title": "Matrix Metalloproteinases and Educational Attainment in Refractive Error Evidence of Gene-Environment Interactions in the Age-related Eye Disease Study",
  "abstract": "Purpose: A previous study of Old Order Amish families showed an association of ocular refraction with markers proximal to matrix metalloproteinase (MMP) genes MMP1 and MMP10 and intragenic to MMP2. A candidate gene replication study of association between refraction and single nucleotide polymorphisms (SNPs) within these genomic regions was conducted. Design: Candidate gene genetic association study. Participants: Two thousand participants drawn from the Age-Related Eye Disease Study (AREDS) were chosen for genotyping. After quality-control filtering, 1912 individuals were available for analysis. Methods: Microarray genotyping was performed using the HumanOmni 2.5 bead array (Illumina, Inc., San Diego, CA). Single nucleotide polymorphisms originally typed in the previous Amish association study were extracted for analysis. In addition, haplotype tagging SNPs were genotyped using TaqMan assays. Quantitative trait association analyses of mean spherical equivalent refraction were performed on 30 markers using linear regression models and an additive genetic risk model while adjusting for age, sex, education, and population substructure. Post hoc analyses were performed after stratifying on a dichotomous education variable. Pointwise (P-emp) and multiple-test study-wise (P-multi) significance levels were calculated empirically through permutation. Main Outcome Measures: Mean spherical equivalent refraction was used as a quantitative measure of ocular refraction. Results: The mean age and ocular refraction were 68 years (standard deviation [SD], 4.7 years) and +0.55 diopters (D; SD, 2.14 D), respectively. Pointwise statistical significance was obtained for rs1939008 (P-emp = 0.0326). No SNP attained statistical significance after correcting for multiple testing. In stratified analyses, multiple SNPs reached pointwise significance in the lower-education group: 2 of these were statistically significant after multiple testing correction. The 2 highest-ranking SNPs in Amish families (rs1939008 and rs9928731) showed pointwise P-emp <0.01 in the lower-education stratum of AREDS participants. Conclusions: This study showed suggestive evidence of replication of an association signal for ocular refraction to a marker between MMP1 and MMP10. Evidence of a gene-environment interaction between previously reported markers and education on refractive error also was shown. Variants in MMP1 through MMP10 and MMP2 regions seem to affect population variation in ocular refraction in environmental conditions less favorable for myopia development. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2013;120:298-305 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "736b5b6bca8e3406dfc0d4ce6f06abfa",
  "timestamp": "2025-05-15T03:27:25.115702"
}