{
  "id": 9262,
  "title": "The determinants of capital structure of Islamic and conventional banks: an autoregressive distributed lag approach",
  "abstract": "Purpose This paper aims to explore how Sharia principles could impact capital structure determinants and speed of adjustment of Islamic banks (IBs) compared to conventional banks (CBs) in the Gulf Cooperation Council countries (GCC). Design/methodology/approach This study applies the autoregressive distributed lag (ARDL) approach for a sample of 69 banks listed on GCC stock markets over the period 2009-2018. Findings Regression results indicate that tangibility and bank size are positively related to book leverage of both IBs and CBs, whereas profitability, liquidity and risk are negatively related. For growth opportunities, the results show opposing effect on book leverage of IBs and CBs, regarding macroeconomic variables, the authors find that gross domestic product and financial development are negatively related to book leverage of both IBs and CBs, whereas oil price change is positively related. Moreover, the authors find that IBs slowly adjust their capital structure toward the desired leverage ratio than CBs. In sum, the capital structure of IBs appears to be driven by similar factors to those previously found in the corporate finance literature. Research limitations/implications This research contributes to the theory in re-validating capital structure theories on IBs. It helps understand the capital structure of IBs in comparison with CBs. It highlights some areas where further research on topics related to capital structure of IBs is needed. Practical implications The paper can contribute to policymakers and governance function in understanding the choice of capital structure for IBs within the bound of Sharia requirement in different economic climate through its relation with the macroeconomic variables. Practically, the directors and managers can predict the best capital structure to be achieved by IBs in ensuring their performance is at par, in their quest of additional capital. Originality/value This paper offers some insights on the determinants of capital structure by investigating IBs and CBs. It explores the implication of relevant Islamic principles on capital structure. Moreover, it analyses the determinants of capital structure using ARDL method that permits to identify the short-run and long-run relationships between capital structure and its main determinants.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7370cbe6d1657aaecafa193ff743fcaa",
  "timestamp": "2025-05-15T03:26:54.630887"
}