{
  "id": 6535,
  "title": "Suicide and Murder-Suicide Involving Aircraft",
  "abstract": "BACKGROUND: This is a systematic review of suicide and homicide-suicide events involving aircraft. In aeromedical literature and in the media, these very different events are both described as pilot suicide, but in psychiatry they are considered separate events with distinct risk factors. METHODS: Medical databases, internet search engines, and aviation safety databases were searched in a systematic way to obtain relevant cases. Relevant articles were searched for additional references. RESULTS: There were 65 cases of pilot suicide and 6 cases of passengers who jumped from aircraft found. There were also 18 cases of homicide-suicide found involving 732 deaths. Pilots perpetrated 13 homicide-suicide events. Compared to non aviation samples, a large percentage of pilot suicides in this study were homicide-suicides (17%). DISCUSSION: Homicide-suicide events occur extremely rarely. However, their, impact in terms of the proportion of deaths is significant when compared to deaths from accidents. There is evidence of clustering where pilot suicides occur after by media reports of suicide or homicide-suicide. Five of six homicide-suicide events by pilots of commercial airliners occurred after they were left alone in the cockpit. This, along with a sixth incident in which active intervention by a Japan Air crew saved 147 lives, suggests that having two flight members in the cockpit is potentially protective. No single factor was associated with the risk for suicide or homicide-suicide. Factors associated with both events included legal and financial crises, occupational conflict, mental illness, and relationship stressors. Drugs and/or alcohol played a role in almost half of suicides, but not in homicide-suicides.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "738745d17fe95f59083104d1778143be",
  "timestamp": "2025-05-15T02:59:07.515927"
}