{
  "id": 5536,
  "title": "Farming under environmental restrictions in the Beskyds and White Carpathians",
  "abstract": "The paper presents the results of research aimed at the analysis of the viability of agricultural enterprises which farm in less favoured areas and under the environmental restrictions pertaining to protected landscape areas. The target objects of the research were farmers taking care of mountain grasslands (meadows and grazing lands) in two protected landscape areas of the Czech Republic - the Beskyds and White Carpathians. The results are based on the sample survey carried out in 2006 and 2007. The first stage of the survey was devoted to the quality of life and business of farmers. The second stage of the survey concerned the financial condition of the farming businesses. Two statistical methods (analysis of variance, logistic regression) and the financial analysis method were used as analytic tools. The agricultural enterprises farming under environmental restrictions perceive their farming activities as a deal and mission. Farmers also accept restrictions while using the current subsidies. Compared to the farms outside the protected landscape areas, the farms in both protected land areas showed a higher profitability but a lower business activity. The analysis found out that the adverse age structure of farmers is a very important risk factor for rural development.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "739a9cf8f4151fbdeb99fd575d814745",
  "timestamp": "2025-05-15T02:48:51.326616"
}