{
  "id": 4221,
  "title": "Outdoor Free Space Optical Systems: Motivations, Challenges, Contributions in Environmental Conditions, and Future Directions-A Systematic Survey",
  "abstract": "This paper presents a new systematic survey of the free-space optical (FSO) system, highlighting its operations and applications in outdoor optical communication underlying its interaction with the environment. As the application portfolio of FSO technology grows, so does the need for a clear classification for FSO link configurations. Most existing surveys and classifications are single-level classifications using traditional survey methods, and thus not inclusive enough to accommodate recent and emerging changes and developments of different FSO link configurations and systems. To that end, this paper adopts a novel methodology based on statistical analysis using a natural language processing approach (NLP) to analyze, visualize, and interpret the researchers' trends of 5075 relevant literature published documents (journal papers, conference papers, books, etc.) from 2017 to Feb-2024. The process of summarizing and analyzing is encompassed by adopting hierarchal multi-level classifications for the key performance evaluations, motivations, challenges, and contributions related to FSO systems. The survey is started by understanding the key performance of FSO such as matrices models and mathematical models. Then, the survey process is followed by investigating the outdoor FSO applications (urban, satellite, smart city, military, healthcare, disasters, and sensing applications). We have relied on listing and dividing the outdoor FSO networks into sub-networks based on the FSO's architectural structures (point-to-multipoint, mobile network, long-range transmission and heterogeneous). In turn, outdoor impairments are classified into two categories: 1) environmental factors (weather and atmospheric conditions) and 2) component systems (source types and mechanical issues). We demonstrate the impact of these impairments in terms of the optical phenomena (effects), such as scattering, reflection, refraction, absorption, shadowing, and consequences (outcomes), such as pointing error, misalignments, beam divergence, etc. Finally, multi-technical solutions are listed and analyzed based on the researchers' contributions, such as modulation, detection techniques, relay, array, and retroflectors. This paper is the first paper that adopts the statistical analysis approach for studying the FSO in outdoor applications, making this approach a good choice for future researchers to prioritize their decisions about future trends and target their improvements.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73a74e2ab65121f2723820859a044d7b",
  "timestamp": "2025-05-15T01:24:51.499747"
}