{
  "id": 1910,
  "title": "Handling Uncertainty in Financial Decision Making: A Clustering Estimation of Distribution Algorithm With Simplified Simulation",
  "abstract": "In financial decision making models, parameters are usually obtained based on historical data, which involve strong uncertainties. In some cases, the fluctuation caused by environmental uncertainty may even be more significant than that caused by utilizing different strategies. Such phenomenon makes the optimization and uncertainty handling in finical optimization a great challenge. In this article, a group insurance portfolio problem is considered as an instance of financial optimization with strong uncertainty. To handle uncertainty, we first analyze the feature of the problem and discover that in such kind of optimization problem with strong uncertainty, the solutions are strongly relative to the scenario. In view of the scenario-relevant feature, a simplified simulation approach is designed. Only one scenario is simulated for each generation in the evolution process to deal with the uncertainties. Combining this approach with a clustering estimation of distribution algorithm, a new algorithm (CEDA-SS) is proposed. Estimation of current profit is made by Monte Carlo (MC) simulation based on historical data. Solutions in each generation are evaluated in the same scenario. Two kinds of clustering mechanisms are applied to further improve the performance of the algorithm. Moreover, a comparison mechanism based on the Wilcoxon rank sum test is proposed to evaluate the performance of the algorithms. Experimental results show that the proposed CEDA-SS is suitable for the group insurance portfolio problem and it outperforms other uncertain evolutionary algorithms.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73a9d0dcb68a9b35707c0aef15bcbce0",
  "timestamp": "2025-05-15T01:01:06.107980"
}