{
  "id": 2229,
  "title": "Artificial Intelligence and Arthroplasty at a Single Institution: Real-World Applications of Machine Learning to Big Data, Value-Based Care, Mobile Health, and Remote Patient Monitoring",
  "abstract": "Background: Driven by the recent ubiquity of big data and computing power, we established the Machine Learning Arthroplasty Laboratory (MLAL) to examine and apply artificial intelligence (AI) to musculo-skeletal medicine. Methods: In this review, we discuss the 2 core objectives of the MLAL as they relate to the practice and progress of orthopedic surgery: (1) patient-specific, value-based care and (2) human movement. Results: We developed and validated several machine learning-based models for primary lower extremity arthroplasty that preoperatively predict patient-specific, risk-adjusted value metrics, including cost, length of stay, and discharge disposition, to provide improved expectation management, preoperative planning, and potential financial arbitration. Additionally, we leveraged passive, ubiquitous mobile technologies to build a small data registry of human movement surrounding TKA that permits remote patient monitoring to evaluate therapy compliance, outcomes, opioid intake, mobility, and joint range of motion. Conclusion: The rapid rate with which we in arthroplasty are acquiring and storing continuous data, whether passively or actively, demands an advanced processing approach: AI. By carefully studying AI techniques with the MLAL, we have applied this evolving technique as a first step that may directly improve patient outcomes and practice of orthopedics. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73aa2b13ecd9aaa2d9fe320520595bf1",
  "timestamp": "2025-05-15T02:12:50.986406"
}