{
  "id": 6820,
  "title": "Cardiovascular Health Issues in Inner City Populations",
  "abstract": "Inner city populations in high-income countries carry a disproportionately high burden of cardiovascular disease. Although low individual socioeconomic status has long been associated with higher morbidity and mortality from cardiovascular disease, there is a growing body of evidence that area-level socioeconomic status may also have a major effect on cardiovascular outcomes. A lack of supermarkets, limited green space, and high rates of violent crime in inner city neighbourhoods result in poor dietary intake and low rates of physical activity among residents. The physical and social environments of inner city neighbourhoods may also contribute to high rates of comorbid mental illness in disadvantaged urban populations. Mental illness may lead to the clustering of cardiovascular risk factors through its impact on health behaviours, effects of psychiatric medications, and sequelae of substance abuse. Individuals residing in disadvantaged neighbourhoods experience reduced access to both primary preventive and acute in-hospital cardiovascular care. This may be driven by financial disincentives for caring for patients with low socioeconomic status, as well as system capacity issues in the inner city, and patient-level differences in health-seeking behaviours. Small-scale studies of interventions to improve individual-level health behaviours and access to care in the inner city have demonstrated some success in improving cardiovascular outcomes through the use of mobile clinics, health coaching, and case management approaches. There is a need for further research into community-wide interventions to improve the cardiovascular health of inner city populations.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73ab77b0bb3ade293bc31038262d987d",
  "timestamp": "2025-05-15T03:02:07.429967"
}