{
  "id": 8379,
  "title": "ENTREPRENEURIAL ORIENTATION AND LOCAL PUBLIC ADMINISTRATION PERFORMANCE",
  "abstract": "For several decades the policymakers and academics stressed out the necessity of increasing the effectiveness, efficiency, quality and availability of public services. Recent times of public austerity during the global financial crisis and economic damages caused by Covid-19 crisis even furtherly stretched the quest for an appropriate response from public managers. The entrepreneurial orientation (EO) concept, which has been already proven in the profit sector may represent a valuable solution for the public sector to cope with the lack of funding and additional costly demands. The purpose of this study was to empirically prove that the EO of the city administrations may be a way to accomplish these tasks, in an innovative, proactive and (acceptable) risk-taking manner. These three components represent the sali-ent components of the EO construct based on Miller's (1983)/Covin & Slevin (1989) conceptualization, used in this research. A survey of mayors and public servants in city administrations in Croatia proved that a medium level of EO exists. The results of a correlation and multiple regression analysis revealed that there is a statistically significant and positive link between more entrepreneurially oriented city administrations and their self-reported performance. However, the influence of the EO on city administration performance measured objectively only partially repeated this conclusion. Furthermore, cluster analysis determined the difference between the salien-ce of the EO dimensions among entrepreneurially 'non-oriented' and 'orien-ted' city administrations. This study contributes to modest research opus on EO implementation within the local public sector.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73d023cb43b5f8983c833c86903cf84d",
  "timestamp": "2025-05-15T03:18:19.556145"
}