{
  "id": 3966,
  "title": "Identifying firm-specific technology opportunities from the perspective of competitors by using association rule mining",
  "abstract": "Technology opportunity discovery (TOD) is a starting point for firms to conduct research and development (R&D) activities. Although researchers have suggested diverse methods for study-ing firm-specific TOD, there is a lack of research that makes the best use of competitors' roles to identify technology opportunities. In addition, the evaluation of candidate technology opportuni-ties only focuses on the current potential of technologies. Therefore, this paper proposes a novel approach to identifying technology opportunities from the perspective of competitors using an improved association rule mining (ARM) algorithm named Two-Phase Frequent Item Mining-Customised Association Rule Mining (TPFIM-CARM). The proposed approach involves: 1) min -ing frequent itemsets of technologies from the patent dataset of the target firm's competitors, 2) discovering strong association rules of technologies and recommending candidate technology opportunities based on the technology portfolio of the target firm, and 3) evaluating technol-ogy opportunities by predicting indicators of technology importance and technology effects with polynomial ridge regression. The effectiveness of the proposed approach is validated by a case study of the General Motors Company (GM). The study extends the TOD literature by identify-ing technology opportunities from the perspective of competitors and provides a forward-looking evaluation idea, which can be used in both TOD and other studies on technology and innovation management.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73d475b12a3c70816ff7220313d2899f",
  "timestamp": "2025-05-15T01:22:39.382763"
}