{
  "id": 8741,
  "title": "Telangiectatic Capillaries in Retinal Vein Occlusion: Incidence, Topography, and Risk Factors",
  "abstract": "Purpose: To investigate the incidence, timing, dimensional features, and spatial characteristics of telangiectatic capillaries (TelCaps) in retinal vein occlusion (RVO) patients treated with anti-VEGF monotherapy. Design: Prospective nonconcurrent cohort study. Participants: One hundred thirty-eight eyes of 138 patients with treatment-naive RVO treated with anti-VEGF monotherapy for a minimum of 24 months. Methods: Telangiectatic capillaries were identified using multimodal imaging, including indocyanine green angiography (ICGA), OCT, and color fundus photography. Recurrence of venous occlusive events was defined by new onset of retinal hemorrhages accompanied by worsening of macular edema. Cox regression modeling was used to assess risk factors for TelCap development. Main Outcome Measures: Telangiectatic capillaries' incidence, dimensional features, spatial distribution, and association with RVO recurrence events. Results: Over 4.4 +/- 2.6 years of follow-up, TelCaps developed in 15/138 eyes (10.9%) after 26 +/- 16 months. Telangiectatic capillaries in hemispheric and central RVO showed larger diameters compared with branch RVO (277 +/- 44 mm vs. 196 +/- 43 mm, P-0.005) and preferential localization along the temporal horizontal raphe (y-axis coordinates: 0.4 +/- 0.6 mm vs. 0.9 +/- 0.7 mm, P-0.017). The recurrence of RVO during follow-up was significantly associated with TelCap development (hazard ratio-8.74, 95% confidence limit-2.92-26.2, P < 0.001). At 5-year follow-up, the risk of developing TelCaps was-9% in patients without recurrence and-55% in those patients with recurrence. Conclusions: Telangiectatic capillaries occur in approximately 10% of RVO cases undergoing intravitreal anti-VEGF monotherapy, with distinct characteristics based on RVO subtype. The strong association with disease recurrence suggests episodes of increased venous obstruction contribute to TelCap formation. Extended follow-up and vigilant screening are recommended; when TelCaps are suspected, ICGA can confirm the diagnosis and guide adjunctive targeted treatment. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2025;5:100754 (c) 2025 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73da1cf4c6f0e5b35a66eb582021e31d",
  "timestamp": "2025-05-15T03:21:56.628148"
}