{
  "id": 2234,
  "title": "The impact of foreign participation on risk-taking in Chinese commercial banks: The co-governance role of equity checks and foreign supervision",
  "abstract": "This study examines how foreign equity participation affects the risk-taking of commercial banks using Chinese bank-level data from 2012 to 2020. The results indicate that foreign equity participation significantly reduces bank risk, and there is a U-shaped relationship between the foreign shareholding ratio and bank risk. Mechanism analysis reveals that augmenting foreign ownership strengthens shareholder equilibrium and boosts the presence of foreign directors. This structure enhances dual governance mechanisms, lowering the risk in banking activities. Considering that confounding factors affecting mediator and dependent variables can cause bias in coefficient estimation, we used machine learning methods to determine the best predictive factors affecting bank risk-taking. We indirectly verified the theoretically driven empirical model by evaluating more explanatory variables and selecting subsets of explanatory variables. In addition, we find that governance enhancements are particularly pronounced in Chinese banks, characterized by smaller scale and less income diversification. Additionally, foreign ownership significantly impacts banks' market risk more than credit and operational risks. Our results imply that China's financial regulatory authorities need to shift the focus of supervision to examining foreign shareholding ratio and corporate governance ability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73df94562330d24125b72edf6a41e1a0",
  "timestamp": "2025-05-15T02:12:51.003406"
}