{
  "id": 8637,
  "title": "Discontinuity of psychiatric care among patients with bipolar disorder in the Netherlands",
  "abstract": "Background: Patients with bipolar disorder benefit from guidelines recommended continuous community-oriented psychiatric and somatic healthcare, but often discontinue psychiatric care. Aims: The first objective was to identify predictive factors of discontinuity of psychiatric care among patients who had received psychiatric care. The second objective was to examine if practice variation in discontinuity of psychiatric care existed between providers of psychiatric care. Method: Registry healthcare data were used in a retrospective cohort study design using logistic regression models to examine potential predictive factors of discontinuity of care. Patient-related predictive factors were: age, sex, urbanization, and previous treatment (type and amount of psychiatric care, alcohol, and opioid treatment). Patients already diagnosed with bipolar disorder were selected if they received psychiatric care in December 2014 to January 2015. Discontinuity of psychiatric care was measured over 2016. Results: A total of 2,355 patients with bipolar disorder were included. In 12.1% discontinuity of care occurred in 2016. Discontinuity was associated with younger age and less outpatient care over 2013 to 2014. Discontinuity of patients who received all eight quarters outpatient care including BD medication was very low at 4%. The final model contained: age, type of psychiatric care, and amount of outpatient care in 2013 to 2014. Practice variation among providers appeared negligible. Conclusions: The (mental) health service in the Netherlands has few financial or other barriers toward continuity of care for patients with severe mental disorders, such as bipolar disorder. An active network of providers, aim to standardize care. This seems successful. However, 12% discontinuity per year remains problematic and more detailed data on those most at risk to drop out of treatment are necessary.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73e6403e14e733e7a4963df1c1ff288f",
  "timestamp": "2025-05-15T03:20:55.943293"
}