{
  "id": 4097,
  "title": "A knowledge based scheme for risk assessment in loan processing by banks",
  "abstract": "Inadequacy in the compliance auditing (CA) process is one of the major reasons behind corporate frauds and accrual of non-performing assets within the banking sector. This phenomenon threatens the organization, stakeholders and society at large. The traditional CA process is slow and often inadequate in highly regulated and networked sectors such as banking, insurance and healthcare. This paper proposes a knowledge driven automated compliance auditing scheme for the processing of loans by banks. We collect 100 cases that are designated as fraudulent by banks and use them to design an automated risk score card model. The model uses text mining to automatically classify DPCs (Deviation Pattern Components) from unstructured text based cases. DPC patterns in a case give an early indication of the portfolio turning into a NPA. At the same time the cases are reviewed by five expert auditors in order to determine their risk level, risk impact and ease of detection. A logistic regression based model is used to derive risk scores of the case studies and classify the cases. By incorporating experts' opinion along with data mining techniques, the model automates the prediction of risk level, risk impact and ease of detection of fraudulent cases that deal with loan processing. The classifier performs well in terms of various performance metrics. The knowledge based method has the potential to save time and expensive human resources by automating the risk analysis of fraudulent loan processing cases reported by banks. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73e72614d8f134fedf6fe895aeaf5e5d",
  "timestamp": "2025-05-15T01:23:58.023223"
}