{
  "id": 5623,
  "title": "Can environmental awards stimulate corporate green technology innovation? Evidence from Chinese listed companies",
  "abstract": "Based on the environmental awards granted by credible third parties to recognize firms' devotion to environmental protection, this study examines the impact of environmental awards on firms' green technology innovation by using a data sample comprising Chinese A-shares listed firms for a period of 2007 to 2019. Our results show that environmental awards can significantly promote corporate green technology innovation. This finding remains valid after endogenous and robustness testing, including the alternative measure of green technology innovation, and the replacement of the estimation method with the Poisson regression and the negative binomial regression. Additional tests reveal that this influence is exerted through increased long-term loans and government environmental subsidies. Moreover, our study reveals that this effect only exists among non-state-owned enterprises, companies with high financial risk, and heavily polluting enterprises. Compared to extensive studies on how environmental regulation forces companies to conduct green technology innovation, this study provides essential guidance on the role played by positive incentives in driving corporate green technology innovation from the perspective of environmental awards.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73fbf851fd744a5da84e183a1717561c",
  "timestamp": "2025-05-15T02:49:50.222278"
}