{
  "id": 8957,
  "title": "Mental health among healthcare workers during COVID-19 pandemic in Thailand",
  "abstract": "Objectives This study aimed to measure the prevalence of burnout syndrome, anxiety, depression, and post-traumatic disorders (PTSD), as well as examine their associated factors among Thai healthcare workers (HCWs) during COVID-19 outbreak. Method We employed a multiple-method design at a tertiary-care hospital in Bangkok between May 22, 2021 and June 30, 2021 by using an online survey. The information included demographic characteristics, work details, perceived support, PTSD symptoms, Maslach Burnout Inventory: General Survey (MBI-GS), General Anxiety Disorder-7 (GAD-7), Patient Health Questionnaire (PHQ-2 and PHQ-9), and narrative response to an open-ended question. The associated factors of mental health problems were analysed by multiple logistic regression analyses. The qualitative data were analysed by the content analysis method. Results A total of 986 HCWs (89.1% female; mean age = 34.89 11.05 years) responded to the survey. 16.3%,16%, and 53.5% of respondents had a high level of emotional exhaustion, depersonalisation, and diminished personal achievement, respectively. 33.1%, 13.8%, and 2.3% of respondents had anxiety, depression, and PTSD. Risk factors of emotional exhaustion were male sex (ORadj = 2.29), nurses (ORadj = 3.04), doctors (ORadj = 4.29), working at COVID-19 inpatient unit (ORadj = 2.97), and working at COVID-19 intensive care unit (ORadj = 3.00). Additionally, preexisting mental illness was associated with anxiety (ORadj = 2.89), depression (ORadj = 3.47), and PTSD (ORadj = 4.06). From qualitative analysis, participants reported that these factors would improve their mental health: supportive and respectful colleagues, appropriate financial compensation, reduced workload, clarity of policy and communication channel, and adequate personal protective equipment. Conclusions Thai HCWs experienced negative mental health outcomes during the COVID-19 pandemic substantially. This issue needs attention and actions should be implemented to support them.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "73fe1034678aaf53f162a46f0afdab3b",
  "timestamp": "2025-05-15T03:23:56.168297"
}