{
  "id": 7599,
  "title": "Use of Psychotropic Substances and Satisfaction with Vocational Education",
  "abstract": "Objective: The aim of this study was to investigate if there is an independent association between substance use and satisfaction in vocational education. Methods: A cross-sectional study of 5688 first-year apprentices from 49 vocational schools, mean age 19.4 years (SD=3.9 years) was undertaken. Data were analysed using multilevel linear regression analysis. Predictors were use of tobacco, alcohol, cannabis and pharmaceuticals as well as personal characteristics (sex, age, migration background, educational level, financial status, chronic diseases, psychological distress, physical activity, media use, personality) and vocational/firm characteristics (firm size, number of apprentices, perceived quality of mentoring, amount of pay, vocational field, working conditions, over- and underload, housing situation, number of previous apprenticeships, first choice). Vocational satisfaction was used as primary outcome. Results: Satisfaction was most strongly associated with perceived quality of mentoring, judgement that the chosen education was first choice and working climate in the training company. In addition, only problematic alcohol use remained significant in the multivariate analysis. There was no association in the adjusted model between vocational satisfaction and daily tobacco use or problematic use of cannabis and pharmaceuticals. Conclusions: Results suggest that problematic alcohol use could be an independent risk factor for problems in vocational education.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7407d60f49d7a21c333109435aa29af4",
  "timestamp": "2025-05-15T03:10:05.642732"
}