{
  "id": 542,
  "title": "Integration of parameterized quantum circuits within classical neural network for financial time-series prediction",
  "abstract": "The forecasting of financial defaults plays a pivotal role in augmenting risk management methodologies and ensuring the resilience of financial ecosystems. This study presents the seamless integration of classical and quantum computing methodologies for developing a neural network for financial default prediction on a time-series dataset. A hybrid neural network architecture also known as a dressed quantum circuit, is proposed to integrate classical and quantum layers for financial default prediction. The state-of-the-art dressed quantum circuit, incorporates rotations and multiqubit controlled gates meticulously tailored to navigate the intricacies of complex, large-scale, and high-dimensional time-series datasets. The contributions of the study are multifaceted. Firstly, the study presents a distinctive framework for the integration of quantum computing with classical machine learning, heralding a promising pathway for addressing high complexity and dimensionality challenges. Secondly, the study demonstrates the scalability of the model's configuration through variations in the number of qubits and quantum circuit depth and optimizes the model's performance through the application of diverse optimization algorithms. Thirdly, the model's enhanced efficiency is evidenced by a significant reduction in training time compared to state-of-the-art classical gradient-boosting algorithms. The hybrid model has the potential and adaptability to offer robust solutions across various real-world problems.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7416d8335220c835979e5b112d6808d5",
  "timestamp": "2025-05-15T01:52:12.262573"
}