{
  "id": 7367,
  "title": "The Prognostic Value of the Work Ability Index for Sickness Absence among Office Workers",
  "abstract": "Background The work ability index (WAI) is a frequently used tool in occupational health to identify workers at risk for a reduced work performance and for work-related disability. However, information about the prognostic value of the WAI to identify workers at risk for sickness absence is scarce. Objectives To investigate the prognostic value of the WAI for sickness absence, and whether the discriminative ability differs across demographic subgroups. Methods At baseline, the WAI (score 7-49) was assessed among 1,331 office workers from a Dutch financial service company. Sickness absence was registered during 12-months follow-up and categorised as 0 days, 0< days< 5, 5 <= days< 15, and >= 15 days in one year. Associations between WAI and sickness absence were estimated by multinomial regression analyses. Discriminative ability of the WAI was assessed by the Area Under the Curve (AUC) and Ordinal c-index (ORC). Test characteristics were determined for dichotomised outcomes. Additional analyses were performed for separate WAI dimensions, and subgroup analyses for demographic groups. Results A lower WAI was associated with sickness absence (>= 15 days vs. 0 days: per point lower WAI score OR=1.27; 95% CI 1.21-1.33). The WAI showed reasonable ability to discriminate between categories of sickness absence (ORC=0.65; 95% CI 0.63-0.68). Highest discrimination was found for comparing workers with >= 15 sick days with 0 sick days (AUC=0.77) or with 1-5 sick days (AUC=0.69). At the cut-off for poor work ability (WAI <= 27) the sensitivity to identify workers at risk for >= 15 sick days was 7.5%, the specificity 99.6%, and the positive predictive value 82%. The performance was similar across demographic subgroups. Conclusions The WAI could be used to identify workers at high risk for prolonged sickness absence. However, due to low sensitivity many workers will be missed. Hence, additional factors are required to better identify workers at highest risk.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "742122b07e9c4ed80c52a1671200699b",
  "timestamp": "2025-05-15T03:08:00.742184"
}