{
  "id": 2700,
  "title": "Understanding financial risk protection in China's health system: a descriptive analysis using data from multiple national household surveys",
  "abstract": "BackgroundProviding financial risk protection is one of the fundamental goals of health systems. Catastrophic health expenditure (CHE) and medical impoverishment (MI) are two common indicators in evaluating financial risk protection in health. As China continues its health system reform to provide accessible and affordable health care, it is important to have a clear understanding of China's progress in financial risk protection. However, past research showed discrepancies in the incidence of CHE and MI. In this article, using data from four national household surveys, we analyzed levels and characteristics of CHE and MI in China under different definitions.MethodsWe used multiple conventional thresholds for CHE and MI to comprehensively describe the levels of financial risk protection in China. We used data from four national household surveys to measure the incidence of CHE and MI, and their inequalities by urban/rural status and by income quartiles. The Probit regression model was used to explore influencing factors of CHE and MI.ResultsWe found that the incidences of CHE and MI were largely consistent across four national household surveys, despite different sampling methods and questionnaire designs. At the 40% nonfood expenditure threshold, the incidence of CHE in China was 14.95%-17.73% across four surveys during the period of 2016-2017. Meanwhile, at the 1.9 US dollars poverty line, the incidence of MI was 2.01%-5.63%. Moreover, rural residents, lower-income subgroups, and smaller households were faced with higher financial risks from healthcare expenditures. Although positive progress in financial risk protection has been achieved in recent years, China has disproportionately high incidences of CHE and MI, compared to other countries.ConclusionChina has large margins for improvements in risk financial protection, with large inequalities across subgroups. Providing better financial protection for low-income groups in rural areas is the key to improve financial protection in China.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7425b09209fa676ed0dcbb7e2bfa63c2",
  "timestamp": "2025-05-15T02:18:06.265779"
}