{
  "id": 410,
  "title": "Prediction of the resilient modulus of compacted subgrade soils using ensemble machine learning methods",
  "abstract": "The accurate estimation of resilient modulus (MR) of compacted subgrade soil is imperative for the safe and sustainable design of flexible pavement systems. The aim of this study is to explore the potential of ensemble machine learning techniques for predicting the MR of pavement subgrade soil. For this, 2813 data points from twelve compacted subgrade soils were collected which consists of the following inputs parameters: dry unit weight, weighted plasticity index, deviator stress, confining stress, number of freeze???thaw cycles, and moisture content. Four commonly used machine learning (ML) methods, namely, gradient boosting regression (GBR), decision tree regression (DTR), K nearest neighbour regression (KNR), and random forest regression (RFR) were developed and implemented for forecasting the MR value. Thereafter, several ensemble ML techniques including voting ensemble (VO-ENSM), voting ensemble with RF as a meta-model (VO-ENSM (RF)), stacking ensemble (STENSM) and bagging ensemble (BG-ENSM) were utilised to amalgamate the outputs from the developed standalone ML models. Additionally, a multiple linear regression model was also developed as a baseline. The predictive veracity, reliability and trustworthiness of the developed ensemble models were corroborated using rigorous statistical testing, ranking technique, and uncertainty analysis. The results as obtained have shown that the BG-ENSM outperformed its counterparts in predicting the MR of subgrade soil. Hence, it can be a part of portfolio of predicting tools utilised by the practitioners in evaluating the strength of the pavement subgrade soil. Finally, the sensitivity analysis was performed to assess the strength of input variables on the MR.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74257633bf1df471d7faf0e4dabb2863",
  "timestamp": "2025-05-15T00:43:10.523486"
}