{
  "id": 1968,
  "title": "MARSHALL-OLKIN DISTRIBUTIONS, SUBORDINATORS, EFFICIENT SIMULATION, AND APPLICATIONS TO CREDIT RISK",
  "abstract": "In the paper we present a novel construction of Marshall-Olkin (MO) multivariate exponential distributions of failure times as distributions of the first-passage times of the coordinates of multidimensional Levy subordinator processes above independent unit-mean exponential random variables. A time-inhomogeneous version is also given that replaces Levy subordinators with additive subordinators. An attractive feature of MO distributions for applications, such as to portfolio credit risk, is its singular component that yields positive probabilities of simultaneous defaults of multiple obligors, capturing the default clustering phenomenon. The drawback of the original MO fatal shock construction of MO distributions is that it requires one to simulate 2(n) - 1 independent exponential random variables. In practice, the dimensionality is typically on the order of hundreds or thousands of obligors in a large credit portfolio, rendering the MO fatal shock construction infeasible to simulate. The subordinator construction reduces the problem of simulating a rich subclass of MO distributions to simulating an n-dimensional subordinator. When one works with the class of subordinators constructed from independent one-dimensional subordinators with known transition distributions, such as gamma and inverse Gaussian, or their Sato versions in the additive case, the simulation effort is linear in n. To illustrate, we present a simulation of 100,000 samples of a credit portfolio with 1,000 obligors that takes less than 18 seconds on a PC.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "743c74b849893163af4dad603fdd7441",
  "timestamp": "2025-05-15T01:01:41.619571"
}