{
  "id": 8635,
  "title": "Modeling the determinants of consumers' attitudes toward online group buying: Do risks and trusts matters?",
  "abstract": "The aim of this research is to investigate the determinants of consumers' attitude towards online group buying (OGB). Furthermore, this study compares male and female shoppers based on their purchasing behavior in OGB. Partial Least Square-Structural Equation Modeling (PLS-SEM) approach supported by Smart-PLS 2.0 was used for data analysis as it avoids biases in the parameter estimation in regression analysis. A PLS-SEM approach revealed that website trustworthiness was the strongest predictor of consumers' attitude towards OGB. Consumers noted that the site of initiator appeals to be more trustworthy than other sites and delivers every promise made. Indeed, they felt trusted for their group buying on the Internet when clear legal privacy statements including guarantees are available on the websites. They were assured that initiator's protective measures for online payment are secured. The reliability and validity of the measurement items used and collection of data via survey questionnaires clearly confirmed the robustness of the research methodology applied which led to the creation of reliable and valid discoveries. Online retail managers should improve their transaction security mechanisms and Internet technology to dwindle consumers' perceived risks in terms of financial, product and time risks, strengthen their trusts, and grow online trading confidence when executing OGB. With sufficient knowledge of network group-buying platform, customers would develop more trust to the security of online group-buying platform which lessen the risk cost thereafter. The viable quantitative empirical results transport new and substantial ideas into the marketing model as it systematically and precisely investigates the significant factors and adds to the emergent works around consumer OGB behavior.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74497874a6d5b51e73e5c6f297332d1c",
  "timestamp": "2025-05-15T03:20:55.915738"
}