{
  "id": 5553,
  "title": "Decoding the systemic risk implications of corporate innovation: Evidence from a three-period game model and a panel data regression",
  "abstract": "How to understand the implications of corporate innovation in integrating economic development and financial stability is of great importance to the academia and the authority. Based on data from Chinese A-share listed firms during 2007-2021, this study constructs a three-period game model and a two-way fixed effects panel regression model to examine the impact of corporate innovation on systemic risk theoretically and empirically. It is found that innovation measured by quantity and investment significantly pushes up corporate systemic risk, and such an effect is stronger in firms facing a more severe principal-agent issue and in firms with weaker internal governance and external supervision. The effect pertains to the fact that innovation features high innovation risk and low innovation information robustness. Nevertheless, innovation quality manifested by R&D capitalization has a significant depressing effect on firm systemic risk. Additional tests show that inventive innovation strategies have a significant pushing-up effect on firm systemic risk. Contrarily, non-inventive innovation strategies are not necessarily related to a lower failure risk and higher innovation information robustness, and impact firm systemic importance and systemic vulnerability inconsistently, causing an undefined effect on firm systemic risk. The study highlights that the authority should scientifically guide enterprises to innovate and focus on improving innovation quality for structuring a balanced system of stabilizing growth and resolving risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74552a95f468060ecec33c6ec1f27221",
  "timestamp": "2025-05-15T02:48:51.380110"
}