{
  "id": 2128,
  "title": "RETRACTED: Multiobjective Optimization Algorithm for EFRM Strategy (Retracted Article)",
  "abstract": "With the rapid development of the global economy in recent years, market competition has become more and more intense. Therefore, the market competitiveness of the enterprises is becoming higher and higher. Among them, the enterprise financial risk management (EFRM) is one of the key factors that decide the enterprise market competition. It also shows that enhancing the enterprise market competition needs to strengthen the enterprise's financial control and management, with the method of reasonable controlling of enterprise financial risk (EFR). The current research and development status of EFRM is combed, the theory of financial internal control and its significance are expounded, the related concepts of the company's financial internal control are studied, and the definition, classification, basic features, and causes of financial risk are analyzed in this paper. Finally, a company is taken as research object, the characteristics and status quo of the company's financial risk system are studied, and its existing problems are analyzed, a mathematical model for the company's FRM is built, and the multiobjective optimization algorithm is used to optimize the model, to improve the level of a company's FRM performance and market competitiveness and to guard against the company's financial risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7465c2390b3754e8d199a6b0108e9df9",
  "timestamp": "2025-05-15T02:11:40.547838"
}