{
  "id": 4437,
  "title": "Breast Cancer-Related Employment Disruption and Financial Hardship in the Sister Study",
  "abstract": "Background: More than one-half of breast cancer cases are diagnosed among women aged younger than 62 years, which may result in employment challenges. This study examined whether cancer-related employment disruption was associated with increased financial hardship in a national US study of women with breast cancer. Methods: Women with breast cancer who were enrolled in the Sister or Two Sister Studies completed a survivorship survey in 2012. Employment disruption was defined as stopping work completely or working fewer hours after diagnosis. Financial hardship was defined as: 1) experiencing financial problems paying for cancer care, 2) borrowing money or incurring debt, or 3) filing for bankruptcy because of cancer. Prevalence ratios and 95% confidence intervals for the association between employment disruption and financial hardship were estimated using multivariable Poisson regression with robust variance. Results: We analyzed data from women employed at diagnosis (n = 1628). Women were a median age of 48 years at diagnosis and 5.6 years from diagnosis at survey completion. Overall, 27.3% of women reported employment disruption (15.4% stopped working; 11.9% reduced hours), and 21.0% experienced financial hardship (16.0% had difficulty paying for care; 12.6% borrowed money or incurred debt; 1.8% filed for bankruptcy). In adjusted analysis, employment disruption was associated with nearly twice the prevalence of financial hardship (prevalence ratio = 1.93, 95% confidence interval = 1.58 to 2.35). Conclusions: Women experiencing employment disruptions after breast cancer may be more vulnerable to financial hardship. Findings highlight the need to target risk factors for employment disruption, facilitate return to work or ongoing employment, and mitigate financial consequences after cancer.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "746d51ecfcda7cc8e693f304ab9e1277",
  "timestamp": "2025-05-15T02:37:16.853503"
}