{
  "id": 3160,
  "title": "Weathering exchange rates: estimating the effect of climate change vulnerability on foreign currency hedging using a text-based approach",
  "abstract": "PurposeThe authors investigate whether firm-specific vulnerability to climate change influences foreign exchange hedging, using a novel text-based measure of firm-level climate change exposure generated by state-of-the-art machine-learning algorithms.Design/methodology/approachThe authors' empirical analysis includes firm-fixed effects, random-effects regressions, propensity score matching (PSM), entropy balancing, an instrumental-variable analysis and using an exogenous shock as a quasi-natural experiment.FindingsThe authors' findings suggest that greater climate change exposure brings about a significant reduction in exchange rate hedging. Companies more exposed to climate change may invest significant resources to address climate change risk, such that they have fewer resources available for currency risk management. Additionally, firms seriously coping with climate change risk may view exchange rate risk as relatively less important in comparison to the risk posed by climate change. Notably, the authors also find that the negative effect of climate change exposure on currency hedging can be specifically attributed to the regulatory aspect of climate change risk rather than the physical dimension, suggesting that companies view the regulatory dimension of climate change as more critical.Originality/valueRecent studies have demonstrated that climatic fluctuations represent one of the most recent sources of unpredictability, thereby impacting the economy and financial markets (Barnett et al., 2020; Bolton and Kacperczyk, 2020; Engle et al., 2020). The authors' study advances this field of research by revealing that company-specific exposure to climate change serves as a significant determinant of corporate currency hedging, thus expanding the existing knowledge base.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7482a39e682f899f329608d7b7530233",
  "timestamp": "2025-05-15T02:22:56.867570"
}