{
  "id": 3174,
  "title": "How quickly do auditors resign from engagements: an examination of auditor resignation lag",
  "abstract": "PurposeThis paper aims to examine factors that determine the time lapse between audit report date and resignation date (the resignation lag). As supporting tests, it also studies auditor resignation and client risk portfolio of the resigning auditor.Design/methodology/approachThis paper uses a high-profile case in Hong Kong and a logistic regression to study resignation lag, an ordinary least squares regression to examine auditor resignation, and t-tests and chi-square tests to investigate the risk portfolio of clients dropped, retained and taken-up by the auditor.FindingsThis paper reports that resignation lag is shorter for clients listed on the main board, with a reported loss or high leverage. The results of a reported loss and high leverage indicate that riskier clients are dropped sooner by the auditor. It also finds that more risky clients are dropped by the auditor and less likely taken up by other Big 4 auditors, and dropped clients become riskier after being dropped. In addition, new clients are not more risky than continuing clients but less risky than clients dropped.Research limitations/implicationsSince client risk could not be measured by a single risk variable, the conclusion of the results depends on the totality of the results of all variables used. Generalisation of the results should be done cautiously due to the small sample size. As the literature lacks a model that explains resignation lag, the results could be different had such a model exists.Originality/valueThe investigation of resignation lag advances the literature because it is in the interest of auditors to drop more unfavourable engagements sooner. This efficiency issue, absent in prior studies, is important to an understanding of the audit market. In addition, resignation lag could serve as an observable, summary measure of the resigning auditors' assessment of client risk, and participants in the market could infer the riskiness of dropped clients using resignation lag.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7489cba8ca4e054e6be723e95f92fe94",
  "timestamp": "2025-05-15T01:14:16.254463"
}