{
  "id": 2889,
  "title": "Analysis of the economic-financial risk indicators of the Companies with the ESG seal: Comparison between the companies that make up the ISE and those listed on the BM&FBOVESPA",
  "abstract": "This study aims to analyze whether companies with the ESG (Environmental, Social and Governance) seal listed in the Corporate Sustainability Index (ISE) have better risk management of their short and long-term liabilities compared to companies that do not obtain this classification on the BM & FBovespa. Carrying out this quantitative and qualitative research, the Balance Sheet and Cash Flow Statement, for the periods 2017 to 2020, of 298 companies listed on the Stock Exchange (B3), among which are listed on the ISE, were analyzed, excluding the financial economic sector from the analysis. The indicators analyzed were liquidity ratios, operating cash flow return on equity and long-term liabilities, and Net Working Capital (CGL) requirements. The research is classified as descriptive and exploratory in terms of its objectives, and bibliographical and documental in terms of procedures. The results observed through the calculations of the data of the financial indicators reveal that the companies in the ISE and B3 have similar results and present good risk management when combining the three indicators, in addition it was identified that, despite some indicators, they favor companies that do not are on the ISE, they presented financial performance similar or better to group B3 and consequently revealed to have a lower or similar economic-financial risk. As a suggestion for future research, the study of the international market and the financial economic sector was suggested.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "748e4532034b93303716419ded41a28d",
  "timestamp": "2025-05-15T02:20:16.909683"
}