{
  "id": 4300,
  "title": "Associations of financial toxicity with symptoms and unplanned healthcare utilization among cancer patients taking oral chemotherapy at home: a prospective observational study",
  "abstract": "BackgroundCancer patients with financial toxicity experience psychological distress and often miss medical appointments and quit treatments early, which could be a barrier to the effective management of oral chemotherapy drugs at home. This study explores whether financial toxicity predicts symptoms and unplanned healthcare utilization among cancer patients taking oral chemotherapy at home, which will contribute to the safe management of oral chemotherapy.MethodsData in this study was from a prospective observational study, which was conducted between October 2018 and December 2019. 151 patients completed the Comprehensive Score for Financial Toxicity at discharge and completed the MD Anderson Symptom Inventory and unplanned healthcare utilization questionnaires after finishing one cycle of oral chemotherapy at home. Regression analyses were conducted to explore the associations of financial toxicity with symptoms and unplanned healthcare utilization.ResultsAmong 151participants, 88.08% reported severe or moderate financial toxicity, 43.05% reported symptom interference, and 31.79% reported unplanned healthcare utilization while taking oral chemotherapy at home. Patients between the age of 45-60y (p = 0.042) have higher financial toxicity, while those living in urban areas (p = 0.016) have lower financial toxicity. Patients with worse financial toxicity suffered increased symptoms of fatigue, emotional distress, disturbed sleep, and lack of appetite. Consequently, their mood and personal relation with other significant suffered. However, no statistical differences in unplanned healthcare utilization were found among patients with different levels of financial toxicity.ConclusionMiddle-aged adults and those living in suburban or rural areas experienced worse financial toxicity than other groups. Patients with worse financial toxicity experienced more severe psychological symptoms (e.g., fatigue, distress, disturbed sleep, and lack of appetite) and affective interference (e.g., mood and relations with others). Identifying at-risk patients is necessary to offer tailored support for psychological symptom management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "749a362bbd39aa5698b602babd72232e",
  "timestamp": "2025-05-15T02:35:26.330003"
}