{
  "id": 883,
  "title": "Primary Prevention of Cardiovascular Disease at Community Clinics in the State of Sao Paulo, Brazil: Results from the Epidemiological Information Study of Communities",
  "abstract": "Background: Primary prevention of cardiovascular disease (CVD) remains a major challenge, especially in communities of low-and middle-income countries with poor medical assistance influenced by distinct local, financial, infrastructural, and resource -related factors. Objective: This a community-based study aimed to determine the proportion and prevalence of uncontrolled cardiovascular risk factors (CRF) in Brazilian communities. Methods: The EPICO study was an observational, cross-sectional, and community clinic-based study. Subjects were living in Brazilian communities and were of both sexes and & GE;18 years old, without a history of a stroke or myocardial infarction but presenting at least one of the following cardiovascular risk factors: hypertension, diabetes mellitus and hypercholesterolemia. The study was carried out in Brazil, including 322 basic health units (BHU) in 32 cities. Results: A total of 7,724 subjects with at least one CRF were evaluated, and one clinical visit was performed. Mean age was 59.2 years-old (53.7% were >60 years old). A total of 66.7% were women. Of the total, 96.2% had hypertension, 78.8% had diabetes mellitus type II, 71.1% had dyslipidemia, and 76.6% of patients were overweight/obese. Controlled hypertension (defined by <130/80 mmHg or <140/90 mmHg) was observed in 34.9% and 55.5% patients among respective criteria, the rates of controlled blood glucose in patients taking antidiabetic medications was 29.5%, and among those with documented dyslipidemia who received any lipid-lowering medication, only 13.9% had LDL-c on target. For patients presenting three CRF less than 1.9% had LDL-c < 100 mg/dL once their BP and blood glucose were on target. High education level as associated with blood pressure (BP) target of less than 130 / 80mm Hg. The glucose and LDL-c levels on target were associated with the presence of hypertension and diabetes mellitus. Conclusion: In Brazilian community clinics, regarding most patients in primary prevention, the CRF such as BP, blood glucose, and lipid levels are poorly controlled, with a majority of patients not achieving guidelines/recommendations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74ae6522e9cfa202d0d06e77c03c34df",
  "timestamp": "2025-05-15T01:43:54.594221"
}