{
  "id": 3451,
  "title": "Availability and Suitability of Digital Health Tools in Africa for Pandemic Control: Scoping Review and Cluster Analysis",
  "abstract": "Background: Gaining oversight into the rapidly growing number of mobile health tools for surveillance or outbreak management in Africa has become a challenge. Objective: The aim of this study is to map the functional portfolio of mobile health tools used for surveillance or outbreak management of communicable diseases in Africa. Methods: We conducted a scoping review by combining data from a systematic review of the literature and a telephone survey of experts. We applied the PRISMA (Preferred Reporting Items for Systematic Reviews and Meta-Analyses) guidelines by searching for articles published between January 2010 and December 2020. In addition, we used the respondent-driven sampling method and conducted a telephone survey from October 2019 to February 2020 among representatives from national public health institutes from all African countries. We combined the findings and used a hierarchical clustering method to group the tools based on their functionalities (attributes). Results: We identified 30 tools from 1914 publications and 45 responses from 52% (28/54) of African countries. Approximately 13% of the tools (4/30; Surveillance Outbreak Response Management and Analysis System, Go.Data, CommCare, and District Health Information Software 2) covered 93% (14/15) of the identified attributes. Of the 30 tools, 17 (59%) tools managed health event data, 20 (67%) managed case-based data, and 28 (97%) offered a dashboard. Clustering identified 2 exceptional attributes for outbreak management, namely contact follow-up (offered by 8/30, 27%, of the tools) and transmission network visualization (offered by Surveillance Outbreak Response Management and Analysis System and Go.Data). Conclusions: There is a large range of tools in use; however, most of them do not offer a comprehensive set of attributes, resulting in the need for public health workers having to use multiple tools in parallel. Only 13% (4/30) of the tools cover most of the attributes, including those most relevant for response to the COVID-19 pandemic, such as laboratory interface, contact follow-up, and transmission network visualization.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74b6ce912f4cae7df2c8eae1baf9aa70",
  "timestamp": "2025-05-15T01:17:25.427658"
}