{
  "id": 9191,
  "title": "ESG performance and dividend stability of the world's largest enterprises",
  "abstract": "PURPOSE: Theoretical and empirical research on corporate sustainability focuses on the relationship between environmental, social, and governance (ESG) performance and profitability or market value; little attention is given to describing their effect on dividend policy. Therefore, the main purpose of this paper is to address the research gap by identifying the relationship between corporate sustainability performance and the stability of dividend payouts. To achieve this goal, we formulated a general research hypothesis that there is a positive link between an enterprise's ESG performance and its propensity to pay stable dividends. This research hypothesis is operationalized by the following five specific hypotheses: (1) the link between the overall ESG score and the propensity to pay stable dividends is positive; (2) the link between the environmental pillar score and the propensity to pay stable dividends is positive; (3) the link between the social pillar score and the propensity to pay stable dividends is positive; (4) the link between the governance pillar score and the propensity to pay stable dividends is positive; (5) the link between the ESG controversies score and the propensity to pay stable dividends is positive. METHODOLOGY: The hypothesis was empirically verified using a logistic regression model among the world's largest non-financial enterprises listed in the Global 500 of 2021 for the years 2012-2021. The specifications of the general model include sustainability variables such as environmental, social, and governance pillar scores, as well as the ESG controversies score, which measures an enterprise's exposure to environmental, social, and governance controversies and negative events reflected in global media. The financial ratios, such as a return on assets, current ratio, and debt-to-equity ratio, are considered control variables in the model specifications. The research was extended by implementing descriptive statistics and Pearson correlation coefficients. All required financial and sustainability data were retrieved from the London Stock Exchange Group (LSEG) Eikon database. FINDINGS: The results of the estimation revealed that: (1) the effect of integrated ESG activities on payout stability is statistically significant and negative only in model specifications without the ESG controversies; (2) the effect of the environmental dimension is statistically significant and negative only when other particular ESG pillars are not considered; (3) the effect of the social dimension is statistically significant and negative, only when the governance dimension and the ESG controversies are not considered together in the same model specification; (4) the effect of the governance dimension is statistically significant and positive only if other particular pillars are considered together in one model specification, both with and without the ESG controversies; (5) the effect of the ESG controversies is statistically significant and positive in each model specification. Therefore, the general research hypothesis cannot be confirmed because only the fifth specific research hypothesis can be positively verified in all model specifications. IMPLICATIONS: Further research should be conducted on the relationship between corporate sustainability performance and dividend policy. It should consider not only commonly applied ESG scores but also the ESG controversies score, which was statistically significant in this research. Governments and international organizations should cooperate with companies that provide ESG data to make ESG scores, including the ESG controversies score, publicly available to all stakeholder groups, which would help to reduce the information gap. Managers should pay more attention to increasing the visibility of ESG initiatives from the perspective of risk, which they allow to avoid controversies in particular corporate sustainability dimensions. ORIGINALITY AND VALUE: The value added of this paper is that it investigates the relationship between ESG performance and payout policy, which was not thoroughly explored in previous studies, especially in the context of an enterprise's controversial ESG activities. To fill the research gap in the literature, the authors incorporated the ESG controversies score as an independent variable in the model specifications, which is a novelty in research on dividend policy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74bdc61831cf31922302fa0a1e9642e5",
  "timestamp": "2025-05-15T03:26:25.991490"
}