{
  "id": 2823,
  "title": "UbCadet: detection of compromised accounts in twitter based on user behavioural profiling",
  "abstract": "Online Social Networks(OSNs) are generally at the risk of many potential dangers. Malicious attackers use compromised OSN accounts to spread fake news, to send spam messages and to promote malicious applications which in turn lead to substantial financial and reputation loss. The current scenario in the world is that heavily funded and sophisticated criminal groups execute these malicious activities. Numerous Twitter accounts are either fake or compromised as they are victims of these attacks. Detecting these compromised accounts is a challenging task due to various reasons, including the dynamic behaviour of OSN services and its users. A new framework titled User Behaviour Analytics based Compromised Account Detection(UbCadet) proposed in this paper. Some of the significant derived attributes proposed in this work to profile a Twitter user are Similarity of tweet text, Similarity of hashtag, time of tweeting and Geo-location information. In this work, User Behavioural Profile builds with derived attributes of a Twitter user. Based on this user profile, the tweets of each user converts to individual tweet patterns. These patterns are classified as normal or anomalous using k-Nearest Neighbour machine learning algorithm. Additionally, the ensemble method and Random Forest classifier has also experimented for pattern classification. An account classifies as compromised or benign based on the frequency of normal or anomalous tweets from that account. The dataset collected from Yelp, which is a popular crowd-sourced review forum is also used for the experiment in addition to the Twitter dataset, to examine the applicability of the proposed approach in other OSNs. Experimental results show that the proposed UbCadet achieves a high accuracy and reduced false-positive rate.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74cbc95a3cb9e35156e99f1fb408fe3d",
  "timestamp": "2025-05-15T02:19:46.608239"
}