{
  "id": 6312,
  "title": "Assessment of the workload and financial burden of Bosniak IIF renal cyst surveillance in a tertiary referral hospital",
  "abstract": "Background The Bosniak classification is a CT classification which stratifies renal cysts based on imaging appearances and therefore associated risk of malignancy. Bosniak IIf cysts are renal which have complex features and therefore require surveillance. Aims The aim of this study is to assess the economic and workload burden of diagnosing and following up Bosniak IIf cysts on the urology service in a tertiary hospital in the West of Ireland. Methods All patients with a diagnosis of Bosniak IIf renal cysts attending our urology service between 1st of January 2012 and 31st December 2020 were analysed. The following data were collected: number and modality of follow up scans, number of MDT discussions, number and type of outpatient appointments, surgical intervention, and length of follow up. Financial data were provided by the hospital finance department. Results One hundred and sixty-two patients were included. Total cost of follow up was euro164,056, costing euro1,012.7 per patient. Cost of outpatient visits was euro77,850. Follow-up length ranged from 1 to 109 months, median follow up time 17.5 months. Overall cost of imaging was euro74,518. There were a total of 80 MDT discussions at an overall cost of euro11,688. Conclusions This study demonstrates that surveillance of patients with Bosniak IIf renal cysts represents a significant burden upon both radiology and urology services. Surveillance for these patients could be streamlined in the future through a number of initiatives such as virtual OPDs and dedicated MDTs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74ce66f244b53f0e0690d86afdf91992",
  "timestamp": "2025-05-15T02:56:37.568057"
}