{
  "id": 6958,
  "title": "Associations of a Composite Stress Measurement Tool With Cardiovascular Risk Factors and Outcomes: Findings From the Dallas Heart Study",
  "abstract": "Background: Most data linking chronic stress with cardiovascular disease (CVD) risk factors and outcomes have focused on single-domain stress measurements. We evaluated the association between a novel composite measure of chronic perceived stress and CVD risk factors and outcomes in a diverse population. Methods and Results: Individual chronic stress subcomponents (generalized stress, psychosocial, financial, and neighborhood stress) were standardized and integrated to create a novel composite stress score (CSS). Participants from the DHS (Dallas Heart Study) phase 2 (2007-2009) visit without prevalent CVD who completed chronic stress questionnaires were included (n=2685). Associations between CSS and demographics, cardiac risk factors, and health behaviors were assessed in multivariable analyses. Cox proportional hazards models adjusting for traditional risk factors were used to determine associations of the CSS with adjudicated atherosclerotic CVD and global CVD (atherosclerotic CVD, heart failure, and atrial fibrillation) outcomes. CSS was higher among participants who were younger, women, and Black or Hispanic individuals, with lower income and educational attainment (P<0.0001 for each). In multivariable regression models adjusting for age, sex, race and ethnicity, income and education, higher CSS associated with hypertension, smoking, higher body mass index, hemoglobin A1C, high-sensitivity C-reactive protein, and sedentary time (P<0.01 for each). Over a median follow-up of 12.4 years, higher CSS associated with atherosclerotic CVD (adjusted hazard ratio [HR]. 1.22 per SD [95% CI, 1.01-1.47]) and global CVD (adjusted HR, 1.20 [95% CI, 1.03-1.40]). No interactions were seen between CSS, demographic factors, and outcomes. Conclusions: Composite measures of chronic stress are higher in vulnerable populations and may help identify individuals at risk for CVD who may benefit from enhanced prevention strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74cff90c04478aaea0891a023c12f57f",
  "timestamp": "2025-05-15T03:03:13.551149"
}