{
  "id": 7377,
  "title": "Childhood Adversity as a Predictor of Non-Adherence to Statin Therapy in Adulthood",
  "abstract": "Purpose To investigate whether adverse experiences in childhood predict non-adherence to statin therapy in adulthood. Methods A cohort of 1378 women and 538 men who initiated statin therapy during 2008-2010 after responding to a survey on childhood adversities, was followed for non-adherence during the first treatment year. Log-binomial regression was used to estimate predictors of non-adherence, defined as the proportion of days covered by dispensed statin tablets <80%. In fully adjusted models including age, education, marital status, current smoking, heavy alcohol use, physical inactivity, obesity, presence of depression and cardiovascular comorbidity, the number of women ranged from 1172 to 1299 and that of men from 473 to 516, because of missing data on specific adversities and covariates. Results Two in three respondents reported at least one of the following six adversities in the family: divorce/separation of the parents, long-term financial difficulties, severe conflicts, frequent fear, severe illness, or alcohol problem of a family member. 51% of women and 44% of men were non-adherent. In men, the number of childhood adversities predicted an increased risk of non-adherence (risk ratio [RR] per adversity 1.11, 95% confidence interval [CI] 1.01-1.21], P for linear trend 0.013). Compared with those reporting no adversities, men reporting 3-6 adversities had a 1.44-fold risk of non-adherence (95% CI 1.12-1.85). Experiencing severe conflicts in the family (RR 1.27, 95% CI 1.03-1.57]) and frequent fear of a family member (RR 1.27, 95% CI 1.00-1.62]) in particular, predicted an increased risk of non-adherence. In women, neither the number of adversities nor any specific type of adversity predicted non-adherence. Conclusions Exposure to childhood adversity may predict non-adherence to preventive cardiovascular medication in men. Usefulness of information on childhood adversities in identification of adults at high risk of non-adherence deserves further research.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74d69c136465e20bd8a6a222c2abb798",
  "timestamp": "2025-05-15T03:08:00.764973"
}