{
  "id": 1419,
  "title": "Effect of social media rumors on stock market volatility: A case of data mining in China",
  "abstract": "The Stock Market is a typical complex network composed of investors, stocks, and market information. The abnormal fluctuation of the Stock Market has a strong effect on the economy of a country and even that of the world. Fueled by the herd effect of the increasingly abundant social media, Internet rumors, as an important source of market information and an exogenous financial risk, can lead to the collapse of investor confidence and the further propagation of financial risks, which can damage the financial system and even lead to social unrest. With additional availability of computing techniques, we attempt to uncover the media information effects in the stock market and seek to provide researchers with 1) a theoretical reference for a comprehensive understanding of such a complex network, 2) accurate prediction of future data, and 3) design of efficient and reliable risk intervention models. Based on the data of China's Stock Market, this study uses machine learning to investigate social media rumors to reveal the interplay of social media rumors and stock market volatility. In this work, we find patterns from social media rumors from financial forums using machine learning, quantify social media rumors based on statistics, and analyze the mechanism of propagation and influence of social media rumors on stock market volatility using econometric models. The empirical results show that rumors play an important information transmission effect on stock market volatility and the constructed Internet Financial Forum Rumor Index is helpful to sense the potential impact of rumors, i.e., a significant lagged negative effect. These findings are of guidance for the optimization of the information environment, and can serve to promote the healthy and stable development of the stock market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74ef97932769703b76857a346f3dfbb9",
  "timestamp": "2025-05-15T02:03:00.611103"
}