{
  "id": 8314,
  "title": "Which factors are associated with cannabis use among adolescents in Andalusia? An application of the I-Change model",
  "abstract": "Background Cannabis use is increasing among Andalusian adolescents, causing health, social and financial problems. School nurses visit schools and provide health promotion to adolescents in Andalusia. In order to better tailor health promotion programs, it is important to understand the sociodemographic and motivational factors related to cannabis use in Andalusian adolescents. Design/Methods In this cross-sectional study, 369 students (aged 15-18 years) from secondary schools in Andalusia were involved. An anonymous questionnaire based on the I-Change Model was self-administered during school hours. Cannabis users were compared with non-cannabis users regarding sociodemographic and motivational factors. Contingency tables, mean comparison tests, and logistic regression analyses were conducted. Results The prevalence of cannabis use in the last year was 21.6%. Non-cannabis users had a few positive beliefs toward cannabis use (e.g. the ability to relax or medical benefits), as well as users. Users recognized some disadvantages of cannabis use but played down their importance and mentioned more advantages. Moreover, social influence, especially from peers, plays a critical role in cannabis use. Specific social situations and moods seemed to be special risk factors for cannabis use, such as being at a celebration or feeling good. Results of regression analysis showed that cannabis use is mainly associated with age, low family function, low family affluence, high pocket money, perceiving few disadvantages of cannabis use, much social modeling of cannabis use, social norm and pressure favoring cannabis, low self-efficacy to resist using cannabis and positive intentions to use cannabis. Conclusions Based on our results, prevention programmes lead by nurses can be tailored to the factors important to prevent cannabis use, focusing on outlining the disadvantages of cannabis use, alternatives for using cannabis when feeling good, increasing salience of healthy social influences and reinforcing self-efficacy to resist temptations to use cannabis are recommended. Clinical Relevance Nurses need to know the sociodemographic factors and motivations associated with the use of cannabis in adolescents in order to establish effective preventive interventions at school.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "74fd9e6cdd5f699d707f328bf221c73b",
  "timestamp": "2025-05-15T03:17:49.060993"
}