{
  "id": 7749,
  "title": "A Cost Analysis of Hospitalizations for Infections Related to Injection Drug Use at a County Safety-Net Hospital in Miami, Florida",
  "abstract": "Background Infections related to injection drug use are common. Harm reduction strategies such as syringe exchange programs and skin care clinics aim to prevent these infections in injection drug users (IDUs). Syringe exchange programs are currently prohibited by law in Florida. The goal of this study was to estimate the mortality and cost of injection drug use-related bacterial infections over a 12-month period to the county safety-net hospital in Miami, Florida. Additionally, the prevalence of HIV and hepatitis C virus among this cohort of hospitalized IDUs was estimated. Methods and Findings IDUs discharged from Jackson Memorial Hospital were identified using the International Classification of Diseases, Ninth Revision, codes for illicit drug abuse and endocarditis, bacteremia or sepsis, osteomyelitis and skin and soft tissue infections (SSTIs). 349 IDUs were identified for chart abstraction and 92% were either uninsured or had publicly funded insurance. SSTIs, the most common infection, were reported in 64% of IDUs. HIV seroprevalence was 17%. Seventeen patients (4.9%) died during their hospitalization. The total cost for treatment for injection drug use-related infections to Jackson Memorial Hospital over the 12-month period was $11.4 million. Conclusions Injection drug use-related bacterial infections represent a significant morbidity for IDUs in Miami-Dade County and a substantial financial cost to the county hospital. Strategies aimed at reducing risk of infections associated with injection drug use could decrease morbidity and the cost associated with these common, yet preventable infections.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "750f0f1a2835a131bfa35e456509bc84",
  "timestamp": "2025-05-15T03:11:38.563851"
}