{
  "id": 9045,
  "title": "Short-term attributable risk and economic burden of hospital admissions for anxiety disorders due to air pollution: a multicity time-stratified case-crossover study",
  "abstract": "Background Anxiety disorders are a leading cause of severe quality of life impairment and are among the most common mental disorders globally. However, few studies have investigated the association between exposure to high levels of air pollution and an increased risk of developing anxiety disorders. This study aimed to investigate the relationship between air pollutants and hospitalisation for anxiety disorders and the associated economic burden of these hospitalisations in Sichuan, China. Methods We collected 7,282 records of anxiety disorder hospitalisation from medical institutions across nine cities between January 1, 2017, and December 31, 2018. Concurrent meteorological and air pollution data, including temperature, humidity, PM2.5, PM10, SO2, and CO, were obtained from 183 monitoring stations in Sichuan Province. After controlling for long-term trends, day of the week, and meteorological factors, we employed a time-stratified case-crossover design based on conditional logistic regression to assess the association between concentrations of the four pollutants (PM2.5, PM10, SO2, and CO) and hospital admissions for anxiety disorders, with stratified analysis by age, sex, and season. The cost of hospitalisation was evaluated using the cost-of-illness method. Results The finding indicated a positive correlation between short-term exposure to air pollutants and hospitalization rates of anxiety disorders. The effect of each 10 mu g/m3 increase in airborne particulate matter (PM) and SO2 on hospital admissions for people with anxiety disorders peaked with a lag of 5 days, and each 1 mg/m3 increase in CO had the greatest effect on the 0-7 day moving average lag, with OR values of PM2.5:1.002 (95% CI: 1.001,1.004), PM10:1.001 (95% CI: 1.000,1.002), SO2:1.034 (95% CI: 1.020,1.047), and CO: 1.614 (95% CI: 1.247, 2.089). Air pollution increases the chances of anxiety disorders during the cold season. Furthermore, the elderly are particularly susceptible to these pollutants, which may contribute to an increased hospitalization rates of anxiety disorders (P < 0.05). The total economic cost of hospitalisation for anxiety disorders due to particulate matter pollution was & YEN; 966,319 during the study period. Conclusion Short-term exposure to PM2.5, PM10, SO2, and CO may increase the risk of hospital admissions for anxiety disorders and impose significant financial burdens.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "750fd36564d56fb5f8a2f254698e5431",
  "timestamp": "2025-05-15T03:24:54.936875"
}