{
  "id": 6977,
  "title": "Risk Factors for Revision Surgery After Superior Labral Anterior-Posterior Repair: A National Perspective",
  "abstract": "Background: Data regarding risk factors for revision surgery after superior labral anterior-posterior (SLAP) repair are limited to institutional series. Purpose: To define risk factors for revision surgery after SLAP repair among patients in a large national database. Study Design: Case-control study; Level of evidence, 3. Methods: A national insurance database was queried for patients undergoing arthroscopic SLAP repair (Current Procedural Terminology [CPT] code 29807) for the diagnosis of a SLAP tear. Patients without a CPT modifier for laterality were excluded. Revision surgery was defined as (1) subsequent ipsilateral SLAP repair (CPT 29807), (2) ipsilateral arthroscopic debridement for the diagnosis of a SLAP tear (CPT 29822 or 29823, with diagnosis code 840.7), (3) subsequent ipsilateral arthroscopic biceps tenodesis (CPT 29828), (4) subsequent ipsilateral open biceps tenodesis (CPT 23430), and (5) subsequent biceps tenotomy (CPT 23405). Multivariable binomial logistic regression analysis was performed to identify risk factors for revision surgery after SLAP repair, including patient demographics/comorbidities, concomitant diagnoses, and concomitant procedures performed. Odds ratios (ORs), 95% CIs, and P values were calculated. The estimated financial impact of revision surgery was also calculated. Results: There were 4751 patients who met inclusion and exclusion criteria. Overall, 121 patients (2.5%) required revision surgery after SLAP repair. Regression analysis identified numerous risk factors for revision surgery, including age >40 years (OR, 1.5; 95% CI, 1.2-1.8; P = .045), female sex (OR, 1.5; 95% CI, 1.3-1.8; P = .010), obesity (OR, 1.8; 95% CI, 1.5-2.2; P = .001), smoking (OR, 2.0; 95% CI, 1.6-2.4; P < .0001), and diagnosis of biceps tendinitis (OR, 3.5; 95% CI, 3.0-4.2; P < .0001) or long head of the biceps tearing (OR, 5.1; 95% CI, 4.1-6.3; P < .0001) at or before the time of surgery. Concomitant rotator cuff repair and distal clavicle excision were not significant risk factors for revision surgery. The cost of revision surgery averaged almost $9000. Conclusion: Risk factors for revision surgery after SLAP repair include age >40 years, female sex, obesity, smoking, and diagnosis of biceps tendinitis or long head of the biceps tearing. The diagnosis of biceps tendinitis (OR, 3.5) or long head of the biceps tearing (OR, 5.1) at or before the time of surgery was an especially significant risk factor for revision surgery. The high cost of revision surgery highlights the importance of appropriate indications to avoid the need for subsequent procedures.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7510910228448b249579eeee2bf315e2",
  "timestamp": "2025-05-15T03:03:55.691022"
}