{
  "id": 5310,
  "title": "EFFECT OF MONETARY POLICY ON ECONOMIC GROWTH IN NIGERIA IN THE POST STRUCTURAL ADJUSTMENT PROGRAMME",
  "abstract": "The study investigated the effect of monetary policy on economic growth during post structural adjustment programmer in Nigeria. It used the expo-facto design. Secondary data for the period of 1985-2015 were utilized. The data were extracted from the Central Bank of Nigeria (CBN) Statistical Bulletin and the National Bureau of Statistics (NBS). The linear regression with the application of Ordinary least Squares (OLS) technique was employed to estimate the parameters of the model numerically. Finding revealed that broad money supply had a positive and significant effect on economic growth in Nigeria during post structural adjustment programmer from 1986-2015. Interest rate had a negative and significant effect on economic growth in Nigeria during the same period and inflation rate had a positive and insignificant effect on economic growth in Nigeria at the same time. The study recommended that Central Bank of Nigeria should facilitate the emergence of market based interest rate that would attract both domestic and foreign investments, as well as create jobs, and promote non oil export, while reviving industries that are currently operational, far below installed capacity. In order to strengthen the financial sector, the Central Bank has to encourage the introduction of more financial instruments that are flexible enough to meet the risk preferences and sophistication of operators in the financial sector.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "752f05de0d4a0d291229cc8ce1421f52",
  "timestamp": "2025-05-15T02:46:16.291709"
}