{
  "id": 3222,
  "title": "Loan Applicant Anomaly Detection",
  "abstract": "Anomaly detection, also known as outlier detection, involves identifying data points or patterns that deviate significantly from the expected or normal behavior within a dataset. Anomaly detection in loan applicants is an important topic in the financial industry to reduce the risk of default and prevent fraud. The financial industry has proposed several techniques to identify anomalies in loan applicant data. This study aims to identify anomalous loan applicants by utilizing methods such as k-Nearest Neighbor (k-NN), Local Outlier Factor (LOF), Isolation Forest (iForest), and Density-Based Spatial Clustering of Applications with Noise (DBSCAN) to examine and identify specific traits associated with risk-based classifications. The dataset obtained from the Rusamilae branch of the Ibnu Affan Cooperative contains a wide array of characteristics about 3,242 loan applicants. These characteristics encompass demographic indicators, occupation details, credit history, financial information, and the motivations for their loan applications. The results indicate that iForest outperforms other methods in accurately identifying 86 non-conventional loan applicants and achieving an average silhouette coefficient of 0.28 for categorizing them into two distinct groups. The findings of the characteristic investigation reveal that high-quality loan applicants possess a total income that surpasses that of low-quality loan applicants. In contrast, the group of financially disadvantaged loan applicants has a significant number of payment defaults and a substantial amount of outstanding debt.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7535d243b08ef70f0ef216650482f2db",
  "timestamp": "2025-05-15T02:24:05.018506"
}