{
  "id": 6688,
  "title": "A Predictive Model and Risk Score for Unplanned Cardiac Surgery Intensive Care Unit Readmissions",
  "abstract": "BackgroundReadmissions or bounce back to the intensive care unit (ICU) following cardiac surgery is associated with an increased risk of morbidity and mortality. We sought to identify clinical and system-based factors associated with ICU bounce backs in order to generate a Bounce Back After Transfer (BATS) prediction score. MethodsWe prospectively collected the clinical and financial records of all patients undergoing coronary artery bypass grafting (CABG) or surgical aortic valve replacement (AVR) between May 2013 and March 2014. Multivariable logistic regression was used to identify independent predictors of bounce backs to the ICU which served as the basis for our BATS score. ResultsOf the 532 patients that underwent CABG or AVR during the study period, 35 (6.6%) were readmitted to the ICU. After risk adjustment, female sex, NYHA class III/IV, urgent or emergent operative status, and postoperative renal failure were the predictors of ICU bounce backs utilized to create the BATS score. Patients in the low (<5), moderate (5-10), and high-risk (>10) score cohorts experienced bounce back rates of 3.0%, 10.4%, and 42%, respectively. After adjusting for preoperative patient risk, ICU bounce back resulted in an increase in $68,030 to a patient's total hospital charges. ConclusionsA predictive model (BATS) can determine the risk of a bounce back to the ICU after transfer to the floor. We speculate that determination of a patient's BATS upon ICU transfer would allow targeted floor care and decrease bounce back rates, along with postoperative morbidity, mortality, and cost of care. doi: 10.1111/jocs.12589 (J Card Surg 2015;30:685-690)",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "755ddd6da5e05725e5b8bd6d0e1c781b",
  "timestamp": "2025-05-15T03:00:35.446974"
}