{
  "id": 8210,
  "title": "Trend of passive smoking and associated factors in Iranian children and adolescents: the CASPIAN studies",
  "abstract": "Background It is well documented that, similar to active smokers, passive smokers are also at an increased risk of developing non-communicable diseases, and it could impose high financial costs on the healthcare system. This study aimed to evaluate the trend of passive smoking and related determinants during the three phases of a school-based surveillance program. Methods This is a secondary study using the national data obtained from three phases of the surveillance program entitled The Childhood and Adolescence Surveillance and Prevention of Adult Noncommunicable Disease (CASPIAN) study, conducted from 2008 to 2014 on Iranian children and adolescents living in urban and rural areas of 30 provinces in Iran. Participants were selected by cluster multistage sampling method. Results Overall, the study participants consisted of 33,288 students (50.5% boys) with a mean (+/- SD) age of 12.8 +/- 3.2 years. The passive smoking rate was significantly increased from 35.6% in 2008 to 43.2% in 2015 among children and adolescents. According to the multivariate logistic regression, father's university education, mother's employment, life satisfaction, and socioeconomic status had a protective role regarding second-hand smoke exposure. In contrast, the father's self-employment had a positive role in increasing the rate of passive smoking. Conclusion Considering the increasing trend of passive smoking and its considerable adverse health effects, it is necessary to implement large-scale public interventions to reduce the rate and hazards of exposure to tobacco smoke.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "755e6cc445c9400dc8469032941de18b",
  "timestamp": "2025-05-15T03:16:17.474751"
}