{
  "id": 5213,
  "title": "Assessment of users' adoption behaviour for stock market investment through online applications",
  "abstract": "Investing in stocks has become increasingly accessible, with beginners able to start an account via a brokerage's website or mobile app with very little money. Online trading through applications allows you to trade independently without a broker's interference. This not only lowers the overall cost of trading but also makes it hassle-free, increasing the value of the business significantly. Using an online trading account gives an investor more control. This paper examined the user's perspective on stock market investment through online applications. The impact of users' awareness, benefits & choice of investment, reliability, safety, risk-related factors, financial literacy, technical aspect, and dependency was analyzed on users' adoption behaviour. An empirical survey with a valid sample of 424 respondents from India was collected from the respondent and analyzed using descriptive analysis, correlation analysis, reliability analysis, analysis of variance, and regression analysis. Results indicated that users' awareness, benefits & choice of investment, reliability, safety, risk-related factors, financial literacy, technical aspect, and dependency significantly influence the users' adoption behaviour in using stock trading applications. The findings will assist potential investors in comprehending the factors influencing the adoption of such apps and aiding the organizations engaged in operating or creating such applications in understanding user behaviour, which will significantly add value to the society at large.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7560a832fce89154150d829712993541",
  "timestamp": "2025-05-15T02:45:47.310178"
}