{
  "id": 1538,
  "title": "Service risk of energy industry international trade supply chain based on artificial intelligence algorithm",
  "abstract": "With the deepening of the process of global economic integration, international trade supply chain financial services have also flourished. International trade supply chain financial services have played an important role in solving supply chain enterprise financing. As far as the energy industry is concerned, international trade supply chain financial services can provide sufficient credit support for energy companies. This solves the financing dilemma of small and medium-sized energy companies in import and export trade, and can also improve the capital turnover rate of large energy companies. However, because the international trade supply chain financial service still faces the influence of risks such as corporate credit risk, bank operational risk, and supply chain enterprise information transmission risk, its function of providing financing has not been fully exerted. Early warning and control of risks existing in international trade supply chain financial services can fully play the role of international trade supply chain financial services in promoting the development of the energy industry. Therefore, this article used three artificial intelligence (AI) algorithms, including artificial neural network, genetic algorithm and particle swarm algorithm, to analyze the risk of financial services in the international trade supply chain of the energy industry. A risk early-warning model about the financial services of the international trade supply chain of the energy industry was constructed, and an experimental study on the risk early-warning model was carried out. Research showed that the risk early warning model based on AI algorithm enabled banks to improve the accuracy of corporate credit assessment by 7.43% and the accuracy of information collection by 5.61%. It improved the forecast accuracy of external environmental risks by 3.52%, and reduced bank operational risk by 6.58% and legal and regulatory risk by 7.06%. (C) 2022 The Authors. Published by Elsevier Ltd.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75690316f85ce92d91f6caf881d2b149",
  "timestamp": "2025-05-15T02:04:20.091699"
}