{
  "id": 5662,
  "title": "Minority Student Perceptions of the Impact of Financial Cost of Pharmacy School and Career Choice at a Historically Black College and University (HBCU)",
  "abstract": "Objective: One of the barriers that might prevent an underrepresented minority (URM) individual from pursuing a professional career in the United States is finances. The high disproportionate burden of student debt among URM students further perpetuates the racial wealth gap. Therefore, this study sought to evaluate the extent to which URM students' personal finance perceptions, and current and projected student loan indebtedness affect postgraduation career intentions. Methods: A cross-sectional analysis was conducted using data from four cohorts of pharmacy students using a survey from November 2, 2022, to February 1, 2023. The financial perception survey included subscales namely personal finance self-efficacy, debt influence and pressure, and risk mitigation and retirement. Descriptive statistics, simple logistic regression, and multivariate logistic regression analyses were conducted. Results: In total, 93 students completed the survey and had a mean age of 28.1 +/- 5.3 years. Seventy-one percent of the respondents were female, and 67.7 % had completed a 4-year bachelor's degree. There was a significant association between age and the intention to pursue postgraduate training as well as a significant association between risk mitigation and retirement perceptions and intention to pursue postgraduate training after adjusting for other factors. Conclusion: Among students from largely minority backgrounds, age, and confidence in their ability to make wise investment decisions for retirement are associated with a greater likelihood of pursuing postgraduate training opportunities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7592a4e6491c11c632e7fd7ce4eb16fa",
  "timestamp": "2025-05-15T02:49:50.403449"
}