{
  "id": 4390,
  "title": "Socio-demographic predictors of not having private dental insurance coverage: machine-learning algorithms may help identify the disadvantaged",
  "abstract": "Background For accessing dental care in Canada, approximately 62% of the population has employment-based insurance, 6% have some publicly funded coverage, and 32% have to pay out-of pocket. Those with no insurance or public coverage find dental care more unaffordable compared to those with private insurance. To support the development of more comprehensive publicly funded dental care programs, it is important to understand the socio-demographic attributes of all those, who find dental care unaffordable.Methods This study is a secondary analysis of the data collected from Ontarians during the latest available cycle of the Canadian Community Health Survey (2017-18), a cross-sectional survey that collects information on health status, health care utilization, and health determinants for the Canadian population. First, bivariate analysis was conducted to determine the characteristics of Ontarians who lack dental insurance. Afterwards, we employed machine learning (ML) to analyze data and identify risk indicators for not having private dental insurance. Specifically, we trained several supervised ML models and utilized Shapley additive explanations (SHAP) to determine the relative feature importance for not having private dental insurance from the best ML model [the gradient boosting (GBM)].Results Approximately one-third of Ontarians do not have private insurance coverage for dental care. Individuals with an income below $20,000, those unemployed or working part-time, seniors aged above 70, and those unable to afford to have their own housing are more at risk of not having private dental insurance, leading to financial barriers in accessing dental care.Conclusion In the future, government-funded programs can incorporate these identified risk indicators when determining eligible populations for publicly funded dental programs. Understanding these attributes is critical for developing targeted and effective interventions, ensuring equitable access to dental care for Canadians.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75962d1aa88052ad7c5dddd1431a2f97",
  "timestamp": "2025-05-15T02:36:38.486837"
}