{
  "id": 4794,
  "title": "HOLISTIC ASSESSMENT OF THE RISKS ENCOUNTERED BY FAST MOVING CONSUMER GOODS SMES IN SOUTH AFRICA",
  "abstract": "Fast moving consumer goods (FMCG) small and medium-sized enterprises (SMEs) play an indispensable role in the emerging economies by selling products that are often classified as necessities. This paper argues that the traditional classification of risks into mainly operational, strategic, financial, and compliance risk, exposes FMCG SMEs to sustainability issues today. Focusing on sustainability and the associated factors, this paper seeks to offer a broader perspective on the risks that are crucial to the survival of FMCG SMEs in a fast-paced changing environment. The empirical investigation relied on the mixed research methods with the survey questionnaire and personal interviews as tools of interest. Two expert interviews were held to complement the quantitative data that was collected from 289 respondents. The research fmdings highlight the necessity for FMCG SMEs to look beyond the traditional risk types by incorporating social, economic and environmental risks, which are essential elements of the sustainability framework today. By combining these three components of sustainability into risk assessment, the paper seeks to introduce a more holistic view of risk sources that include evolving risk areas that are of growing importance in a rapidly changing global environment.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75aef5b8b470779fc9b3fcc249f76039",
  "timestamp": "2025-05-15T02:41:00.889116"
}