{
  "id": 2264,
  "title": "Detection of Disease in Calves using Artificial Intelligence",
  "abstract": "Background: Livestock farming is experiencing a digital transformation and is becoming more information-driven. However, this type of data is often kept in separate storage towers, making it incapable of practicing its potential to boost animal welfare. Lumpy Skin Disease (LSD) is a serious threat to the health of cattle worldwide and has caused financial problems for many cattle farming enterprises. It has been shown that combining machine learning (ML) and artificial intelligence (AI) with biosensor data and conventional visual inspections can improve the identification and diagnosis of this serious condition. Methods: This study presents an extremely precise livestock farming framework that combines data streams from a wide array of disciplines of dairy cattle to see if ever wider/vast data sources enhance the overall projections for diseases and if using the more complicated prediction models can reimburse for less diverse data to some extent. Using images from the farming landscape, this study highlights the utility of convolutional neural networks (CNNs) in the identification of the Lumpy Skin Disease Virus (LSDV) in animals. Result: An analysis of the relative weight given to individual factors in predicting accuracy shows that disease in dairy cattle results from the intricate interactions between many life domains/parameters, such as housing, nutrition and climate; that prediction performance is enhanced by incorporating a wider range of data sources and that current information can be repurposed to produce useful information for vaccine development. The study highlights the potential of data-driven dairy interventions, focusing on artificial intelligence for disease prediction in cattle, to improve animal welfare and reduce the risk of disease. A Convolutional Neural Network (CNN) based model effectively classified skin conditions with an overall accuracy of 73.89% after 27 training epochs. This study demonstrates CNN's useful applications in the field of veterinary medicine by highlighting its potential for early detection of Lumpy Skin Disease (LSD).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75b75b7b534551c61d02872bda28dd8f",
  "timestamp": "2025-05-15T02:13:31.719749"
}