{
  "id": 8200,
  "title": "Statistical methods to assess the reliability of magnetic data recorded over steel corrosion sites",
  "abstract": "Steel reinforcement corrosion, the most significant cause for Reinforced Concrete (RC) structural failure, should be monitored to reduce human and financial risk. A novel passive-magnetic based Non-Destructive Testing (NDT) method has been developed to assist in quantifying steel reinforcement condition. In this study, the magnetic properties of six rebars with different mass loss percentages are experimentally recorded. Then, to ensure the method's viability, reliability and utility, the magnetic data sets are subjected to different methods of statistical analysis, including T-testing, F-testing, and the calculation of Pearson's correlation. As an example, statistical analysis results show that five scans are needed over the same path of every rebar to ensure a significance level of less than 5% and a power of greater than 90%. The recorded data sets are then interpreted using data-processing approaches based on three features: the power of the magnetic flux density's derivative; the dominant frequency analysis; and the standard deviation of the data. Among these three data-processing approaches, the method based on the standard deviation of the data is demonstrated to be the most reliable. As a result, good correspondence is observed between these magnetic data sets' features and the rebars' general corrosion state. For instance, a regression model with an R-squared value of 0.5 demonstrates that the average of standard deviations calculated for a magnetic data set decreases when corrosion increases. (C) 2020 Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75bb2dceda8e8c361274459143cc56b1",
  "timestamp": "2025-05-15T03:16:17.436077"
}