{
  "id": 9430,
  "title": "Association Between the Patient Driven Payment Model and Therapy Utilization and Patient Outcomes in US Skilled Nursing Facilities",
  "abstract": "This cross-sectional study assesses whether implementation of the Patient Driven Payment Model is associated with changes in therapy utilization or health outcomes. Importance In October 2019, Medicare changed its skilled nursing facility (SNF) reimbursement model to the Patient Driven Payment Model (PDPM), which has modified financial incentives for SNFs that may relate to therapy use and health outcomes. Objective To assess whether implementation of the PDPM was associated with changes in therapy utilization or health outcomes. Design, Setting, and Participants This cross-sectional study used a regression discontinuity (RD) approach among Medicare fee-for-service postacute-care patients admitted to a Medicare-certified SNF following hip fracture between January 2018 and March 2020. Exposures Skilled nursing facility admission after PDPM implementation. Main Outcomes and Measures Main outcomes were individual and nonindividual (concurrent and group) therapy minutes per day, hospitalization within 40 days of SNF admission, SNF length of stay longer than 40 days, and discharge activities of daily living score. Results The study cohort included 201 084 postacute-care patients (mean [SD] age, 83.8 [8.3] years; 143 830 women [71.5%]; 185 854 White patients [92.4%]); 147 711 were admitted pre-PDPM, and 53 373 were admitted post-PDPM. A decrease in individual therapy (RD estimate: -15.9 minutes per day; 95% CI, -16.9 to -14.6) and an increase in nonindividual therapy (RD estimate: 3.6 minutes per day; 95% CI, 3.4 to 3.8) were observed. Total therapy use in the first week following admission was about 12 minutes per day (95% CI, -13.3 to -11.3) (approximately 13%) lower for residents admitted post-PDPM vs pre-PDPM. No consistent and statistically significant discontinuity in hospital readmission (0.31 percentage point increase; 95% CI, -1.46 to 2.09), SNF length of stay (2.7 percentage point decrease in likelihood of staying longer than 40 days; 95% CI, -4.83 to -0.54), or functional score at discharge (0.04 point increase in activities of daily living score; 95% CI, -0.19 to 0.26) was observed. Nonindividual therapy minutes were reduced to nearly zero in late March 2020, likely owing to COVID-19-related restrictions on communal activities in SNFs. Conclusions and Relevance In this cross-sectional study of SNF admission after PDPM implementation, a reduction of total therapy minutes was observed following the implementation of PDPM, even though PDPM was designed to be budget neutral. No significant changes in postacute outcomes were observed. Further study is needed to understand whether the PDPM is associated with successful discharge outcomes. Question Was the Patient Driven Payment Model (PDPM), implemented in October 2019, associated with rehabilitation therapy utilization and health outcomes of patients admitted to skilled nursing facilities (SNFs)? Findings In this cross-sectional study of 201 084 patients admitted to an SNF after hip fracture between January 2018 and March 2020, those admitted post-PDPM received about 13% fewer therapy minutes than those admitted pre-PDPM, but the likelihood of rehospitalization and functional scores at discharge remained unchanged. Meaning Implementation of PDPM was associated with a reduction in the volume of therapy use without changes in subsequent hospitalization risk or discharge functional scores.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75deba5384074569ddee3f3512bde592",
  "timestamp": "2025-05-15T03:28:46.282392"
}