{
  "id": 616,
  "title": "Time-aware and interpretable predictive monitoring system for Anti-Money Laundering",
  "abstract": "Money laundering is a global threat to society nowadays. Governments and governmental authorities fight money laundering, in part, by regulating banks and financial institutions. Financial institutions, in turn, are obligated to implement mechanisms to prevent money laundering. Usually, these prevention mechanisms include automated monitoring systems. In this paper, we propose an Anti -Money Laundering monitoring system based on machine learning techniques, which addresses three requirements: (i) generating accurate and nonredundant alerts; (ii) generating timely alerts; and (iii) associating explanations and risk estimates to each alert. The first requirement is addressed by training a machine learning classification model on different snapshots of customers' history and then feeding the classification scores generated by this model into an alerting policy designed to prevent redundant alerts. The second requirement is addressed via custom metrics for assessing the performance of classification models, which take into account the timeliness requirements that arise in the Anti -Money Laundering domain. Finally, the third requirement is addressed by applying a method for class probability calibration and by an interpretability layer based on Shapley values. The proposed monitoring system has been designed based on requirements provided by an investigation unit at a financial institution and evaluated using real -life data as well as multiple rounds of feedback from specialized subject -matter experts.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75eaae40e21b91381bfa7501a13b5ee5",
  "timestamp": "2025-05-15T01:53:24.740307"
}