{
  "id": 8014,
  "title": "Retinal Vascular Tortuosity, Blood Pressure, and Cardiovascular Risk Factors",
  "abstract": "Objective: To examine the relationship of retinal vascular tortuosity to age, blood pressure, and other cardiovascular risk factors. Design: Population-based, cross-sectional study. Participants: A total of 3280 participants aged 40 to 80 years from the Singapore Malay Eye Study (78.7% response rate). Methods: Retinal arteriolar and venular (vascular) tortuosity were quantitatively measured from fundus images using a computer-assisted program. Retinal vascular tortuosity was defined as the integral of the curvature square along the path of the vessel, normalized by the total path length. Data on blood pressure and major cardiovascular disease (CVD) risk factors were collected from all participants. Mean Outcome Measures: Retinal arteriolar and venular tortuosity. Results: A total of 2915 participants contributed data to this study. The mean (standard deviation) and median were 2.99 (1.40) and 2.73 for retinal arteriolar tortuosity (x10(4)), and 4.64 (2.39) and 4.19 for retinal venular tortuosity (x10(4)), respectively. Retinal venules were significantly more tortuous than retinal arterioles (P < 0.001). In multivariable-adjusted linear regression models, less arteriolar tortuosity was independently associated with older age, higher blood pressure, higher body mass index (BMI), and narrower retinal arteriolar caliber (all P < 0.05); greater venular tortuosity was independently associated with younger age, higher blood pressure, lower high-density lipoprotein (HDL) cholesterol level, and wider retinal venular caliber (all P < 0.05). Conclusions: Retinal arteriolar tortuosity was associated with older age and higher levels of blood pressure and BMI, whereas venular tortuosity was also associated with lower HDL level. The quantitative assessment of retinal vascular tortuosity from retinal images may provide further information regarding effects of cardiovascular risk factors on the retinal vasculature. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 812-818 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75ef00a3f78ad5249f45c1cd493626d1",
  "timestamp": "2025-05-15T03:14:37.254303"
}