{
  "id": 900,
  "title": "Automatic detection of migrating soaring bird flocks using weather radars by deep learning",
  "abstract": "1. The use of weather radars to detect and distinguish between different biological patterns greatly improves our understanding of aeroecology and its consequences for our lives. Importantly, it allows us to quantify passerine bird migration at different scales. Yet, no algorithm to detect soaring bird flocks in weather radar is available, precluding our ability to study this type of migration over large spatial scales. 2. We developed the first automatic algorithm for detecting the migration of flocks of soaring birds, an important bio-flow phenomenon involving many millions of birds that travel across large spatial extents, with implications for risk of collisions. The algorithm was developed with a deep learning network for semantic segmentation using U-Net architecture. We tested several models with different weather radar products and with image sequences for flock movement identification. 3. The best model includes the radial velocity product and a sequence of two previous images. It identifies 93% of soaring bird flocks that were tagged by a human on the radar image, with a false discovery of less than 20%. 4. Large birds such as those detected by the algorithm pose a serious risk for flight safety of civilian and military transportation and therefore the application of this algorithm can substantially reduce bird-strikes, leading to reduced financial losses and threats to human lives. In addition, it can help overcome one of the main challenges in the study of bird migration by automatically and continuously detecting flocks of large birds over wide spatial scales without the need to equip the birds with tracking devices, unravelling the abundance, timing, spatial flyways, seasonal trends and influences of environmental conditions on the migration of bird flocks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "75fba2327fd663029c66133824ff65a0",
  "timestamp": "2025-05-15T01:43:54.678334"
}