{
  "id": 5854,
  "title": "Factors Associated with Medical Follow-Up Adherence for Patients on All-Oral Regimen for Multidrug-Resistant Tuberculosis in Shenzhen, China",
  "abstract": "Purpose: The aim of this study is to identify factors affecting medical follow-up adherence of pulmonary multidrug-resistant tuberculosis (MDR-TB) patients on an all-oral regimen in Shenzhen, China to enhance intervention measures for increased treatment success. Methods: A cohort study was conducted in The Third People's Hospital of Shenzhen on MDR-TB patients switched to an all-oral regimen to evaluate effectiveness following the WHO's recommendation in late 2018. We recruited patients in the group for an opinion survey on medical follow-up adherence from May 2019 to June 2020. The survey was designed with socio-demographic questions in collecting baseline characteristics and importance and Likert closed-ended questions for measuring opinions and relevance of different factors to adherence. Linear regression model was used to analyze data collected. Results: The findings revealed that gender difference (P = 0.828) had no correlation with adherence. Marital status (P = 0.014), financial situation (P <0.001) and difficulties encountered with medical appointment booking procedures (P = 0.001) were significantly associated with medical follow-up adherence. Single (including widowed and divorced) patients, those with low household income and patients having difficulties making online medical appointment booking, were at higher risk of defaulting from routine MDR-TB medical follow-up. Conclusion: Our survey revealed that financial burden, being single and a non-user friendly medical appointment booking system are the main barriers to patients' medical follow-up compliance. More financial assistance, better patient support and simplifying medical appointment booking procedures are facilitators of better treatment adherence.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76149bded190935e1e99ef21e2e09e03",
  "timestamp": "2025-05-15T02:51:58.710193"
}