{
  "id": 129,
  "title": "Using Machine Learning Approach to Evaluate the Excessive Financialization Risks of Trading Enterprises",
  "abstract": "As Internet technology develops and spreads widely, using the Internet for financial management has become a new type of financial technology. Despite Internet finance's convenience and profits, severe financial risks, such as chaotic reputation management, bad loans, and malicious deception, also appear. Hence, in order to enhance the ability of trading financial enterprises to respond to over-financialization risks, the machine learning algorithms are utilized to build a decision tree model, a random forest model, and a gradient boosting model; the average fusion method is utilized to build a fusion control model. The performances and risk prediction indicators of the proposed algorithm under the models mentioned above are analyzed. Finally, by analyzing a trading enterprise's loan data within six months, the optimized risk control model's actual impacts are evaluated. The results show that the support vector machine (SVM) will be quicker trained than other models if the data set is in the smaller range of 1G-5G, with an average of 20 min. The fusion model (FM) will consume a shorter time if the data set is in the broader range of 5G-30G, with an average of 35 minutes. Different models have unique advantages in different performances; the precision, recall rate, and accuracy of the fusion algorithm are higher, 79.35%, 39.28%, and 78.28%. The precision of the random forest algorithm (RFA) is 72.48%, which is also higher. The performance of the risk control model is improved through model fusion, in an effort to improve the ability of trade finance enterprises to withstand financial loan risks, which provides a reference for the risk control of financial enterprises.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76197394f8dda6dc6d309c7dad84961a",
  "timestamp": "2025-05-15T01:47:14.041835"
}