{
  "id": 8069,
  "title": "Characteristics of Hospital Acquired Pressure Ulcer and Factors Affecting Its Development: A Retrospective Study",
  "abstract": "Background Worldwide, pressure ulcers (PUs) have been implicated in costing billions annually, with 60,000 deaths out of 2.5 million hospitalized patients resulting from complications related to PU. The prevention of PU reduces the incidence of other illnesses, decreases the financial costs, and improves the quality of life for patients. We aimed to identify the most influential factors that increased the risk of developing PUs among hospitalized patients at a university hospital according to the Waterlow scale. Methods Data were collected retrospectively from patients who developed PUs between January 2016 and December 2018 at King Abdulaziz University Hospital, Jeddah, Saudi Arabia, and were evaluated using the Waterlow PU risk assessment tool. The analysis was performed using the Statistical Package for Social Science (SPSS), version 23.0 (IBM, Armonk, NY). Results A total of 272 cases were included in this study. The highest number of cases (n = 83, 30.5%) belonged to the age group of 50 to 64 years. The majority of patients had stage 2 PUs (165, 60.7%). The most frequent location of PU was the back (97, 35.7%). A history of undergoing major surgery was significantly associated with a higher stage of PU (p = 0.040). The mean Waterlow PU score for all cases was 27.19 +/- 13.143. There was a moderate positive correlation between the neurological deficit score and the Waterlow PU score (correlation coefficient: 0.447, p < 0.001). Multinomial logistic regression analysis revealed that increasing age is a significant predictive factor for developing higher stages of PUs (p = 0.046). Conclusion Major surgery, neurological deficit, low hemoglobin level, and increasing age were strong predictors for developing higher stages of PU. Therefore, healthcare contributors should consider these risks when applying a comprehensive PU management plan.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7622f2ea35cc4f806d1e6e350ae9f69d",
  "timestamp": "2025-05-15T03:15:09.315448"
}