{
  "id": 3165,
  "title": "AI predictive models and advancements in microdissection testicular sperm extraction for non-obstructive azoospermia: a systematic scoping review",
  "abstract": "STUDY QUESTION How accurately can artificial intelligence (AI) models predict sperm retrieval in non-obstructive azoospermia (NOA) patients undergoing micro-testicular sperm extraction (m-TESE) surgery?SUMMARY ANSWER AI predictive models hold significant promise in predicting successful sperm retrieval in NOA patients undergoing m-TESE, although limitations regarding variability of study designs, small sample sizes, and a lack of validation studies restrict the overall generalizability of studies in this area.WHAT IS KNOWN ALREADY Previous studies have explored various predictors of successful sperm retrieval in m-TESE, including clinical and hormonal factors. However, no consistent predictive model has yet been established.STUDY DESIGN, SIZE, DURATION A comprehensive literature search was conducted following PRISMA-ScR guidelines, covering PubMed and Scopus databases from 2013 to 15 May 2024. Relevant English-language studies were identified using Medical Subject Headings (MeSH) terms. We also used PubMed's 'similar articles' and 'cited by' features for thorough bibliographic screening to ensure comprehensive coverage of relevant literature.PARTICIPANTS/MATERIALS, SETTING, METHODS The review included studies on patients with NOA where AI-based models were used for predicting m-TESE outcomes, by incorporating clinical data, hormonal levels, histopathological evaluations, and genetic parameters. Various machine learning and deep learning techniques, including logistic regression, were employed. The Prediction Model Risk of Bias Assessment Tool (PROBAST) evaluated the bias in the studies, and their quality was assessed using the Transparent Reporting of a Multivariable Prediction Model for Individual Prognosis or Diagnosis (TRIPOD) guidelines, ensuring robust reporting standards and methodological rigor.MAIN RESULTS AND THE ROLE OF CHANCE Out of 427 screened articles, 45 met the inclusion criteria, with most using logistic regression and machine learning to predict m-TESE outcomes. AI-based models demonstrated strong potential by integrating clinical, hormonal, and biological factors. However, limitations of the studies included small sample sizes, legal barriers, and challenges in generalizability and validation. While some studies featured larger, multicenter designs, many were constrained by sample size. Most studies had a low risk of bias in participant selection and outcome determination, and two-thirds were rated as low risk for predictor assessment, but the analysis methods varied.LIMITATIONS, REASONS FOR CAUTION The limitations of this review include the heterogeneity of the included research, potential publication bias and reliance on only two databases (PubMed and Scopus), which may limit the scope of the findings. Additionally, the absence of a meta-analysis prevents quantitative assessment of the consistency of models. Despite this, the review offers valuable insights into AI predictive models for m-TESE in NOA.WIDER IMPLICATIONS OF THE FINDINGS The review highlights the potential of advanced AI techniques in predicting successful sperm retrieval for NOA patients undergoing m-TESE. By integrating clinical, hormonal, histopathological, and genetic factors, AI models can enhance decision-making and improve patient outcomes, reducing the number of unsuccessful procedures. However, to further enhance the precision and reliability of AI predictions in reproductive medicine, future studies should address current limitations by incorporating larger sample sizes and conducting prospective validation trials. This continued research and development is crucial for strengthening the applicability of AI models and ensuring broader clinical adoption.STUDY FUNDING/COMPETING INTEREST(S) The authors would like to acknowledge Mashhad University of Medical Sciences, Mashhad, Iran, for financial support (Grant ID: 4020802). The authors declare no competing interests.REGISTRATION NUMBER N/A.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76244bad0e978cd25a97a690432b69d1",
  "timestamp": "2025-05-15T02:23:33.468677"
}