{
  "id": 4943,
  "title": "Does sin matter in corporate governance issues in the United States",
  "abstract": "Purpose - The authors provide evidence for the effects of social norms on corporate governance risk by studying sin stocks publicly traded companies involved in producing alcohol, firearms, biotechnology, gambling, military, nuclear power and tobacco. There is a societal norm against funding operations that promote vice and expropriation by controlling shareholders. Design/methodology/approach - The sample is representative of S&P 500 firms in 2014. The authors use Datastream to obtain a sample of sin stocks. The authors' descriptive analysis is completed by four variations of the basic ordinary least squares regression model according to dependent variable corporate governance risk score. Findings - The authors find that non-financial incentives alone do not explain corporate governance risk. The authors provide strong empirical support for an alignment of financial and non-financial incentives. The authors show that when sin firm's current performance is good, suggesting that the market holds a positive belief in firm's future profitability, managers will likely have more incentive to expropriate shareholders. Research limitations/implications - Belonging of firm to a sin industry does not reflect the acceptance level of social norms. The evolution of social norms towards sin stocks overcomes the drawback of assuming a constant social norms level over time. Therefore, researchers are encouraged to use the changes in consumption of sin products as a proxy for the evolution of social norms and examine does sin matter in corporate governance issue in other countries. Practical implications - Well-planned and well-managed philanthropy sin industries to creating education programmes for the disadvantaged to protecting the environment, in the name of corporate social responsibility has become a necessary ingredient in virtually every large corporation's business plan. Originality/value - This paper fulfils an identified need to study does sin matter issue in corporate governance issue.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "762d40a863f3a30941c30d5351de98e5",
  "timestamp": "2025-05-15T02:42:36.192024"
}