{
  "id": 7415,
  "title": "Out-of-pocket payment and patients' treatment choice for assisted reproductive technology by household income: a conjoint analysis using an online social research panel in Japan",
  "abstract": "Background Economic disparities affect access to assisted reproductive technology (ART) treatment in many countries. At the time of this survey, Japan provided partial reimbursement for ART treatment only for those in low- or middle-income classes due to limited governmental budgets. However, the optimal level of financial support by income class remains unclear. Methods We conducted a conjoint analysis of ART in Japan in January 2020. We recruited 824 women with fertility problems aged 25 to 44 years via an online social research panel. They completed a questionnaire of 16 hypothetical scenarios measuring six relevant ART attributes (i.e., out-of-pocket payment, pregnancy rate, risk of adverse effects, number of visits to outpatient clinics, consultation hours and kindness of staff) and their relations to treatment choice. Results Mixed-effect logistic regression models showed that all six attributes significantly influenced treatment preferences, with participants valuing out-of-pocket payment the most, followed by pregnancy rates and kindness of staff. Significant interactions occurred between high household income (>= 8 million JPY) and high out-of-pocket payment (>= 500,000 JPY). However, the average marginal probability of the highest-income patients (i.e., >= 10 million JPY, ineligible for the subsidy) receiving ART treatment at the average cost of 400,000 JPY was 47%, compared to 56 - 61% of other income participants, who opted to receive ART at an average cost of 100,000 JPY after a 300,000 JPY subsidy. Conclusion Our results suggest that out-of-pocket payment is the primary determinant in patients' decision to opt for ART treatment. High-income patients were more likely to choose treatment, even at a high cost, but their income-based ineligibility for government financial support might discourage some from receiving treatment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "762f527005317db866474b918b673568",
  "timestamp": "2025-05-15T03:08:37.729073"
}