{
  "id": 1014,
  "title": "Precision Healthcare for UTIs: Leveraging Machine Learning to Reduce Readmissions",
  "abstract": "Hospital readmissions impose a significant financial strain on healthcare systems and can adversely affect patients. Unfortunately, traditional approaches to predicting readmissions frequently lack accuracy. This presents a critical challenge, as identifying patients at high risk for readmission is essential for implementing preventive measures. The study introduces a novel method that employs machine learning to automatically extract features from patient data, eliminating labor-intensive manual feature engineering. The primary goal is to develop predictive models for unplanned readmissions for UTI patients at Jordan University Hospital within 3 months postdischarge. This is executed through a retrospective analysis of electronic health records from January 2020 to June 2023. By leveraging machine learning techniques, the study identifies high-risk patients by evaluating demographic, clinical, and outcome characteristics, ensuring model reliability through thorough optimization, validation, and performance assessment. Three predictive models were developed as follows: a gradient-boosting classifier (GBC), logistic regression (LR), and stochastic gradient descent (SGD). The GBC, SGD, and LR achieved impressive accuracy rates of 99%, 95%, and 89%, providing strong confidence in the methodology. The study's findings reveal key risk factors associated with readmissions, enhancing our understanding of this process and offering a valuable framework for improving patient care, optimizing resource allocation, and supporting evidence-based decision-making in healthcare management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7653ce00bac38a224ae275c85045456c",
  "timestamp": "2025-05-15T01:58:08.435831"
}