{
  "id": 6108,
  "title": "Survival of e-commerce entrepreneurs: The importance of brick-and-click and internationalization strategies",
  "abstract": "E-commerce is a fast-growing industry that attracts many entrepreneurs; however, the survival rate is lower than that of other industries. Entrepreneurs take many strategic decisions that have a significant bearing on the success of their e-commerce ventures. Two are particularly salient for our research: Is it better to start as a pureclick or open a physical store? To what extent should e-commerce ventures internationalize? We also wonder if it is worth reviewing the first annual accounts available. Grounding on organizational ecology theory, we develop a model hypothesizing that (1) the brick-and-click strategy favours survival; (2) internationalization favours survival; (3) firm size and financial health matter; (4) earnings management mediates the relationship between financial health and survival; and (5) the brick-and-click and internationalization strategies mediate the relationship between size and survival. The empirical study is performed by analysing seven years of data on 632 new e-commerce ventures using non-parametric means tests, a Cox regression, and a generalized structural equation model. The study tests the strategies followed by e-commerce entrepreneurs and firm characteristics that influence survival. We find that the risk of bankruptcy is 1.437 times greater for pure-click than for brickand-click retailers, 2.778 times greater for local players than for internationalized firms, and 1.787 times greater for unprofitable firms than for profitable firms. Hence, it is worth analysing the financial statements provided by entrepreneurs; however, signs of earnings management should be checked. All these factors affect the probability of early bankruptcy as well as explain survival several years later.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "765a79dc504610339a0ea5ac6d2f7a6b",
  "timestamp": "2025-05-15T02:54:39.150162"
}