{
  "id": 8208,
  "title": "Public opinion on COVID-19 vaccine prioritization in Bangladesh: Who gets the vaccine and whom do you leave out?",
  "abstract": "One of the most challenging aspects of the COVID-19 pandemic is the inability to ensure equitable distribution of vaccines to fight the pandemic. Many governments around the globe had to prioritize and perform a triage in distributing the vaccines due to the limited supply as well as a lack of financial strength to acquire a sufficient number of vaccines in time. The present study assessed the public opinion in Bangladesh regarding vaccination prioritization strategy and its associated aspects. Due to the infectious nature of the viral transmission, the study used an online survey and collected a sample of 2291 respondents, distributed proportionally across sex, and income groups. Descriptive statistics and multinomial logistic regression modelling were utilized to conduct the analyses. The results emphasized unanimous preference of prioritized vaccination leaning towards the frontline workers, the severely sick and the elderly. However, the segregation across ethnicity was noted with no major preference among sexes or religion. The results reinforce the Bangladesh government's undertaken strategy of prioritization. However, the preference rankings varied across sociodemographic factors including self-assessed COVID-19 knowledge and income tiers, among others. The findings underline the necessity of improved risk communication strategies to ensure public confidence and conformity to vaccination efforts and their effective deployment across the country. & COPY; 2023 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "765a35b6218f8198d50f23d46a5a50ae",
  "timestamp": "2025-05-15T03:16:17.468708"
}