{
  "id": 7362,
  "title": "A Study of Risk Factors for Surgical Site Infections and Direct Economic Losses in Clean Orthopedic Surgery",
  "abstract": "Background: Surgical site infection (SSI) is a serious complication after clean orthopedic surgery. Patients and Methods: We retrospectively gathered data on 18,140 patients who underwent clean incision orthopedic operations at two institutions between January 2023 and April 2024. The study included 87 patients with SSIs in the case group and 80 matched controls without SSIs. Age, diabetes mellitus, and intra-operative blood transfusions were all examined using uni-variable and conditional multi-variable logistic regression to detect risk and independent risk factors for SSI. Differences in hospital charges and length of stay were also investigated. Results: Among the 18,140 surveyed patients, 87 developed SSIs, yielding an infection rate of 0.48%. Significant risk factors for SSI included hypertension (31.3% vs. 15.0%, p = 0.015), more than two surgical procedures (28.8% vs. 8.8%, p = 0.001), and durations of indwelling urinary catheters (p < 0.001) and drains (p = 0.003). Independent risk factors included age >= 60 years [odds ratio (OR): 36.011, p = 0.025], more than two surgical procedures (OR: 7.001, p = 0.034), and durations of indwelling urinary catheters (OR: 2.164, p = 0.033) and drains (OR: 1.426, p = 0.004). The median hospitalization cost was $5,289.3 for patients with SSIs compared with $3,653.9 for those without infections. The cost difference was statistically significant (Z = -3.409, p = 0.001), with an additional median expense of $1,366.5 attributed to SSIs. Patients in the infection group were hospitalized for a median of 30 days, compared with 15 days in the non-infected group, a statistically significant difference (Z = -7.32, p < 0.001), resulting in 17 additional days of hospitalization. The total direct economic loss attributed to 80 SSI cases across both hospitals amounted to $162,415.8. Conclusion: The study identifies multiple risk factors for SSIs following orthopedic clean surgical procedures. Hospital-related departments should aim to mitigate these risks to decrease the incidence of SSIs and reduce the financial burden on patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "768118d93eb63f339e42edb753490a2f",
  "timestamp": "2025-05-15T03:07:32.018038"
}