{
  "id": 1076,
  "title": "Mechanisms of Stock Selection and Its Capital Weighing in the Portfolio Design Based on the MACD-K-Means-Mean-VaR Model",
  "abstract": "When designing a stock portfolio, investors must select stocks with different characteristics and increasing price trends and weigh each capital. Both are fundamental to diversifying loss and profit. Therefore, the mechanisms that accommodate both are needed. Based on this, this research aims to design a stock selection and capital weighing mechanism using the MACD-K-means-Mean-VaR model. The moving average convergence-divergence (MACD) is used to analyze stock buying time, providing trend, momentum, and potential price reversal insights. Then, stocks with increasing price trends are clustered using K-means, a grouping simple pattern data method based on specific characteristics. The best stocks from each cluster are capital weighted using the mean value at risk (mean-VaR), a portfolio optimization model adjusting loss possibility to the investor's acceptance tolerance. The mechanism is then applied to Indonesia's 100 stock index data to analyze variable sensitivities and compare it with another model. The application reveals that all variables significantly impact portfolio return mean and VaR, suggesting the need for clustering and analyzing stock price movements in stock portfolio design. This research academically develops a portfolio design mechanism by clustering stocks and analyzing price movement trends. It enables investors to practically diversify and choose stocks with increasing price trends, reducing losses and increasing profit opportunities.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76832883395d22b5222575c3f91f6f6a",
  "timestamp": "2025-05-15T00:51:25.950000"
}