{
  "id": 3766,
  "title": "Observing choice of loan methods in not-for-profit microfinance using data envelopment analysis",
  "abstract": "Distributing loan using group lending method is one of the unique features in microfinance, as it utilises peer monitoring and dynamic incentive to lower credit risks in extending collateral-free loan to the poor. However, many microfinance institutions (MFIs) eventually perceive it to be costly and restricting loan growth thereby resorted to individual lending method to enhance profitability. On the other hand, village banking method was developed to boost outreach and to create self-sustaining village microbanks. We thus seek to empirically observe the loan method- efficiency relationship and to examine the best loan method regionally; focusing on not-for-profit MFIs that are widely regarded as best microfinance provider. Non-oriented Data Envelopment Analysis with regional meta-frontier approach is used for efficiency assessment of 628 MFIs from 87 countries in 6 regions, followed by Tobit regression. We also investigated factors affecting efficiencies such as borrowings, total donation, cost per borrower (CPB), portfolio at risk (PAR), interest rates, MFI age, regulation status, and legal format. The results support our argument that appropriate performance analysis should best be performed on regional basis separately as we find different results for different region. Crown Copyright (C) 2017 Published by Elsevier Ltd.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7686334c25017c819c6b5ad5006d2338",
  "timestamp": "2025-05-15T01:20:36.093786"
}