{
  "id": 8473,
  "title": "Emotional intelligence and venture internationalization during economic recession",
  "abstract": "Purpose The purpose of this paper is to identify the factors related to entrepreneurs' emotional intelligence that trigger the choice of venture internationalization after locally suffering the shock of an economic recession in a developing economy. Design/methodology/approach The primary survey data were collected from 226 Uruguayan entrepreneurs and included their psychological traits and human capital characteristics after the most recent global financial crash of 2008. Personal interviews were conducted, and a Trait Meta-Mood Scale instrument (i.e. TMMS-12) was specifically designed for the measurement of emotional intelligence. Logistic regression analyses were conducted to test the hypotheses. Findings This study demonstrates that in disadvantaged environments, such as developing regions suffering from a severe global crisis, the early internationalization process of a new firm is mainly triggered by entrepreneurs' emotional intelligence attributes rather than conventional human capital-related attributes. Moreover, social-emotional competences are more significant than personal-emotional competences to explain entrepreneurs' exporting behaviour in such an adverse context. Originality/value The effect of emotional intelligence on venture internationalization is investigated in situations in which entrepreneurs are pressured to pursue risk-bearing strategies, pushed by a disrupting shock that weakens the national economic condition (e.g. an economic recession). While previous findings have highlighted the importance of entrepreneurs' human capital attributes in their entering foreign markets, few studies have analysed how the emotional intelligence competences of entrepreneurs lead them to internationalize. This study fills this gap in the literature on entrepreneurial behaviour by focussing on the emotional, cognitive and psychological qualities of entrepreneurs to explain their exporting business decisions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76867599e4697fd4cbf1e8dbf9c5571b",
  "timestamp": "2025-05-15T03:19:21.275356"
}