{
  "id": 8751,
  "title": "Immediate Changes in Intraocular Pressure after Laser Peripheral Iridotomy in Primary Angle-Closure Suspects",
  "abstract": "Purpose: To determine the immediate changes in intraocular pressure (IOP) after laser peripheral iridotomy in primary angle-closure suspects. Design: Prospective, randomized controlled trial (split-body design). Participants: Seven hundred thirty-four Chinese people 50 to 70 years of age. Methods: Primary angle-closure suspects underwent iridotomy using a neodymium: yttrium-aluminum-garnet laser in 1 randomly selected eye, with the fellow eye serving as a control. Intraocular pressure was measured using Goldmann applanation tonometry before treatment and 1 hour and 2 weeks after treatment. Total energy used and complications were recorded. Risk factors for IOP rise after laser peripheral iridotomy were investigated. Main Outcome Measures: Intraocular pressure. Results: The proportion of treated eyes with an IOP spike (an elevation of >= 8 mmHg more than baseline) at 1 hour and 2 weeks after treatment was 9.8% (95% confidence interval [CI], 7.7-12.0) and 0.82% (95% CI, 0.2-1.5), respectively. Only 4 (0.54%) of 734 eyes (95% CI, 0.01-1.08) had an immediate posttreatment IOP of 30 mmHg or more and needed medical intervention. The average IOP 1 hour after treatment was 17.5 +/- 4.7 mmHg in the treated eyes, as compared with 15.2 +/- 2.6 mmHg in controls. At 2 weeks after treatment, these values were 15.6 +/- 3.4 mmHg in treated eyes and 15.1 +/- 2.7 mmHg in controls (P < 0.001). No significant difference was detected in the baseline IOP of the treated and untreated eyes. Logistic regression showed that the incidence of IOP spike was associated with greater laser energy used and shallower central anterior chamber. Conclusions: Laser peripheral iridotomy in primary angle-closure suspects resulted in significant IOP rise in 9.8% and 0.82% of cases at 1 hour and 2 weeks, respectively. Eyes in which more laser energy and a higher number of laser pulses were used and those with shallower central anterior chambers were at increased risk for IOP spikes at 1 hour after laser peripheral iridotomy. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012; 119: 283-288 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76882cbfbd9e367822e97f7c96508208",
  "timestamp": "2025-05-15T03:21:56.677007"
}