{
  "id": 8343,
  "title": "Productivity growth, catching-up and technology innovation in microfinance institutions in India: evidence using a bootstrap Malmquist Index approach",
  "abstract": "Purpose This paper aims to examine the total factor productivity (TFP) change and its components: efficiency change and technical change in microfinance institutions (MFIs) in India operating from 2005 to 2018. The study also scrutinizes the variations in productivity levels across the distinct organizational form and size groups of MFIs. In addition to this, the authors identify the contextual factors that determine TFP growth, catching-up and technology innovation in MFIs. Design/methodology/approach The study employs a smooth homogeneous bootstrap estimation procedure of Simar and Wilson (1999) for obtaining reliable estimates of Malmquist indices -productivity and its components - in a data envelopment analysis (DEA) framework for individual MFIs. In order to identify the determinants of productivity change and its components, the study follows Simar and Wilson's (2007) guidelines and applies a bootstrap truncated regression model. The double bootstrap procedure performs well, both in terms of allowing correct estimation of bias and deriving statistically consistent productivity estimates in the first and root mean square errors in the second stage of the analysis. Findings The empirical results reveal that the MFIs have shown average productivity growth of 6.70% during the entire study period. The observed productivity gains are primarily contributed by a larger efficiency increase at the rate of 4.80%, while technical progress occurs at 2.3%. Nonbanking financial companies (NBFC)-MFIs outperformed non-NBFC-MFIs. Small MFIs show the highest TFP growth in terms of size groups, followed by the large MFIs and medium MFIs. The bootstrap truncated regression results suggest that the credit portfolio, size and age of MFIs matter in achieving higher productivity levels. Practical implications The practical implication drawn from the study is that the Indian MFI industry might adopt the latest technology and innovations in the products, risk assessment and credit delivery to improve their productivity levels. The industry must focus on enhancing the managerial skill of its employees to achieve a high productivity level. Originality/value This study is perhaps the initial attempt to explain the productivity behavior of MFIs in India by deploying a statistically robust double bootstrap procedure in the DEA-based Malmquist Productivity Index (MPI) framework. The authors estimate the bias-adjusted productivity index and its decompositions, which represent more reliable and statistically consistent estimates. For contextual factors responsible for driving productivity change, the study deploys a bootstrap truncated regression approach.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "768bab74a3af718c9a3dfc6a07e05c7f",
  "timestamp": "2025-05-15T03:17:49.163049"
}