{
  "id": 5621,
  "title": "Evidence of Differences in the Effectiveness of Safety-Net Management in European Union Countries",
  "abstract": "European Union (EU) financial safety nets are social contracts that assign uncertain benefits and burdens to taxpayers in different member countries. To help national officials to assess their taxpayers' exposures to loss from partner countries, this paper develops a way to estimate how well markets and regulators in 14 of the EU-15 countries have controlled deposit-institution risk-shifting in recent years. Our method traverses two steps. The first step estimates leverage, return volatility, and safety-net benefits for individual EU financial institutions. For stockholder-owned banks, input data feature 1993 2004 data on stock-market capitalization. Parallel accounting values are used to calculate enterprise value (albeit less precisely) for mutual savings institutions. The second step uses the output from the first step as input into regression models of safety-net benefits and interprets the results. Parameters of the second-step models express differences in the magnitude of safety-net subsidies and in the ability of financial markets and regulators in member countries to restrain the flow of safety-net subsidies to commercial banks and savings institutions. We conclude by showing that banks from high-subsidy and low-restraint countries have initiated and received the lion's share of cross-border M&A activity. The efficiency, stabilization, and distributional effects of allowing banks to and from differently subsidized environments to expand their operations in partner countries pose policy issues that the EU ought to address.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76913e24255ea091b02f6522f2c7bd02",
  "timestamp": "2025-05-15T02:49:50.216773"
}