{
  "id": 3794,
  "title": "The exposure of the US tourism subsector stocks to global volatility and uncertainty factors",
  "abstract": "In the face of uncertain circumstances and volatilities across tourism stocks, the current study attempts to investigate the connectedness of US tourism subsectors using time-varying vector autoregressions (TVP-VAR) technique for the period spanning 1 August 2008-31 August 2021. Moreover, we examined the influence of various financial and economic indicators to observe their impact on the connectedness of US tourism subsectors. Further, we employed Diebold and Yilmaz ([2012]. Better to give than to receive: Predictive directional measurement of volatility spillovers. International Journal of Forecasting, 28(1), 57-66) connectedness approach to justify the robustness of our results. We find that hotels, transportation, and recreational are net transmitters of spillovers to the remaining US subsectors. We reported multiple time-varying attributes where the connectedness of US tourism subsectors was remarkably higher. In addition, the regression results reveal a positive and significant impact of financial and economic uncertainties on the connectedness. Finally, our findings were robust to the methodology employed, which substantially justified our estimator. We proposed numerous useful implications for policymakers, US government, tourism industry, investors, market players, and portfolio managers to benefit from the findings obtained.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76945ceb4a64e99194edd478c25bd1a2",
  "timestamp": "2025-05-15T01:21:08.030984"
}