{
  "id": 3961,
  "title": "Racial/ethnic differences in the beneficial effect of social support on sleep duration",
  "abstract": "Study Objectives: Social support (SS) is associated with better health outcomes, including sleep health. However, the specific sources of SS that benefit sleep are unclear, and whether these associations vary by race/ethnicity or age is unknown. The aim of this study was to examine cross-sectional associations between sources of SS (number of friends, financial, church attendance, and emotional support) and self-reported short sleep duration (< 7 hours) overall and by race/ethnic groups and age among a representative sample. Methods: Using National Health and Nutrition Examination Survey (NHANES) data, logistic regression (marginal standardization) and linear regression models were fit accounting for survey design and weights to test associations between sources of SS (number of friends, financial, church attendance, emotional support) and self-reported short sleep duration (< 7 hours) overall and by race/ethnic groups (Black, Hispanic, and White) and age (< 65 vs & GE; 65 years). Results: Among 3,711 participants, the mean (standard error) age was 57 (0.3) years and 37% slept < 7 hours. Black adults had the highest prevalence of short sleep (55%). Overall, participants with financial support compared with those without financial support had a lower prevalence of short sleep: 23% (confidence interval [CI]: 0.68, 0.87). As the number of SS sources increased, the prevalence of short sleep duration decreased and the racial disparity in sleep duration narrowed. Associations between financial support and sleep were most pronounced among Hispanic and White adults and adults < 65 years. Conclusions: In general, financial support was associated with a healthier sleep duration, particularly among those < 65 years of age. Individuals with numerous sources of SS were less likely to be short sleepers. The benefits of SS on sleep duration varied by race. Targeting specific sources of SS may help to improve sleep duration among those most at risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "769f36358eba1a1411849f0a14f7165b",
  "timestamp": "2025-05-15T02:31:28.534177"
}