{
  "id": 3928,
  "title": "Emerging adults' financial stress and self-rated health: Meaning in life as a moderator",
  "abstract": "Objective: The primary objective of the study was to examine associations between financial stress and self-rated health (mental and physical), with presence of and search for meaning in life as moderator variables. The secondary objective was to examine the association between presence of meaning and self-rated health, with search for meaning as a moderator. Participants and methods: The sample included 166 emerging adults (ages 18-32, mean age 22.55) recruited from a university setting (n = 87) and online platform (n = 79). To examine the proposed moderating effects, two hierarchical multiple regression models were conducted using secondary data. Results: For the primary objective, presence of meaning did not moderate the association between financial stress and self-rated health (mental or physical). Search for meaning strengthened the negative association between financial stress and physical health, exacerbating the negative health impacts associated with financial stress. However, search for meaning did not moderate the association between financial stress and mental health. For the secondary objective, search for meaning moderated the association between presence of meaning and physical health such that a negative presence-physical health association emerged at high levels of search, and a positive presence-physical health association emerged at low levels of search. Conclusion: Presence of meaning was not a protective factor in the association between financial stress and self-rated health, perhaps because average presence of meaning was lower than average search for meaning in this sample. Search for meaning was a risk factor for adverse physical health when financial stress was high or presence of meaning was low. Future research should examine in which contexts (e.g., different stressors, cultures) meaning in life dimensions emerge as risk versus protective factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76acc606204c99778c962b6c8feca54c",
  "timestamp": "2025-05-15T02:31:28.359907"
}