{
  "id": 2316,
  "title": "Pre-production box-office success quotient forecasting",
  "abstract": "Hollywood enjoys the position of being the biggest movie producers when it comes to global recognition among movie-making industries. Despite being the biggest movie producer, it has been facing high revenue losses lately since most of the films that it has created have failed to capture viewer's attention in the first few weeks of its release resulting in a box-office flop. It has been observed in a recent study that Hollywood is estimated to witness a loss of around 1 billion to almost 10 billion US dollars till 2020. Revenue risks have created immense pressure on movie producing stakeholders. They feel a constant pressure to come up with a formula to make a successful movie, however, to date; there are no fixed ingredients that can ensure the success of a movie. Researchers and movie producers constantly feel a need to have some expert systems which would predict the fate of the movie prior to its production with reasonable accuracy. Regardless of the difficult nature of the issue area, few researchers have created expert systems to forecast the financial success of movies using different approaches, but most of them are targeted pre-release forecasting or have low prediction accuracy. Such predictions are of a seminal nature as of their limited prediction scope, and non-ability to reduce revenue loss risk. Therefore, there is a constant demand from investors to have pre-production forecasting tools with high accuracy which can help them plan and make necessary alterations to save huge investments. In this study, we proposed eighteen new features to forecast box-office success, as soon as the quotient (director and cast) signs an agreement. This proposed forecasting time is the earliest prediction that has ever been reported in the movie forecasting literature. The decision support system ranks director and lead cast by utilizing their performances of the last 100 years (1915-2015). The processed output file is a table that ranks each director and cast into four categories based on cast experience, journalist critics, media reporting, user ratings, and revenue generated by associating movie. To produce more accurate results, learner-based feature selection is also performed to select the best subsets of features. This system is intended to be a dynamic tool, integrating further data for real-time adaptation. The system has the ability to incorporate different feature selection algorithm for the progressive improvement of movie success forecasting We demonstrate the effectiveness of extracting features and explain how they improve forecasting accuracy over existing models. The adaptive behaviour of the presented system is achieved by incorporating conceptually different machine learning classifiers, i.e. support vector machine, gradient boosting, extreme boosting classifier, and random forest. A voting system is used to make the prediction by averaging the output class-probabilities. To assess the adequacy of new features, a cross-validation test is directed. Our classification results are evaluated by using two performance measures, i.e. average per cent success rate, or within one class away from its actual prediction. The new features have achieved the most noteworthy accuracy of 85% with an expansion of a 46.43% (average per cent success rate) and 5.56% (within a class away) in comparison with other state-of-the-art feature sets.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76b46bb8fc92f50d3583fdb1d6dde43d",
  "timestamp": "2025-05-15T02:14:19.535113"
}