{
  "id": 4074,
  "title": "Conventional REITs, Islamic REITs and macroeconomic variables in Malaysia: a review",
  "abstract": "Purpose The purpose of this paper is to empirically examine the return and dividend characteristics of two different types of Malaysian real estate investment trust (REIT) series, namely, conventional and Islamic, against macroeconomic variables over the period 2011-2017. Design/methodology/approach The required data are derived from Datastream database. Multiple regression analysis is used to determine the impact of macroeconomic variables on financial performance of 13 Malaysian REIT series. Findings Results show that the macroeconomic variables are able to predict future returns and dividends of Malaysian REITs. The analysis also suggests that Islamic REITs are seen to be less sensitive to macroeconomic variables and display better portfolio diversification benefits as compared to their conventional counterpart. The ongoing implications for large-cap and small-cap REITs are also highlighted. Research limitations/implications The main limitation of the study is the small percentage of Islamic REITs sample due to limited period of observation available. However, the two Islamic REITs included are representative of Islamic REITs in Malaysia as both of them are listed in the Bursa Malaysia with asset size and market capitalization values more than RM1bn. Practical implications The results of this study may serve as a useful input for financial market players on making strategic business decisions especially with regards to differences between conventional and Islamic REITs characteristics. Originality/value The main contribution of this paper is to explore the relationship between REITs and macroeconomic factors on a unique capital market (Malaysia) that allows comparison between conventional and its Islamic counterpart.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76bef171f5b433ced46743be6fa379ba",
  "timestamp": "2025-05-15T01:23:27.380964"
}