{
  "id": 6627,
  "title": "ADOPTION OF IDENTITY THEFT COUNTERMEASURES AND ITS SHORT- AND LONG-TERM IMPACT ON FIRM VALUE",
  "abstract": "Identity theft has impaired e-commerce. To combat the crime, many identity theft countermeasures (ITC) have been proposed. As investments in ITC are substantial and the benefits of such investments are intangible, companies are often hesitant to adopt such measures. This was the motivation for this study of the impact of 526 ITC adoption announcements on short- and long-term market value. The event study shows that such announcements result in positive market return of about U.S. $583 million around the date of announcement. Calendar-time portfolio analysis (CPA) is used for the long-term impact analysis and shows that the adoption of ITC generates positive and significant average monthly return up to 1.5% with control of market risk factors in two years. Subsampling analysis and interaction analysis show that U.S. listing, early ITC adoption, and two- factor authentication may moderate the market value of ITC adopters differently. A number of robustness checks (e.g., Heckman model, cross-sectional regression on Tobin 's Q, firm-specific risk factor analysis, subsampling analysis by ICT development, and analysis of security statements in annual reports) are performed. The research provides quantitative evidence of financial gain resulting from adoption of ITC and aspires to raise ITC awareness among industrial practitioners.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76d2a74b32383735890e34ff4cdb100a",
  "timestamp": "2025-05-15T03:00:04.978000"
}