{
  "id": 9260,
  "title": "How can tuberculosis services better support patients with a diabetes co-morbidity? A mixed methods study in the Philippines",
  "abstract": "BackgroundPeople with diabetes mellitus (DM) have an estimated two- to three-times greater risk of adverse tuberculosis (TB) treatment outcomes compared to those without DM. Blood glucose control is a primary aim of managing DM during TB treatment, yet TB programmes are not generally adapted to provide DM services. The purpose of this study was to understand perceptions and the lived experiences of diabetic patients in TB treatment in the Philippines, with a view to informing the development of disease co-management strategies.MethodsThis mixed methods study was conducted within a prospective cohort of adults newly-starting treatment for drug-sensitive and drug-resistant TB at 13 public TB clinics in three regions of the Philippines. Within the subset of 189 diabetic persons who self-reported a prior DM diagnosis, or were diagnosed by screenings conducted through the TB clinic, longitudinal blood glucose data were used to ascertain individuals' glycaemic control (controlled or uncontrolled). Univariable logistic regression analyses exploring associations between uncontrolled glycaemia and demographic and clinical factors informed purposive sampling of 31 people to participate in semi-structured interviews. All audio-recorded data were transcribed and thematic analysis performed.ResultsParticipants - both with controlled and uncontrolled blood glucose - were knowledgeable about diabetes and its management. However, a minority of participants were aware of the impact of DM on TB treatment and outcomes. Many participants newly-diagnosed with DM at enrolment in TB treatment had not perceived any diabetic symptoms prior and would have likely not sought clinical consult otherwise. Access to free glucose-lowering medications through TB clinics was a key enabling resource. However, participants expressed fear of side effects and interrupted access to glucose-lowering medications, and a preference for phytotherapy. Many participants felt that physical and financial impacts of TB and its treatment were challenges to DM management.Conclusions and recommendationsResults of this study indicate that public TB clinics can provide diabetic patients with additional health care resources and education to address co-morbidity. TB programmes might consider identifying patients with complicated DM, and offering diabetic monitoring and management, as DM and diabetic complications may compound the burden of TB and its treatment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76d69ce359e997d54800e8287a959b4f",
  "timestamp": "2025-05-15T03:26:54.628297"
}