{
  "id": 7726,
  "title": "The demand and supply timely financial reports",
  "abstract": "Purpose This paper is motivated by the Financial Markets Authority's (FMA) investigation into reporting delays of New Zealand issuers. The purpose of this paper is to provide regulators with systematic evidence on firm specific characteristics associated with reporting delay. The paper examines the audit report lag (ARL), the financial report lag and the corresponding interim report lags for a large sample of New Zealand listed firms. Design/methodology/approach Because of the small sample we report bivariate correlations. Together with OLS regression, we examine the association between reporting delay and firm characteristics (e.g., size, complexity, governance) that capture the supply and demand for timely audited financial reports. We choose a period immediately prior to the FMA enforcement of reporting delays to capture the voluntary choice of reporting timeliness by managers. Findings The audit lag (i.e. balance date to preliminary announcement to the NZX) is longer than the report lag (i.e. preliminary announcement date to the issuance of the report to the NZX). We find that audit risk factors (leverage and finance firms) and busy reporting period are associated with longer audit lag. Whereas, having a Big 4 auditor and an interim review reduces annual audit lag. Investor demand factors are associated with a shorter report lag. Firms with a loss and more segments have a shorter report lag, while firms with high market to book ratio have a longer report lag. These are consistent with agency and proprietary cost explanations. The interim report lag is only seven days shorter than the annual lag. The determinants of annual report lag provide weak explanations for the interim report lags. Research limitations/implications Although all listed companies are sampled, the small sample size reduces the power of the analysis and may limit finding significant results at conventional levels. Practical implications The factors associated with reporting delays could be used by regulators as red flags to identify abnormal reporting delays. Interim reporting lags appear excessively relative to annual report lags. Therefore, regulators should investigate the reasons for the lack of timeliness of interim reports. Social implications Report timeliness is an important, but often overlooked, component of accounting quality. The major social implication is that timely reporting reduces information asymmetry between managers and shareholders and other stakeholders. Making better, timelier decisions ought to increase the wealth and welfare of investors and other stakeholders. Originality/value There are many studies on reporting delay. However, prior evidence on reporting delay in New Zealand is pre-IFRS and pre-recent regulatory reforms (such as the formation of the FMA). Hence, our contribution is to provide more contemporary-relevant evidence. We also distinguish between ARL and the financial report lag and found that different firm characteristics drive these lags. We also examine the interim reporting lag.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76d6101eac9dde77597769fd9da78bce",
  "timestamp": "2025-05-15T03:11:38.445140"
}