{
  "id": 7712,
  "title": "Increased Risk of a Cancer Diagnosis after Herpes Zoster Ophthalmicus: A Nationwide Population-Based Study",
  "abstract": "Purpose: Herpes zoster has been associated with immune suppression, as has an increased risk of cancer. This population-based follow-up study aimed to investigate the risk of a subsequent cancer diagnosis after herpes zoster ophthalmicus (HZO). Design: A retrospective cohort study. Participants and Controls: Retrospective claims data from the Taiwan National Health Insurance Research Database were analyzed. The study cohort comprised all patients with a diagnosis of HZO (International Classification of Diseases, 9th Revision, Clinical Modification code 053.2) in 2003 and 2004 (n=658). The comparison cohort consisted of randomly selected ambulatory care patients, 8 for every patient with HZO (n=5264) matched with the study group on age, gender, monthly income, and urbanization level of the patient's residence. Methods: The Kaplan-Meier method was used to compute 1-year cancer-free survival rate. Stratified Cox proportional hazard regressions were carried out to compute the adjusted 1-year cancer-free survival rate after adjusting for potential confounding factors. Main Outcome Measures: Subsequent claims for all study and comparison patients were captured over a 1-year follow-up period from their index ambulatory care visit to identify whether the patient received a cancer diagnosis during the follow-up period. Results: During 1-year follow-up, cancer was diagnosed in 4.86% of patients with HZO and 0.53% of patients in the comparison cohort. Patients with HZO had significantly lower 1-year cancer-free survival rates than the comparison cohort. After adjusting for patient age, gender, monthly income, and urbanization level, patients with HZO were found to have a 9.25-fold (95% confidence interval, 5.51-15.55) risk of a subsequent cancer diagnosis than the matched comparison cohort. No significant differences in cancer type were observed between the 2 cohorts. Conclusions: Herpes zoster ophthalmicus may be a marker of increased risk of being diagnosed with cancer in the following year. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 1076-1081 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "76e869e4d7dca9de3916c73187919a66",
  "timestamp": "2025-05-15T03:11:04.664481"
}