{
  "id": 4950,
  "title": "Changes in self-reported alcohol consumption in relation to financial and mental health problems: Experiences from the COVID-19 pandemic in Sweden",
  "abstract": "Aim: The study aimed to assess the extent to which financial and/or mental health problems resulting from the COVID-19 pandemic were associated with an increased risk of alcohol consumption. Methods: Data stemmed from a Swedish cross-sectional population survey (n = 9122) collected during the second half of 2020. Questions were asked about changes in alcohol consumption during the pandemic and to what extent financial and mental health problems were experienced. Logistic regression analysis was used to estimate whether exposure to these problems was related to increasing consumption and as a complementary analysis to decreased drinking. An additive interaction analysis was conducted to assess whether there was a joint effect of these problems. Results: The proportion of respondents who reported increased alcohol consumption was higher among those who had experienced financial or mental health problems, and it rose with the severity of negative experiences. However, findings from logistic regressions (including both exposure variables and covariates) showed that only experiences of mental health problems significantly elevated the risk (odds ratio) of increased consumption. Experiences of mental health problems were also related to a higher likelihood of decreasing consumption, although the odds ratio was lower. No interaction effects were found. Conclusions: Although alcohol consumption overall declined in Sweden during the pandemic, a group experiencing pandemic-related mental health problems increased their drinking. A parallel decline in drinking in a subgroup of individuals experiencing mental health problems adds nuance to the findings and is suggested to be influenced by specific pandemic-related circumstances.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "770809c708ba9b2fce096582784976e7",
  "timestamp": "2025-05-15T02:42:36.241222"
}