{
  "id": 8666,
  "title": "The Impact of Economic Downturn on Banks' Loan Portfolio Profitability",
  "abstract": "The difference of financial institutions from other firms is the wide range of risks that these institutions meet with and must be able to manage. The macroeconomic environment undoubtedly has the impact on banks' performance results. This research analyzes the impact of the country's economic downturn on banks' loan portfolio profitability. The Lithuanian economic downturn in 2009-2010 negatively affected the banks' debtors abilities to repay their debts increasing the proportion of non-performing loans (NPLs) and reducing the banks' loan portfolio. Also the changes in the interbank interest rates and credit margins had the impact on the banks' interest income and expenses. The statistical analysis techniques allowed to characterize the dependence between macroeconomic indicators and the bank's loan portfolio profitability. Afterwards the factorial regression model was developed to predict the Lithuanian commercial banks' loan portfolio to GDP ratio according to the country's macroeconomic indicators. To assess the consistent patterns of loan portfolio profitability that are typical for the banking systems, the macroeconomic and banks' data of other EU countries was analyzed. Because the proportion of non-performing loans in banks is one of the main factors of their loan portfolio profitability, the association rules network was developed to visualize the dependence between NPLs and macroeconomic indicators. The analysis results affirmed the high sensitivity of NPLs ratio to the economic downturn in the EU countries with the imperfect macroeconomic indicators. It follows that banks in these countries assessing the credit risk of loan applicants must consider the possible changes in the macroeconomy, because they have the significant impact on banks' loan portfolio profitability in future periods.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7712d0f6a0dafab8bfa60f831569b521",
  "timestamp": "2025-05-15T03:21:24.609472"
}