{
  "id": 6241,
  "title": "Risk-taking unmasked: Using risky choice and temporal discounting to explain COVID-19 preventative behaviors",
  "abstract": "To reduce the spread of COVID-19 transmission, government agencies in the United States (US) recommended precautionary guidelines, including wearing masks and social distancing to encourage the prevention of the disease. However, compliance with these guidelines has been inconsistent. This correlational study examined whether individual differences in risky decision-making and motivational propensities predicted compliance with COVID-19 preventative behaviors in a sample of US adults (N = 404). Participants completed an online study from September through December 2020 that included a risky choice decision-making task, temporal discounting task, and measures of appropriate mask-wearing, social distancing, and perceived risk of engaging in public activities. Linear regression results indicated that greater temporal discounting and risky decision-making were associated with less appropriate mask-wearing behavior and social distancing. Additionally, demographic factors, including personal experience with COVID-19 and financial difficulties due to COVID-19, were also associated with differences in COVID-19 preventative behaviors. Path analysis results showed that risky decision-making behavior, temporal discounting, and risk perception collectively predicted 55% of the variance in appropriate mask-wearing behavior. Individual differences in general decision-making patterns are therefore highly predictive of who complies with COVID-19 prevention guidelines.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "771835fbc089cbb5ddee37188f97457c",
  "timestamp": "2025-05-15T02:56:10.967230"
}