{
  "id": 2103,
  "title": "Unsupervised learning modeling of the impact of Black Swan events on financial network reconfiguration: New insights from the COVID-19 outbreak and the Russia-Ukraine war",
  "abstract": "The emergence of Black Swan events, such as the COVID-19 pandemic and the Russian-Ukrainian war, has presented new challenges for stock markets and necessitates a redesign of portfolio management strategies. This work investigates the impact of unexpected and rare events, like the COVID-19 pandemic and the military conflict between Russia and Ukraine, on the structure of the cross-correlation network of stock returns. This research area has not yet been explored in depth. Previous research has primarily focused on the effects on stock returns, volatility, or changes in the topological properties of complex financial networks. In contrast, this study introduces a novel two-phase approach, integrating complex networks and self-organizing maps (the Kohonen network), to analyze changes in network structure and stock classification. A total of 483 US stocks from the S&P 500 index were analyzed. The findings reveal a notable contrast between the networks constructed before and after the onset of the COVID-19 pandemic (895 quotations for each network), along with significant disparities in stock classification according to centrality measures. Moreover, in-depth analysis has revealed significant distinctions between the SOM classification and the inherent partitioning based on economic sectors for both periods. Our research highlights the process of asset reconfiguration within the cross-correlation network, triggered by uncommon and unexpected events that disrupt financial market quotations. These findings are crucial for investors, portfolio managers, policymakers, and researchers.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7721521b9a2155028104a3a902f5a79f",
  "timestamp": "2025-05-15T01:03:03.649317"
}