{
  "id": 1408,
  "title": "Online learning of time-varying stochastic factor structure by variational sequential Bayesian factor analysis",
  "abstract": "Investment tasks include forecasting volatilities and correlations of assets and portfolios. One of the tools widely utilized is stochastic factor analysis on a set of correlated time-series (e.g. asset returns). Published time-series factor models require either sufficiently wide time windows of observed data or numeric solutions by simulations. We developed a 'variational sequential Bayesian factor analysis' (VSBFA) algorithm to make online learning of time-varying stochastic factor structure. The VSBFA is an analytic filter to estimate unknown factor scores, factor loadings and residual variances. The covariance matrix of the time-series predicted by the VSBFA can be decomposed into loadings-based covariance and specific variances, and the former can be expressed by 'explanatory factors' such as systematic components of various financial market indices. We compared the VSBFA with the most practiced factor model relying on wide data windows, the rolling PCA (principal components analysis), by applying them to 9-year daily returns of 200 simulated stocks with the 'true' daily data-generating model completely known, and by using them to forecast volatilities of long-only and long/short global stock portfolios with 25-year monthly returns of more than 800 stocks worldwide. Accuracy of the forecast covariance matrices is measured by a (symmetrized) Kullback-Leibler distance, and accuracy of the forecast portfolio volatilities is measured by bias statistic, log-likelihood, Q-statistic, and portfolio volatility minimization. The factor-based covariance and specific variances predicted by the best VSBFA are significantly more accurate than those by the best rolling PCA.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "772d9aa7dd3f7097ea744165e9f8a7ff",
  "timestamp": "2025-05-15T00:55:28.467860"
}