{
  "id": 3520,
  "title": "Non-financial social determinants of diabetes among public assistance recipients in Japan: A cohort study",
  "abstract": "Aims/Introduction Poverty is an important social determinant of diabetes. Poverty is a multidimensional concept including non-financial difficulties, such as social isolation and exclusion from communities. Many countries provide financial social assistance programs for those in need. This study aimed to explore non-financial social determinants of diabetes among public assistance recipients in Japan, by using linkage data of two municipal public assistance databases and medical assistance claim data. Materials and Methods We carried out a retrospective cohort study. Public assistance is provided to households below the poverty line to ensure their income security. We extracted recipients' sociodemographic factors of January 2016 (household number and employment status as non-financial social determinants of diabetes) and identified the incidence of diabetes diagnosis until December 2016 as the outcome. Results We included the data of 2,698 younger individuals (aged <65 years) and 3,019 older individuals (aged >65 years). A multivariable Poisson regression, with a robust standard error estimator, showed that among 2,144 younger recipients at risk, unemployment and living alone were slightly associated with 1-year cumulative incidence of diabetes diagnosis (adjusted incidence ratio 1.20, 95% confidence interval 0.93-1.54 and adjusted incidence ratio 1.15, 95% confidence interval 0.89-1.48, respectively). Among 2,181 older recipients at risk, there was no strong association between their sociodemographic factors and incidence of diabetes diagnosis. Conclusions Unemployment and living alone might be additional risk factors for diabetes among younger public assistance recipients. Multidimensional supports assuring financial and non-financial securities are required to prevent diabetes among people living in poverty.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "772d459de6950c3e3d6a33fd094d2fa9",
  "timestamp": "2025-05-15T02:27:19.075008"
}