{
  "id": 3752,
  "title": "Do renewable portfolio standards in the United States stunt renewable electricity development beyond mandatory targets?",
  "abstract": "Building upon the literatures of policy stringency, policy effectiveness and clean technological change, this paper explores the question of whether the renewable portfolio standard (RPS) serves as a floor or a cap on renewable electricity capacity deployment in the U.S. In particular, we examine the effect of RPS policy stringency on renewable electricity capacity additions beyond compliance. A panel dataset from 1998 to 2017 is constructed for 28 states that have adopted a mandatory RPS in this timeframe. Using hybrid random effects negative binomial regression models, we find that when constrained by renewable electricity potential capacity (potential capacity < 403.4 GW), more stringent RPSs are significantly associated with a lower level of non-RPS related renewable electricity capacity additions. This negative effect of the RPS on beyond RPS compliance renewable electricity development is weakened by the abundance of renewable energy resources. For states endowed with large renewable energy resources, a stringent RPS policy can motivate utilities and other energy producers to invest in renewable electricity capacity beyond the mandatory target. These findings contribute to the policy stringency and policy effectiveness literatures, and improve our understanding of the relationship between clean energy technology adoption and energy policy.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "773396241bc78609efdff47ae9dfe9b9",
  "timestamp": "2025-05-15T01:20:35.982724"
}