{
  "id": 5815,
  "title": "The Political Ecology of Landscape Change, Malaria, and Cumulative Vulnerability in Central Ghana's Gold Mining Country",
  "abstract": "Following the 2008 global financial crisis, small-scale gold mining operations proliferated worldwide. Along Ghana's Offin River, the landscape has been radically transformed by mining, including disruptions to agriculture and surface hydrology, with adverse health outcomes. Yet, health research on small-scale mining tends to focus on miners' mercury exposure. Further, studies on the relationships between disease and landscape change typically examine disease clustering and risk factor identification, rather than complex nature-society dynamics shaping infection and uneven vulnerability. Combining ethnographic, remote sensing, and quantitative methodological approaches, we detail how the socioecological outcomes of miningfrom food insecurity and water-logged pits to profound anxiety and mercury contaminationcombine to increase local malaria incidence. We argue that these changes interact with existing sociostructural conditions and Plasmodium falciparum's unique biological capacities to render women and children most vulnerable to the disease. We suggest that mental health profoundly shapes malaria incidence and, countering individualized constructions of risk, family members' health is deeply interconnected. This article contributes to current geographic debates in several ways. First, a cumulative vulnerability approach helps scholars conceptualize how biological, psychological, structural, and social conditions interrelate to shape humans' conjunctural vulnerabilities along axes of difference, particularly in health contexts. We also highlight the importance of materiality in mediating vulnerability and malaria dynamics. Finally, we argue for more scholarly attention to familial relationships of care and mental health, heretofore unexplored topics in political ecologies of health.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7734f3e91eb52ab7805895810af5f6e9",
  "timestamp": "2025-05-15T02:51:58.510284"
}