{
  "id": 8254,
  "title": "Quality of life, anxiety, depression, and distress in patients with advanced and metastatic lung cancer",
  "abstract": "Objective Lung cancer (LC) patients have shown a predisposition for developing emotional and physical symptoms, with detrimental effects on the quality of life (QoL). This study evaluates the bidirectional relationship between main psychological disorders and clinical/sociodemographic factors with the QoL. Methods In this observational cross-sectional study, patients with a confirmed LC diagnosis from February 2015 to March 2018 were eligible for this study. Each participant completed screening instruments of anxiety, depression, distress, and QoL assessment. Other relevant clinical data were extracted from electronic health records. Then comparisons, correlations, and logistic regression analyses were performed. Results Two hundred and four cases were eligible; of them, the median age was 61 (24-84) years, most had clinical stage IV (95%), and most were under first-line therapy (53%). Concerning psychological status, 46% had symptoms of emotional distress, 35% anxiety, and 31% depression. Patients with psychological disorders experienced a worse global QoL than those without psychological impairment (p < 0.001). Increased financial issues and physical symptoms, combined with lower functioning, were also significantly associated with anxiety, depression, and distress. In the multivariate analysis, female sex and emotional distress were positively associated with an increased risk of depression; likewise, female sex, low social functioning, insomnia, and emotional distress were associated with anxiety. Conclusions Emotional symptoms and QoL had a significant bidirectional effect on this study; this underscores the necessity to identify and treat anxiety, depression, and distress to improve psychological well-being and the QoL in LC patients.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7737ea5cabeab4306b4bfe4c519346c4",
  "timestamp": "2025-05-15T03:16:49.041923"
}