{
  "id": 1553,
  "title": "Near infrared spectroscopy for counterfeit detection using a large database of pharmaceutical tablets",
  "abstract": "Medicine counterfeiting is one of the current burdens of the pharmaceutical world. Reliable technologies have become available for the chemical analysis of suspect medicines. Near infrared spectroscopy (NIRS) allows for instance fast, specific and non-destructive authentication of pharmaceutical products. In this paper, a NIRS method is presented for the identification of 29 different pharmaceutical product families of tablets, one family containing one or more formulation (s), e.g. different dosages. This selection represents the whole tablet portfolio of our firm. The high number of product families constituted a challenge, given that the measurement of the samples, made on two similar instruments, generated a dataset of 7120 spectra. Several chemometric tools proved efficient for the identification of these medicines. The dataset was first investigated with a Principal Component Analysis (PCA) in order to provide an overview of the distribution of the samples. The K-Nearest Neighbors (KNN), the Support Vector Machines (SVM) and the Discriminant Analysis (DA) supervised classification tools were successfully applied and generated an outstanding classification rate of 100% of correct answer. The methods were then fully validated with an independent set of spectra. The DA was selected as the method for the routine analysis of suspect tablets with the Mahalanobis distance as acceptance criterion for identification. Counterfeits, generics and placebos samples, constituting a second validation set, were tested and rejected by the method. NIRS has thus been demonstrated as an efficient tool for the quick identification of a large dataset of pharmaceutical tablets and the detection of counterfeit medicines. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77407c7634d3b45dbf514755f641dbff",
  "timestamp": "2025-05-15T00:57:12.625523"
}