{
  "id": 5152,
  "title": "The effect of distance to primary care physician on health care utilization and disease burden",
  "abstract": "Background: The relationship of distance to care with total health care utilization and disease burden is not well understood among the managed care population. Purposes: The aim of this study was to examine the relationship between the distance from a patient's home to his or her primary care physician (PCP) and the patient's health characteristics. Methodology: This was a population-based study of commercial health maintenance organization (HMO) members enrolled in one medium-sized health plan in Michigan in 2001. This study measured health care utilization from all settings (per member per year [PMPY]). Disease burden measure was based on the Adjusted Clinical Group (ACG) system. Distance was defined as straight-line distance between a member's residency and his or her PCP. Both direct standardization and regression modeling were used to assess the effect of distance on utilization. Findings: Both utilization and disease burden increased as distance increased, especially among members selecting PCPs in an academic health system (AHS). The difference in observed utilization between local (0-10 miles) and distant (> 30 miles) members was $973 (PMPY) for the AHS and $193 (PMPY) for the community independent practice associations (IPA). Compared with age-sex adjustment, ACG adjustment reduced local-distant difference within the same practice group to a greater extent ($281 and $59 remaining for the academic and community groups, respectively). Distance as a whole exerted a statistically significant positive effect on either disease burden score or utilization in regression modeling. Practice Implications: HMO members consume more health care and had higher disease burden as their distance from their PCPs increased. The distance traveled by the individuals to their PCPs could be incorporated when adjusting managed care financial risk models. Other remedies include negotiating higher capitation rates for distant patients, carving out distant patients from any financial risk model, or excluding such patients from provider performance assessment.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7751edab3be2090529b09f37e556079b",
  "timestamp": "2025-05-15T02:44:43.975394"
}