{
  "id": 4007,
  "title": "CLIMATE CHANGE AND THE RISK UNDERTAKING OF AGRICULTURAL ENTERPRISES",
  "abstract": "As people's attention to the climate environment increases, extreme climate change has become an important factor threatening human survival and affecting global economic development. Agricultural enterprises naturally face higher natural risk; however, there are few literature reviews on how agricultural enterprises respond to climate change. To analyse the relationship between climate change and the risk undertaking of agricultural enterprises, based on the risk undertaking theory, the resource scarcity theory, and the option value theory, the impact mechanism of climate change on the development of agricultural enterprises, the mediating role of fixed asset investment and the moderating role of the level of regional financial technology development in the above-mentioned impact relationship were examined using the data of China's agricultural listed companies from 2007 to 2022 and the OLS (Ordinary Least Squares) regression method. The results show that climate change significantly reduces the internal risk undertaking of agricultural enterprises. When climate change is large, agricultural enterprises reduce their risk undertaking level by reducing investment in fixed assets. Financial technology can increase the risk undertaking level of agricultural enterprises, while weakening the inhibitory effect of climate change on the risk undertaking level of agricultural enterprises. The conclusions obtained from this study enrich the related studies on climate change and agricultural enterprise decisions, providing further evidence for understanding the wide-ranging impacts of climate change.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7752f3fd32a385033ee5f082552fd841",
  "timestamp": "2025-05-15T02:31:58.716402"
}