{
  "id": 1002,
  "title": "Aligning financial and functional equivalent depreciations rates of building assets",
  "abstract": "Purpose Both financial and non-financial functions are imbedded in the life-cycle management activities of building assets. These functions provide relevant information for the establishment of operational and maintenance strategies and for decision-making processes related with the timing of major repairs, replacements and rehabilitations. The purpose of this paper is to focus on improving the alignment of financial and non-financial functions related to the recognition that the service potential of buildings should be appropriately funded as it is consumed over its life cycle. Design/methodology/approach Authors undertake an analysis of depreciation rates used to accommodate a systematic allocation of the depreciable amount of building assets over its useful life. Different depreciation approaches and calculation methods are explored. A case study of a school building portfolio is used to debate situations of misalignment of financial and non-financial depreciation rates. Data mining methods including decision tree and clustering are used to predict equivalent functional depreciation rates of buildings system and subsystems and promote an enhanced alignment with regulated financial depreciation rates toward an optimized life-cycle management of the school building portfolio. Findings Historical data show the relevance of considering technical and functional characteristics of the building system and their subsystems (landscaping; structure; external elevations and roofs; interior divisions; and services and equipment) when determining depreciation rates for the building assets The case study showed a misalignment of equivalent functional and financial depreciation rates used in the life-cycle management activities of the school building portfolio ranging between 1/1.26 for external elevations and roofs and 1/5.21 for landscaping. Originality/value Buildings initial technical and functional attributes are affected with its wear, aging or decay, causing loss of value until they reach end-of-life. This paper demonstrates the impact of the different interpretations of the concept of useful life and the subsequent misalignment that it generates between financial functions based on financial depreciation rates and non-financial functions based on historical data and the functional equivalent (technical and functional) depreciation rates. Economic data of 158 public school buildings constructed in Portugal since the 1940s, that sound life-cycle thinking enhances the alignment of both financial and non-financial functions.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "775953f63c3cf697a3368b4e89cd134f",
  "timestamp": "2025-05-15T00:50:40.757829"
}