{
  "id": 7291,
  "title": "Assessing key behavioural theories of drought risk adaptation: Evidence from rural Kenya",
  "abstract": "The Horn of Africa Drylands are increasingly experiencing severe droughts, which impose a threat on traditional livelihood strategies. Understanding adaptation behavior in rural communities is key to helping reduce the impact of these droughts. We investigate adaptation behavior by assessing four established economic and social psychological theories on decision making under risk: expected utility theory (EUT), rank dependent utility theory (RDU), protection motivation theory (PMT), and theory of planned behavior (PMT). To measure adaptation behavior and the theory constructs, we conducted a household survey in Kenya (N = 502). Regression analysis shows that the economic theories (EUT and RDU) have the best fit for our data. Risk and time preferences are found to play an important role in adaptation decisions. An analysis of differences in decision making for distinct types of adaptation measures shows that risk averse (agro-)pastoralists are more likely to implement adaptation measures that are adjustments to their current livelihood practices, and less willing to invest in adaptation measures that require a shift to other livelihood activities. Moreover, we find significant effects for elements of the social psychological theories (PMT and TPB). A person's belief in their own ability to implement an adaptation measure (perceived self-efficacy) and adaptation by family and friends are important factors in explaining adaptation decisions. Finally, we find that the type of adaptation measures that people implement is influenced by, among others, gender, education level, access to financial resources, and access to government support or aid. Our analysis gives insights into the drivers of individual adaptation decisions, which can enhance policies promoting adaptation of dryland communities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "777f9ce909265ec34d295da95d300c3a",
  "timestamp": "2025-05-15T03:07:02.644209"
}