{
  "id": 5804,
  "title": "EVALUATING THE RISK PROFILE OF CROATIAN BANKS USING CLUSTER ANALYSIS",
  "abstract": "Credit institutions play a major role in the economy, especially in bank-centric systems such as the Croatian . financial system, having a significant impact on the stability and efficiency. This paper analyzes how the homogeneity of Croatian banks changed relative to indicators of their profitability, risk exposure and costs. The main objective of this study is to recognize banks that have a comparable risk profile and that have experienced similar problems in the observed years. Three years that were selected represent the pre-crisis, crisis and post-crisis periods. The pre-crisis period refers to the year 2006, which was a period of economic expansion with strong growth of loans, deposits and foreign sources of funding. Then follows the year 2011, which represents the global financial crisis, while the last period is 2016, a year after the Swiss . franc became stronger than the euro and caused problems for thousands of people, but also the Croatian banks. A method of multivariate analysis - cluster analysis is applied for all of the Croatian banks operating in 2006, 2011 and 2016. Cluster analysis can be used as an alternative to regression analysis, or more advanced methods in which the relationship between endogenous and exogenous is predetermined. It allows greater freedom without imposing any a priori limitations. The formed clusters give a different insight into the relationship between variables and between the banks than would give other econometric methods. The estimates have especially helped in singling out the banks that were the most vulnerable in the two crises.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7793ea434df730d6c97d6a4a52e56eb8",
  "timestamp": "2025-05-15T02:51:30.113020"
}