{
  "id": 2788,
  "title": "Management obfuscation through mandatory financial risk disclosure: evidence from European-listed banks",
  "abstract": "Purpose This study aims to investigate the readability of financial risk disclosure divulged by listed banks of the first five European countries according to gross domestic product. Design/methodology/approach This study adopts the management obfuscation hypotheses and tests data gathered for a sample of 790 observations from listed banks in Europe covering the 2007-2018 period. This study uses a readability index (Gunning's fog index) as the dependent variable for measuring the readability of banks' mandatory financial risk disclosures. Moreover, it relies on a completeness index, discretionary accruals and several control variables for identifying the determinants of risk disclosure readability using ordinary least square regression for testing the hypotheses. Findings The findings show the existence of a positive relation\\nship between readability and completeness of risk disclosure. In contrast, a negative relationship exists between readability and banks' discretionary accruals. Originality/value This study expands the stream of accounting literature analyzing the lexical characteristics of narrative risk disclosure, and, by focusing on the financial risk disclosure of banks, it extends the readability-related debate, which has primarily concentrated on other types of disclosure to date. This study is relevant to regulators and policymakers for fostering reflections as actions for improving the financial risk disclosures readability. This study is also of potential interest for investors to better delve into the questions surrounding risk disclosure.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77974e276cfa4ba817b5bad528fcd822",
  "timestamp": "2025-05-15T02:19:08.461332"
}