{
  "id": 9368,
  "title": "Strategic donor behaviour and country vulnerability in health aid transitions",
  "abstract": "BackgroundWhen countries reach the middle-income threshold, many multilateral donors, including Gavi, the Vaccine Alliance (Gavi), begin to withdraw their official development assistance (ODA), known as graduation. We hypothesised that bilateral donors might follow Gavi's lead, except in countries where they have strategic interests. We aim to understand how bilateral donors behave after a recipient country graduates from Gavi support and how bilateral donors might treat Gavi support countries differently, based on 'strategic interest'. We also aim to identify countries that were more vulnerable to 'simultaneous' transitions and financial cliffs after Gavi transition.MethodsThis is an observational dyadic analysis using longitudinal data. We collected country-level data on 77 Gavi-eligible countries between 2009 and 2018 and paired donor and recipient country in a specific year to conduct dyadic analysis. We included Gavi graduation status and Gavi disbursement as explanatory variables. We controlled for (1) donor-recipient relationship variables that represent potential strategic relationships (eg, distance between donor and recipient country) and (2) recipient-level characteristics (eg, population, income). We used Odinary Least Squares regression, Tobit and two-part model in Stata SE 15.0.FindingsWe found a country would receive $3.1 million less all sector ODA from a bilateral donor, and $0.6 million less health ODA, after they graduate from Gavi. For every additional 1% ODA a country would receive from Gavi, it would receive 0.14% more ODA and 0.16% more health ODA from individual bilateral donors. Gavi's graduation status or disbursement brought more change in percentage term to health ODA than to total ODA. Additionally, Gavi's graduation was observed to have a larger negative impact on bilateral ODA in the longer term. Countries that sent more migrants, had been colonised, and received more US military assistance tended to receive more ODA. There are similarities and differences across different donors and bilateral donors tend to provide more ODA to nearby countries and countries receiving fewer exports from the donor. We found that former colonies did not see a decline in aid after Gavi graduation.ConclusionBilateral donors behave in a similar manner to Gavi when it comes to funding health systems in low and middle-income countries. Therefore, some countries may be at risk of losing donor resources for health from a multitude of sources around the same time. However, countries that have a strategic interest in bilateral donors may be spared from such funding cliffs. This research has important implications for global health donors' funding policies and approaches in addition to recipient countries' transition planning.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77a475947eb4248ec0a70271dadc4efa",
  "timestamp": "2025-05-15T03:28:17.523270"
}