{
  "id": 8849,
  "title": "Postoperative complications decrease the cost-effectiveness of robotic-assisted lobectomy",
  "abstract": "Background: Cost of robotic-assisted (RATS) lobectomy remains a major concern. We sought to define variability in cost and factors associated with increased hospital expenses after RATS lobectomy for early stage non-small cell lung cancer. Methods: We performed a retrospective review of patients who underwent RATS lobectomy for stages I-IIIA non-small cell lung cancer at a single institution between 2012 and 2014. Clinical outcomes were linked to hospital financial data. Linear regression analysis was used to test the impact of patient factors and postoperative outcomes on cost. Results: A total of 137 patients underwent RATS lobectomy, predominantly for stage IA (73%, n=100). Overall in-hospital morbidity was 29.2% (n=40), median length of stay was 5 days (range 1-27 days). Postoperative cost accounted for approximately 50% of total cost of hospitalization and varied significantly (mean $9,618.38 +/- $10,779.65), resulting in an average total hospital cost of $19,565 (+/-$11,620.42). Male sex and upper lobe predominant disease were independently associated with increased cost, whereas higher preoperative diffusing capacity of lung for carbon monoxide (DLCO) was cost-protective. Hospital expenses associated with prolonged hospitalization were $2,376.23 per day (95% CI $2,178-2,573.60). The most common complication associated with increased cost was atrial fibrillation ($5,609.13; 95% CI $2,095.42-$9,122.84). Postoperative atelectasis requiring bronchoscopy, respiratory failure, pulmonary embolism, and reoperation were seen less frequently in this cohort of patients but were associated with significant additional cost. Conclusion: Hospital cost of RATS lobectomy can vary significantly. In addition to patient risk factors, differences in cost are mainly driven by postoperative events. Initiatives aimed to reduce common yet expensive complications have the potential to improve overall cost-effectiveness of RATS lobectomy. (C) 2018 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77a8cb9abdccd30eda4b1fe6fba22b27",
  "timestamp": "2025-05-15T03:22:57.934056"
}