{
  "id": 9178,
  "title": "Evaluation of Hospital Cesarean Delivery-Related Profits and Rates in the United States",
  "abstract": "Importance A high cesarean delivery rate in US hospitals indicates the potential overuse of this procedure; however, underlying causes of the excessive use of cesarean procedures in the US have not been fully understood. Objective To investigate the association between the probability of cesarean delivery at the patient-level and profit per procedure from cesarean deliveries. Design, Setting, and Participants This observational, cross-sectional study used a nationally representative sample of hospital discharge data from women at low risk for cesarean birth who delivered newborns between 2010 and 2014 in the US. Data were gathered from the Nationwide Readmissions Database from the Healthcare Cost and Utilization Project, compiled by the Agency for Healthcare Research and Quality. Data cleaning and analyses were conducted between August 2019 and May 2020. Exposures Hospital-level median value of profits from cesarean deliveries, defined as the difference between the charge and the cost for cesarean delivery calculated for each hospital. Main Outcomes and Measures Our primary outcome was the individual-level probability of undergoing a cesarean delivery. We examined the association with the hospital-level median value of profits per procedure for cesarean delivery (defined as the difference between the charge and the cost for cesarean delivery) using hierarchical regression models adjusted for patient and hospital characteristics and year-fixed effects. Results A total of 13 215 853 deliveries were included in our analyses (mean [SE] age, 27.4 [0] years), of which 2 202 632 (16.7%) were cesarean deliveries. After adjusting for potential confounders, pregnant women were more likely to have a cesarean birth when they delivered at hospitals with higher profits per procedure from cesarean deliveries. Women cared for at hospitals with the highest (adjusted odds ratio, 1.08; 95% CI, 1.02-1.14; P = .005) and second-highest profit quartiles (adjusted odds ratio, 1.07; 95% CI, 1.02-1.13; P = .007) had higher probabilities of a cesarean delivery compared with those cared for at hospitals in the lowest profit quartile. Conclusions and Relevance In this cross-sectional study of US nationally representative hospital discharge data, hospitals with higher profits per cesarean procedure were associated with an increased probability of delivering newborns through cesarean birth. These findings highlight the potential influence financial incentives play in determining a high cesarean delivery rate in the US. Question Do patients who receive care at hospitals that make higher profits have a higher probability of cesarean delivery compared with hospitals that make less profits? Findings In this cross-sectional, nationally representative study using hospital discharge data between 2010 and 2014, women delivering at hospitals with higher profits per procedure were associated with an increased probability of undergoing cesarean delivery. Meaning These findings suggest an association between financial incentives and the US cesarean delivery rate. This cross-sectional study of discharge data from a national database of US hospitals examines the association of profits hospitals received from cesarean procedures and rates of cesarean delivery.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77a96035e10a8d359106dd2118ac188e",
  "timestamp": "2025-05-15T03:26:25.949941"
}