{
  "id": 5881,
  "title": "Does the Board of Commissioners Affect Tax Avoidance? Evidence from Banking Industry in Indonesia",
  "abstract": "Tax avoidance is one of the company's taxation strategies to reduce a company's tax burden. In order to realize tax avoidance efforts without incurring tax risks and sanctions, the role of the board of commissioners is important in tax avoidance efforts. The board of commissioners have to ensure the business strategy, management, potential risk in every decision made and ensure that the company's activities comply with applicable legal regulations. The board of commissioners is expected to be able to supervise and control tax policy. The board of commissioners must be able to carry out its supervisory function appropriately, independently and transparently in order to optimize financial performance and company sustainability. Research conducted on 156 samples of banking company data in Indonesia for the 2015-2019 period using regression testing has proven that only the variable number of independent commissioners has a significant effect on tax avoidance efforts. As for the variable of gender, tenure and political connections of the board of commissioners have no significant effect on tax avoidance efforts. The number of independent commissioners is the main factor affecting tax avoidance efforts. This is in line with the regulations of the Financial Services Authority and the Limited Liability Company Law.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77babd1fc71eac31ff8b7a664ae5260d",
  "timestamp": "2025-05-15T02:52:31.418573"
}