{
  "id": 8369,
  "title": "Estimated Costs Associated With Radiation Therapy for Positive Surgical Margins During Radical Prostatectomy",
  "abstract": "Importance Prostate cancer is the most common malignant neoplasm among men and is the one with the highest positive surgical margin (PSM) rate. This high rate is due to the difficulty in balancing the risk of extraprostatic disease and excising periprostatic structures, which ultimately affects patients' quality of life. In the case of a PSM, the appropriateness of adjuvant radiation therapy (aRT) should be discussed. The financial burden of PSMs on health systems has not been investigated. Objective To estimate the financial costs associated with a PSM during radical prostatectomy on the basis of the odds of undergoing aRT. Design, Setting, and Participants This cohort study used data on men with prostate cancer from the US National Cancer Database (January 1, 2010, through December 31, 2015). Data were requested in March 2019, accessed in April 2019, and analyzed in August 2019. Exposure Treatment with radical prostatectomy followed by aRT, if indicated. Main Outcomes and Measures The attributable risk fraction of PSMs on undergoing aRT was estimated from a logistic regression with aRT administration as the outcome. The analysis was adjusted for patients' socioeconomic and demographic characteristics and tumor characteristics. The aRT cost for the year 2019 was calculated using the Medicare Physician Fee Schedule and the Hospital Outpatient Prospective Payment System. The fraction of this cost attributable to a PSM was estimated according to its attributable risk fraction. RESULTS In total, 230 175 men were identified (median [interquartile range] age at diagnosis, 62.0 [56.0-67.0] years). Overall, 22.8% of the patients had a PSM. Patients with PSMs were more likely than those without PSMs to be older (median [interquartile range] age, 62.0 [56.0-66.0] years vs 62.0 [57.0-67.0] years) and nonwhite (9320 patients [17.8%] vs 29 872 patients [16.8%]), to have higher comorbidity scores (1604 patients [3.1%] vs 4884 patients [2.7%] with a Charlson-Deyo Comorbidity Index score >= 2) and worse tumor characteristics (category T3 and T4 disease, 26 394 patients [50.3%] vs 36 040 patients [20.3%]), and to have lower socioeconomic indicators (median annual income <$30 000, 5708 patients [10.9%] vs 17 874 patients [10.1%]; proportion of individuals without a high school degree in the area similar to 29%, 6925 patients [13.2%] vs 22 648 patients [12.7%]). In addition, PSMs were documented more frequently at nonacademic institutions than academic ones (31 702 patients [60.5%] vs 20 714 patients [39.5%]). A total of 11 585 patients (5.0%) underwent aRT, and 7698 of them (3.3%) had a PSM at the final pathology examination. When controlling for patients' socioeconomic and demographic characteristics and tumor characteristics, men with PSMs were more likely than those with negative margins to undergo aRT, with an odds ratio of 3.79 (95% CI, 3.63-3.96; P <.001). The attributable risk fraction of the presence of a PSM on aRT was 44%(95% CI, 42%-45%). The attributable cost of a PSMwas calculated as $ 17 356 (95% CI, $16 567-$17 751). Assuming 60 000 prostatectomies in 2019 and similar trends of PSM and aRT, the overall health burden attributable to PSMs was calculated to be $52 068 000 (95% CI, $49 701 000-$53 253 000). CONCLUSIONS AND RELEVANCE The estimated aRT cost attributable to the presence of a PSM was $17 356, resulting in $52 068 000 in spending on aRT in 2019. Strategies to reduce PSMs could be associated with a reduction in the overall health costs of surgically treated PCa.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77c2c5fa1d4bc88f1a1837390d7ff577",
  "timestamp": "2025-05-15T03:18:19.512138"
}