{
  "id": 2817,
  "title": "Clone clusters in autoreactive CD4 T-cell lines from probable multiple sclerosis patients form disease-characteristic signatures",
  "abstract": "P>We developed a method for selectively propagating disease-related autoreactive T-cell lines (auTCLs) based on their increased resistance to apoptosis. The generated auTCLs homogeneously co-express CD45RO and CD49a, adhere strongly to extracellular matrix proteins and express high interleukin-17 (IL-17) messenger RNA levels, resembling a T-cell subset proposed to transmigrate into tissues and induce systemic and local inflammation in rheumatoid arthritis. The combinations of T-cell oligoclones that comprise probable multiple sclerosis (pMS) disease-related lines use a unique portfolio of T-cell receptor beta-chain variable allele (BV genes) combinations forming 'disease-specific cluster patterns'. The auTCL derived from different patients and from different myelin epitopes display striking similarities in BV gene allele clusters and are derived primarily from a disease-prone hotspot residing in the BV gene locus between V beta 6 and V beta 9. Conversely, healthy subject TCLs use different BV gene allele sets, forming 'healthy responder usage formats'. These formats were absent from the pMS patient V-beta gene allele combinations evaluated in this study. Hierarchical clustering of the BV gene combinations, distinguish three pMS auTCL groups, implying existence of up to three disease-related immune response patterns. These subgroup patterns may reflect different disease subclasses or alternatively they may suggest immune reactivity to different aetiological agents. Analyses of clonal-clustering patterns may potentially aid in subclassification of MS or in characterizing aetiological agents of this disease.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77c9ac396faa8ab61f7c5292432ee083",
  "timestamp": "2025-05-15T01:10:49.506467"
}