{
  "id": 2882,
  "title": "MEASUREMENT OF FINANCIAL PERFORMANCE UNDER MACROECONOMIC UNCERTAINTY",
  "abstract": "The paper deals with measurement of financial performance of the company, which is conditioned with market and macroeconomic changes. We used financial risk measure Earning-at-Risk that can be applied to non-financial enterprises and it is similarly to Cash-flow-at-Risk method. The methodology of study is based on measurement of dependence between financial performance and market and macroeconomic risk factors. This relation is quantified using multiple regression models. We emphasize respect for assumptions of the method because its breakdown (non-stationarity of time series, influential observations, multicollinearity, heteroskedasticity etc.) leads to biased results. For that reason we applied to modeling several arrangements to ensure the credibility of created models. This study is applied on oil and gas industry, specifically on Austrian OMV Group. We analyse not only whole group together, but also its particular business segments: Exploration 84, Production, Refining & Marketing and Gas & Power. We quantify dependence of EBIT on following risk factors: spot prices of Brent crude oil, spot prices of European natural gas, base interest rate in Austria, 3-months EURIBOR, 3-months LIBOR on USD, harmonized indices of consumer prices in Austria and exchange rate USD/EUR. We simultaneously analyse also seasonability and auto-regressive trend of EBIT. We find out that most significant risk factor is spot prices of Brent crude oil. We also recognize auto-regressive trend of financial performance. In consequence of created models we performed simulations, which result to probability distribution of EBIT.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "77e1bde8e031a9ceddc1de4117e75a2d",
  "timestamp": "2025-05-15T02:20:16.879292"
}