{
  "id": 4097,
  "title": "Financial toxicity and its risk factors among patients with cancer in China: A nationwide multisite study",
  "abstract": "Objective: We assessed financial toxicity (FT) among Chinese patients with cancer and investigated associated risk factors guided by a multilevel conceptual framework. Methods: Applying multistage stratified sampling, we selected six tertiary and six secondary hospitals across three economically diverse provinces in China. From February to October 2022, 1208 patients with cancer participated. FT was measured using the COmprehensive Score for financial Toxicity (COST), with 28 potential risk factors identified at multilevel. Multiple regression analysis was used for risk factor identification. Results: FT prevalence was 82.6% (95% confidence interval [CI]: 80.5%, 84.8%), with high FT (COST score < 18.5) observed in 40.9% of participants (95% CI: 38.1%, 43.7%). Significant risk factors included younger age at cancer diagnosis, unmarried status, low annual household income, negative impact of cancer on participants' or family caregiver's work, advanced cancer stage, longer hospital stay for cancer treatment or treatment-related side effects, high perceived stress, poor emotional/informational support, lack of social medical insurance or having urban and rural resident basic medical insurance, lack of commercial medical insurance, tertiary hospital treatment, and inadequate cost discussions with healthcare providers (all P < 0.05). Conclusions: Cancer-related FT is prevalent in China, contributing to disparities in cancer care access and healthrelated outcomes. The risk factors associated with cancer-related FT encompasses multilevel, including patient/ family, provider/practice, and payer/policy levels. There is an urgent need for collective efforts by patients, healthcare providers, policymakers, and insurers to safeguard the financial security and well-being of individuals affected by cancer, promoting health equities in the realm of cancer care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "780789a376a9e710c27d58fc397b3244",
  "timestamp": "2025-05-15T02:33:03.495668"
}