{
  "id": 7040,
  "title": "Use of Desmopressin Prior to Kidney Biopsy in Patients With High Bleeding Risk",
  "abstract": "Introduction: To prevent bleeding after native kidney biopsy (NKB), nephrologists often prescribe desmopressin, especially for patients with reduced estimated glomerular filtration rate (eGFR) at risk of uremia-related platelet dysfunction. However, only 1 randomized study has suggested a beneficial effect for desmopressin in patients with eGFR >= 60 ml/min per 1.73 m(2). This retrospective cohort study aimed to evaluate desmopressin effect on postbiopsy bleeding in all patients, regardless of eGFR and other comorbidities. Methods: In this retrospective cohort study, all adult patients who underwent an NKB from April 1, 2013, to April 30, 2018, in a tertiary hospital were identified. The association between desmopressin use and bleeding complications, including hemoglobin fall, transfusion, hematoma, symptomatic hematoma, urgent radiologic study, and hypotension, was analyzed using multivariable logistic regression models. Results: A total of 413 native kidney biopsies were studied, 79% of which were performed after receiving desmopressin. Patients receiving desmopressin had worse chronic kidney disease (eGFR 28 vs. 45 ml/min per 1.73 m(2); P < 0.001) and were more often hospitalized (48% vs. 32%; P = 0.009). Despite higher bleeding risk, patients using desmopressin had a similar likelihood of symptomatic hematomas (odds ratio [OR], 0.39; 95% confidence interval [CI], 0.13-1.14) and a lower need for urgent radiologic studies (OR, 0.33; 95% CI, 0.11-0.98). Conclusion: Patients at higher risk of bleeding using desmopressin before kidney biopsy had bleeding complications similar to those not using desmopressin. These results highlight potential important clinical and financial benefits of desmopressin use before kidney biopsy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "780ab03588a3f8c5070e640e0f5bb938",
  "timestamp": "2025-05-15T03:04:23.022409"
}