{
  "id": 6132,
  "title": "Burden of out-of-pocket expenditure for road traffic injuries in urban India",
  "abstract": "Background: Road traffic injuries (RTI) are an increasing public health problem in India where out-of-pocket (OOP) expenditures on health are among the highest in the world. We estimated the OOP expenses for RTI in a large city in India. Methods: Information on medical and non-medical expenditure was documented for RTI cases of all ages that reported alive or dead to the emergency departments of two public hospitals and a large private hospital in Hyderabad. Differential risk of catastrophic OOP total expenditure (COPE-T) and medical expenditure (COPE-M), and distress financing was assessed for 723 RTI cases that arrived alive at the study hospitals with multiple logistic regression. Catastrophic expenditure was defined as expenditure > 25% of the RTI patient's annual household income. Variation in intensity of COPE-M in RTI was assessed using multiple classification analysis (MCA). Results: The median OOP medical and non-medical expenditure was USD 169 and USD 163, respectively. The prevalence of COPE-M and COPE-T was 21.9% (95% CI 18.8-24.9) and 46% (95% CI 42-49.3), respectively. Only 22% had access to medical insurance. Being admitted to a private hospital (OR 5.2, 95% CI 2.7-9.9) and not having access to insurance (OR 3.8, 95% CI 1.9-7.6) were significantly associated with risk of having COPE-M. Similar results were seen for COPE-T. MCA analysis showed that the burden of OOP medical expenditure was mainly associated with in-patient days in hospital (Eta = 0.191). Prevalence of distress financing was 69% (95% CI 65.5-72.3) with it being significantly higher for those reporting to the public hospitals (OR 2.8, 95% CI 1.7-4.6), those belonging to the lowest per capita annual household income quartile (OR 7.0, 95% CI 3.7-13.3), and for those without insurance access (OR 3.4, 95% CI 2.0-5.7). Conclusions: This paper has outlined the high burden of out-of-pocket medical and total expenditure associated with RTI in India. These data reinforce the need for implementing more effective financial protection mechanisms in India against the high out-of-pocket expenditure incurred on RTI.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "782581f4993e3a6b0464ef6d349ad329",
  "timestamp": "2025-05-15T02:55:12.884752"
}