{
  "id": 7510,
  "title": "Is the Victimization-Perpetration Association for School Bullying a Cycle of Bias?",
  "abstract": "It is well known that some youth are both victims and perpetrators of bullying. However, it remains unclear whether the victim-perpetrator overlap contains specific characteristics, such as bias. Using data from the United States Health Behavior among School-aged Children survey from 2009 to 2010 (N = 8,739), this study investigated the victim-perpetrator overlap for school bullying, with emphasis on assessing whether the perpetrators of biased (i.e., bias-motivated or prejudicial) bullying are also victims of biased bullying. The analyses employed predictive modeling using cross-sectional data and multinomial logistic regression to examine whether perpetrating biased bullying is associated with a higher risk of experiencing biased victimization than nonbiased victimization (and no victimization). It was then determined among which demographic subgroup of students, the biased bullying victim-perpetrator overlap is most prevalent. Results indicated evidence of a type-specific victim-perpetrator overlap for biased bullying. The biased bullying victim-perpetrator overlap was most prevalent among females, students whose families have financial difficulties, and students not born in the United States. These findings suggest that bullying perpetrators are not only at risk of being victims of bullying generally, but they are specifically more likely to be victims of the type of bullying they perpetrate. School programming to combat biased bullying should be designed with the understanding that there are some students in both the victim and perpetrator roles. Initiatives should focus on potential avenues for breaking the cycle of bias, especially among the group of students most likely to be involved.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "784c9b05e9afbe5d12a766b56652b27f",
  "timestamp": "2025-05-15T03:09:07.389137"
}