{
  "id": 7955,
  "title": "Investigating unmet health care needs under the National Health Insurance program in Taiwan: A latent class analysis",
  "abstract": "Objectives In Taiwan, although the implementation of the National Health Insurance (NHI) program reduced financial barriers and enhanced accessibility for individuals to utilize health care services, an unequal distribution of medical care resources still exists. This paper is focusing on analyzing factors that are associated with unmet health care needs among the middle-aged and elderly under the NHI in Taiwan. Methods Statistical analysis from the 2007 Survey of Health and Living Status of the Elderly in Taiwan. We firstly adopted latent class analysis to classify individuals' observable reasons for feeling unwell but not seeing a doctor within the last 3 months into three latent perceived barriers classes. We further used a multinomial probit regression model to analyze factors that are associated with each perceived barrier class to the access of health care service. Results Results indicate relative to the relatively no barriers class, individuals with a high level of educational attainment tend to more likely to be in the accommodation barriers class, and individuals live in the most developed areas with the densest medical facilities tend to less likely to be in the accessibility barriers class. Conclusions We identified possible risk factors for each perceived barrier, which could provide important insights for health authorities and medical providers when targeting policies and interventions to efficiently assist people in need.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "785d3b558092cac6b18ae543f50992ca",
  "timestamp": "2025-05-15T03:13:30.722068"
}