{
  "id": 7279,
  "title": "Exploring the nexus between fiscal decentralization and ecological sustainability: a fresh perspective from the moderating role of geopolitical risk and updated international evidence",
  "abstract": "Fiscal decentralization has been long employed to enhance the utilization of financial resources for sustainable development. Nevertheless, its effectiveness in limiting ecological degradation is ambiguous, especially when a country faces geopolitical risks. Different from previous works which separately examine the impacts of either fiscal decentralization or geopolitical risks on ecological sustainability, this research examines the moderating role of geopolitical risks on the non-linear relationship between fiscal decentralization and ecological footprints across different levels of environmental condition. An advanced panel quantile regression is applied to a sample of 23 advanced and emerging market economies from 1990 to 2018. The empirical results indicate that the nexus between revenue decentralization and ecological footprint follows an inverted U-shaped pattern at the 20th to 60th quantiles of ecological footprint. Meanwhile, the linkage between expenditure and ecological footprint reflects a U-shaped pattern across all quantiles. Notably, geopolitical risk strongly moderates the connection between fiscal decentralization and ecological footprint with the role being stronger in the case of revenue decentralization. This research provides valuable implementations to tailor policies for transferring revenue and expenditure responsibilities to sub-governmental bodies towards sustainability targets based on their current ecological conditions and contexts of geopolitical instability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7873e15df39a58f1859532c264476ab4",
  "timestamp": "2025-05-15T03:07:02.592059"
}