{
  "id": 7009,
  "title": "Factors influencing the resilience of rural agricultural and retail Micro, Small and Medium Enterprises in Midlands Province of Zimbabwe",
  "abstract": "Factors influencing the resilience of rural agricultural and retail Micro, Small and Medium Enterprises (MSME) in Zimbabwe have received less research focus. To addresses this gap in the literature, this article analyzes factors influencing the resilience of rural agricultural and retail MSMEs. Data used in this article is drawn from a survey of 492 MSME owners/managers from Chirumanzu, Gweru, Shurugwi and Mberengwa districts of Midlands Province, Zimbabwe. Principal component analysis was used to compute the resilience index and multivariate linear regression was used for statistical data analysis. The regression results show that MSME internal resources proxied by asset value increased MSME resilience by 0.22 index points. A conducive environment improved the MSME resilience by 1.88 index points. Entrepreneurial orientation manifested through MSME support increased MSME resilience by 0.81 index points. Robustness tests using FinScope data also show that MSME internal resources, denoted by access to credit and financial capital, increased MSME resilience. Risk-taking and conflict resolution, which measure entrepreneurial, increased MSME resilience. Policymakers and business owners need to promote initiatives that improve access to MSME finance to increase their resilience. The public sector should nurture a conducive business environment with sound and predictable macroeconomic policies that foster business stability. MSME owners must constantly scan their business environment to identify opportunities to enhance their resilience capabilities. The government and private sectors should offer entrepreneurship training to MSMEs to build their resilience.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "787563a3a13c2358e820ab2cbeeca65a",
  "timestamp": "2025-05-15T03:03:55.868415"
}