{
  "id": 3472,
  "title": "Risk Factors for Cortical, Nuclear, Posterior Subcapsular, and Mixed Lens Opacities: The Los Angeles Latino Eye Study",
  "abstract": "Purpose: To identify sociodemographic and biological risk factors associated with having cortical, nuclear, posterior subcapsular (PSC), and mixed lens opacities. Design: Population-based, cross-sectional study. Participants: A total of 5945 Latinos aged >= 40 years from 6 census tracts in Los Angeles, California. Methods: Participants underwent an interview and detailed eye examination, including best-corrected visual acuity and slit-lamp assessment of lens opacities using the Lens Opacities Classification System II. Univariate and stepwise logistic regression analyses were used to identify independent risk factors associated with each type of lens opacity. Main Outcome Measures: Odds ratios for sociodemographic and biological risk factors associated with cortical only, nuclear only, PSC only, and mixed lens opacities. Results: Of the 5945 participants with gradable lenses, 468 had cortical only lens opacities, 217 had nuclear only lens opacities, 27 had PSC only opacities, and 364 had mixed lens opacities. Older age, higher hemoglobin A(1c), and history of diabetes mellitus were independent risk factors for cortical only lens opacities. Older age, smoking, and myopic refractive error were independent risk factors for nuclear only lens opacities. Higher systolic blood pressure and history of diabetes were independent risk factors for PSC lens opacities. Older age, myopic refractive error, history of diabetes, higher systolic blood pressure, female gender, and presence of large drusen were independent risk factors for mixed lens opacities. Conclusions: The modifiable and non-modifiable risk factors identified in this study provide insight into the mechanisms related to the development of lens opacification. Improved glycemic control, smoking cessation and prevention, and blood pressure control may help to reduce the risk of having lens opacities and their associated vision loss. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:547-554 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78970f824517034d107cfe7020c1845f",
  "timestamp": "2025-05-15T02:26:48.456208"
}