{
  "id": 4075,
  "title": "Value drivers of development stage biopharma companies",
  "abstract": "Objective Scholars previously estimated research and development (R&D) costs of the internal drug development process. However, little is known about the costs and value arising from externally acquired therapeutics. This study identifies and estimates the magnitude of factors associated with Biopharma acquisition value. Methods SDC Thomson Reuter and S&P Capital IQ were screened for majority acquisitions of US and EU Biopharma companies developing new molecular entities for prescription use (SIC code: 2834) from 2005 to 2020. Financial acquisition data were complemented with variables characterizing the target's product portfolio extracted from clinicaltrials.gov, Drugs@FDA database, US SEC filings, and transaction announcements. A multivariate regression assesses the association of firm value with extracted variables. Results 311 acquisitions of companies developing prescription drugs were identified over the study period. Acquirers paid 37% (p < 0.05) more for companies with biologics and gene therapeutics than small-molecule lead drugs. Multi-indication products were acquired for a 12% premium per additional indication (p < 0.01). No significant valuation difference between companies developing orphan and non-orphan designated lead products was observed (18%, p = 0.223). Acquisition value positively correlated with the total number of further products, headquarter location in the US, underlying market conditions, and acquirer market capitalization (p < 0.05). Conclusions Internal and external drug development consumes many financial and human resources, yet it is important for entrepreneurs, regulators, and payers to understand their precise magnitude and value drivers. This information permits the design of targeted pricing and industrial policies that incentivize the development of novel drugs in areas with high unmet needs.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78a3be5f7f4a7e7a1600cd2087f3b046",
  "timestamp": "2025-05-15T01:23:27.383988"
}