{
  "id": 2519,
  "title": "Extraction of natural resources and geopolitical risk revisited: A novel perspective of research and development with financial development",
  "abstract": "There has been a worldwide increase in geopolitical risk and the need for a stable financial system. The effects of these two factors are felt in the economy and the natural world alike. Yet there is a lack of literature that fully explores how geopolitical risk affects financial development. In light of this, this paper evaluates the impact of geopolitical risk on financial development for BRICS economies from 1990 to 2022, together with other major control factors, such as natural resources, energy use, and research and development expenditures. To examine the situation of BRICS countries, we use panel data and one of the most appropriate econometric approaches for long run connection, like moment quantile regression to observe adjustment with time between the variables, which offers empirical evidence. The following are the key findings from the models. As a preliminary step, crosssection dependence tests indicated that the slopes are not constant throughout the distribution and that there is, in fact, variable dependence. Next, the various panel unit root test that is most appropriate is used. The cointegration of variables over the long run was then assessed using the Kao and Johansen Fisher cointegration tests. The moment's quantile regression method has been employed to observe the long-term effect of the variables of interest. The results show that geopolitical risk decreases financial development in BRICS economies. Additionally, spending on R&D and energy consumption supports financial development, but over-exploiting natural resources retards it in the BRICS countries. From a policy perspective, policymakers and academics should focus on understanding how geopolitical risk impacts grow nationally and worldwide and how to handle geopolitical actions to promote a positive, sustainable environment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78b82cd17fa17952ac8c6cb8c7bc37c0",
  "timestamp": "2025-05-15T02:16:32.572839"
}