{
  "id": 4708,
  "title": "Does Real Earnings Management Explain Cost of Debt? Evidence from an Emerging Economy",
  "abstract": "This study tested the relationship between real earnings management and debt cost in Vietnam, a developing market. We used the Generalized Method of Moments (GMM) Technique on a sample of 241 listed.rms in Vietnam for 7 years from 2010 to 2016, with a total of 1687 observations collected. The regression result showed a positive association between real earnings management and cost of debt. The results of the study revealed that real earnings management is shown through the rising transactions and directly affected financial reports, thereby affecting creditors by affecting their cost of debt. This can be seen as the driving force for listed companies to increase the quality of their financial information. Our study only focussed on earnings manipulation through real earnings management (REM) to affect transaction costs in Vietnam. The research explains the relationship between managerial behavior (real earnings management) and direct influence on creditors' behavior (cost of debt capital). The result would give outside stakeholders an overall view about the usage of REM in Vietnamese listed firms, the reasonable action of investors, financial institutions, banks, etc on the debt market to reduce risk and the signal of warning for regulators and policy-makers.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78d781feb0318ca11ca795b65f4aacf3",
  "timestamp": "2025-05-15T02:39:57.626839"
}