{
  "id": 2511,
  "title": "Hospital innovation portfolios: Key determinants of size and innovativeness",
  "abstract": "Background: Health care organizations face an increasing demand for strategic change and innovation; however, there are also several barriers to innovation that impede successful implementation. Purposes: We aimed to shed light on key issues of innovation management in hospitals and provide empirical evidence for controlling the size and innovativeness of a hospital's new health service and process portfolio. We show how health care managers could align the need for exploration and exploitation by applying both informal (e. g., employee encouragement) and formal (e.g., analytical orientation and reward systems) organizational mechanisms. Methodology: To develop hypotheses, we integrated the innovation management literature into the hospital context. Detailed information about the innovation portfolio of 87 German hospitals was generated and combined with multirespondent survey data using ratings from management, medical, and nursing directors. Multivariate regression analysis was applied. Findings: The empirical results showed that an analytical approach increased the size of innovation portfolios. Employee encouragement amplified the degree of innovativeness of activities in the portfolio. Reward systems did not have direct effects on the composition of innovation portfolios. However, they adjusted bottom-up employee and top-down strategic initiatives to match with the existing organization, thereby decreasing the degree of innovativeness and enforcing exploitation. Practice Implications: Hospitals should intertwine employee encouragement, analytical approaches, and formal reward systems depending on organizational goals.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78d96d52daeea2c4f008a06e4222c5a0",
  "timestamp": "2025-05-15T01:07:35.716921"
}