{
  "id": 6301,
  "title": "Effect Mechanism Research of Carbon Price Drivers in China-A Case Study of Shenzhen",
  "abstract": "Revealing the effect mechanism of carbon price drivers is the basis to establish the pricing mechanism of carbon emission exchange, which also promotes the development of the carbon emission exchange market and can reduce the investment risk. Based on the previous research, the cointegration test, Granger causality test, and ridge regression estimate are used to analyze the effect mechanism between the domestic carbon price and its drivers. Johansen's cointegration analysis reveals that there is a long-term equilibrium relationship between the domestic carbon price and energy price, industrial development level, climate change, and financial prosperity. Ridge regression estimates reveal that the international spot price of thermal coal in the ARA port and the spot price of Brent crude oil in Britain are negatively correlated with the domestic carbon price, while CER futures price is positively correlated with the domestic carbon price. There is a linkage between the international carbon price and the domestic carbon price. Since 2017, the domestic carbon price has been lower than the equilibrium value, and the value of carbon emission rights has been underestimated. With the continuous improvement of the domestic carbon market, the carbon price will rise and fluctuate around the equilibrium price in the future.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78e704316e8c5987dbdcb527273ebfbc",
  "timestamp": "2025-05-15T02:56:37.513721"
}