{
  "id": 1850,
  "title": "Sustainable Adaptation Planning for Cultural Heritage in Coastal Tourism Destinations Under Climate Change: A Mixed-Paradigm of Preservation and Conservation Optimization",
  "abstract": "Fragmented guidance and unbalanced climate adaptation efforts for tangible and intangible cultural heritage are challenging the long-term sustainability of coastal tourism destinations. Conceptualizing and quantifying adaptation paradigms that optimize cultural heritage preservation from multi-faceted perspectives under fiscal constraints is highly prioritized by coastal tourism destinations. Informed by the Modern Portfolio Theory, this study developed, tested, and evaluated four adaptation paradigms using machine-learning approaches to optimize the historical significance, tangible, and intangible values of multi-type cultural heritage in Gulf Island National Seashore across a 30-year planning horizon under varying fiscal constraints. Results indicated that adaptation paradigms can provide transformative and flexible preservation portfolios to preserve tangible and intangible uses when facing degradation or loss from inadequate funding and intensifying climate threats. The mixed-paradigm framework optimizes preservation efforts between tangible and intangible cultural heritage quantitatively and can be generalized to coastal tourism destinations globally as a sustainable climate adaptation decision support tool.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78ecc3be7e86b2228eeaf425edc0d8b9",
  "timestamp": "2025-05-15T01:00:27.299745"
}