{
  "id": 8919,
  "title": "Clinical and financial outcomes of transplant recipients following emergency general surgery operations☆",
  "abstract": "Introduction: Due to immunosuppression and underlying comorbidities, transplant recipients represent a vulnerable population following emergency general surgery (EGS) operations. The present study sought to evaluate clinical and financial outcomes of transplant patients undergoing EGS. Methods: The 2010-2020 Nationwide Readmissions Database was queried for adults (>= 18 years) with nonelective EGS. Operations included bowel resection, perforated ulcer repair, cholecystectomy, appendectomy and lysis of adhesions. Patients were classified by transplant history (Non-transplant, Kidney/Pancreas, Liver, Heart/Lung). The primary outcome was in-hospital mortality while perioperative complications, resource utilization and readmissions were secondarily considered. Multivariable regression models evaluated the association of transplant status on outcomes. Entropy balancing was employed to obtain a weighted comparison to adjust for intergroup differences. Results: Of 7,914,815 patients undergoing EGS, 25,278 (0.32 %) had prior transplantation. The incidence of transplant patients increased temporally (2010: 0.23 %, 2020: 0.36 %, p < 0.001) with Kidney/Pancreas comprising the largest proportion (63.5 %). Non-transplant more frequently underwent appendectomy and cholecystectomy while transplant patients more commonly received bowel resections. Following entropy balancing, Liver was associated with decreased odds of mortality (AOR: 0.67, 95 % CI: 0.54-0.83, Reference: Non-transplant). Incremental hospitalization duration was longer in Liver and Heart/Lung compared to Non-transplant. Odds of acute kidney injury, readmissions and costs were higher in all transplant types. Conclusion: The incidence of transplant recipients undergoing EGS operations has increased. Liver was observed to have lower mortality compared to Non-transplant. Transplant recipient status, regardless of organ, was associated with greater resource utilization and non-elective readmissions. Multidisciplinary care coordination is warranted to mitigate outcomes in this high-risk population. (c) 2023 The Authors. Published by Elsevier Inc. This is an open access article under the CC BY license (http:// creativecommons.org/licenses/by/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "78ef0e7f8939a69cac1d4fa7fba1c44d",
  "timestamp": "2025-05-15T03:23:56.040552"
}