{
  "id": 8425,
  "title": "Factors associated with changing alcohol consumption during the first UK lockdown",
  "abstract": "Background In response to COVID-19 there have been lockdowns and restrictions to hospitality services. Drinking behaviours often change in response to traumatic events and changes in the drinking environment, and this is influenced by a range of factors. This study explores self-reported changes in alcohol consumption in the third month of the UK lockdown, associations with socio-demographics factors and with COVID-19-related concerns, and mental health and wellbeing. Methods The COVID-19 Psychological Wellbeing Study was a longitudinal, online, three-wave survey of 1958 UK adults. Data were collected during the first UK lockdown; wave 1 launched 23 March 2020, wave 2 was 1 month after and wave 3 2 months after completion of wave 1A hierarchical multinomial regression model was estimated to investigate factors associated with changes in perceived alcohol consumption in the third month of the lockdown. Results The majority of participants reported changes in drinking (62%) with over one-third indicating increased consumption. Student status and worries about the financial implications of COVID-19 were associated with lower odds of decreased alcohol consumption. Those with above average income and those with children in the household had lower odds of increased alcohol consumption, while younger adults had higher odds of increased alcohol consumption. Conclusions This study adds to the growing body of research showing changes in alcohol consumption behaviours during the COVID-19 lockdown restrictions, and identifies risk and protective factors which can aid in targeting intervention at those most in need of support.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "791aaf0985d389da3b5134703456018d",
  "timestamp": "2025-05-15T03:18:51.548473"
}