{
  "id": 3839,
  "title": "Influencing Mechanism Analysis of Holiday Activity-Travel Patterns on Transportation Energy Consumption and Emissions in China",
  "abstract": "Energy shortage and atmospheric pollution problems are getting more serious in China, and transportation is the main source of energy consumption, pollutants, and carbon emissions. This study combined the activity-based analysis method with emission models, and investigated the influence mechanism of people's activity travel scheduling on transportation energy consumption and emissions on holidays. Based on the holiday travel behavior survey data, the multinomial logistic regression model was first applied to explore the decision mechanisms of individual travel-mode choices in holidays. Next, the emission model was integrated with an activity-based travel demand model to calculate and compare transportation energy consumption and emissions under different policy scenarios. The results showed that socio-demographic characteristics had significant effects on holiday activity-travel patterns, and combined mode chains had a larger number of activity points than single mode chains. With an increase in the trip time of cars, and decrease of travel distance and the number of activity points, transportation energy consumption and emissions could be reduced greatly with an adjustment of holiday activity-travel patterns. The reduced portion is mainly attracted by slow traffic and public transport. However, the effects of a single policy strategy are very limited, thus portfolio policies need to be considered by policy makers.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "792f260d7dc917d597984237e49f5013",
  "timestamp": "2025-05-15T01:21:08.351332"
}