{
  "id": 9390,
  "title": "Affordability of Medical Care Among Medicare Enrollees",
  "abstract": "Question Is medical care affordable among people in the Medicare program? Findings In a nationally representative survey of 13 171 Medicare enrollees that asked several questions about the affordability of their medical care, the overall reported prevalence of ever delaying care during 2017 owing to worries about cost was 11%; the prevalence of having problems paying medical bills was also 11%, and 16% of the respondents experienced 1 of these 2 concerns or both. Unaffordability of care was associated with lower incomes, worse health, and being younger than 65 years with long-term disability. Meaning The findings of this study suggest that the burden of medical care cost-sharing leads to care avoidance and financial strains among the most vulnerable patients despite insurance coverage through Medicare; equitable access to care may require targeted reforms aimed at reducing cost burden. Importance Cost-sharing requirements can discourage patients from seeking care and impose financial hardship. The Medicare program serves many older and disabled individuals with multimorbidity and limited resources, but little has been known about the affordability of care in this population. Objective To examine the affordability of medical care among Medicare enrollees, in terms of the prevalence of delaying medical care because of costs and having problems paying medical bills, and risk factors for these outcomes. Design, Setting, and Participants Cross-sectional analyses conducted from November 1, 2019, to October 15, 2021, used logistic regression to compare the probability of outcomes by demographic and health characteristics. Data were obtained from the 2017 nationally representative Medicare Current Beneficiary Survey (response rate, 61.7%), with respondents representing 53 million community-dwelling Medicare enrollees. Main Outcomes and Measures New questions about medical care affordability were included in the 2017 Medicare Current Beneficiary Survey: difficulty paying medical bills, ongoing medical debt, and contact by collection agencies. A companion survey question asked whether individuals had delayed seeking medical care because of worries about costs. Results Respondents included 10 974 adults aged 65 years or older and 2197 aged 18 to 64 years; 54.2% of all respondents were women. The weighted proportions of Medicare enrollees with annual incomes below $25 000K were 30.7% in the older population and 67.4% in the younger group. Self-reported prevalence of delaying care because of cost was 8.3% (95% CI, 7.4%-9.1%) among enrollees aged 65 years or older, 25.2% (95% CI, 21.8%-28.6%) among enrollees younger than 65 years, and 10.9% (95% CI, 9.9%-11.9%) overall. Similarly, 7.4% (95% CI, 6.6%-8.2%) of older enrollees had problems paying medical bills, compared with 29.8% (95% CI, 25.6%-34.1%) among those younger than 65 years and 10.8% (95% CI, 9.8%-11.9%) overall. Regarding specific payment problems, 7.9% (95% CI, 7.0%-8.9%) of enrollees overall experienced ongoing medical debt, contact by a collection agency, or both. In adjusted analyses, older adults with incomes $15 000 to $25 000 per year had odds of delaying care more than twice as high as those with incomes greater than $50 000 (odds ratio, 2.47; 95% CI, 1.82-3.39), and their odds of problems paying medical bills were more than 3 times as high (odds ratio, 3.37; 95% CI, 2.81-5.21). Older adults with 4 to 10 chronic conditions were more than twice as likely to have problems paying medical bills as those with 0 or 1 condition. Conclusions and Relevance The findings of this study suggest that unaffordability of medical care is common among Medicare enrollees, especially those with lower incomes, or worse health, or who qualify for Medicare based on disability. Policy reforms, such as caps on patient spending, are needed to reduce Medical cost burdens on the most vulnerable enrollees. This survey study examines the affordability of health care and prevalence of payment difficulties among Medicare enrollees.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79377746618bc5e7d7257ac48d60902c",
  "timestamp": "2025-05-15T03:28:17.604180"
}