{
  "id": 4213,
  "title": "Internet of Energy (IoE) in Smart Power Systems",
  "abstract": "The accelerated trend of development in the areas of information and communications technology (ICT), as well as energy systems, has been led to emersion of a new concept called the internet of energy (IoE). This concept is classified as a subsector of the internet of things (IoT), which means the utilization of advanced digital controllers, sensors, actuators, and meters with the ability of information exchange through IT infrastructures. The phrase internet, in this context, does not exclusively refer to the World Wide Web rather than any type of server-based or peer-to-peer network. These communicational tools are able to receive information for local analyze and control, receive analyzed commands, send raw data, or send instructions. The incorporation of IoT in power systems conveys a brilliant future for overcoming power system operation hurdles and environmental challenges, although it incurs a large capital investment portfolio initially. However, it is hoped that the evolution of current technologies and the advent of new technologies with economically affordable prices can help to increase the pervasiveness of these state-of-the-art technologies. IoE covers the entire energy scope such as thermal or electrical energies. However, in this study, the applications of IoE in power systems, as the central core of the energy ecosystem, will be addressed. At first, the basic terminology of this topic such as IoE, IoT, plug & play capability, smart energy, future networks, smart grid 2.0, energy 4.0, prosumers, AMI, API, digitalization, and grid edge are described to make the rest of paper more intelligible. Then the role of IoE in supply-side and demand-side of power systems encompassing renewable generation section, large-scale energy storage section, thermal power plant section, system operation and protection as well as execution of demand response programs (DRPs), microgrids, integration of plug-in electric vehicles with V2G capability, and end-user residential consumption management in smart buildings are explained. In this study, it is tried to outline a different classification of IoE in power systems which has not been drawn by previous similar works.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "793f6febd22d420cdd9ea7e156be53ee",
  "timestamp": "2025-05-15T01:24:51.464105"
}