{
  "id": 7804,
  "title": "Aggression Between Siblings: Associations With the Home Environment and Peer Bullying",
  "abstract": "Sibling aggression is a common form of intra-familial aggression, yet has been largely neglected by research. Using an inclusive measure of sibling aggression, this study investigated, firstly, prevalence of sibling aggression and associations with family and household characteristics, and secondly, the relationship between sibling aggression and peer bullying. Participants were 4,237 adolescents from Wave 1 of Understanding Society. Four types of sibling aggression were measured: physical, verbal, stealing and teasing, and combined into composite measures of victimization and perpetration. Regression analysis identified associations with demographic characteristics, family and sibling composition, parent-child relationships and socioeconomic status and explored the link between sibling aggression and involvement in peer bullying. Using a broad definition, sibling aggression was found to be widespread, with 46% of all participants being victimized and 36% perpetrating aggression. Household and family characteristics, including a large family size, male siblings, and financial difficulties were associated with greater rates of sibling aggression. Parenting behavior showed the strongest relationship: harsh parenting increased the risk of sibling aggression while positive parenting protected against it. Sibling aggression was also homotypically related to involvement in peer bullying. Victimization by siblings significantly increased the odds of being a victim of peer bullying, and perpetrators of sibling aggression were more likely to be both peer bullies and bully-victims. Considering the adverse effects of sibling aggression on physical and mental health, the study provides pointers for efforts to reduce the risk of sibling aggression. Furthermore, the link with peer bullying suggests that school anti-bullying efforts should also take account of children's sibling relationships. (C) 2014 Wiley Periodicals, Inc.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79477045aa3e6e7f8c11eb9f0b405972",
  "timestamp": "2025-05-15T03:12:11.695324"
}