{
  "id": 4222,
  "title": "Acoustic Emission Health Monitoring of Marine Renewables Illustration with a Wave Energy Converter in Falmouth Bay (UK)",
  "abstract": "Marine renewable energy ( MRE) is an emerging technology and at present there are an increasing number of MRE prototypes and full-scale devices deployed. The future commercialization in the near future may contribute to the mitigation of carbon emissions and diversify the renewable electricity generation portfolio. Because of the high costs of marine intervention, it is important to establish reliable, remote monitoring techniques. The underwater sound around MRE devices is often monitored for environmental impact assessments. This approach can also be potentially utilized to monitor the engineering health of MRE devices. This is the objective of the project AEMORE ( Acoustic Emission technology for environmental and engineering health Monitoring of Offshore Renewable Energy), jointly conducted by the Universities of Exeter and Bath, with J+S Ltd. Acoustic Emission ( AE) monitoring is already used for Structural Health Monitoring ( SHM) of land-based structures and devices such as wind turbines. AE allows faults and defects to be detected early in a device's lifetime, providing more time to plan and implement necessary maintenance and repair procedures to avoid catastrophic failure. This is highly desirable for MRE structures, which operate in energetic seas with tight weather access windows. This paper explores the remit for AE monitoring to SHM and maintenance planning for MRE devices and demonstrates that this novel application is principally feasible. A brief review of the state of the art of AE for land-based systems aids to illustrate how its techniques can be applied to underwater environments and MRE components. This literature review will inform a classification system that relates likely failure modes to their expected acoustic emissions. The results from previous underwater environmental studies are used to evaluate their potential for SHM of MRE structures. AE environmental data collected during the operation of the Fred Olsen Lifesaver wave energy converter at the Falmouth Bay Test site ( FaBTest, SW UK) is used to demonstrate this novel application. The case study provides proof that this concept is valid for underwater SHM of marine renewable structures.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "794d8e15455cd55403036aeeba28ad03",
  "timestamp": "2025-05-15T01:24:51.501747"
}