{
  "id": 6957,
  "title": "Socioeconomic Determinants of Multimorbidity: A Population-Based Household Survey of Hong Kong Chinese",
  "abstract": "Introduction Multimorbidity has been well researched in terms of consequences and healthcare implications. Nevertheless, its risk factors and determinants, especially in the Asian context, remain understudied. We tested the hypothesis of a negative relationship between socioeconomic status and multimorbidity, with contextually different patterns from those observed in the West. Methods We conducted our study in the general Hong Kong (HK) population. Data on current health conditions, health behaviours, socio-demographic and socioeconomic characteristics was obtained from HK Government's Thematic Household Survey. 25,780 individuals aged 15 or above were sampled. Binary logistic and negative binomial regression analyses were conducted to identify risk factors for presence of multimorbidity and number of chronic conditions, respectively. Sub-analysis of possible mediation effect through financial burden borne by private housing residents on multimorbidity was also conducted. Results Unadjusted and adjusted models showed that being female, being 25 years or above, having an education level of primary schooling or below, having less than HK$ 15,000 monthly household income, being jobless or retired, and being past daily smoker were significant risk factors for the presence of multimorbidity and increased number of chronic diseases. Living in private housing was significantly associated with higher chance of multimorbidity and increased number of chronic diseases only after adjustments. Conclusions Less advantaged people tend to have higher risks of multimorbidity and utilize healthcare from the public sector with poorer primary healthcare experience. Moreover, middle-class people who are not eligible for government subsidized public housing may be of higher risk of multimorbidity due to psychosocial stress from paying for the severely unaffordable private housing.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79565df216c402d6330dbc3e741a0a3c",
  "timestamp": "2025-05-15T03:03:13.544257"
}