{
  "id": 2849,
  "title": "Can Herding Be Adaptive? Evidence from Markets Sentiment, News Sentiment and Happiness in Global Energy Markets",
  "abstract": "This study investigates the adaptive nature of herding behaviour in global energy markets, focusing on the USA, Europe and Asia, from January 2013 to December 2023. Utilizing advanced sentiment analysis tools, including Thomson Reuters MarketPsych Indices, Bloomberg Sentiment Analysis and the Hedonometer, this study captures real-time fluctuations in market mood. By employing Cross-Sectional Absolute Deviation models, static regression, rolling regression and quantile-on-quantile regression, this study examines the impact of investor sentiment, news sentiment and happiness on herding behaviour under varying market conditions. The findings revealed significant regional variations and underscored the dynamic and context-dependent aspects of herding behaviour. In the USA, higher levels of investor happiness and positive market sentiment are linked to increased herding behaviour, whereas negative news sentiment is linked to reduced herding behaviour. Similar but less pronounced patterns are observed in Europe, whereas Asian markets show weaker correlations, highlighting the critical role of market volatility and trading volume. These insights offer valuable implications for portfolio management, regulatory frameworks and investment strategies, thus enhancing the understanding of herding behaviour in volatile and sentiment-driven markets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7971ef2566ecc7883e7b63526e33839e",
  "timestamp": "2025-05-15T01:11:17.335321"
}