{
  "id": 2087,
  "title": "The value allocation model of renewable portfolio standards considering the contribution of renewable energy consumption on the demand side",
  "abstract": "Under China's current Renewable Portfolio Standards (RPS) policy system, the provincial power grid is the assessment subject, and then the assessment is conducted on the user side. However, in the centralized clearing power market, renewable energy (RE) consumption on the user side cannot be accurately identified, so accurate value transmission cannot be formed to guide users to optimize their electricity consumption behavior. To improve this problem, this paper identifies the irreplaceable role of users in RE consumption through time series simulation. We construct a three-layer RPS assessment value transmission model of power grid company - retailers - users based on the identified unique contributions of each user. The equilibrium state of multi-market participants is obtained based on the decentralized training framework of reinforcement learning. The following conclusions are drawn through simulation analysis:(1) the user-side RE contribution identification method can effectively identify the user's contribution to RE consumption, which can reduce about 8% or increase about 7.48% of RPS cost allocation according to different contribution degrees; (2) the RPS value allocation mode can optimize users' power consumption behavior, achieve peak shaving and valley filling, promote RE consumption, and reduce about 0.6% of the abandoned wind power; (3) Under the RPS system, the effect of improving the response-ability of the user-side is better than increasing the RPS target and the peak shaving capacity.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79768cc823c9f534fc6f0e051328ccfa",
  "timestamp": "2025-05-15T01:02:32.972678"
}