{
  "id": 3318,
  "title": "Do stochastic risks flow between industrial and precious metals, Islamic stocks, green bonds, green stocks, clean investments, major foreign exchange rates, and Bitcoin?",
  "abstract": "This study examines the interactions between Bitcoin (BTC) and other major financial markets (forex, equity and bond, and industrial and precious metals). This interaction is viewed from the spectrum of spillover analysis, hedging, and portfolio analyses. Due to the high volatility and volatility clustering nature of most financial series, particularly BTC, we rely on a Multivariate Factor Stochastic Volatility (mvFSV) Model of Kastner et al. (2017). In order to capture the influence of extreme market conditions, we use a quantile-based mvFSV Model. Among other things, results confirm the importance of quantile analysis as results are sensitive to market conditions. For instance, currencies and industrial and precious metals are net transmitters of shocks at lower and middle quantiles, while these assets change their status to the net receiver of shocks at the upper quantile. Results of the total connectedness show that there is a high degree of interconnectedness among the assets, as the total connectedness index ranges between 86% and 100%. Besides, Islamic equities perform such as the most currencies and conventional assets in terms of the transmission of shocks and diversification benefits. The hedging potentials of Bitcoin over other assets were also examined, and results confirm that the hedging effectiveness is commodity-specific. Policy implications of these results are discussed.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "797d03c5649225f2a15147f54758e7b7",
  "timestamp": "2025-05-15T01:15:54.761898"
}