{
  "id": 3667,
  "title": "The Internal Connection Analysis of Information Sharing and Investment Performance in the Venture Capital Network Community",
  "abstract": "In order to explore the internal connection between information sharing and investment performance in the venture capital network community, this study took environmental-governance start-ups as the research object and used the 2009-2020 environmental-social enterprise start-up venture capital investment events as a data sample. The successful exit rate of the venture capital portfolio and the successful listing rate of investment ventures were used as the measurement criteria. Combined with regression analysis, the relationship between information sharing and investment performance in the venture capital network community was analyzed in detail. Research shows that there are differences between the ways of information sharing in the venture capital network communities. In the regression results, all coefficients are less than 0.01. There is a positive correlation between information sharing and investment performance in the venture capital network community. With the increase in enterprise characteristic variables, the degree of enterprise risk information sharing is getting higher and higher. This ultimately leads to more and more frequent corporate investment performance and a higher possibility of acquisition. Among them, the degree of information sharing in the venture capital network community is relatively high, and venture capital companies that are supported by corporate venture capital institutions will benefit even more from listed capital. Not only was the analysis of the relationship between finance and investment in the venture capital network community pointed out in this research, but also the investment development of entrepreneurial enterprises was also provided with feasible suggestions.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "797e082eebdc204fafdf688e9488fbee",
  "timestamp": "2025-05-15T01:19:26.218676"
}