{
  "id": 5107,
  "title": "Energy planning and modern portfolio theory: A review",
  "abstract": "Modern portfolio theory (MPT) stands as a widely accepted methodology to meet the challenges associated with the definition of energy planning for a particular territory or region. Energy planning is thus framed as an investment selection problem. MPT is characterized by having a wider capacity and conceptual richness than the other previously used methodologies, such as the individual least cost alternative. The portfolio approach is based on solving for an objective function that seeks to minimize either the cost or the risk of the portfolio, subject to different constraints, considering that real electricity generation assets can be defined in terms of cost or return and economic risk for each alternative technology. The relevant portfolios are the result of solving the optimization model, to determine the efficient cost-risk frontier. The work presented here consists of an exhaustive review of the literature in relation to the application of MPT methodology to the field of energy planning and electricity production. A new classification is proposed from a financial perspective of the selection of investments from the preceding studies. It delves deeper into the explanation of the limits to the methodology and into the concept of risk, which is key from both a financial and an energy perspective. The main methodological contributions found in the literature are examined that are aimed at improving the capacity of the model and adjusting it to the reality of the electricity market, Finally, conclusions are provided from the works analyzed in terms of renewable technologies and the policy implications derived from them. In most studies, a preference has been shown for the inclusion of renewable technologies in the efficient portfolios. However, in order to implement the decision to increase the share of renewable technologies, greater flexibility in the interconnection capacity between states and in storage capacity is needed.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79937d85d2228c00f1f923c417a7af11",
  "timestamp": "2025-05-15T02:44:11.105830"
}