{
  "id": 7030,
  "title": "Work Placement and Job Satisfaction in Long-Term Childhood Cancer Survivors: The Impact of Late Effects",
  "abstract": "Simple Summary Due to previous cancer and its treatments, long-term childhood cancer survivors (CCS) are at risk of developing medical comorbidities, as well as socioeconomic vulnerability. Above all, work placement, financial independence, and job satisfaction can represent burdensome areas for some CCS. Regarding this topic, it is important to consider the variety of country-specific educational and vocational systems. The aim of this study is to provide a description of the occupational status of CCS in the Italian socio-economic scenery and to evaluate the association between late effects and unemployment and late effects and job satisfaction. Our data contribute to the description of the different country scenery of work placement for CCS in Europe and agree with previous literature on the impact of severe late effects on occupation. Future research in this field can be focused on interventions to improve CCS in obtaining jobs suitable for their health. Late effects of cancer and its treatments during childhood or adolescence can impact work placement and increase the risk of unemployment. The aim of this study is to describe the work placement and the perceived job and economic satisfaction of long-term childhood cancer survivors (CCS). Jobs have been categorized according to the International Standard Classification of Occupations version 08 (ISCO-08), and satisfaction has been evaluated through the Satisfaction Profile (SAT-P). Out of 240 CCS (female = 98) included: 53 were students, 46 were unemployed and 141 were employed. Within unemployed survivors, 89.13% were affected by late effects (n = 41). The presence of at least one severe late effect was significantly associated with the probability of unemployment (OR 3.21; 95% CI 1.13-9.12, p < 0.050), and having any late effect was inversely related to the level of satisfaction of the financial situation of unemployed CCS (b -35.47; 95% CI -59.19, -11.74, p = 0.004). Our results showed that being a survivor with severe comorbidities has a significantly negative impact on occupation and worsens the perception of satisfaction of economic situations. Routinary follow-up care of CCS should include the surveillance of socioeconomic development and provide interventions, helping them to reach jobs suitable for their health.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7997e97a7785a318f8d8037781ba7220",
  "timestamp": "2025-05-15T03:04:23.004605"
}