{
  "id": 2538,
  "title": "Resolving uncertainty and creating value from the exercise of e-commerce investment options",
  "abstract": "This study examines the effect of the resolution of uncertainty on real options exercise decisions with respect to three e-commerce investment options: scale-up, stage and joint investment, and the relationship between exercise of these options and firm performance. The results of a study of 172 public e-commerce investment announcements show that resolution of external (exogenous) and internal (endogenous) uncertainty has a significant effect on option exercise decisions. However, the results also imply that simply waiting without investment in active learning does not create significant value from real options. The key differentiator is how a firm resolves endogenous uncertainty as this endows it with the ability to successfully undertake the information technology investment and exploit the economic opportunity implied by the resolution of exogenous uncertainty. Furthermore, our results imply that different options should be used to manage situations involving certainty of loss on one hand and severity of loss on the other hand. Thus, it is important for firms to make the right choices when using options-based investing to manage risk. We suggest that, perhaps, managers need to maintain a portfolio of options to manage the two dimensions of risk simultaneously.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79986316ad7409e86dc04902693203bb",
  "timestamp": "2025-05-15T01:07:35.791496"
}