{
  "id": 2879,
  "title": "Effect of Capital Adequacy, Liquidity to Shariah Financial Performance in Shariah Banking in 2011-2015",
  "abstract": "This study aims to examine the Effect of Capital Adequacy, Liquidity on Sharia Financial Performance in Islamic Banking in year of 2011-2015. This research is very useful for banking sector because it is expected to be able to assess the performance of Islamic Banking that has been less examined; because more research are focusing on non-Sharia or conventional banking. Capital adequacy is one of the variables that is used as a variable in measuring banking performance as reflected in the banking valuation component. Using Capital adequacy ratio (CAR) to measure capital ratios, means the amount of own capital needed to cover the risk of losses that may arise from asset investment risk. Liquidity is one of the tools used to assess the health of banks, in order to anticipate financial obligations that are soon due by granting loans to people in need. Data collection in this study was carried out using secondary data using financial report data and annual reports of Islamic banking companies from 2011-2015. Data is obtained on the official website of the Islamic banking company. Based on the statistical test results, the capital adequacy (CAR) have a significant negative effect on the financial performance of Islamic banking (ROA) because the regression transformation coefficient value is -2.508 and the value of Sig 0.04 < 0.05. The negative effect indicates that the higher the bank's capital, the lower the profit if the risk-weighted assets are also high. Likewise, the Liquidity (FDR) variable has no significant negative effect on the financial performance of Islamic banking (ROA) because the regression coefficient value is -1.766.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79a514d6ab647ac4bf5ee5764438bbc5",
  "timestamp": "2025-05-15T02:20:16.859409"
}