{
  "id": 6818,
  "title": "Systemic risk and competition in OTC derivatives dealing: evidence from client failures",
  "abstract": "Purpose - The purpose of this paper is to examine the extent of systemic risk and competition in over-the-counter (OTC) derivatives dealing. Using derivatives-related failures during the 1990s, the authors draw conclusions that are pertinent to the recent financial market turmoil involving OTC derivatives. Design/methodology/approach - The authors use the event-study methodology with crude dependence adjustment to examine the wealth effect for the involved derivatives dealers. The authors re-estimate the parameters using the market-adjusted model to check for robustness. In addition, a multivariable regression framework was used to estimate the determinants of the abnormal returns. Findings - OTC derivatives dealers experience negative returns when their clients announce derivatives losses. In contrast, rival dealers uninvolved in the loss event exhibit positive returns. The extent of the positive returns for the rival dealers grows as new events unfold, and the dealers continue to steer clear of derivatives trouble. A broader industry portfolio of securities brokers, dealers, and advisors is affected negatively, indicating possible industry contagion. The cross-sectional analysis of the abnormal returns indicates the presence of information (and not pure) contagion implying that in a financial crisis involving derivatives systemic failure is not likely. Originality/value - The authors extend the literature by examining an exhaustive set of derivatives loss events. The sample includes a more diverse set of derivatives dealers and it spans a longer time period than prior studies did. This is also the first study confirming the distorting impact of the too big to fail and federal safety net phenomena in the context of OTC derivatives dealing.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79a563940b50b1c06940bb0f7d27f488",
  "timestamp": "2025-05-15T03:02:07.423472"
}