{
  "id": 5604,
  "title": "Analyzing business-failure-process risk: evidence from Finland",
  "abstract": "Purpose The purpose of this study is to analyze the business-failure-process risk from two perspectives. First, a simplified model of the loss-generation process in a failing firm is developed to show that the linear system embedded in accounting makes financial ratios to depend linearly on each other. Second, a simplified model of the development of the risk during the failure process is developed to introduce a new concept of failure-process-risk line (FPRL) to assess the systematic failure risk of a firm. Empirical evidence from Finnish firms is used to test two hypotheses. Design/methodology/approach This study makes use of simple mathematical modeling to depict the loss-generation process and the development of failure risk during the failure process. Hypotheses are extracted from the mathematical results for empirical testing. Time-series data originally from 13,082 non-failing and 515 failing Finnish are used to test the hypotheses. Analysis of variance F statistics and Mann-Whitney U test are used in testing of the hypotheses. Findings The findings show that the linear time-series correlations are generally higher in failing than in non-failing firms because of the loss-generation process. The FPRL depicted efficiently the systematic failure-process risk through the beta coefficient. Beta coefficient efficiently discriminated between failing and non-failing firms. The difference between the last-period risk estimate and FPRL was largely determined by the approximated growth rate of the periodic failure risk. Research limitations/implications The loss-generation process is based on a simple cash-based approach ignoring the growth of the firm. In future research, the model could be generalized to a growing firm in an accrual-based framework. The failure-process risk is assumed to grow at a constant rate. In further studies, more general models could be applied. Empirical analyses are based on simple statistical methods and tests. More advanced methods could be used to analyze the data. Practical implications This study shows that failure process makes the time-series correlation between financial ratios to increase making their signals of failure consistent and allowing the use of static classification models to assess failure risk. The beta coefficient is a useful tool to reflect systematic failure-process risk. In addition, it can be used in practice to warn a firm about ongoing failure process. Originality/value To the best of the author's knowledge, this is the first study analyzing systematically business-failure-process risk. It is first in introducing a mathematical loss-generation process and the FPRL based on the beta coefficient assessing the systematic failure risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79b1ca0cc2e342890598af6daec28083",
  "timestamp": "2025-05-15T02:49:21.749964"
}