{
  "id": 7046,
  "title": "Association between social position and congenital anomalies: A population-based study among 19,874 Danish women",
  "abstract": "Aims: To examine the association between maternal and paternal educational level and household income and the risk of giving birth to a baby with a congenital anomaly in a population of Danish women. Methods: We performed a population-based cohort study, based on record linkage of data from Danish administrative registries. For each pregnant woman in the cohort, we described financial and educational resources and congenital anomalies in her offspring. We used logistic regression to model the association between social position and congenital anomalies. Results: The analyses included all 19,874 primiparous singleton deliveries in North Jutland county, Denmark, from 1991 to 1998. There were 1025 (5.2%) babies with congenital anomalies. The odds ratios (ORs) for giving birth to a baby with a congenital anomaly showed a dose-response decline, as the mothers' educational level increased. Women with less than 10 years of schooling had an almost three-fold increased risk of giving birth to an infant with a congenital anomaly, as compared with women with more than 4 years of higher education (OR = 2.9, 95% confidence interval = 1.8-4.6). Paternal educational level and household income were, to a lesser degree, associated with congenital anomalies in the offspring. Conclusions: Maternal educational level, and to a lesser degree paternal educational level and household income, were associated with the risk of giving birth to a baby with a congenital anomaly. However, the analysis did not take into account maternal health status, and the results might be due to differential misclassification or residual confounding.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79b70452dc862333575f4dac30e2c69d",
  "timestamp": "2025-05-15T03:04:23.031908"
}