{
  "id": 1213,
  "title": "The analysis of financial time series data by independent component analysis",
  "abstract": "The use of higher-variance portfolios to increase expected investment return is based upon the empirical observation of a risk premium. This is the expected return (r) over bar (A) on an asset A, minus the prevailing risk-free interest rate r(F). We first review concisely the classical methods of efficient portfolio selection based upon the use of variance as a measure of risk. These comprise the Markowitz model and its simplification to the market model of Sharpe, which defines a market factor and the Capital Asset Pricing Model (CAPM). This is followed by a discussion of the use of additional factors to account for specific market forces, for example, sector or country, which is still a subject of investigation, and the use of principal components analysis (PCA) in this problem. The Markowitz theory must impose the same constraints upon the individual portfolio holdings even in these multifactor models, which can thus be formulated within a so-called Arbitrage Pricing Theory (APT). We will then be in a position to go beyond PCA to look at the newer method of independent component analysis (ICA). We will show some examples of typical features, including simultaneous diagonalisation of second- and fourth-order statistics and suggest ideas for cross fertilisation, for example, with connected moment expansions in physics.",
  "year": 2004,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79cb1eae81f5168e7e4f0207180d323b",
  "timestamp": "2025-05-15T00:53:09.918077"
}