{
  "id": 8543,
  "title": "Treatment of coronavirus disease 2019 in Shandong, China: a cost and affordability analysis",
  "abstract": "Background Coronavirus disease 2019 (COVID-19) is now a global public threat. Given the pandemic of COVID-19, the economic impact of COVID-19 is essential to add value to the policy-making process. We retrospectively conducted a cost and affordability analysis to determine the medical costs of COVID-19 patients in China, and also assess the factors affecting their costs. Methods This analysis was retrospectively conducted in Shandong Provincial Chest Hospital between 24 January and 16 March 2020. The total direct medical expenditures were analyzed by cost factors. We also assessed affordability by comparing the simulated out-of-pocket expenditure of COVID-19 cases relative to the per capita disposable income. Differences between groups were tested by studentttest and Mann-Whitney test when appropriate. A multiple logistic regression model was built to determine the risk factors associated with high cost. Results A total of 70 COVID-19 patients were included in the analysis. The overall mean cost was USD 6827 per treated episode. The highest mean cost was observed in drug acquisition, accounting for 45.1% of the overall cost. Total mean cost was significantly higher in patients with pre-existing diseases compared to those without pre-existing diseases. Pre-existing diseases and the advanced disease severity were strongly associated with higher cost. Around USD 0.49 billion were expected for clinical manage of COVID-19 in China. Among rural households, the proportions of health insurance coverage should be increased to 70% for severe cases, and 80% for critically ill cases to avoid catastrophic health expenditure. Conclusions Our data demonstrate that clinical management of COVID-19 patients incurs a great financial burden to national health insurance. The cost for drug acquisition is the major contributor to the medical cost, whereas the risk factors for higher cost are pre-existing diseases and severity of COVID-19. Improvement of insurance coverage will need to address the barriers of rural patients to avoid the occurrence of catastrophic health expenditure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79d87217a15fde6726cc5511c6b5d7d8",
  "timestamp": "2025-05-15T03:19:52.146029"
}