{
  "id": 8824,
  "title": "National and State-Specific Shingles Vaccination Among Adults Aged ≥60 Years",
  "abstract": "Introduction: Shingles (herpes zoster) causes substantial morbidity, especially among older adults. The shingles vaccine has been recommended for people aged >= 60 years since 2006. This study assessed recent shingles vaccination at national and state levels among adults aged >= 60 years. Methods: The 2014 Behavioral Risk Factor Surveillance System data were analyzed in 2015 to assess shingles vaccination coverage among adults aged >= 60 years at national and state levels. Multivariable logistic regression and predictive marginal models identified factors independently associated with vaccination. Results: Shingles vaccination coverage among adults aged >= 60 years was 31.8% (95% CI=31.4%, 32.2%). Among states, shingles vaccination coverage ranged from 17.8% (95% CI=15.8%, 20.0%) in Mississippi to 46.6% (95% CI=44.3%, 48.8%) in Vermont, with a median of 33.3%. Coverage was <25% in four states and > 40% in nine states. For all states, coverage was significantly higher among non Hispanic whites compared with non-white races except for Oregon, with coverage differences ranging from -33.2% in the District of Columbia to 0.9% in Oregon and a median of -16.0%. Characteristics independently associated with vaccination were age, race/ethnicity, sex, education, employment status, household income, region, perceived health status, health insurance status, personal healthcare provider, routine checkup status, and whether reporting that cost was a barrier to seeing a doctor. Conclusions: Coverage varied dramatically by state. State-level comparisons may aid in designing tailored intervention programs through sharing of best practices. Strategies are needed to mitigate financial barriers for both provider and patients, improve awareness, and increase provider recommendation of the vaccine. Published by Elsevier Inc. on behalf of American Journal of Preventive Medicine",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79e00d9861ba8111907a63ca94f9243f",
  "timestamp": "2025-05-15T03:22:57.879378"
}